[
  {
    "information_requirement": "Is the adversary attempting to impair or disable security defenses on our mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629",
        "name": "Impair Defenses",
        "evidence": [
          {
            "description": "A managed mobile device, identified by its unique ID in MDM logs, fails to send its periodic heartbeat signal to the MDM/MTD management server. The time since the last successful check-in, observed in MDM server logs or as a network session in Zeek conn.log, exceeds a device-specific baseline, and MDM audit logs show no corresponding authorized administrative action (e.g., 'unenroll', 'decommission') for that device ID during the period of absence.",
            "data_sources": [
              "Zeek conn.log",
              "MDM Server Logs",
              "MTD Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway, Wi-Fi network infrastructure, and MDM/MTD Management Servers",
            "action": [
              "Define a SIEM correlation rule that triggers when a device misses a scheduled check-in event from the MDM/MTD platform. The rule must query the MDM/MTD audit logs for the device's unique ID within a +/- 5-minute window of the missed check-in. If no authorized event such as 'unenroll', 'wipe', or 'decommission' is found, generate a medium-severity alert.",
              "For each managed device, ingest MDM check-in timestamps or Zeek conn.log sessions to the MDM server. Calculate the 99th percentile of the time delta between consecutive check-ins over a 30-day baseline. Schedule a query to run every 5 minutes, flagging any device where the time elapsed since its last check-in exceeds this 99th percentile threshold.",
              "Train a per-device time-series forecasting model (e.g., ARIMA, Prophet) using the historical sequence of check-in timestamps from MDM logs. The model's purpose is to predict the next expected check-in time. Generate an alert if an actual check-in is not observed within a grace period defined by 3 standard deviations of the model's historical prediction error."
            ]
          },
          {
            "description": "A mobile device's network traffic, observed via network sensors, shows communication with infrastructure known to host mobile rooting kits or spyware. This is evidenced by: (1) DNS queries (Zeek dns.log) or TLS connections via SNI (Zeek ssl.log) to domains/IPs on a mobile-specific threat intelligence feed, or (2) the download of an Android Application Package (.apk) or iOS App Store Package (.ipa) whose file hash (Zeek files.log) is present on a known malware hash list.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway and Wi-Fi network infrastructure",
            "action": [
              "Implement a real-time SIEM rule that matches values from Zeek logs against mobile-specific threat intelligence feeds. Specifically, match the 'query' field in dns.log and the 'server_name' field in ssl.log against known malicious domains. Concurrently, match MD5/SHA1 hashes from files.log against known malware hashes. Trigger a high-severity alert upon any match.",
              "Analyze Zeek logs for statistical anomalies. First, for DNS queries not on an organizational allow-list, calculate the Shannon entropy of the second-level domain using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. Flag domains with entropy scores above 4.0 as potential DGA. Second, calculate the population rarity of 'User-Agent' strings from http.log across all mobile devices. Investigate connections from devices using a User-Agent seen on less than 1% of the fleet, especially if correlated with high-entropy DNS queries.",
              "Deploy a supervised classification model (e.g., Random Forest) trained on labeled network connection data. Engineer features from Zeek logs, including connection duration, bytes sent/received, JA3/JA3S hashes, TLS SNI entropy, and the rarity of the User-Agent. The model will score each new connection for maliciousness. Trigger an alert if a connection's score exceeds a calibrated threshold (e.g., 0.90) and enrich the alert with the contributing features."
            ]
          },
          {
            "description": "An explicit alert is generated by the MTD or MDM platform indicating a direct attempt to weaken the device's security posture. This includes events such as: (1) the forceful termination of a monitored security process (e.g., the MTD agent itself), (2) unauthorized modification of a security configuration profile (e.g., disabling 'Google Play Protect'), or (3) an application being granted a high-risk permission (e.g., Android 'Device Administrator') without a corresponding IT change request.",
            "data_sources": [
              "Mobile Threat Defense (MTD) Agent Logs",
              "Mobile Device Management (MDM) Compliance Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device endpoints and MDM/MTD Management Servers",
            "action": [
              "Configure a SIEM rule to generate a high-severity alert upon receiving specific event IDs from MDM/MTD logs. Key events to monitor include 'Security Agent Process Terminated', 'Compliance Policy Violation: Google Play Protect Disabled', 'High-Risk Permission Granted: Device Administrator', or 'Configuration Profile Changed: Install from Unknown Sources Enabled'. The rule should verify that the event is not associated with an authorized change management ticket ID before alerting.",
              "Establish a 30-day rolling baseline for the rate of compliance alerts and high-risk permission grants, segmented by user role (e.g., 'Developers', 'Sales', 'Executives'). Implement a scheduled query to identify any user or device whose event count in a 24-hour period exceeds three standard deviations above the mean for their assigned peer group. This highlights anomalous activity relative to similar users.",
              "Ingest event streams from MDM/MTD, VPN/authentication, and network logs into a User and Entity Behavior Analytics (UEBA) platform. Use a sequence-based anomaly detection model (e.g., an LSTM autoencoder) to learn normal sequences of user actions on mobile devices. The system should flag and score sequences with high reconstruction error as anomalous. A high-risk sequence like '[VPN login from new ASN] -> [MDM reports new app installed from unknown source] -> [App granted Device Admin rights] -> [MTD agent check-in missed]' would receive a high anomaly score and trigger an alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ],
    "references": [
      {
        "id": 1,
        "text": "Samsung Knox Mobile Threat Defense. Samsung. Retrieved September 29, 2025, from https://www.samsungknox.com/en/solutions/mobile-threat-defense"
      }
    ]
  }
]