[
  {
    "information_requirement": "Is an adversary attempting to evade user detection on corporate-managed mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628.002",
        "name": "User Evasion",
        "evidence": [
          {
            "description": "An application not on a pre-defined allowlist (e.g., 'Gaming', 'Fitness', 'AR/VR') accesses motion sensors (accelerometer, gyroscope) as reported by Mobile Threat Defense (MTD) logs. This access coincides with a device state change from 'at rest' (no motion detected for >60 seconds) to 'in motion'. Within 5 seconds of this state change, periodic network connections from the device, previously observed at a regular interval (standard deviation of time delta < 5 seconds) and directed to a low-entropy set of domains/IPs, experience a >95% reduction in connection frequency for at least 5 minutes. The ceased connections were characterized by low data volume (<2KB per connection), consistent with C2 beaconing.",
            "data_sources": [
              "Mobile Threat Defense (MTD) sensor access logs",
              "Mobile Device Management (MDM) application inventory logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints: Corporate-managed mobile devices with MTD/MDM agents. Network: Network taps at corporate Wi-Fi access points, VPN egress points, and internet gateways where Zeek sensors are deployed. Infrastructure: MDM servers providing application metadata; DNS servers providing query logs.",
            "action": [
              "Create a SIEM correlation rule that triggers on an MTD event where `sensor_type` is in `['accelerometer', 'gyroscope']`. Enrich the event with the application's category from MDM. If `app_category` is not on a motion-access allowlist AND periodic C2-like traffic (low-variance inter-arrival time, low-entropy destination) was observed in the 5 minutes prior in Zeek conn.log AND that traffic ceases (>95% connection reduction) in the 5 minutes after, generate a high-severity alert.",
              "For each managed device and installed application, calculate the Pearson correlation coefficient `r` between two aligned time series over 24-hour periods: a binary 'Motion Series' from MTD logs (1 if motion detected, 0 if not) and a 'Network Connection Count' series from Zeek conn.log. Generate a medium-severity alert for any application not on a motion-access allowlist that exhibits a strong negative correlation, such as $$ r < -0.7 $$, indicating network activity consistently stops when the user is active. Elevate alert severity if, during 'at rest' periods (motion=0), the network traffic exhibits low Shannon entropy of destination ports, characteristic of C2 heartbeats.",
              "Train a dedicated Isolation Forest model for each unique application to learn its normal 'at rest' network behavior. Aggregate 'at rest' network data from Zeek logs (periods of >10 minutes with no MTD-reported motion) into 5-minute windowed feature vectors including `connection_count`, `total_bytes_out`, `avg_connection_duration`, `entropy_of_destination_ips`, and `stdev_of_inter_connection_time_delta`. In real-time, monitor for a state change from 'at rest' to 'in motion'. A subsequent 5-minute window with near-zero network activity will be highly anomalous compared to the learned 'at rest' profile. If the model returns a high anomaly score for this window, generate a high-confidence alert for evasive C2 activity."
            ]
          },
          {
            "description": "An application not categorized as 'Communications' or 'System Utility' accesses the proximity sensor. This access coincides with the sensor state changing to 'covered' (e.g., phone in pocket or face down) for more than 60 seconds. During this 'covered' state, high-frequency network activity (e.g., connection frequency > 1 per second) or high-volume data transfer (e.g., >95th percentile of the app's normal background usage) is observed. This activity ceases or drops by >90% within 5 seconds of the proximity sensor state changing to 'uncovered'.",
            "data_sources": [
              "Mobile Threat Defense (MTD) sensor access logs",
              "Mobile Device Management (MDM) application inventory logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints: Corporate-managed mobile devices with MTD/MDM agents. Network: Network taps at corporate Wi-Fi access points and VPN egress points where Zeek sensors are deployed. Infrastructure: MDM servers providing application metadata.",
            "action": [
              "Create a rule that triggers on an MTD event for 'proximity_sensor' access where the state becomes 'covered'. If the app is not on a proximity-access allowlist (e.g., 'Phone Dialer') and subsequent network traffic from the app in Zeek conn.log exceeds a defined threshold (e.g., >1MB in 1 minute) during the 'covered' period, generate a medium-severity alert. Elevate severity to high if the traffic ceases immediately when the sensor state becomes 'uncovered'.",
              "For each application, establish a baseline of background network data usage (bytes_out per minute) from Zeek conn.log when the device is idle but the proximity sensor is 'uncovered'. Monitor for periods when the proximity sensor is 'covered'. Calculate the Z-score for data usage during these 'covered' periods against the 'uncovered' baseline distribution. A consistently high Z-score (e.g., $$ Z > 3 $$) indicates anomalous activity while the user is presumed not to be looking at the screen, warranting an alert.",
              "Use a logistic regression classifier to predict the proximity sensor state ('covered' vs. 'uncovered') based on network features from Zeek logs. Train the model on labeled data where the sensor state is known from MTD logs, using features like `bytes_out`, `connection_rate`, `dns_query_rate`, and `avg_flow_duration`. Once trained, apply the model to network traffic in real-time. If the model predicts a 'covered' state with high probability based on network activity, but MTD logs show the state is 'uncovered', it indicates a behavioral mismatch suggestive of user evasion."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]