[
  {
    "information_requirement": "Is an adversary attempting to elevate privileges by injecting code into a higher-privileged process on a mobile device? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1631.001",
        "name": "Ptrace System Calls",
        "evidence": [
          {
            "description": "An Android audit.log event of type SYSCALL with syscall=101 (ptrace) is recorded where the source application process (exe) is not on an established allow-list and the target process has a privileged effective user ID (euid of 0 for root or 1000 for system).",
            "data_sources": [
              "Android audit.log",
              "MDM application inventory log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Central SIEM aggregating Android audit.log streams from managed mobile endpoints; Mobile Device Management (MDM) platform containing application inventories.",
            "action": [
              "Create a detection rule to alert when an Android audit.log event shows syscall=101 (ptrace) and the source application's package name or hash matches a threat intelligence feed of known malicious mobile apps, and the target process euid is 0 or 1000.",
              "From MDM application inventories, establish an allow-list of approved applications that may use ptrace. For each device, calculate the 99th percentile of hourly ptrace call frequency per application over a 30-day baseline. Alert if a ptrace call is initiated by an unlisted application targeting a privileged process (euid 0 or 1000), or if an allowed application exceeds its hourly call frequency threshold.",
              "Train a supervised classification model (e.g., Random Forest) using labeled Android audit logs to identify malicious ptrace usage. Feature engineer attributes such as source/target UID, source/target process name, parent process name, time of day, and whether the source app is an approved developer tool. Deploy the model to score new syscall=101 events and generate a high-severity alert for events classified as 'malicious' with a confidence score over 0.9, especially when targeting privileged UIDs."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to evade defenses by executing malicious code within the context of a legitimate mobile application process? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1631.001",
        "name": "Ptrace System Calls",
        "evidence": [
          {
            "description": "A ptrace syscall (syscall=101 in Android audit.log) from a device's IP address is correlated within a 5-minute window with anomalous network traffic from the same IP in Zeek logs. Anomalies include connections to threat-listed IPs/domains, DNS queries for domains with high Shannon entropy (e.g., > 3.5), or connections on non-standard ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Android audit.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at corporate Wi-Fi egress points, VPN concentrators, and DNS resolvers; Central SIEM aggregating network and mobile endpoint logs.",
            "action": [
              "Implement a correlation rule in the SIEM that triggers a high-priority alert if a ptrace event (syscall=101 in Android audit.log) is followed within 5 minutes by a network connection (Zeek conn.log) or DNS query (Zeek dns.log) from the same device IP to a destination on a high-confidence C2 threat intelligence list.",
              "For each mobile device IP, establish a 30-day rolling network baseline from Zeek logs, including the set of common destination ports and the 95th percentile of Shannon entropy for DNS queries. After a ptrace event is observed from a device, create a medium-severity alert if, within the next 60 minutes, the device connects to a port not in its baseline or makes a DNS query with entropy exceeding its 95th percentile.",
              "For each device, train a time-series anomaly detection model (e.g., LSTM Autoencoder) on 1-minute aggregated network telemetry from Zeek logs (e.g., connection count, data volume, unique destination ports). Following a ptrace event on a device, monitor its subsequent network activity with the model. Trigger a high-severity alert if the model's reconstruction error exceeds its 99th percentile for three consecutive minutes, indicating a significant behavioral deviation."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]