[
  {
    "information_requirement": "Is an adversary attempting to steal credentials from mobile device keychains? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1634.001",
        "name": "Keychain",
        "evidence": [
          {
            "description": "A mobile device, identified by its IP address on the corporate network, exhibits one or more network-based indicators of a jailbroken state. These include: (1) DNS requests to domains associated with jailbreaking tools (e.g., Cydia, unc0ver); (2) TLS connections with anomalous validation statuses (e.g., 'self signed certificate in certificate chain'); or (3) TLS connections to an unusually low diversity of certificate issuers, suggesting TLS interception by a single rogue CA.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, VPN termination points, DNS resolvers, and web proxies handling mobile device traffic.",
            "action": "1. (Symbolic) Continuously query Zeek dns.log data for requests originating from mobile device IP address ranges. Match the `query` field against a threat intelligence list of domains and subdomains associated with jailbreaking tools and repositories (e.g., Cydia, Sileo, unc0ver, Checkra1n). Generate a high-severity alert upon any match, including the source IP, queried domain, and timestamp. 2. (Statistical) For each mobile device source IP, use Zeek ssl.log to establish a 14-day rolling baseline of TLS activity. First, calculate the daily ratio of connections with a `validation_status` other than 'ok' to the total number of TLS handshakes. Second, calculate the daily Shannon entropy of the server certificate `issuer` field. Trigger a medium-severity alert if the validation failure ratio exceeds the 95th percentile of its own history, or if the issuer entropy score drops by more than 50% from its 14-day average, indicating a potential Man-in-the-Middle (MitM) condition common on compromised devices. 3. (Machine Learning) Deploy an anomaly detection model (e.g., Isolation Forest or a one-class SVM) trained on legitimate TLS session features from Zeek ssl.log and conn.log. Features should include: certificate validity period, SNI server name rarity (calculated via TF-IDF), `validation_status` (one-hot encoded), `orig_bytes`, and `resp_bytes`. An anomalous score indicates a connection deviates significantly from normal behavior. A cluster of high-scoring anomalies from a single device, especially when correlated with alerts from the symbolic or statistical methods, strongly suggests device compromise."
          },
          {
            "description": "A mobile device initiates an outbound network connection characterized by an unusually large data volume (`orig_bytes`) sent to a low-reputation or rarely-contacted destination IP address. This pattern is consistent with the exfiltration of a compressed keychain database file (e.g., keychain-2.db).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, firewalls, and cloud access security brokers (CASBs) monitoring traffic from mobile device subnets.",
            "action": "1. (Symbolic) Continuously monitor connections from mobile device IP ranges in Zeek conn.log and ssl.log. Match the destination IP (`id.resp_h`) and server name (`server_name`) against a threat intelligence feed of known malicious C2 servers, anonymization services (e.g., TOR exit nodes), and suspicious data exfiltration endpoints. Generate a high-severity alert on any match. 2. (Statistical) Using Zeek conn.log, for each mobile device source IP, maintain a 30-day rolling baseline of outbound data volume (`orig_bytes`) per connection. Calculate the 99th percentile for this metric. Trigger a medium-severity alert if a single connection's `orig_bytes` exceeds this threshold. Increase severity to high if the destination IP has been seen fewer than 3 times in the device's 30-day history or if the connection's bytes-per-second rate (calculated from `orig_bytes` / `duration`) is in the top 99th percentile. 3. (Machine Learning) Train an autoencoder neural network on legitimate network connection patterns from Zeek conn.log for the mobile device fleet. The feature vector for each connection should include `orig_bytes`, `resp_bytes`, `duration`, destination port, and a categorical representation of the destination IP's Autonomous System Number (ASN). Feed live connection data into the model and calculate the reconstruction error. A high reconstruction error flags the connection as anomalous. This signal is a strong indicator of potential exfiltration, especially if it occurs shortly after a jailbreak detection alert for the same device."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]