[
  {
    "information_requirement": "Has an adversary exfiltrated data from a corporate mobile device by using a non-standard or alternative network protocol? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1639",
        "name": "Exfiltration Over Alternative Protocol",
        "evidence": [
          {
            "description": "A mobile device establishes an outbound connection using a protocol (e.g., FTP, IRC, SMB) not observed within its 30-day baseline, or the volume of data transmitted in a single connection exceeds the 99th percentile for that protocol across all mobile devices.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, guest networks, VPN concentrators, and Mobile Device Management (MDM) platform logs.",
            "action": [
              "Monitor Zeek conn.log for connections originating from the mobile device IP range to destination IPs or ports listed in a threat intelligence feed of known C2 servers. Trigger a high-severity alert upon a match.",
              "For each mobile device, maintain a 30-day rolling baseline of used network protocols from Zeek conn.log. Alert if a device uses a protocol outside its baseline. Additionally, calculate the 99th percentile of outbound bytes ('orig_bytes') per protocol for the entire mobile fleet. Alert if a single connection's 'orig_bytes' exceeds this fleet-wide threshold.",
              "Using Zeek conn.log, create a feature vector for each connection (e.g., protocol, port, duration, orig_bytes, resp_bytes). Apply an Isolation Forest model to the feature vectors of all mobile device traffic to identify anomalous connections. Flag connections identified as outliers for analyst review."
            ]
          },
          {
            "description": "A mobile device's DNS traffic exhibits characteristics of tunneling, such as a query rate exceeding 3 standard deviations of its baseline, query names with Shannon entropy over 4.5, a high ratio of TXT/NULL requests, or queries to domains with a prevalence below 1% across the mobile fleet.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, network egress points, and Cloud Access Security Broker (CASB) logs.",
            "action": [
              "Continuously monitor the 'query' field in Zeek dns.log for requests from mobile devices that match a blocklist of known malicious or dynamic DNS domains commonly used for tunneling. Trigger a high-severity alert on any match.",
              "For each mobile device, establish a 30-day rolling baseline from Zeek dns.log for daily query count, average query name length, and average Shannon entropy of the query name. Generate an alert if any metric deviates by more than 3 standard deviations from the device's baseline. Specifically flag any query with an entropy score above 4.5 as highly suspicious.",
              "Train a Random Forest classifier using features from Zeek dns.log (e.g., query length, subdomain count, Shannon entropy, n-gram frequency) on a labeled dataset of benign and malicious DNS queries. Apply the model to live mobile DNS traffic, flagging any query with a predicted 'malicious' probability greater than 0.85 for investigation."
            ]
          },
          {
            "description": "A mobile device sends an HTTP/S POST request with a total data payload exceeding the 99th percentile for the mobile fleet, or establishes periodic, 'heartbeat' connections with a low standard deviation of inter-arrival times to a non-corporate or newly registered domain (NRD).",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies, internet gateways, VPN concentrators with SSL/TLS inspection capabilities, and Cloud Access Security Broker (CASB) platforms.",
            "action": [
              "Join Zeek http.log ('host' field) and ssl.log ('server_name' field) with Zeek conn.log. Correlate the destination host/server name against threat intelligence feeds for malicious and newly registered domains (NRDs). Trigger a high-severity alert for any POST request to a matched domain where 'orig_bytes' exceeds 500KB.",
              "From Zeek conn.log for ports 80/443, calculate the 99th percentile of outbound bytes ('orig_bytes') for all mobile devices and alert on any single connection exceeding this threshold. Separately, for each device-destination pair, calculate the standard deviation of time deltas between connections; flag pairs with a low standard deviation and high frequency (>10/hour) as potential beaconing.",
              "Extract JA3/JA3S hashes from Zeek ssl.log and User-Agent strings from http.log to fingerprint client applications. Use a clustering algorithm (e.g., K-Means) to group known-good applications. Flag any traffic associated with a client fingerprint that falls outside these known-good clusters, especially when correlated with large POST requests or low-prevalence domains."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]