[
  {
    "information_requirement": "Is an adversary exfiltrating data from mobile devices over an established command and control (C2) channel? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1646",
        "name": "Exfiltration Over C2 Channel",
        "evidence": [
          {
            "description": "An outbound connection from a mobile device has an anomalously high data volume or connection duration, or the total daily outbound data volume to a single destination exceeds the 99th percentile of the device's 30-day historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network gateways for corporate Wi-Fi, VPN concentrators, Cloud Access Security Broker (CASB) egress points, and other network egress points monitoring mobile device traffic.",
            "action": [
              "Query Zeek conn.log for connections originating from the mobile device IP range where the destination IP is present on a threat intelligence feed of known C2 servers. Separately, search for connections where the total outbound bytes (orig_bytes) exceeds a static threshold (e.g., 10MB) or the connection state (conn_state) indicates a one-way data dump (e.g., 'S1', 'S2', 'S3').",
              "For each unique source mobile IP (id.orig_h), establish a 30-day rolling baseline of outbound bytes (orig_bytes) and connection duration per destination IP (id.resp_h). Calculate the 99th percentile for both metrics. Generate an alert when a new connection's orig_bytes or duration exceeds its respective percentile threshold for that source-destination pair.",
              "Implement a time series forecasting model (e.g., ARIMA) for the aggregate daily outbound data volume (SUM of orig_bytes) for each mobile device-to-destination pair using Zeek conn.log data. Train the model on at least 90 days of history. Trigger an alert if the observed daily volume for a given pair exceeds the model's predicted 95% confidence interval, indicating a statistically significant deviation from the established communication pattern."
            ]
          },
          {
            "description": "The ratio of outbound HTTP POST/PUT requests to GET requests for a mobile device's communication to a single server exceeds a 10:1 threshold, and the average POST request body size is greater than the 95th percentile of its historical baseline for that destination.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web proxies, DNS resolvers used by mobile devices, and Unified Endpoint Management (UEM) proxy logs.",
            "action": [
              "Using Zeek dns.log, identify mobile devices querying for domains on C2 blocklists or domains with high-entropy names. Correlate the source IP with Zeek http.log and flag any subsequent HTTP POST/PUT requests to those domains where the request_body_len exceeds 1MB. Additionally, alert on the use of known malicious User-Agent strings from a watchlist.",
              "For each source mobile IP (id.orig_h) and destination host (host) pair in Zeek http.log, calculate a 30-day baseline for the ratio of HTTP POST to GET requests. Separately, establish the baseline average and standard deviation for the POST request body length (request_body_len). Alert when the daily POST:GET ratio exceeds a high threshold (e.g., 10:1) or when the average request_body_len for a 24-hour period exceeds the baseline by more than 3 standard deviations.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to hourly aggregated session data from Zeek http.log. Engineer features per source-destination pair, including: request/response size ratio, POST/GET method ratio, user-agent string entropy, and URI path entropy. Investigate clusters identified as outliers, as they represent network behaviors that deviate significantly from the norm."
            ]
          },
          {
            "description": "Data payloads within a non-TLS/SSL network flow from a mobile device to a low-reputation destination consistently exhibit a Shannon entropy score above 7.5, suggesting the traffic is compressed or custom encrypted.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log",
              "PCAP"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs capturing traffic from mobile subnets, Virtual Private Cloud (VPC) traffic mirroring, and Wi-Fi access points configured for full packet capture.",
            "action": [
              "Monitor Zeek files.log for files extracted from mobile device traffic. Correlate the connection UID (conn_uids) to Zeek conn.log to identify the destination. Alert if the file's mime_type is an archive format (e.g., 'application/zip', 'application/x-rar-compressed') and the destination IP (id.resp_h) is not on an allow-list of approved corporate cloud services.",
              "Using a Zeek script to analyze payloads in real-time, calculate the Shannon entropy for traffic flows from mobile devices over non-standard ports or to low-reputation IPs. Establish a baseline entropy score for known-good application traffic. Alert when a flow's calculated entropy consistently exceeds a high-water mark (e.g., > 7.5), which is indicative of non-standard encryption or data compression.",
              "Train a binary classification model (e.g., Random Forest) to label network flows as 'benign' or 'potential exfiltration'. Use features from connection metadata and payload analysis, including: payload entropy, protocol, destination port, connection duration, bytes sent, bytes received, packet size distribution statistics, and a flag indicating if the destination IP is on a threat intel list. Deploy the model to classify live traffic and generate alerts for flows predicted as 'potential exfiltration'."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]