[
  {
    "information_requirement": "Is an adversary using masqueraded applications or files on mobile devices to evade defenses? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1655",
        "name": "Masquerading",
        "evidence": [
          {
            "description": "A mobile application, identified via its HTTP User-Agent, generates outbound network traffic where: the destination domain matches a known C2 server from a threat intelligence feed; the requested domain name has a Shannon entropy score greater than 3.5 (indicative of DGA); or the data volume and destination port deviate by more than three standard deviations from an established baseline for that application's functional category.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi Network Egress Points, VPN Concentrators, DNS Resolvers, Mobile Device Management (MDM) Platforms",
            "action": "1. (Symbolic) Query Zeek dns.log and conn.log for connections originating from mobile device IP ranges to destination domains or IPs present in a C2 threat intelligence feed. Join on the connection UID with http.log to retrieve the User-Agent and alert on any matches. 2. (Statistical) For each unique User-Agent in http.log, establish a multi-faceted baseline of network behavior including: the 95th percentile of outbound data volume (orig_bytes) from conn.log; the set of common destination ports; and the average Shannon entropy of requested domains from dns.log. Generate an alert when a mobile device's connection deviates significantly, such as exceeding the 95th percentile for data volume, using a historically rare port, or making a DNS query with an entropy score above 3.5. 3. (Machine Learning) Train a time-series forecasting model (e.g., Prophet, ARIMA) on the total outbound data volume per mobile device to detect anomalous spikes. Concurrently, apply an unsupervised clustering algorithm (e.g., DBSCAN) to network connection features (duration, protocol, service, orig_bytes, resp_bytes, dest_port) from conn.log. Investigate connections from mobile devices that the clustering model flags as noise or outliers, as they represent statistically unique behaviors."
          },
          {
            "description": "A file transferred to a mobile device, identified by its User-Agent in HTTP logs, has a filename extension suggesting a benign document type (e.g., 'report.pdf', 'image.jpg', 'memo.docx') but a mime_type identified by Zeek as an Android or iOS application package ('application/vnd.android.package-archive', 'application/x-itunes-ipa').",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organizational Internet Gateway, Web Proxies, Email Gateways",
            "action": "1. (Symbolic) Implement a SIEM rule that generates a high-severity alert when Zeek's files.log records a file transfer where the `mime_type` is 'application/vnd.android.package-archive' or 'application/x-itunes-ipa' and the `filename` ends with a non-executable extension (e.g., .pdf, .jpg, .docx, .txt). Correlate with http.log via the connection UID to confirm the User-Agent string corresponds to a mobile OS. 2. (Statistical) For each user, track the count of file downloads with mismatched filename/MIME types (as defined in the symbolic rule) over a rolling 7-day window. Calculate the 99th percentile for this count across all users. Generate an alert for any user whose mismatched file count exceeds this organizational baseline, indicating a potential targeted attack. 3. (Machine Learning) Develop a supervised classification model (e.g., Random Forest) trained on labeled data from files.log and http.log. Use features such as `mime_type`, filename extension, `is_orig`, file size, source IP reputation, source ASN, and `Referer` header to predict a 'masquerade_risk_score'. Automatically trigger an alert or investigation workflow for file transfers with a predicted score greater than 0.8."
          },
          {
            "description": "An anomalously high rate of failed authentication attempts (Windows Event ID 4625) originates from a single IP address within the mobile device VPN address range. The pattern may indicate a brute-force attack (many failures for one account) or a password spray (failures for many accounts), suggesting a compromised mobile device is being used for internal reconnaissance or lateral movement.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Authentication Servers, Domain Controllers, Active Directory, Internal File Servers",
            "action": "1. (Symbolic) Create a SIEM correlation rule that triggers when a single source IP from the mobile VPN address pool generates over 10 failed logon events (Windows Event ID 4625) within a 5-minute period. Automatically label the alert as 'Potential Brute-Force from Mobile' if the target username is consistent, or 'Potential Password Spray from Mobile' if the target usernames vary. 2. (Statistical) Establish an hourly baseline of failed logon counts (Event ID 4625) originating from the mobile VPN IP range, segmented by business vs. non-business hours. Monitor this metric using a moving average. Generate an alert when the current failure rate exceeds three standard deviations above the established moving average for the corresponding time segment. 3. (Machine Learning) Deploy a User and Entity Behavior Analytics (UEBA) model trained on authentication logs (Event IDs 4624 and 4625). The model should profile normal user behavior, including typical login times, source IP geolocation/ASN, and systems accessed. Generate a high-priority alert when the model detects a high-risk anomaly, such as a user account on the mobile VPN generating authentication failures at an unusual time or against atypical target systems."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]