[
  {
    "information_requirement": "Is an adversary accessing and exfiltrating sensitive application data from our managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1409",
        "name": "Stored Application Data",
        "evidence": [
          {
            "description": "A process, not explicitly allowlisted for Inter-Process Communication (IPC), accesses a file path within another application's sandboxed storage container (e.g., process com.malicious.app reads /data/data/com.corporate.app/databases/creds.db on Android). Alternatively, a process executes a command or API call to change file permissions of a sandboxed directory to be world-readable/writable (e.g., chmod 777 /data/data/com.corporate.app/).",
            "data_sources": [
              "Mobile EDR file access audit logs",
              "Mobile EDR process execution logs",
              "MDM compliance violation alerts"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal application storage directories (e.g., /data/data/ on Android, Application Sandboxes on iOS) on all managed mobile endpoints.",
            "action": [
              "Construct and maintain an allowlist of known-good inter-process file access pairs (e.g., source_process: com.app.A, target_path: /data/data/com.app.B/*). Deploy a detection rule in the SIEM or Mobile EDR platform that alerts on any file read/write event where the source process's package name does not match the package name in the target file path, and the source/target pair is not on the allowlist. Also, create a high-severity alert for any process execution event matching 'chmod 777' or 'chmod 666' on a path within '/data/data/'.",
              "For each managed application, profile its normal file access behavior over a 30-day period to create a baseline set of external directories it interacts with. On an hourly basis, compare the set of directories accessed by the application to its baseline set using the Jaccard similarity index. Generate an alert if the similarity score falls below a dynamically calculated threshold (e.g., 10th percentile of historic scores) or a static threshold of 0.5. Concurrently, calculate the Shannon entropy of the directory names accessed by a process within a 5-minute window; an entropy score exceeding the 95th percentile for that process suggests scanning activity.",
              "Develop a graph-based anomaly detection model where nodes represent application package names and directed edges represent file access from a source app to a target app's data container. Enrich edges with features like access frequency, time of day, and data volume. Train the model (e.g., using a Graph Convolutional Network) on a baseline of known-good device activity. Deploy the model to score new inter-app file access events in near-real-time, flagging any edge with an anomaly score exceeding the 99th percentile for investigation."
            ]
          },
          {
            "description": "A managed mobile device establishes an outbound network connection with a data volume (orig_bytes) in the top 1% of its 30-day baseline, where the destination is a known malicious IP/domain from a threat intelligence feed or a domain registered in the last 30 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek intel.log",
              "Passive DNS logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways; VPN concentrators; Cloud Access Security Broker (CASB) egress points",
            "action": [
              "In the SIEM, create a rule that triggers on Zeek conn.log records originating from the managed mobile device IP space. The rule should join conn.log.id.resp_h with intel.log.indicator where intel.log.indicator_type is 'Intel::ADDR' or 'Intel::DOMAIN'. Also, join conn.log with dns.log on the transaction ID (uid) and check if the dns.log.query corresponds to a domain younger than 30 days based on passive DNS or WHOIS lookup data. Alert on any match.",
              "For each source IP address (id.orig_h) in the mobile device range, maintain a 30-day rolling profile of its outbound connection statistics from conn.log, including the distribution of orig_bytes, duration, and service. Create a primary alert when a new connection's orig_bytes exceeds the 99.5th percentile of that device's profile. Escalate the alert priority if this anomaly correlates with a duration in the bottom 5th percentile (fast upload) or a service (e.g., 'http', 'dns', 'ssl') not seen from that device in the past 7 days.",
              "For each device, train a one-class SVM or Isolation Forest model to learn a profile of its normal network behavior. Use features from conn.log such as orig_bytes, resp_bytes, duration, proto, and categorical features like service and dst_port (one-hot encoded). Also, engineer time-based features like hour-of-day and day-of-week. Feed live connection data into the model and generate an anomaly alert for any connection classified as an outlier, indicating a significant deviation from the established norm."
            ]
          },
          {
            "description": "A managed corporate application writes a file to a world-readable external storage location (e.g., /storage/emulated/0/Downloads/ on Android), and the file's name, content, or hash matches predefined sensitive data patterns.",
            "data_sources": [
              "Mobile EDR file write event logs (including process name, file path, and file hash)",
              "Mobile DLP file content scan results"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Publicly accessible external storage directories on managed mobile devices (e.g., /storage/emulated/0/, /sdcard/, and their subdirectories like Download and Documents).",
            "action": [
              "Deploy a Mobile EDR rule that monitors for file write events originating from processes on the managed app list. The rule should trigger if the target file path is on an external storage mount point (e.g., starts with /storage/emulated/0/ or /sdcard/). The alert should be high-priority if the filename matches a regex for sensitive data, such as '(?i).*(backup|dump|export|creds|credentials|password|secret|token|key|private|session|contact|vcard).*\\.(db|sql|sqlite|json|xml|txt|zip|bak|vcf)$'.",
              "For all files written to external storage by managed applications, pipe the file content (if accessible via DLP/EDR) into an entropy calculation function. Compare the file's Shannon entropy score against a pre-computed baseline for its file extension (e.g., .txt, .jpg). Alert if the entropy exceeds the 99th percentile for that file type (e.g., a .txt file with entropy > 4.5), which may indicate compressed or encrypted data. Additionally, monitor the count of file writes to external storage per app per hour; alert if this count exceeds 3 standard deviations above the app's 30-day average.",
              "Utilize a mobile EDR/DLP solution with built-in text classification capabilities, or implement a central service with a pre-trained NLP model (e.g., a BERT-based model fine-tuned for PII/credential detection). Create an automated workflow: on a file write event to external storage by a managed app, a sample of the file's content is sent to the classification model. If the model classifies the content as 'Sensitive' (e.g., PII, API Key, Password) with a confidence score above 0.95, automatically generate a critical incident and trigger an MDM action to quarantine the device."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]