[
  {
    "information_requirement": "Is an adversary accessing and exfiltrating sensitive application data from our managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1409",
        "name": "Stored Application Data",
        "evidence": [
          {
            "description": "A process or application on a mobile device is observed reading data from another application's storage directory, particularly from directories known to contain sensitive information like authentication tokens, contacts, or messages.",
            "data_sources": [
              "Mobile OS audit logs (e.g., Android logcat, iOS sysdiagnose)",
              "Mobile Device Management (MDM) security event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet",
            "action": "Analyze mobile OS logs for file access events. Establish a baseline of normal inter-application file access patterns for each approved corporate application. Generate an alert when a process attempts to read files outside of its own application sandbox, especially targeting directories of high-value apps (e.g., /data/data/com.company.email/). Prioritize alerts where the accessing process is unsigned, has a low reputation score, or was recently sideloaded."
          },
          {
            "description": "An anomalous outbound network connection from a mobile device, characterized by a large data volume, connection to a new or rare external domain, or occurring immediately after a known-vulnerable application was used.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways and VPN concentrators",
            "action": "For each mobile device, use Zeek conn.log to establish a baseline of normal network behavior, including typical data upload volumes, common destination countries/ASNs, and connection frequency. Monitor for significant deviations, such as an upload volume exceeding the 95th percentile of the device's historical average. Cross-reference destination domains from Zeek dns.log against threat intelligence feeds and a whitelist of sanctioned corporate services. Use a statistical model to score the rarity of a destination domain for a given user or user group; a high rarity score combined with a large upload triggers an alert."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]