[
  {
    "information_requirement": "Is an adversary accessing and exfiltrating sensitive application data from our managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1409",
        "name": "Stored Application Data",
        "evidence": [
          {
            "description": "A process, not associated with the operating system or an approved security tool, accesses data within another application's designated storage container (e.g., '/data/data/com.target.app/' on Android, '/var/mobile/Containers/Data/Application/<UUID>/' on iOS), or a process modifies the permissions of an application data directory to be world-readable/writable.",
            "data_sources": [
              "Mobile OS audit logs (e.g., Android logcat, iOS sysdiagnose)",
              "Mobile Device Management (MDM) security event logs",
              "Endpoint Detection and Response (EDR) for Mobile agent logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet; Application sandboxes and data containers on endpoints",
            "action": "1. (Symbolic) Define an allowlist of applications approved to perform Inter-Process Communication (IPC). Using Mobile EDR logs, create a rule that alerts on any process attempting to read or write to a file path outside of its own sandboxed data directory (e.g., '/data/data/<own_package_name>/*') unless the source/destination pair is on the approved IPC allowlist. Additionally, monitor for 'chmod' commands or API calls that set insecure permissions (e.g., 777) on directories within '/data/data/'. 2. (Statistical) For each managed application, establish a 30-day baseline of file access patterns, including the set of other application directories it communicates with and the frequency. Calculate the Jaccard similarity between the set of accessed directories in a 1-hour window and the baseline set. Alert if the similarity score drops below a threshold (e.g., < 0.5), indicating access to unusual application directories. Separately, calculate the Shannon entropy of file paths accessed by a process; a sudden spike or sustained high entropy score (e.g., > 4.0) suggests directory scanning activity. 3. (Machine Learning) Train a graph-based model (e.g., GraphSAGE) where nodes are applications (processes) and edges represent file access between them. Use edge features such as access frequency, data volume, and file types. Label edges based on known-good IPC and known-malicious cross-sandbox access. Deploy the model to score new or infrequent inter-app connections, flagging those with a high anomaly score for analyst review."
          },
          {
            "description": "A managed mobile device initiates an outbound network connection with an anomalously high data-to-time ratio (e.g., > 1 MB/sec), a total data volume exceeding 3 standard deviations of the device's daily average, and the destination is a low-reputation IP address or a domain registered within the last 30 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek intel.log",
              "Passive DNS logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways; VPN concentrators; Cloud Access Security Broker (CASB) egress points",
            "action": "1. (Symbolic) In a SIEM, join Zeek 'conn.log' with 'dns.log' and 'intel.log'. Create a rule to alert when a 'src_ip' from the managed mobile device IP range initiates a connection where the 'dst_ip' or DNS query ('query' in dns.log) is flagged in the threat intelligence feed ('intel.log'), or where the DNS query corresponds to a domain registered within the last 30 days per passive DNS data. 2. (Statistical) For each device ('src_ip'), calculate a 30-day rolling baseline of key connection metrics from 'conn.log': total outbound bytes ('orig_bytes'), connection duration, and protocol distribution. Alert when a single connection's 'orig_bytes' exceeds the 99th percentile for that device. Generate a high-confidence alert by correlating this with other statistical anomalies, such as a connection duration in the lowest 5th percentile (indicating a rapid transfer) or the use of a protocol not seen from the device in the last 30 days. 3. (Machine Learning) Implement a one-class SVM (Support Vector Machine) model for each device, trained on features from 'conn.log' representing normal network behavior. Features should include 'orig_bytes', 'resp_bytes', 'duration', 'service', 'dst_port', and hour of day. The model learns a boundary around normal activity. Any new connection that falls outside this boundary is flagged as an anomaly, indicative of potential exfiltration."
          },
          {
            "description": "A file creation event is detected where a process from a managed application writes a file to a publicly accessible storage location (e.g., '/storage/emulated/0/' on Android) and the file's content hash matches a known sensitive file, its name matches a sensitive pattern (e.g., 'credentials.db'), or its content contains high-entropy strings indicative of cryptographic keys or tokens.",
            "data_sources": [
              "Mobile EDR agent logs (file creation events)",
              "File content analysis results from Mobile EDR/DLP",
              "Mobile OS audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External storage locations on managed mobile devices (e.g., /storage/emulated/0/, /sdcard/)",
            "action": "1. (Symbolic) Using Mobile EDR, create a detection rule that triggers on file write events from managed corporate apps to external storage paths (e.g., '/storage/emulated/0/*', '/sdcard/*'). The rule must use a comprehensive regex on the file path to detect sensitive keywords, such as '(?i).*(backup|dump|export|creds|credentials|password|secret|token|key|private|session).*\\.(db|sql|sqlite|json|xml|txt|zip|bak)$'. Alert on any match. 2. (Statistical) For files written to external storage by managed apps, calculate the Shannon entropy of the file's content if available via EDR. Establish a baseline entropy for typical file types (e.g., images, logs). Alert if a file's entropy exceeds the 98th percentile for its type (e.g., a '.txt' file with an entropy score > 4.5), suggesting encrypted or compressed data. Also, alert if the frequency of writes to external storage by an app in a one-hour window exceeds 3 standard deviations of its historic average. 3. (Machine Learning) Deploy a lightweight, pre-trained NLP model (e.g., a fine-tuned DistilBERT) on the mobile EDR agent or a central analysis server. This model should be trained to classify text snippets as containing PII, API keys, or other credentials. For file write events to external storage, a sample of the file's content is passed to the model. If the model returns a 'Sensitive' classification with a confidence score > 0.90, generate a high-priority alert for review."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]