[
  {
    "information_requirement": "Has an adversary successfully elevated privileges on a mobile device? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1404",
        "name": "Exploitation for Privilege Escalation",
        "evidence": [
          {
            "description": "A managed mobile device reports a change in its integrity status, indicating it has been rooted (Android) or jailbroken (iOS), which is a primary indicator of successful privilege escalation [1].",
            "data_sources": [
              "Mobile Device Management (MDM) Integrity Log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet (corporate and BYOD)",
            "action": "Continuously ingest and monitor MDM integrity logs for events where a device's 'is_rooted' or 'is_jailbroken' status flag changes to 'true'. Upon detection, trigger an alert and automatically correlate the device's network activity in the 30 minutes prior to the event using Zeek conn.log. Use descriptive statistics to identify anomalous network connections (e.g., to a new country, a low-prevalence ASN, or using a non-standard port) that may indicate the source of the exploit. A connection to an IP address that falls outside of the 95th percentile of a user's typical source/destination profile should be prioritized for investigation."
          },
          {
            "description": "An application, whose package name or hash is associated with known exploits for privilege escalation, is identified in a device's application inventory or its download traffic is observed on the network.",
            "data_sources": [
              "Mobile Device Management (MDM) Application Inventory Log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and corporate Wi-Fi access points",
            "action": "Maintain a watchlist of mobile application package names and file hashes known to contain exploits, derived from threat intelligence. Periodically scan MDM application inventory logs against this watchlist for matches. In parallel, monitor Zeek http.log for downloads of files matching the malicious hashes. Use Zeek dns.log to hunt for DNS requests to domains known to host these malicious apps. Calculate the Shannon entropy of requested subdomains to detect potential domain generation algorithms (DGAs); a high entropy score compared to a baseline of normal traffic warrants investigation."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]