[
  {
    "information_requirement": "Is an adversary bypassing mobile application security controls by downloading and executing new code at runtime?",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1407",
        "name": "Download New Code at Runtime",
        "evidence": [
          {
            "description": "A network session from a managed mobile device IP address to an external, non-whitelisted destination is observed, resulting in the transfer of a file with a MIME type indicative of executable code ('application/java-archive', 'application/x-dex', 'application/x-sharedlib', 'application/octet-stream'). The destination is deemed suspicious if it matches a threat intelligence feed, has a reputation score below 30/100, or the domain was registered within the last 30 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, VPN concentrators, and cloud-based secure web gateways used by mobile devices.",
            "action": [
              "Construct a SIEM rule that joins Zeek conn.log with Zeek files.log on the session UID. Filter for traffic originating from the mobile device IP address range. Trigger a medium-severity alert if the destination Server Name Indication (from Zeek ssl.log) or destination IP address matches a known malicious indicator from a threat intelligence feed OR the domain's age (derived via WHOIS enrichment on DNS requests in Zeek dns.log) is less than 30 days, AND the file's mime_type in files.log is one of ('application/java-archive', 'application/x-dex', 'application/x-sharedlib', 'application/octet-stream'). Enrich the alert with the JA3/JA3S hash and certificate issuer details.",
              "For all outbound TLS sessions from the mobile NAI, calculate the population frequency of all JA3 and JA3S hashes observed in Zeek ssl.log over a 30-day rolling window. Identify any session using a JA3/JA3S hash in the bottom 5th percentile of frequency. Separately, calculate the Shannon entropy of the URI path and query from Zeek http.log. Create a high-priority alert when a session both uses a bottom-5th-percentile JA3/JA3S hash and has a URI entropy score greater than 4.5, especially if correlated with a file download event, to flag potential DGA or obfuscated C2 channels.",
              "Train and deploy a Random Forest classifier on labeled historical network data (benign vs. malicious downloads). Engineer features including: destination domain age, threat intelligence match (boolean), IP/domain reputation score, JA3/JA3S hash frequency percentile, URI Shannon entropy, file MIME type (one-hot encoded), file size, certificate validity period (from Zeek x509.log), certificate issuer (e.g., self-signed), ratio of vowels to consonants in the SNI, and number of subdomains. The model should score new sessions in near-real-time and generate a high-confidence alert for sessions classified as 'malicious dynamic code download' with a probability greater than 0.85."
            ]
          },
          {
            "description": "A Mobile Threat Defense (MTD) agent on a managed Android device logs an API call to a function associated with dynamic code loading (dalvik.system.DexClassLoader, java.lang.System.load, or android.webkit.WebView.addJavascriptInterface). This becomes evidence when the calling application is not on a pre-approved corporate allowlist or is a version known to be vulnerable.",
            "data_sources": [
              "Mobile Threat Defense (MTD) API monitoring logs",
              "Mobile Device Management (MDM) Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android mobile devices enrolled in MDM/MTD solutions.",
            "action": [
              "Create a SIEM rule to generate a high-severity alert upon receiving an MTD log identifying an API call to 'dalvik.system.DexClassLoader', 'java.lang.System.load', or 'addJavascriptInterface'. The rule must automatically enrich the alert by cross-referencing the application's package name and hash against an MDM-sourced application allowlist. If the application is unapproved or a known-bad version, automatically trigger a playbook to quarantine the device via the MTD/MDM API.",
              "For each unique application-user pair across the Android fleet, use MTD telemetry to establish a 30-day rolling baseline of API call counts for dynamic code loading functions. Generate a medium-severity alert for two conditions: a) a 'first use' event where an application calls one of these APIs for the first time across the entire fleet, or b) a 'frequency spike' where an individual user's application call count in a 24-hour period exceeds the 99th percentile or 3 standard deviations above its historical mean for that specific user-application pair.",
              "Train an Isolation Forest or Local Outlier Factor (LOF) anomaly detection model using telemetry from known-good applications. Engineer features such as: n-grams of API call sequences, time delta between API calls, the set of permissions requested by the application, network traffic volume generated by the process, and the combination of APIs called within a 60-second window. Apply the trained model to streaming MTD telemetry and flag any application whose behavior is classified as an anomaly, prioritizing anomalies that involve dynamic code loading APIs for immediate analyst review."
            ]
          },
          {
            "description": "A managed iOS device initiates a network connection to a domain or IP address known for hosting malicious JSPatch scripts, as identified by mobile-specific threat intelligence feeds. Alternatively, an MTD agent reports that a running application is leveraging a known JSPatch library or a similar unapproved dynamic code loading framework. [1]",
            "data_sources": [
              "Mobile Threat Defense (MTD) logs",
              "Zeek dns.log",
              "Zeek conn.log",
              "MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed iOS mobile devices enrolled in MDM/MTD solutions and their associated network traffic.",
            "action": [
              "Continuously ingest a mobile-specific threat intelligence feed of domains, IPs, and file hashes associated with malicious JSPatch frameworks. Create a SIEM correlation rule to trigger a high-severity alert when a DNS query (Zeek dns.log) or network connection (Zeek conn.log) from the iOS NAI matches an indicator on this feed. Create a parallel rule that alerts when an MTD log explicitly identifies the use of a JSPatch function within a non-allowlisted application. Enrich alerts with MDM data about the device owner and application inventory.",
              "For all DNS queries from the iOS NAI (Zeek dns.log), calculate the Shannon entropy for all newly observed domains (not seen in the last 30 days). Concurrently, analyze the Top-Level Domain (TLD) and flag queries to rare TLDs (e.g., .zip, .mov, .link) that are not on an approved list. Generate a medium-priority alert when a non-browser application on an iOS device queries a domain with an entropy score > 4.0 or a rare TLD, and this is followed by a download greater than 1MB from that domain, indicating a potential payload delivery.",
              "Implement a time-series forecasting model (e.g., SARIMA, Prophet) for each critical iOS application to predict the expected volume of outbound network connections per hour, accounting for weekly and daily seasonality. Train the model using at least 30 days of historical data from Zeek conn.log, aggregated by source device and application identifier. Generate a medium-severity alert when the actual connection volume for an application exceeds the model's predicted upper 95% confidence interval for a sustained period (e.g., more than 10 minutes), especially if this anomaly coincides with other symbolic or statistical triggers related to suspicious domains."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]