[
  {
    "information_requirement": "Is the adversary attempting to discover security software on our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1418.001",
        "name": "Security Software Discovery",
        "evidence": [
          {
            "description": "A newly installed or recently updated mobile application makes DNS requests to suspicious or known malicious domains shortly after launch, potentially to exfiltrate a list of installed packages.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points from mobile device subnets",
            "action": "For DNS requests originating from managed mobile devices (Zeek dns.log), calculate the frequency of each queried domain across the fleet. Identify domains that are queried by only a small number of devices (e.g., below the 5th percentile). Enrich these rare domains with threat intelligence feeds. Correlate suspicious DNS lookups with subsequent outbound connections in Zeek conn.log to confirm data transfer. A temporal link between a new application launch, a rare DNS query, and a small outbound data transfer is highly indicative of reconnaissance exfiltration."
          },
          {
            "description": "Anomalous HTTP/S traffic patterns from a mobile application consistent with data exfiltration of discovered device information, such as a list of security tools.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Web Application Firewalls, and forward proxies",
            "action": "Analyze Zeek http.log for POST requests from mobile devices to unusual URIs or domains. Calculate the entropy of URIs requested by each application; a high entropy score may indicate data being encoded in the URI path for exfiltration. For TLS traffic (Zeek ssl.log), baseline the Server Name Indication (SNI) for common applications and alert on new or rare SNI values originating from the mobile device fleet. Correlate with Zeek conn.log to analyze the connection duration and data volume, looking for short-lived connections that transfer a few kilobytes of data, which is characteristic of reconnaissance data exfiltration."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]