[
  {
    "information_requirement": "Is an adversary capturing user credentials via input manipulation on managed mobile devices? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1417.001",
        "name": "Keylogging",
        "evidence": [
          {
            "description": "A non-standard keyboard application, not on the corporate allow-list, is installed on a managed mobile device. Within 24 hours of installation, Zeek conn.log data for the device shows a new pattern of periodic outbound connections characterized by: 1) low data volume (500 bytes to 5 KB per connection), 2) high connection frequency with regular intervals (e.g., every 300 seconds +/- 10% jitter), and 3) connections to a destination IP/domain with a low reputation score or a registration age of less than 30 days.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM servers, Network egress points (e.g., corporate WiFi gateways, VPN concentrators), Managed mobile endpoints (iOS/Android)",
            "action": [
              "From MDM Application Inventory Logs, continuously monitor for installed keyboard applications. Compare each keyboard's package name against a managed allow-list. If an unapproved keyboard is found, cross-reference its network traffic destinations from Zeek dns.log against a threat intelligence feed of known malicious C2 domains and generate a high-priority alert on a match.",
              "For devices with a non-allowlisted keyboard, analyze Zeek conn.log data to establish a 14-day baseline of outbound connection size (orig_bytes) and inter-arrival times. Alert if a new connection pattern emerges where the median connection size is between 500 bytes and 5 KB and the standard deviation of the inter-arrival time for those connections is less than 30 seconds, indicating programmatic beaconing. Additionally, calculate the Shannon entropy of requested subdomains in Zeek dns.log; an entropy score exceeding 3.5 for a given parent domain strongly indicates DGA-based C2.",
              "Train a time-series anomaly detection model, such as an LSTM Autoencoder, on a per-device basis using features from Zeek conn.log (e.g., orig_bytes, resp_bytes, duration, protocol, and connection frequency per hour). Trigger an alert when the model's reconstruction error for a new time window exceeds a dynamic threshold, such as the 99th percentile of reconstruction errors observed over the past 30 days. Correlate the timestamp of the anomaly with MDM logs to link the behavior to the installation of the suspicious keyboard app."
            ]
          }
        ]
      },
      {
        "technique_id": "T1417.002",
        "name": "GUI Input Capture",
        "evidence": [
          {
            "description": "An Android application, not on a pre-approved allow-list, is granted either 'android.permission.SYSTEM_ALERT_WINDOW' or 'android.permission.BIND_ACCESSIBILITY_SERVICE' permission, as recorded in MDM logs. Within 60 minutes of the permission grant, Zeek conn.log shows the device initiating connections to a destination IP/domain that has not been observed in the device's 90-day network history baseline.",
            "data_sources": [
              "MDM Application Permission Logs",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM servers, Network egress points (e.g., corporate WiFi gateways, VPN concentrators), Managed mobile endpoints (iOS/Android)",
            "action": [
              "From MDM Application Permission Logs, generate a medium-priority alert whenever an application is granted 'SYSTEM_ALERT_WINDOW' or 'BIND_ACCESSIBILITY_SERVICE'. Escalate to high priority if the application's package name is not on a curated allow-list of known-good apps. Immediately enrich the app's package name and signing certificate hash against threat intelligence feeds.",
              "For any app flagged by the symbolic rule, establish a 30-day baseline of destination domains/IPs from Zeek dns.log and conn.log for that device. Alert if, within 24 hours of the permission grant, the app initiates connections to a domain that is not in the baseline. Additionally, analyze Zeek ssl.log for associated connections and flag any connection using a self-signed certificate or a JA3/JA3S hash pair with a prevalence of less than 0.1% across the enterprise network.",
              "Utilize a pre-trained classification model, such as a Random Forest, to generate a risk score for each application requesting 'SYSTEM_ALERT_WINDOW' or 'BIND_ACCESSIBILITY_SERVICE'. Model features should include: all requested permissions, app store category, developer reputation, user rating count, application age, and presence on major app stores. A risk score greater than 0.8 should trigger an automated workflow to isolate the device from the network and create a critical incident for immediate SOC investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary collecting sensitive user information (e.g., messages, contacts) via input capture on managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1417.001",
        "name": "Keylogging",
        "evidence": [
          {
            "description": "A non-allowlisted keyboard application is installed on a managed mobile device. Following installation, the device exhibits a new pattern of outbound network connections consistent with bulk data exfiltration. This pattern, observed in Zeek conn.log, is characterized by: 1) larger, more variable data volumes (e.g., 10 KB to 1 MB per connection) than typical C2 beaconing, 2) connections occurring immediately after the use of messaging or email applications, and 3) connections to destination domains with low reputation scores or a registration age of less than 90 days.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM servers, Network egress points (e.g., corporate WiFi gateways, VPN concentrators), Managed mobile endpoints (iOS/Android)",
            "action": [
              "Continuously monitor MDM Application Inventory Logs for newly installed keyboard applications. For any keyboard package name not on a managed allow-list, cross-reference its observed network destinations from Zeek dns.log against threat intelligence feeds for known spyware drop zones or malicious domains. Generate a high-priority alert upon a match.",
              "For devices with a non-allowlisted keyboard, analyze Zeek conn.log to monitor outbound data volume (orig_bytes). Generate an alert if a connection's orig_bytes exceeds the 99th percentile of the device's historical (30-day) outbound connection sizes, particularly if the destination IP has no history for that device. Further score the alert's priority based on the size of the deviation and the reputation of the destination.",
              "Employ unsupervised clustering, such as DBSCAN, on network connection data from all managed mobile devices, using features such as orig_bytes, duration, protocol, destination port, and destination IP prevalence. Investigate any device that falls into a small cluster characterized by high average orig_bytes and connections to rare domains. Correlate devices in these anomalous clusters with MDM logs to identify a common malicious application responsible for the behavior."
            ]
          }
        ]
      },
      {
        "technique_id": "T1417.002",
        "name": "GUI Input Capture",
        "evidence": [
          {
            "description": "An Android application, not on a pre-approved allow-list, is granted 'android.permission.SYSTEM_ALERT_WINDOW' or 'android.permission.BIND_ACCESSIBILITY_SERVICE' permission. Within 60 minutes, the device initiates outbound connections with unusually large payloads (e.g., orig_bytes > 50KB in Zeek conn.log) to a new destination domain, suggesting exfiltration of captured screen content like screenshots or scraped text from sensitive applications.",
            "data_sources": [
              "MDM Application Permission Logs",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM servers, Network egress points (e.g., corporate WiFi gateways, VPN concentrators), Managed mobile endpoints (iOS/Android)",
            "action": [
              "Generate a medium-priority alert from MDM Application Permission Logs whenever an application is granted 'SYSTEM_ALERT_WINDOW' or 'BIND_ACCESSIBILITY_SERVICE'. Escalate to high-priority if the application's package name is not on a curated allow-list. Immediately enrich the app's package name and signing certificate against threat intelligence feeds and internal application inventories.",
              "For any non-allowlisted app granted these permissions, monitor its subsequent outbound traffic in Zeek conn.log. Establish a 30-day baseline of outbound connection size (orig_bytes) for the device. Generate an alert if the app initiates a connection where the size exceeds the 95th percentile of this baseline and the destination domain from Zeek dns.log is not present in the device's historical baseline.",
              "Refine the pre-trained classification model from PIR 1 to specifically score for spyware behavior. Add model features for permissions that enable data collection (e.g., READ_CONTACTS, READ_SMS, READ_EXTERNAL_STORAGE) in conjunction with BIND_ACCESSIBILITY_SERVICE. A risk score greater than 0.85, indicating a high probability of being spyware, should trigger an automated workflow to isolate the device and create a critical incident for forensic analysis to confirm collection of sensitive data."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]