[
  {
    "information_requirement": "Is the adversary attempting to discover security software on our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1418.001",
        "name": "Security Software Discovery",
        "evidence": [
          {
            "description": "A mobile application, within five minutes of its first launch event logged by the MDM, generates a DNS query for a domain with a prevalence below the 1st percentile across the enterprise, and subsequently initiates a connection to the resolved IP with an outbound data transfer greater than 1KB.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, VPN Concentrators, Corporate Wi-Fi Access Points, DNS Resolvers, MDM/EMM Servers",
            "action": [
              "Correlate MDM new application installation events with network logs by device IP. For DNS queries from the device within 5 minutes of installation, match the `query` field in Zeek dns.log against threat intelligence feeds for known malicious domains (C2, DGA). For associated SSL/TLS connections, match the `ja3` and `ja3s` fields in Zeek ssl.log against known malicious fingerprints.",
              "For DNS queries not matching an enterprise allow-list, calculate the 30-day query prevalence across all mobile devices. Alert if the queried domain's prevalence is below the 1st percentile (e.g., queried by fewer than 5 unique devices). Additionally, calculate the Shannon entropy of the fully qualified domain name (FQDN) in the `query` field and alert if the score exceeds a baseline threshold of 3.5, indicating high randomness.",
              "Develop a per-device time-series anomaly detection model (e.g., ARIMA, LSTM) on outbound data volume (`orig_bytes` in Zeek conn.log) aggregated in one-minute windows. Trigger an alert if an anomalous spike in data exfiltration is detected within five minutes of a new application's first-launch event from MDM logs, especially when correlated with a low-prevalence DNS query from the statistical alert."
            ]
          },
          {
            "description": "A mobile application generates an HTTP/S POST request where the request body size exceeds the 99th percentile of its 30-day baseline for that specific application, and the destination Server Name Indication (SNI) has a low reputation score or has never been seen for that application.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Web Application Firewalls, Forward Proxies, VPN Concentrators",
            "action": [
              "For traffic from the mobile device IP space, match the `host` field in Zeek http.log and the `server_name` field in Zeek ssl.log against threat intelligence feeds of known malicious indicators. Additionally, create a rule to alert on HTTP requests containing non-standard User-Agent strings (e.g., 'curl', 'python-requests', or null) that deviate from typical mobile application agents.",
              "For each mobile application (identified via MDM/EMM), establish a 30-day statistical baseline for its outbound HTTP POST requests. Alert if a single POST request's body size (`request_body_len` in Zeek http.log) exceeds the 99th percentile for that app. Concurrently, alert if an app communicates with a destination SNI (`server_name` in Zeek ssl.log) that has never been observed for that application across the enterprise.",
              "Train an unsupervised Isolation Forest model using features from Zeek http.log and ssl.log, such as: URI length, request body length, User-Agent string rarity, destination SNI prevalence, and response MIME type. Use the trained model to score all HTTP/S sessions originating from mobile devices and flag sessions identified as significant outliers for analyst review."
            ]
          },
          {
            "description": "Analysis of a mobile application's manifest or behavior scan reveals the use of the `android.permission.QUERY_ALL_PACKAGES` permission (Android) or private APIs like `LSApplicationWorkspace` (iOS) used for enumerating installed applications.",
            "data_sources": [
              "MDM/EMM Application Manifest Scans",
              "Mobile App Vetting Service Reports"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) / Enterprise Mobility Management (EMM) Platform, Third-party Application Vetting System",
            "action": [
              "Create an alert that triggers when an MDM or app vetting service scan detects the `android.permission.QUERY_ALL_PACKAGES` permission or use of the `LSApplicationWorkspace` private API in any application that is not on a pre-approved allow-list of security or device management tools.",
              "For all applications in the mobile device inventory, calculate the prevalence of the `QUERY_ALL_PACKAGES` permission, segmented by app store category. Alert on any application that has this permission if its presence is statistically rare for its category (e.g., present in <5% of 'Productivity' apps). Also, analyze permission co-occurrence and alert on statistically improbable combinations (e.g., 1st percentile) like `QUERY_ALL_PACKAGES` and `ACCESS_FINE_LOCATION`.",
              "Train a supervised classification model (e.g., Gradient Boosting, Random Forest) to generate a risk score for each mobile application. Features should include: presence of `QUERY_ALL_PACKAGES` or private API usage (as a high-weight binary feature), total number of permissions requested, developer reputation, app store rating, and app age. Trigger an automated policy action, such as quarantine or alert, when an application's risk score exceeds a predetermined threshold."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]