[
  {
    "information_requirement": "Is an adversary attempting to discover running processes on our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1424",
        "name": "Process Discovery",
        "evidence": [
          {
            "description": "A mobile device exfiltrates a list of running processes, which may appear as an anomalous HTTP POST request or an unusually long DNS query containing encoded data.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, network egress points, DNS servers.",
            "action": "Monitor Zeek http.log for POST requests originating from mobile device IP ranges to unknown or low-reputation domains. Analyze the size and entropy of the POST body; a small request with high entropy could indicate exfiltration of a compressed/encoded process list. For Zeek dns.log, monitor for DNS queries from mobile devices that are abnormally long (e.g., > 95th percentile of query length for the environment) or have high entropy in the queried subdomain, which can be indicative of DNS tunneling. Correlate findings with threat intelligence feeds for known C2 domains."
          },
          {
            "description": "A compromised mobile device, connected to a corporate Windows machine via USB, leverages the connection to execute process discovery commands on the Windows host to understand the connected environment.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Employee workstations, developer machines where mobile devices are frequently connected.",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for instances where the parent process is related to mobile device services (e.g., 'adb.exe'). Specifically, hunt for child processes like 'tasklist.exe' or PowerShell commands like 'Get-Process'. Establish a baseline of normal developer activity. Flag any execution of these process discovery commands originating from a mobile device bridge process that deviates from the established baseline, especially on non-developer workstations."
          },
          {
            "description": "A mobile device communicates with known domains or IPs associated with rooting or jailbreaking tools, which is a common prerequisite for process discovery on modern mobile operating systems.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, guest Wi-Fi networks.",
            "action": "Continuously monitor Zeek dns.log for queries from mobile device IP ranges to domains associated with known mobile rooting/jailbreaking kits. Maintain and update this list from threat intelligence sources. In Zeek conn.log, look for direct IP connections or connections on non-standard ports to IPs known to host these services. Calculate the frequency of connections from a single device to multiple such suspicious destinations; a sudden spike could indicate an active attempt to root the device."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]