[
  {
    "information_requirement": "Is an adversary enumerating local or adjacent networks from a managed mobile device? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1421",
        "name": "System Network Connections Discovery",
        "evidence": [
          {
            "description": "An application on a managed mobile device makes API calls associated with network discovery (e.g., Android `WifiInfo.getScanResults()`, `BluetoothAdapter.startDiscovery()`, `TelephonyManager.getAllCellInfo()`) that meet at least two of the following conditions: 1) the call frequency in a 60-minute window exceeds the 99th percentile for that specific application's baseline, 2) the calls are made while the application is running in a background state, and 3) the application's assigned category (e.g., 'Calculator', 'Game') in the MDM/UEM platform is inconsistent with the functional need for network discovery permissions and is not on an approved exception list.",
            "data_sources": [
              "Mobile EDR API call monitoring logs",
              "Android Logcat output captured by MDM/EDR",
              "Unified Endpoint Management (UEM) application state logs (foreground/background)",
              "Mobile Device Management (MDM) application inventory and categorization data",
              "MDM application permission grant logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform console, Mobile Threat Defense (MTD) platform console, Corporate-managed mobile endpoints (Android/iOS), SIEM/Data Lake for log aggregation and analysis",
            "action": "1. (Symbolic) Create a SIEM correlation rule to generate a high-severity alert if an application making network discovery API calls has a package name, signing certificate hash, or developer ID matching a known-bad entry from a mobile-specific threat intelligence feed. 2. (Statistical) For each unique application package on managed devices, establish a 30-day rolling baseline of hourly discovery API call counts. Generate a medium-severity alert if the count in any one-hour window exceeds the 98th percentile for that specific app. A high-severity alert is triggered if an app from a non-obvious category (e.g., 'Utilities', 'Games') makes any discovery calls and is not on an approved exception list, OR if discovery calls originate from an app running in the background for more than 5 minutes. 3. (Machine Learning) Train a Local Outlier Factor (LOF) model on features extracted from API call events, including: hour of day, day of week, application category, application install date vs. first discovery call date, number of permissions granted, specific API call made, and a binary flag for 'app in background'. Use the model to score all discovery API call events in near real-time. Events with a high anomaly score (e.g., top 1%) indicate potentially malicious discovery activity that evades static rules and thresholds."
          },
          {
            "description": "A mobile device initiates network discovery API calls (e.g., `WifiInfo`, `BluetoothAdapter`, `TelephonyManager`) and, within a 5-minute window, makes an outbound network connection (observed in Zeek conn.log or dns.log) to a destination that exhibits one or more of the following characteristics: 1) the destination IP/domain is a known malicious indicator, 2) the domain was registered within the last 30 days (Newly Registered Domain), 3) the connection uses a non-standard port for a common protocol (e.g., HTTP over port 8000), or 4) the connection is a direct-to-IP connection, bypassing DNS.",
            "data_sources": [
              "Mobile EDR API call monitoring logs",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek notice.log",
              "Zeek ssl.log",
              "Threat Intelligence Platform domain/IP feeds",
              "Passive DNS records",
              "WHOIS lookup data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate wireless network and internet gateway, DNS resolvers, Network SIEM / Data Lake for log correlation, Threat Intelligence Platform",
            "action": "1. (Symbolic) Correlate mobile EDR/UEM API logs with network logs (Zeek) on device IP and timestamp. Create a SIEM rule that triggers a high-severity alert when a device's network discovery API call event is followed within 5 minutes by a DNS query (Zeek dns.log) or connection (Zeek conn.log) to a destination domain/IP present on a C2 threat intelligence list. Enrich the alert with WHOIS data; if the domain was registered in the last 30 days or the connection is direct-to-IP, elevate the priority to critical. 2. (Statistical) After a device performs discovery calls, monitor its subsequent DNS requests in Zeek dns.log for a 10-minute window. Generate a high-severity alert if: a) the Shannon entropy of the requested subdomain labels in a 1-minute window exceeds a threshold of 4.2 (indicative of DGA), or b) a connection is made to a domain seen by fewer than 5 other devices in the enterprise over the last 30 days (long-tail analysis), or c) the ratio of failed connections (Zeek conn.log with `conn_state` 'REJ' or 'RSTO') to successful connections for a single destination exceeds 90% (indicative of C2 beaconing to an offline server). 3. (Machine Learning) After a discovery event, extract features for all subsequent outbound connections within 10 minutes: destination port, protocol, data volume sent/received, connection duration, JA3/JA3S hash (from Zeek ssl.log), and whether the destination is an IP or domain. Use a pre-trained one-class SVM model, trained on benign network traffic from mobile devices, to classify each connection. A connection classified as an outlier indicates anomalous C2 communication attempting to masquerade as legitimate traffic."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]