[
  {
    "information_requirement": "Is an adversary using a compromised mobile device to move laterally within our internal network by exploiting remote services? (PIR)",
    "tactic_id": "TA0033",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1428",
        "name": "Exploitation of Remote Services",
        "evidence": [
          {
            "description": "A mobile device, connected via VPN or internal Wi-Fi, initiates an unusually high volume of connections to multiple internal servers/workstations over a short period, particularly targeting known vulnerable ports. This activity is followed by a successful login on one of the target systems from the mobile device's IP.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Internal Wi-Fi Access Points, Core network switches, and high-value internal servers.",
            "action": "Correlate mobile device IP addresses from VPN or Wi-Fi DHCP logs with network traffic logs (Zeek conn.log). For each mobile device, establish a baseline of normal connection patterns (e.g., number of unique hosts contacted per hour). Using descriptive statistics, hunt for mobile IPs exhibiting a fan-out connection pattern (e.g., connections to >95th percentile of unique hosts) targeting common service ports (e.g., 445, 3389, 8080). If such scanning is detected, pivot to the target systems' logs to find a corresponding successful login (Windows Event ID 4624) from the source mobile IP, which would confirm lateral movement."
          },
          {
            "description": "An internal service or application crashes or terminates unexpectedly immediately following a connection from an IP address associated with a mobile device.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 7034",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application servers and workstations hosting remote services accessible from the internal network.",
            "action": "Monitor for application crash events (Windows Event ID 1000) or unexpected service terminations (Windows Event ID 7034). Upon detection, extract the timestamp and host IP. Query network logs (Zeek conn.log) for all connections to the affected host in the minute preceding the event. Correlate the source IPs of these connections with VPN/Wi-Fi logs to identify any originating from mobile devices. A strong temporal link between the mobile connection and the crash is evidence of a potential exploit attempt."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]