[
  {
    "information_requirement": "Is the adversary capturing audio from mobile devices to collect sensitive information? (TA0035 - Collection)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1429",
        "name": "Audio Capture",
        "evidence": [
          {
            "description": "An application on a managed mobile device accesses the microphone while in a background state, and within a 60-second window, initiates an outbound network connection to a destination matching a threat intelligence feed or exhibiting statistically anomalous properties.",
            "data_sources": [
              "MDM/MTD API Event Logs (Microphone Access, App State)",
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Feeds (C2 domains/IPs)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet (both corporate-owned and BYOD), Mobile Device Management (MDM) and Mobile Threat Defense (MTD) servers, Network egress points capturing traffic from mobile device subnets (e.g., VPN concentrators, corporate Wi-Fi access points, proxies)",
            "action": [
              "Using a SIEM, create a correlation rule that joins MDM/MTD logs with network logs on a per-device ID basis. Trigger a high-severity alert if the following sequence occurs within 60 seconds: (1) MDM log shows microphone activation by an app, (2) MDM log shows that app is in a background state, and (3) Zeek conn.log or dns.log shows the device communicating with a destination IP/domain listed on a C2 threat intelligence feed.",
              "For each application on each device, build a baseline profile of background behavior over a 30-day period. The profile should include: the 95th percentile of microphone activation duration, the 95th percentile of data volume sent (Zeek `orig_bytes`) within 5 minutes of a background microphone activation, and the set of countries typically connected to. Generate a medium-severity alert if an application's background microphone use exceeds its duration percentile AND the subsequent data transfer volume exceeds its volume percentile or connects to a country not seen in the baseline.",
              "Ingest device event streams (mic_on, app_background, net_connect, app_name, destination_ip) into a time-series database. Train an LSTM autoencoder on historical event sequences to learn normal device activity patterns. Deploy the model to analyze live event sequences in real-time. Trigger a high-severity alert for analyst investigation when the model's reconstruction error for a given sequence exceeds a dynamically calculated threshold (e.g., 3 standard deviations above the mean error), indicating a statistically rare and potentially malicious behavioral pattern."
            ]
          },
          {
            "description": "Static analysis of an Android application package (APK) reveals the `android.permission.CAPTURE_AUDIO_OUTPUT` permission, and the application's digital signature does not match an allowlist of the device OEM or approved system vendors. Alternatively, an application requests standard microphone access and is flagged as high-risk by a multi-feature scoring model.",
            "data_sources": [
              "Mobile Application Vetting Static Analysis Reports (Parsed Manifests, Permissions, Signer Certificates, API calls)",
              "MDM Application Inventory Logs (Package Name, Version, Device ID)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Application Management (MAM) repositories, Mobile application vetting and sandboxing platforms, MDM/MTD servers storing application inventory data for all managed devices",
            "action": [
              "Configure the mobile application vetting platform to perform a daily, automated scan of all managed applications' manifests. Create a rule to generate a critical-severity alert for immediate investigation if an Android app's manifest contains the 'android.permission.CAPTURE_AUDIO_OUTPUT' permission AND its signer certificate's Common Name (CN) is not on a pre-defined allowlist of trusted OEMs and system software providers.",
              "For every application requesting microphone access (`RECORD_AUDIO` or `NSMicrophoneUsageDescription`), calculate a risk score. The score is a weighted sum of features: 1) Application Category Risk (e.g., a game is higher risk than a meeting app), 2) Developer Reputation (new or unknown developers increase score), 3) Shannon Entropy of requested permissions (higher entropy may indicate over-permissioning), 4) Market Presence (not being on a major app store increases score). Flag any application with a total risk score exceeding the 95th percentile of all apps in the environment for manual review.",
              "Train a supervised classification model (e.g., Gradient Boosting) using a labeled dataset of known malicious and benign APK/IPA files. Engineer features from static analysis reports, including: the full list of requested permissions (one-hot encoded), presence of specific suspicious API calls (`MediaRecorder.setAudioOutput`, reflection APIs like `Class.forName`), presence of obfuscated code indicators, and string analysis for embedded URLs/IPs. Integrate the trained model into the app vetting pipeline to automatically classify new applications, blocking and alerting on any app classified as 'malicious' with a confidence score > 0.9."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]