[
  {
    "information_requirement": "Is an adversary enumerating local or adjacent networks from a managed mobile device? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1421",
        "name": "System Network Connections Discovery",
        "evidence": [
          {
            "description": "An application makes frequent or unexpected calls to mobile OS APIs used for discovering Wi-Fi, Bluetooth, or cellular networks, such as WifiInfo, BluetoothAdapter, or TelephonyManager.",
            "data_sources": [
              "Mobile EDR/MDM API call logs",
              "Android Logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (Android/iOS)",
            "action": "From mobile EDR/MDM logs, inventory all applications making calls to network discovery APIs (e.g., WifiInfo, BluetoothAdapter, TelephonyManager). For each application, establish a baseline of call frequency. Use statistical analysis (e.g., Z-score, percentile rankings) to identify apps making an anomalously high number of calls compared to their own history or peer group. Correlate these calls with the app's installation time and known function; a recently installed non-network utility app that begins intense network scanning is highly suspicious."
          },
          {
            "description": "A mobile device exhibits on-device network scanning behavior immediately followed by new or anomalous outbound network connections to unknown or suspicious C2 domains.",
            "data_sources": [
              "Mobile EDR/MDM API call logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate wireless network and internet gateway",
            "action": "Join on-device API call logs with network logs (Zeek) by timestamp and device IP address. Create a time-windowed query that looks for network discovery API calls followed within a short period (e.g., 5 minutes) by an outbound connection (in conn.log) to a domain with low prevalence (rare) or a low reputation score. Calculate the entropy of requested subdomains in dns.log for the device; a sudden spike in entropy following network discovery could indicate the use of domain generation algorithms (DGAs) for C2 communication."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]