[
  {
    "information_requirement": "Is an adversary attempting to discover the physical location of our mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430",
        "name": "Location Tracking",
        "evidence": [
          {
            "description": "An installed application on a corporate mobile device requests location permissions (e.g., ACCESS_BACKGROUND_LOCATION on Android; NSLocationAlwaysAndWhenInUseUsageDescription on iOS) that are not justified by its documented function.",
            "data_sources": [
              "Mobile Device Management (MDM) application inventory logs",
              "Application manifest/Info.plist files from app vetting"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, internal/external application stores, application vetting sandboxes.",
            "action": "Continuously scan application manifests (Android) and Info.plist files (iOS) for all installed applications on managed devices. Create a baseline of required permissions for approved corporate applications. Alert on any application that requests `ACCESS_BACKGROUND_LOCATION` or `NSLocationAlwaysAndWhenInUseUsageDescription` if it is not on the approved list or if its category (e.g., a simple utility app) does not justify constant location tracking. Calculate the entropy of permissions requested by each app; a high entropy score combined with sensitive permissions like location tracking could indicate a malicious multipurpose app."
          },
          {
            "description": "A user's device is frequently reporting its location outside of expected patterns or to an unusual network endpoint.",
            "data_sources": [
              "Mobile Threat Defense (MTD) location logs",
              "MDM location history logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, network gateways, VPN endpoints.",
            "action": "From MDM/MTD logs, establish a baseline of location reporting frequency for each device/user. Use time-series analysis to detect significant increases in location pings. Correlate timestamps of location reports with network connection logs (Zeek conn.log) from the device's source IP. Analyze the destination IPs (`id.resp_h`) for rarity and reputation using threat intelligence and historical data. A device reporting location frequently to a new or low-reputation IP address is highly suspicious. Calculate the geographic distance between consecutive location reports; statistically significant jumps in location that are physically impossible (e.g., traveling 500 miles in 5 minutes) could indicate GPS spoofing or a compromised reporting mechanism."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary actively collecting and exfiltrating location data from our mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430",
        "name": "Location Tracking",
        "evidence": [
          {
            "description": "A mobile application with location permissions is observed sending data to a known malicious or suspicious command and control (C2) server.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence feeds",
              "MDM/MTD logs identifying active applications"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (firewalls, proxies, VPN concentrators), corporate-managed mobile devices.",
            "action": "Correlate network traffic (Zeek conn.log) from mobile device IP ranges with a threat intelligence feed of known C2 domains/IPs. If a connection is made to a malicious destination, use MDM/MTD logs to identify the process/application responsible on the device. Prioritize alerts where the responsible application has `ACCESS_BACKGROUND_LOCATION` or `NSLocationAlwaysAndWhenInUseUsageDescription` permissions, as this indicates potential exfiltration of sensitive location data."
          },
          {
            "description": "An anomalous volume of data is being exfiltrated from a device, correlated with the activity of an application that has location permissions.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/MTD application activity logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, corporate-managed mobile devices.",
            "action": "For each mobile device, establish a baseline of daily data upload volume (sum of `orig_bytes` in Zeek conn.log per source IP). Use statistical methods (e.g., a Z-score greater than 3 or exceeding the 95th percentile of historical usage) to detect anomalous spikes in data exfiltration. When a spike is detected, cross-reference MDM/MTD logs to identify which applications were active during that time. If an active application has location permissions and no legitimate reason for the large data transfer, flag it for investigation as potential location history exfiltration."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]