[
  {
    "information_requirement": "Is an adversary using standard application protocols for command and control on our mobile devices?",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1437",
        "name": "Application Layer Protocol",
        "evidence": [
          {
            "description": "A mobile device establishes periodic, 'heartbeat'-like HTTP/S connections to a single domain/IP address, characterized by consistent time intervals and small, uniform data payloads.",
            "data_sources": [
              "zeek.conn.log",
              "zeek.http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points/Internet gateway",
            "action": "Analyze Zeek conn.log data for traffic originating from mobile device IP ranges. For each source-destination IP pair, calculate the time delta between consecutive connections. Use statistical analysis to identify periodic connections (beacons) where the standard deviation of the time delta is very low. Correlate with conn.log's 'orig_bytes' and 'resp_bytes' fields to find connections with consistently small, uniform data payloads, which is characteristic of C2 heartbeats."
          },
          {
            "description": "A mobile device exhibits DNS traffic with C2-like characteristics, such as an unusually high volume of requests to a single non-standard domain or the use of TXT records for data transfer.",
            "data_sources": [
              "zeek.dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points",
            "action": "Analyze Zeek dns.log data, grouping by source device IP. For each device, calculate the entropy of queried subdomains for a given parent domain; a high entropy score may indicate Domain Generation Algorithms (DGA). Monitor the length of DNS queries and the size of TXT record responses; values exceeding the 95th percentile of the network baseline are suspicious. Track the frequency of queries from a single device to a single domain; a high, consistent frequency can indicate DNS tunneling."
          },
          {
            "description": "HTTP/S traffic from a mobile device contains anomalous headers, such as a rare or malformed User-Agent string, or a client TLS fingerprint (JA3) not associated with legitimate applications.",
            "data_sources": [
              "zeek.http.log",
              "zeek.ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators",
            "action": "From Zeek http.log, extract User-Agent strings associated with mobile device traffic. Create a baseline of common User-Agents in the environment and flag any that have low prevalence (e.g., seen on <1% of devices) or are known to be associated with malicious tools. From Zeek ssl.log, use JA3 hashes to fingerprint the client-side of the TLS negotiation. Hunt for rare JA3 hashes not associated with legitimate, known mobile applications in the environment."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]