[
  {
    "information_requirement": "Is an adversary attempting to discover the location of our subscribers by impersonating SS7 nodes? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "One or more SS7 Mobile Application Part (MAP) location-related query messages, such as Send Routing Information for SM (SRI-SM) or Provide Subscriber Information (PSI), are received by the Home Location Register (HLR) from an external Global Title (GT) not present on the established roaming partner whitelist.",
            "data_sources": [
              "SGW_map_transactions.log",
              "HLR_query_logs.csv",
              "roaming_partner_gt_whitelist.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network infrastructure, specifically the SS7 signaling plane interfaces (Signaling Gateways) and subscriber databases (HLR/HSS).",
            "action": "Symbolic: Create a SIEM rule that joins SGW transaction logs with the roaming partner GT whitelist on the source Global Title. Trigger a high-priority alert when a transaction's message type is a location query (e.g., SRI-SM, PSI) and its source GT is not found in the whitelist. Statistical: For each non-whitelisted source GT identified in SGW logs, calculate the ratio of its location queries to all other message types over a 24-hour window. Compare this ratio to a 30-day rolling baseline derived from legitimate partner traffic. Flag any GT whose location query ratio exceeds the 99th percentile of this baseline for investigation. Machine Learning: Feed SS7 transaction features (source GT, message type, target MSISDN, time of day) into a pre-trained 'SS7_Transaction_Classifier' model. Investigate any event classified as 'suspicious' with a confidence score above 0.90, especially if the source GT is not on the roaming partner whitelist."
          },
          {
            "description": "A single external source Global Title (GT) issues a statistically anomalous volume of location queries (e.g., >500) against unique subscriber identifiers (MSISDNs) within a one-hour time window, which is indicative of a scanning or enumeration attempt.",
            "data_sources": [
              "SGW_map_transactions.log",
              "HLR_query_logs.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network infrastructure, specifically the SS7 signaling plane interfaces (Signaling Gateways) and subscriber databases (HLR/HSS).",
            "action": "Symbolic: Using HLR query logs, implement a rule to trigger a high-severity alert if a single source GT queries for more than 500 unique MSISDNs within any 1-hour window. Statistical: For each source GT in HLR query logs, calculate the hourly count of unique MSISDNs queried. Compute a Z-score for this count against the GT's own 30-day rolling average and standard deviation using the formula $$ Z = (x - \\mu) / \\sigma $$. Generate an alert for any Z-score greater than 3, indicating a significant deviation from normal behavior. Machine Learning: Apply a density-based clustering model (e.g., DBSCAN) to a feature set of (source GT, count of unique MSISDNs queried per hour). Investigate any source GTs classified as noise points (outliers) as they represent anomalous scanning behavior not matching typical roaming partner profiles."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary successfully collecting subscriber location data via SS7 network exploitation? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "Three or more sequential SS7 MAP location queries for a single subscriber identifier (MSISDN) are received from the same external, non-whitelisted, Global Title (GT) within a 15-minute time frame, indicating active tracking of an individual.",
            "data_sources": [
              "HLR_query_logs.csv",
              "SGW_map_transactions.log",
              "VLR_event_logs.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Subscriber location databases (HLR/HSS, VLR) and the signaling gateways (SGW) that route queries to them.",
            "action": "Symbolic: In HLR query logs, create a stateful rule that groups events by MSISDN and source GT. Generate a 'Potential Subscriber Tracking' alert if the count of location queries from a single non-whitelisted source GT for a single MSISDN exceeds 3 within a sliding 15-minute window. Statistical: For each MSISDN, calculate the Shannon entropy of the distribution of source GTs making location queries over a 24-hour period, using the formula $$ H(X) = -\\sum p(x_i) \\log_2 p(x_i) $$. A score approaching 0 indicates a single source is dominating queries. Flag MSISDNs in the bottom 5th percentile of entropy scores for further review of potential targeting. Machine Learning: Input sequences of SS7 events per MSISDN into a recurrent neural network (RNN) or similar 'SS7_Sequence_Analyzer' model. Investigate any MSISDN for which the model flags a sequence as an 'anomalous tracking pattern', such as repeated location queries with no subsequent legitimate activity like calls or messages."
          },
          {
            "description": "A successful SS7 MAP response message, such as SRI-SM ACK, containing sensitive subscriber location information like the serving MSC/VLR address, is transmitted to an external Global Title (GT) that is not on the partner whitelist or has been previously flagged as suspicious.",
            "data_sources": [
              "HLR_query_logs.csv",
              "SGW_map_transactions.log",
              "roaming_partner_gt_whitelist.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points of the core network's signaling plane, specifically the Signaling Gateways (SGWs) responsible for forwarding responses to external networks.",
            "action": "Symbolic: In SGW transaction logs, create a correlation rule that links inbound location queries (e.g., SRI-SM) with their corresponding outbound responses (e.g., SRI-SM ACK). If an outbound response indicates success and its destination GT is not found in the roaming_partner_gt_whitelist.csv, generate a 'Confirmed Location Data Exfiltration' critical alert. Statistical: For each non-whitelisted external GT, calculate the success rate of its location queries (successful responses / total queries) per hour. Alert if the success rate for a given GT exceeds 90% and also surpasses the 95th percentile of the typical success rate observed for legitimate roaming partners. Machine Learning: Utilize a graph-based anomaly detection model ('SS7_Network_Graph') where nodes are GTs and MSISDNs. Investigate any non-whitelisted GT node that is flagged as a 'high-centrality collector' outlier, which indicates a node establishing an anomalously high number of successful collection links (successful queries) from distinct MSISDN nodes."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]