[
  {
    "information_requirement": "Is an adversary using web protocols for command and control on corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1437.001",
        "name": "Web Protocols",
        "evidence": [
          {
            "description": "A mobile device exhibits abnormal HTTP/S traffic patterns indicative of C2 communication, such as periodic 'heartbeat' connections, communication with low-reputation or newly registered domains, use of anomalous User-Agent strings, or high entropy data in URIs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network egress points, VPN concentrators, and DNS resolvers servicing mobile devices.",
            "action": "Filter network logs for traffic originating from mobile device IP address ranges. 1) For beaconing detection, analyze `Zeek conn.log` data to identify periodic connections from a single source to a single destination; calculate the time difference between consecutive connections and flag any consistent, repeating intervals (e.g., using statistical variance or standard deviation). 2) From `Zeek http.log`, establish a baseline of legitimate User-Agent strings for approved mobile applications and alert on rare or previously unseen agents. 3) Correlate destination hosts from `http.log` and `dns.log` with external threat intelligence and domain registration data; flag connections to domains registered within the last 60 days. 4) Calculate the Shannon entropy of URI paths and query strings in `http.log`; alert on requests with entropy scores that are statistical outliers (e.g., > 3 standard deviations from the mean for that destination or user). 5) From `Zeek ssl.log`, fingerprint client TLS sessions using JA3 hashes and compare against known-good baselines of corporate mobile apps and known-bad threat intelligence lists."
          },
          {
            "description": "A mobile device makes an HTTP/S connection using a TLS client fingerprint (JA3 hash) that is not associated with legitimate, approved applications or is known to be used by malware.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and SSL/TLS inspection points monitoring traffic from mobile device subnets.",
            "action": "From `Zeek ssl.log`, extract the JA3 hash for all TLS client hellos originating from the mobile device IP space. Create and maintain a baseline of known-good JA3 hashes associated with sanctioned corporate applications and common mobile OS services. Compare each new observed JA3 hash against this baseline and against a threat intelligence feed of malicious JA3 hashes. An alert should be generated for any JA3 hash that is neither on the allowlist nor in the known-bad list (requiring investigation) or that directly matches a known-bad hash (high-confidence alert)."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]