[
  {
    "information_requirement": "Has an adversary gained initial access to a mobile device via a physical USB connection? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1458",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process on a Windows host associated with mobile device communication (e.g., adb.exe for Android) is observed executing unusual commands or connecting to suspicious network locations, concurrent with a mobile device being connected via USB.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, employee laptops, public charging kiosks within corporate facilities.",
            "action": "Monitor for new USB device connections on workstations. When a mobile device is detected, correlate the timestamp with process creation events (Windows Event ID 4688). Specifically, look for the execution of mobile device communication tools like 'adb.exe' or 'ideviceinstaller'. For any such processes, analyze their child processes and network connections (Zeek conn.log). Alert on connections to known malicious IPs/domains or those with low reputation scores. Calculate the entropy of command-line arguments passed to these tools; a high entropy score may indicate obfuscated or malicious commands."
          },
          {
            "description": "A mobile device connection to a host PC is immediately followed by the host PC making network connections to domains or IPs not typically associated with mobile device updates or management (e.g., non-Apple/Google domains).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, internet gateway, DNS servers.",
            "action": "For each host, build a historical baseline of domains queried (Zeek dns.log) and IPs connected to (Zeek conn.log) within 5 minutes of a mobile device USB connection. When a new mobile device connection is observed, compare the subsequent network activity against this baseline. Use a stacking model where lookups to newly observed domains or connections to IPs in rare ASNs generate a risk score. A score exceeding a statistically determined threshold (e.g., 95th percentile of all host risk scores) indicates a high-probability malicious connection initiated due to the compromised mobile device."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary using compromised mobile devices to laterally move to corporate workstations? (PIR)",
    "tactic_id": "TA0033",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1458",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A file is written to a corporate workstation from a connected mobile device, and that file is subsequently executed, leading to suspicious process chains.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, especially those in sensitive departments; IT administrator workstations.",
            "action": "Create a baseline of normal file activity from connected mobile devices (MTP/PTP). Monitor for file write events (Windows Event ID 4663) from a mobile device to a sensitive directory on a workstation (e.g., C:\\Users\\Public, C:\\Windows\\Temp, user's Startup folder). Correlate the written file's name and path with subsequent process creation events (Windows Event ID 4688). Use a statistical model to flag rare process executions originating from files recently copied from a mobile device. For example, flag if a process is in the bottom 5th percentile of execution frequency across the enterprise."
          },
          {
            "description": "A compromised mobile device, when connected to a PC, initiates network scanning activity from the PC to which it's tethered.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, network segments containing high-value assets.",
            "action": "Upon detection of a mobile device USB connection, monitor the host PC's network activity via Zeek logs. Establish a baseline for the number of unique destination IPs and ports a typical workstation communicates with over a 5-minute interval. If, after a mobile device connection, the host PC's connection count exceeds a dynamic threshold (e.g., 3 standard deviations above its own baseline or the peer group baseline), generate an alert for potential network scanning. Correlate this with process execution data (Windows Event ID 4688) to identify the process responsible for the network activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]