[
  {
    "information_requirement": "Has a user's mobile device been compromised via a drive-by attack?",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1456",
        "name": "Drive-By Compromise",
        "evidence": [
          {
            "description": "A mobile device browser is redirected to a malicious or newly registered domain via a suspicious iFrame or meta-refresh tag embedded in a legitimate website, a common tactic for loading exploit kits.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "MDM/Mobile EDR web logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN concentrators, and other internet egress points used by mobile devices.",
            "action": "Analyze Zeek http.log for transactions where the 'referer' header corresponds to a high-reputation site, but the requested 'host' is a low-reputation or newly registered domain (NRD). Correlate http.log and dns.log to find DNS requests for high-entropy or NRDs immediately following requests to legitimate sites from the same source IP. Use statistical analysis to flag visited domains with an age in the bottom 5th percentile, especially when they are linked from established, high-traffic websites."
          },
          {
            "description": "A web page visited by a mobile device executes an unusually large or obfuscated JavaScript file, which is characteristic of browser fingerprinting scripts used to identify vulnerabilities before delivering an exploit.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek weird.log",
              "MDM/Mobile EDR process logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices with EDR/MDM agents; network egress points with full packet capture or Zeek sensors.",
            "action": "From Zeek files.log, identify JavaScript files and calculate the Shannon entropy of their content; high entropy suggests obfuscation. Establish a baseline for the size of typical JS files from frequently visited sites and alert on files exceeding the 95th percentile. Correlate a request for a large or high-entropy JS file with a subsequent download of a binary ('application/octet-stream') or other unexpected file type from the same client IP. Monitor Zeek weird.log for protocol anomalies occurring during or after the web request."
          },
          {
            "description": "A user's mobile device, after visiting a legitimate site, is redirected through an advertising network to a malicious server that initiates the drive-by compromise. The referer chain shows a legitimate ad network domain followed by one or more redirects.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS servers, network egress points, and web proxies serving mobile device traffic.",
            "action": "Maintain a list of known ad network domains. Search Zeek http.log for transactions where the 'referer' domain is on the ad network list, but the requested 'host' domain is known malicious, uncategorized, or newly registered. Use time-series analysis on a per-client basis to detect rapid sequences of HTTP 302/307 redirects originating from an ad network that terminate on a suspicious landing page. Analyze Zeek dns.log for patterns where a DNS query for a legitimate site is followed by queries to an ad network, a redirector, and finally a malicious host."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]