[
  {
    "information_requirement": "Has an adversary compromised a user's corporate account access by performing a SIM swap? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful user authentication to a corporate service (e.g., VPN, Azure AD) occurs within a 4-hour window following an MDM log that indicates a SIM card change for the same user account. A SIM card change is identified by a log entry showing a new International Mobile Subscriber Identity (IMSI), a new Integrated Circuit Card Identifier (ICCID), a 'SIM Not Present' status, or a device unenrollment event. The subsequent authentication is considered anomalous if it exhibits at least two of the following characteristics when compared against the user's 90-day behavioral baseline: 1) The source IP address geolocates to a country or Autonomous System Number (ASN) from which the user has never authenticated. 2) The login timestamp is in the bottom 5th percentile of the user's typical login hours. 3) The Jaccard similarity between the login's user-agent string and the user's set of historical user-agents is below 0.5.",
            "data_sources": [
              "MDM logs (IMSI/ICCID changes, SIM status, device compliance/enrollment status)",
              "Windows Event ID 4624",
              "Azure AD SignInLogs",
              "VPN authentication logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) Platform, Corporate Authentication Servers (e.g., Active Directory), Cloud Identity Providers (e.g., Azure AD, Okta), VPN Concentrators, and Network Egress Points/Internet Gateways",
            "action": [
              "Create a SIEM correlation rule that joins MDM logs with authentication logs (Windows Event ID 4624, Azure AD SignInLogs, VPN logs) on the user identity. Trigger a high-severity alert if an MDM log event for a user indicates a SIM change (e.g., event code for 'IMSI changed', 'ICCID changed', 'SIM removed', or 'Device Unenrolled') and is followed within 4 hours by a successful authentication log for the same user where the source IP address is present on a threat intelligence feed of known anonymizing proxies or Tor exit nodes.",
              "For each user, compute a 90-day rolling baseline of authentication behavior from VPN, Windows, and Azure AD logs. The baseline must include: (a) a set of all historical source countries and ASNs, (b) a frequency distribution of login hour-of-day, and (c) a set of all historical user-agent strings. For each new login, calculate a risk score. Add points for deviations: +3 for a new country, +2 for a new ASN, +2 for a login hour in the least frequent 5% of the user's distribution, +1 for a user-agent not in the baseline set. Generate a medium-severity alert if the cumulative score for a single login event exceeds 4. Escalate to critical if this alert occurs within 4 hours of a confirmed MDM SIM-change event for that user.",
              "For each user, develop an anomaly detection model using an Isolation Forest algorithm. For each login event, construct a feature vector including: sine/cosine transformations of the login hour and day of week to capture cyclical patterns, one-hot encoded categorical features for source country and ASN (from the user's top 10 most frequent), and a TF-IDF vectorization of the user-agent string. Train the model on the user's last 90 days of authentication data. Score each new login in real-time. An anomaly score in the top 1st percentile for that user, which also occurs within 4 hours of an MDM-logged SIM change event, generates a high-confidence alert for account takeover and triggers an automated response to suspend the account and invalidate active sessions."
            ]
          }
        ]
      },
      {
        "technique_id": "T1566",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A user's device makes an HTTP POST request to a suspicious domain within 5 minutes of a DNS query for that same domain from the same source IP. A domain is considered suspicious if it meets one or more of the following criteria: a) it was registered within the last 30 days according to WHOIS data, b) its name is a typosquat of a known mobile carrier or financial brand (Levenshtein distance <= 2), or c) the POST request body contains form field names commonly associated with PII or credentials (e.g., 'ssn', 'dob', 'pin', 'mmn', 'mothersMaidenName').",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Email gateway logs",
              "Web proxy logs",
              "WHOIS data feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Security Gateway, Internal DNS Resolvers, Web Proxies and Internet Gateways, and user Endpoint Devices",
            "action": [
              "Create a SIEM rule that triggers on an HTTP POST event (from Zeek http.log or web proxy logs). The rule conditions are: (a) the destination domain was first resolved in DNS traffic (Zeek dns.log) from that user's IP within the last 5 minutes, (b) the destination domain's registration date from a WHOIS feed is less than 30 days old OR the domain name matches a typosquatting watchlist, AND (c) the HTTP POST body contains keywords from a PII watchlist (e.g., 'ssn', 'dob', 'securityPin'). This combination generates a high-severity alert for potential PII harvesting.",
              "For all outbound HTTP POST requests from user endpoints (identified in Zeek http.log), establish a baseline of the request body size per user and per destination second-level domain. For each new POST request to a domain not on a corporate allow list, calculate its z-score relative to the user's historical POST sizes to that domain. A z-score greater than 3.0 indicates an anomalously large data upload. If the destination domain also has a Shannon entropy score greater than 4.0 (indicating randomness) or a Levenshtein distance of 2 or less to a known brand ('verizon', 'att', 'bankofamerica'), generate a medium-severity alert for potential credential or PII exfiltration.",
              "Train a supervised classification model (e.g., XGBoost) to predict if a URL is malicious. Extract features including: lexical properties (URL length, subdomain count, path depth, count of special characters like '-', '_', '=', '?'), domain-based properties (domain age, TLD reputation), and certificate properties (issuer, validity period). Deploy this model as a real-time API. Create an automation that, for every URL clicked in an external email, queries the API. If the model returns a 'phishing' probability greater than 0.95, and this is followed within 5 minutes by an HTTP POST request from the user to that same URL, trigger a critical alert and initiate a SOAR playbook to isolate the endpoint and reset the user's credentials."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]