[
  {
    "information_requirement": "Has an adversary gained initial access to a mobile device via a physical USB connection? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1458",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "Within 5 minutes of a USB device connection, a mobile device interaction process (e.g., adb.exe, ideviceinstaller.exe) is executed and exhibits anomalous behavior, such as command-line entropy exceeding the 98th percentile for that process, initiating a network connection to a low-reputation domain, or connecting to a destination IP not seen in the last 60 days for that host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows-DriverFrameworks-UserMode/Operational Event ID 2003"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints with USB ports (corporate workstations, employee laptops, IT helpdesk workstations), public charging kiosks within corporate facilities, DNS servers, network gateways, VPN concentrators, and Mobile Device Management (MDM) servers.",
            "action": [
              "Create a watchlist of mobile management processes (e.g., 'adb.exe', 'ideviceinstaller.exe', 'iFunBox.exe', 'libimobiledevice', 'fastboot.exe'). Correlate a USB connection event (Windows-DriverFrameworks-UserMode/Operational Event ID 2003) with a process creation event (Windows Event ID 4688 or Sysmon Event ID 1) on the same host within a 5-minute window. Trigger a high-severity alert if the process name is on the watchlist, is unsigned, executes from a non-standard directory (e.g., not from %ProgramFiles% or %SystemRoot%), and initiates a network connection (Sysmon Event ID 3) to a destination IP or domain present on a known malicious threat intelligence feed.",
              "For each process on the mobile management watchlist, establish a 30-day rolling baseline of command-line argument Shannon entropy and argument count. After a USB connection event (Event ID 2003), analyze subsequent executions of these processes (Sysmon Event ID 1). Generate a medium-severity alert if a process execution's command-line entropy exceeds the 98th percentile for that specific process name, or if its argument count deviates by more than 3 standard deviations from its historical mean, suggesting obfuscation or unusual commands.",
              "Train a one-class SVM or Isolation Forest model on historical 'normal' network connections (Sysmon Event ID 3, Zeek conn.log) originating from watchlist processes. Use features such as destination port, protocol, bytes transferred (outbound and inbound), connection duration, destination ASN, and destination IP geolocation (country). Any new network connection that occurs within 5 minutes of a USB connection event and is classified as an anomaly by the model should be flagged for investigation."
            ]
          },
          {
            "description": "A host PC, within 5 minutes of a mobile device USB connection, generates a burst of anomalous DNS queries. These anomalies are defined by one or more of the following: the number of unique, previously unseen domains (not observed in the last 30 days) exceeds 3 standard deviations above the host's daily baseline; the ratio of rare TLDs (e.g., .xyz, .club) to common TLDs (.com, .org) exceeds the 99th organizational percentile; or the average Shannon entropy of the queried domain labels is abnormally high (e.g., > 4.0), suggesting algorithmic generation (DGA).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Sysmon Event ID 22",
              "Windows-DriverFrameworks-UserMode/Operational Event ID 2003"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, guest network segments, internet gateway, recursive DNS resolvers, corporate DNS servers, and Endpoint Detection and Response (EDR) logs.",
            "action": [
              "Correlate a USB connection event (Windows-DriverFrameworks-UserMode/Operational Event ID 2003) with subsequent DNS queries (Sysmon Event ID 22, Zeek dns.log) from the same host within a 5-minute window. Generate a high-priority alert if any queried domain matches a threat intelligence feed of known malicious C2, DGA, or phishing domains, especially if the query originates from a process on the mobile management watchlist.",
              "For each host, maintain a 30-day rolling baseline of DNS query statistics, including: a) count of unique domains per hour, b) average domain label entropy, and c) ratio of rare-to-common TLDs. Following a USB connection event, monitor the host's DNS activity for 5 minutes. Generate a medium-severity alert if the number of unique domains queried exceeds 3 standard deviations from the baseline, or if the average label entropy or rare TLD ratio exceeds the 99th percentile for that host.",
              "Train an Isolation Forest or Autoencoder model on DNS query features from Zeek dns.log and Sysmon Event ID 22. Features should include query length, subdomain count, TLD, label entropy, query type (A, AAAA, CNAME, etc.), and the name of the initiating process. Flag any query marked as an outlier that occurs within 5 minutes of a USB connection. Prioritize alerts for investigation where a cluster of outlier queries is observed from the same host in a short time frame."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary using compromised mobile devices to laterally move to corporate workstations? (PIR)",
    "tactic_id": "TA0033",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1458",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "Following a mobile device USB connection, a process associated with that connection (e.g., adb.exe) writes a new executable file (.exe, .dll, .ps1, .bat) to a common user-writable directory (e.g., %APPDATA%, %TEMP%, Downloads). This file is subsequently executed within 10 minutes, is either unsigned or has a low enterprise-wide prevalence (e.g., seen on < 5 hosts), and its child processes include command interpreters (cmd.exe, powershell.exe) or network utilities (bitsadmin.exe, certutil.exe).",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Windows-DriverFrameworks-UserMode/Operational Event ID 2003"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, IT administrator workstations, software development environments, user profile directories (Downloads, Temp, AppData), and shared network drives.",
            "action": [
              "Define a detection rule that correlates a USB connection (Event ID 2003) with a subsequent file creation (Sysmon Event ID 11) and process execution (Sysmon Event ID 1) from that file on the same host within 10 minutes. Generate a critical alert if the executed file's hash is present on a malware intelligence feed. Also, generate a high-severity alert if the executed process spawns a child powershell.exe process with suspicious arguments like '-enc', '-e', '-encoded', or '-w hidden'.",
              "Following a USB connection event, for any file created (Sysmon Event ID 11) by a mobile management process, calculate the prevalence of the file's hash across the enterprise. Generate a medium-severity alert if the hash prevalence is below a threshold (e.g., seen on < 5 hosts). Additionally, analyze the parent-child process relationship (Sysmon Event ID 1) of any subsequent execution. Alert if the observed parent-child pair (e.g., 'my_dropped_app.exe' -> 'cmd.exe') falls into the bottom 5th percentile of frequency for all observed process relationships.",
              "Train a Random Forest or Gradient Boosting classifier to predict the maliciousness of a file execution event (Sysmon Event ID 1). Use features derived from the file and process, such as: file path entropy, file extension, parent process name, file signature status (Valid, Invalid, Unsigned), file hash prevalence, and whether the file was created within 10 minutes of a USB connection. Flag any execution with a predicted malicious probability score greater than 0.9 for immediate containment and investigation."
            ]
          },
          {
            "description": "Within 15 minutes of a USB device connection, the host initiates internal network scanning activity. This is evidenced by a high volume of connections to unique internal IPs on reconnaissance ports (e.g., 22, 135, 445, 3389), a high ratio of failed-to-successful connections (>10:1), or a number of unique internal IP-port destinations that is more than 3 standard deviations above the host's hourly baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Sysmon Event ID 3",
              "Windows-DriverFrameworks-UserMode/Operational Event ID 2003"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, network segments containing high-value assets (Domain Controllers, Database Servers), internal network traffic choke points, East-West traffic monitoring points (e.g., network TAPs, virtual switch monitoring), and VLANs with sensitive servers.",
            "action": [
              "Create a rule to monitor Zeek's notice.log for 'Scan::Address_Scan' or 'Scan::Port_Scan' events. Upon detection, correlate the source host of the scan with USB connection logs (Windows-DriverFrameworks-UserMode/Operational Event ID 2003). If a USB connection occurred on that host within the preceding 15 minutes, escalate to a high-severity alert for immediate investigation of lateral movement.",
              "After a USB connection event, monitor the host's internal network connections (Zeek conn.log, Sysmon Event ID 3) in 5-minute windows. For each window, calculate: a) the count of unique internal destination IPs contacted on common lateral movement ports (e.g., 135, 139, 445, 3389), and b) the ratio of failed connection states (e.g., 'REJ', 'S0') to established states ('SF'). Generate a medium-severity alert if the unique IP count exceeds a threshold of 20 or if the failed connection ratio exceeds 3 standard deviations above the host's 30-day rolling baseline.",
              "Periodically (e.g., hourly), use a K-Means or DBSCAN clustering algorithm to group hosts based on their internal network behavior profiles derived from Zeek conn.log. Features for profiling should include: count of unique destination IPs, count of unique destination ports, ratio of failed-to-successful connections, and total outbound data volume. If a host, within 15 minutes of a USB connection event, transitions from a 'normal user' cluster to a 'scanner' cluster (characterized by high unique destination counts and high failure ratios), flag this state change as a high-confidence anomaly indicative of lateral movement."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]