[
  {
    "information_requirement": "Has an adversary gained initial access to the corporate network via a compromised mobile device?",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1461",
        "name": "Lockscreen Bypass",
        "evidence": [
          {
            "description": "A cluster of failed authentication attempts from a mobile user is immediately followed by a successful login, potentially from an anomalous geographic location or at an unusual time. This pattern can suggest a brute-force or password guessing attack against the device's lockscreen credential which is tied to a corporate account.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, Internet Gateway",
            "action": "Continuously monitor Active Directory for failed login events (Windows Event ID 4625). If a threshold of failures for a single user (e.g., >5 failures in 10 minutes) is breached, flag the account. Correlate this failure cluster with a subsequent successful login (Windows Event ID 4624) for that same user. For the successful login, enrich its source IP address using Zeek conn.log to obtain geolocation and ISP information. Compare the login time and geolocation against a pre-computed baseline for that user (e.g., typical working hours, home country/ISP). An alert should be generated if the successful login follows a failure cluster AND deviates significantly from the user's established baseline (e.g., login from a rare country, login at 3 AM)."
          },
          {
            "description": "Network traffic originating from an IP address associated with a known corporate mobile device exhibits patterns inconsistent with its established baseline, such as accessing unusual internal resources, using non-standard ports, or transferring abnormally large volumes of data.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, VPN address pools, Internal servers hosting sensitive data",
            "action": "Maintain a dynamic mapping of corporate-managed mobile devices to their most recently assigned IP addresses (from VPN or DHCP logs). For each user/device, create a baseline of normal network activity using Zeek logs. This baseline should include: (1) a set of frequently accessed internal hostnames (from dns.log), (2) typical data transfer volumes (e.g., 95th percentile of 'resp_bytes' in conn.log), and (3) the distribution of protocols used. Generate an alert when a device's traffic deviates significantly from its baseline. Examples of triggers include: (a) accessing a sensitive server not in its historical set, (b) initiating a connection where data transferred ('resp_bytes') exceeds its historical 99th percentile, or (c) using a protocol it has never used before. This approach aims to detect post-compromise activity after an adversary has successfully bypassed the lockscreen."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]