[
  {
    "information_requirement": "Has an adversary gained initial access to the corporate network via a compromised mobile device?",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1461",
        "name": "Lockscreen Bypass",
        "evidence": [
          {
            "description": "A high velocity of failed corporate authentication attempts (e.g., >5 events) from a single mobile-associated IP address within a 10-minute window, immediately followed by a successful authentication from the same IP. The successful login's context (e.g., time, geolocation, ASN, device posture from MDM) is statistically anomalous compared to the user's established multi-faceted baseline, indicating a potential credential compromise subsequent to a lockscreen bypass.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "MDM/UEM logs",
              "VPN logs",
              "IdP logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Active Directory Domain Controllers), VPN Concentrators, Cloud Identity Providers (e.g., Azure AD, Okta), Internet Gateway, MDM/UEM solution logs.",
            "action": "1. (Symbolic Logic) Create a rule to detect a specific event sequence: search for 5 or more failed logins (Windows Event ID 4625 with Failure Reason: '%%2313' for 'Unknown user name or bad password') for a single user from a single source IP within a 10-minute window, followed by a successful login (Windows Event ID 4624) for the same user from the same IP within the subsequent 5 minutes. Correlate the source IP with MDM/UEM or VPN logs to confirm it was allocated to a mobile device at the time of the event. 2. (Statistical) For every successful login flagged by the symbolic rule, enrich the source IP with geolocation and ASN data using the Zeek conn.log. Calculate if the login time deviates more than 3 standard deviations from the user's mean login hour. Determine if the source country, ISP, or ASN is historically rare for the user (e.g., not present in the last 90 days of logins or in <1% of their historical logins). Generate a high-severity alert if the event sequence is met and at least two contextual factors (e.g., time, location, ASN) are statistically anomalous. 3. (Machine Learning) Train and apply a user-specific Isolation Forest model on historical login features (hour of day, day of week, source ASN, country, device compliance status from MDM). When the symbolic rule triggers, feed the features of the successful login into the model. An anomaly score in the top 1% (p-value < 0.01) classifies the login as highly suspicious and escalates the alert for immediate investigation."
          },
          {
            "description": "A mobile device, identified via its corporate IP address (from MDM/VPN logs), initiates network connections uncharacteristic of the user or their peer group. Anomalies include: connections to high-value internal hosts not previously accessed by the user's role; DNS queries for domains with high character entropy or unusually short TTLs indicative of DGAs; or HTTP/S traffic exhibiting data exfiltration patterns like abnormally large POST/PUT requests to uncategorized external domains.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments (especially those housing sensitive data like developer environments or financial systems), Corporate Wi-Fi access points, VPN termination points, DNS resolvers, Egress points to the internet.",
            "action": "1. (Symbolic Logic) Maintain and monitor a watchlist of sensitive internal hostnames and IP addresses ('Crown Jewels'). Generate an alert if a connection is observed in Zeek conn.log from a mobile device's IP to any asset on this watchlist, and the user's Active Directory group is not on the pre-approved Access Control List (ACL) for that asset. Additionally, alert on connections using self-signed or unusual certificates identified in Zeek ssl.log. 2. (Statistical) For each 5-minute window per device, calculate the Shannon entropy of requested subdomains. An entropy score exceeding 3 standard deviations from the user's baseline, or any DNS query for a domain with a TTL less than 60 seconds, should be flagged. For HTTP traffic, establish a baseline for the 99th percentile of outbound data transfer size ('orig_bytes' in Zeek conn.log) and flag any connection exceeding 5x this baseline. Also, flag any HTTP User-Agent string not present in the user's or their peer group's 30-day baseline. 3. (Machine Learning) Employ a graph-based anomaly detection model (e.g., GraphSAGE) where nodes represent devices and internal servers, and edges are weighted by connection frequency and volume. An alert is generated when a connection is formed that has a low probability score under the trained model. Concurrently, use a time-series model (e.g., LSTM) on egress data volume per device; an alert is raised if the actual volume significantly exceeds the forecasted 99% confidence interval."
          },
          {
            "description": "A corporate-managed mobile device reports a critical compliance failure to the MDM/UEM platform (e.g., jailbreak/root detection, OS integrity failure, disabling of mandatory security controls), and this is followed within 60 minutes by successful authentication to corporate services from the device's IP address. This temporal correlation suggests the compliance failure was a prerequisite for malicious access.",
            "data_sources": [
              "MDM/UEM logs",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "VPN logs",
              "IdP logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM Management Servers, Authentication Servers, VPN Concentrators, Cloud Identity Providers.",
            "action": "1. (Symbolic Logic) Create a high-priority alert rule that triggers when an MDM log event with `isJailbroken = true`, `isRooted = true`, or `osIntegrityCheck = 'Failed'` is recorded. The rule should then query authentication logs (e.g., Windows Event ID 4624, IdP logs) for a successful login from the device's last known IP (obtained from MDM/VPN logs) within the next hour. 2. (Statistical) For all devices, calculate the 95th percentile for the time-to-remediate critical compliance alerts. Any device that remains non-compliant for a period exceeding this percentile, while also showing active network usage (e.g., total bytes > 1MB in Zeek conn.log) associated with its IP, should be flagged for automated quarantine or manual review. 3. (Machine Learning) Train a gradient boosting classifier (e.g., XGBoost) to predict the probability of a compliance alert being part of a malicious event chain. Features should include: the specific compliance failure type, user's role/department, time of day, device model, OS version, and whether a successful authentication occurred within 1 hour post-alert. A model probability score > 0.9 escalates the event to a high-severity incident for immediate SOC review."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]