[
  {
    "information_requirement": "Is an adversary attempting to disrupt our organization's mobile device communications via a Network Denial of Service attack?",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1464",
        "name": "Network Denial of Service",
        "evidence": [
          {
            "description": "A group of 4 or more MDM-enrolled mobile devices, geolocated within a 50-meter radius, simultaneously report a loss of Wi-Fi connectivity and an inability to detect any available SSIDs, with this state persisting for at least 60 seconds. This is corroborated by network-side monitoring, where Zeek conn.log shows an abrupt cessation of traffic from the devices' last known IP addresses without a corresponding TCP FIN or RST flag in the connection history.",
            "data_sources": [
              "Zeek conn.log",
              "MDM Wi-Fi Status Events",
              "MDM Geolocation Data",
              "Wireless LAN Controller (WLC) logs",
              "Access Point (AP) system logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points and associated mobile devices in sensitive areas such as executive suites, R&D labs, data centers, Sensitive Compartmented Information Facilities (SCIFs), and geofenced event spaces like boardrooms or all-hands meeting areas.",
            "action": [
              "Implement a SIEM correlation rule that triggers an alert when the following conditions are met: 1. A count of unique device IDs reporting both 'Wi-Fi Status: Disconnected' and 'Visible SSID Count: 0' from MDM logs exceeds 3 within a 60-second window. 2. The devices' last known coordinates from MDM geolocation data form a cluster within a 50-meter radius. 3. A subsequent query to Zeek conn.log for the last known IP addresses of these devices shows no TCP FIN ('F') or RST ('R') flags in the 'history' field, indicating an ungraceful disconnect.",
              "For each NAI, ingest MDM logs to establish a 30-day baseline of Received Signal Strength Indicator (RSSI) values. Calculate a rolling mean and standard deviation of RSSI per NAI. Generate a high-severity alert if the average RSSI for 5 or more devices within an NAI drops more than 3 standard deviations below the established baseline for a continuous period of 90 seconds, indicating a localized, area-of-effect signal degradation.",
              "Deploy a two-stage ML model. Stage 1: Apply a time series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to a metric representing the count of 'Wi-Fi Disconnect' events per minute, aggregated for each defined NAI. Stage 2: If the time series model flags an anomaly, automatically trigger a density-based clustering algorithm (e.g., DBSCAN) on the latitude/longitude coordinates of all devices that disconnected during the anomalous window. Escalate to a critical incident if the time series anomaly is confirmed by the formation of a dense geographic cluster (e.g., min_samples=4, eps=0.0005 for a ~50m radius)."
            ]
          },
          {
            "description": "A group of 5 or more MDM-enrolled devices within a defined NAI simultaneously report a 'No Service' cellular state and a Reference Signal Received Power (RSRP) below -120 dBm for a duration of at least 2 minutes. This is considered anomalous if it occurs in an NAI with a historical 30-day average RSRP consistently above -95 dBm.",
            "data_sources": [
              "MDM Cellular Status Logs",
              "MDM Geolocation Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Geofenced perimeters of critical infrastructure (corporate headquarters, data centers), off-site meeting venues for executive events, and the real-time travel corridors of high-value personnel.",
            "action": [
              "Create a stateful SIEM rule that monitors MDM cellular status logs. Trigger a high-severity alert if the count of unique devices reporting a 'No Service' status within a single NAI exceeds a hard limit of 5 devices within a 2-minute sliding window. The alert must be enriched with the last known geolocation, carrier, and device owner for each affected device to facilitate immediate response.",
              "For each NAI, create a time series of 'No Service' events from MDM logs aggregated into 5-minute intervals. Calculate the 99th percentile for this event rate based on the last 30 days of data. Generate a high-severity alert if the current event count in any 5-minute interval surpasses this 99th percentile threshold. Corroborate by calculating the median RSRP for all devices in the NAI; a concurrent drop of more than 25 dBm below the 30-day median RSRP strengthens the alert's severity.",
              "Train a supervised classification model (e.g., Gradient Boosting) to distinguish between malicious jamming events and benign carrier outages. Engineer features such as: count of affected devices, median RSRP drop magnitude, time of day, day of week, carrier diversity of affected devices, and a binary flag for known/scheduled carrier maintenance. In real-time, when a mass 'No Service' event occurs, feed the features into the model. Trigger a critical incident if the model classifies the event as 'malicious' with a confidence score above 0.90."
            ]
          },
          {
            "description": "A single high-value MDM-enrolled device simultaneously reports: 1) GPS signal loss, defined as a horizontal accuracy degradation to over 100 meters or fewer than 3 visible satellites; 2) Wi-Fi disconnection with 0 visible SSIDs; and 3) Cellular 'No Service' status. This state persists for over 60 seconds in a location where the device's historical baseline shows stable connectivity and GPS accuracy better than 15 meters.",
            "data_sources": [
              "MDM Location/GPS Status Logs",
              "MDM Cellular Status Logs",
              "MDM Wi-Fi Status Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices used for asset tracking, fleet management, supply chain logistics routes, and by personnel operating in high-risk or sensitive environments where location integrity is critical.",
            "action": [
              "Implement a multi-log source SIEM correlation rule that triggers on a single device ID. An alert is generated if all three of the following conditions are met for the same device within a 60-second time frame: 1. MDM GPS log shows 'horizontal_accuracy' > 100 OR 'visible_satellites' < 3. 2. MDM Wi-Fi log shows 'status' = 'Disconnected' AND 'visible_ssid_count' = 0. 3. MDM Cellular log shows 'status' = 'No Service'.",
              "For each high-value device, establish a per-NAI baseline of its median GPS horizontal accuracy from the last 30 days of MDM location logs. Trigger an alert if the live accuracy value exceeds 5 standard deviations from its historical baseline for that NAI for more than 2 consecutive minutes. As a parallel check for GPS spoofing, calculate the Shannon entropy of the device's latitude/longitude coordinate pairs over a 10-minute window; a sharp increase in entropy, indicating erratic location jumps, should trigger a separate, related alert for investigation.",
              "For each designated high-value asset, deploy three parallel, univariate time series anomaly detection models (e.g., Isolation Forest or Prophet) to monitor GPS accuracy, Cellular RSRP, and Wi-Fi RSSI independently. Create a meta-alerting system that triggers a critical incident only when all three models report a significant anomaly score concurrently (within the same 5-minute window) for the same device. This approach minimizes false positives by requiring evidence of a coordinated, multi-signal attack."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]