[
  {
    "information_requirement": "Has an adversary gained initial access to our mobile device fleet through a compromised hardware supply chain? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1474.002",
        "name": "Compromise Hardware Supply Chain",
        "evidence": [
          {
            "description": "A mobile device reports an unlocked bootloader or a failed secure boot integrity check, which was not authorized by IT.",
            "data_sources": [
              "MDM device attestation logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint mobile devices managed by the MDM platform.",
            "action": "Continuously query Mobile Device Management (MDM) platform logs for all device attestation and compliance status reports. Create an alert to trigger immediately for any device reporting a bootloader status of 'unlocked' or a secure boot check result of 'failed'. Correlate these alerts with authorized maintenance or developer activity. Any device failing integrity checks outside of an authorized window should be considered compromised and isolated."
          },
          {
            "description": "A batch of new mobile devices exhibits anomalous hardware or firmware identifiers (e.g., baseband version, build number) that deviate from the manufacturer's official specifications or from other devices in the same procurement batch.",
            "data_sources": [
              "MDM device inventory logs",
              "Procurement records"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM platform and asset management database.",
            "action": "For each new procurement batch of mobile devices, establish a baseline of expected hardware and firmware identifiers based on manufacturer specifications and a sample of devices. Upon MDM enrollment, query device inventory data for all new devices. Use a set-based comparison to flag any device reporting an identifier (e.g., baseband version, kernel version, build number) not in the established baseline set. Calculate the frequency of each identifier within the batch; a rare or unique identifier is a high-confidence anomaly requiring investigation."
          },
          {
            "description": "A newly provisioned mobile device is observed making network connections to unknown or suspicious infrastructure immediately after its initial power-on and before any user-installed applications are present.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM enrollment logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway and network egress points.",
            "action": "Correlate MDM enrollment logs with network logs to identify the initial network activity of newly provisioned devices. For the first 60 minutes post-enrollment, analyze all outbound connections from the device (Zeek conn.log). Compare destination IPs and domains (Zeek dns.log) against an allow-list of known-good manufacturer, OS, and corporate domains. Calculate the entropy of requested subdomains to detect potential DGAs. Flag any connections to non-allow-listed destinations or domains with high entropy scores for further analysis."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]