[
  {
    "information_requirement": "Is an adversary encrypting data on corporate mobile devices for impact? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1471",
        "name": "Data Encrypted for Impact",
        "evidence": [
          {
            "description": "A single application process on a mobile device exhibits an anomalously high rate of file read/write/modify operations on user data directories (e.g., internal storage, SD card), particularly targeting common user file types like photos, documents, and videos.",
            "data_sources": [
              "Mobile Endpoint Detection and Response (EDR) Logs",
              "Mobile Device Management (MDM) Application Activity Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS/Android)",
            "action": "Establish a baseline of normal file I/O operations (creates, reads, writes, deletes) per application across the mobile device fleet. Monitor for applications that exhibit a statistically significant deviation from this baseline, such as exceeding the 99th percentile of file modification events within a 1-minute window. A sustained burst of file activity from a non-system application should be considered a high-fidelity indicator of ransomware activity."
          },
          {
            "description": "A file with a name commonly associated with a ransom note (e.g., 'readme.txt', 'decrypt_my_files.html', 'recover_your_data.txt') is created in one or more user-accessible directories on a mobile device.",
            "data_sources": [
              "Mobile Endpoint Detection and Response (EDR) Logs",
              "Mobile Device Management (MDM) File System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data directories on corporate mobile devices",
            "action": "Using mobile EDR or MDM capabilities, continuously monitor for file creation events. Create a watchlist of regular expressions that match common ransom note naming conventions (e.g., `/(decrypt|recover|ransom|readme|help).*(txt|html)$/i`). Trigger a critical alert when a file creation event matches a pattern on the watchlist, especially if the same file is created in multiple directories or at the root of user storage."
          },
          {
            "description": "Following a period of high-volume file modification activity, a mobile application initiates an outbound network connection to a newly seen or low-reputation domain, potentially for key exfiltration or C2 communication.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile EDR Network Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., corporate Wi-Fi gateway, VPN concentrator)",
            "action": "Correlate device-level alerts for high file I/O with network logs for the same device's IP address. For the 5 minutes following a file I/O alert, analyze the device's network traffic in Zeek conn.log. Use a threat intelligence feed and a domain age tool to score the reputation of destination IPs and domains. Calculate the entropy of DNS queries in dns.log originating from the device; a high entropy score could indicate Domain Generation Algorithm (DGA) usage. An alert from high file I/O followed immediately by a connection to a suspicious domain (e.g., registered within the last 24 hours) strongly indicates malicious activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]