[
  {
    "information_requirement": "Has an adversary compromised our mobile applications by injecting malicious code into their software dependencies or development tools? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1474.001",
        "name": "Compromise Software Dependencies and Development Tools",
        "evidence": [
          {
            "description": "A third-party library integrated into a corporate mobile application makes anomalous network connections to unapproved or malicious external endpoints.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways and VPN concentrators monitoring mobile device traffic.",
            "action": "Maintain a curated list of approved third-party libraries and their expected network behaviors (e.g., domains they connect to). Monitor Zeek dns.log and conn.log for connections originating from corporate mobile devices to domains not on this pre-approved list. Calculate the entropy of requested domain names; high-entropy domains may indicate DGA activity. Correlate connections to newly registered domains (NRDs) or domains associated with known malicious infrastructure. An alert should be generated when a mobile application communicates with a high-risk or unexpected external endpoint."
          },
          {
            "description": "A software development tool on a developer's workstation executes unauthorized child processes or establishes suspicious network connections.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 3 (Sysmon)",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer endpoints and build servers within the corporate network.",
            "action": "On developer workstations, monitor for the execution of unauthorized or unsigned development tools using Windows Event ID 4688. For known development tools (e.g., IDEs, compilers), establish a baseline of normal child processes and network connections using Sysmon Event ID 3 and Zeek conn.log. Use statistical analysis to detect deviations, such as a compiler making an outbound connection to a rare IP address (based on historical connections from that host/subnet) or spawning an unusual process like `powershell.exe` with encoded commands. A high deviation score, where multiple metrics exceed a statistical threshold (e.g., 2 standard deviations from the norm), indicates a potentially compromised tool."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]