[
  {
    "information_requirement": "Is an adversary encrypting data on corporate mobile devices for impact? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1471",
        "name": "Data Encrypted for Impact",
        "evidence": [
          {
            "description": "A single application process exhibits a statistically significant spike in file modification or rename events targeting user data file types (e.g., .jpg, .png, .doc, .pdf, .mov) that deviates from established baselines within a short time frame (e.g., 5 minutes).",
            "data_sources": [
              "EDR:FileModification",
              "EDR:FileRename",
              "MDM:AppActivity"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data directories on managed mobile devices, including Android standard directories (e.g., /storage/emulated/0/DCIM, /storage/emulated/0/Documents, /storage/emulated/0/Pictures) and iOS App Sandbox container directories.",
            "action": "1. (Symbolic) Continuously scan EDR:FileRename events for a single process renaming more than 10 files with common user data extensions (.jpg, .pdf, .mov) to an unknown or consistent non-standard extension (e.g., .crypted, .locked, .enc) within a 60-second window. Trigger a critical alert upon match. 2. (Statistical) For each non-system application process, calculate a 30-day rolling baseline of file modification events per minute. Generate a high-severity alert if the event count in any 1-minute window exceeds the 99th percentile of the process's own history or the 95th percentile of its application peer group (e.g., 'photo editors'). 3. (Machine Learning) Deploy a time-series anomaly detection model (e.g., ARIMA or an LSTM-based autoencoder) trained on historical file I/O rates (events/minute) for each application. Generate an alert when the observed rate surpasses the model's forecasted confidence interval for a sustained period greater than 2 minutes, indicating a significant behavioral deviation."
          },
          {
            "description": "One or more files are created with filenames or content indicative of a ransom note, such as filenames containing 'decrypt_instructions.txt' or file content containing keywords like 'bitcoin', 'payment', or 'private key'.",
            "data_sources": [
              "EDR:FileCreation",
              "EDR:FileContentScan"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Root of user-accessible storage on mobile devices (e.g., /sdcard/, /storage/emulated/0/), directories containing recently modified user data, and application-specific data directories.",
            "action": "1. (Symbolic) Implement a real-time rule to scan EDR:FileCreation events. Use a regex pattern like `/(readme|recover|decrypt|help|instruction|restore).*(txt|html)$/i` to match filenames. A successful match generates a critical incident. 2. (Statistical) Upon detection of a potential ransom note file, calculate the 'directory fan-out' by counting the number of unique directory paths the same process writes the note to within a 5-minute window. A fan-out value greater than 3 is a high-confidence indicator of widespread activity and should escalate incident priority. 3. (Machine Learning) Utilize a pre-trained text classification model (e.g., Naive Bayes) on the content of newly created text or HTML files. If the model classifies file content as 'ransomware_note' with a confidence score > 0.95 based on TF-IDF weighted keywords ('bitcoin', 'wallet', 'decrypt', 'private key'), trigger an automated device quarantine action."
          },
          {
            "description": "Following anomalous file I/O activity, the associated application process initiates suspicious outbound network connections to known malicious domains, newly registered domains, or over non-standard ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "EDR:NetworkConnection"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, and cloud-based secure web gateways (SWG) that process mobile device traffic.",
            "action": "1. (Symbolic) Correlate a file I/O alert with network logs for the device's IP address within a +/- 5-minute window. Query Zeek dns.log and Zeek conn.log to check if destination IPs or domains appear on threat intelligence feeds. A match on a 'C2' or 'Ransomware' list is a critical finding. 2. (Statistical) For the suspicious process, analyze Zeek dns.log queries. Calculate the Shannon entropy of the queried second-level domains; a score > 3.5 suggests DGA activity. Concurrently, query WHOIS data for resolved domains; connections to domains registered within the last 30 days significantly increase the device's risk score. 3. (Machine Learning) Train a one-class SVM or Isolation Forest model on a baseline of benign mobile network traffic features (destination port, bytes out, protocol, JA3 hash from Zeek ssl.log). Any connection from a device under a file I/O alert that the model flags as an outlier strongly indicates C2 communication for key exfiltration or status reporting."
          },
          {
            "description": "Anomalous file encryption activity originates from an application that was installed from an untrusted source (sideloaded) or has a statistically rare combination of high-risk permissions (e.g., Write External Storage and Internet Access).",
            "data_sources": [
              "MDM:AppInventory",
              "MDM:AppPermissions",
              "MDM:PolicyComplianceStatus"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform database and logs; Endpoint OS security and application logs on managed devices.",
            "action": "1. (Symbolic) Maintain a dynamic allow-list of applications from the corporate app store. Generate a high-priority alert if any process associated with a file encryption alert originates from an application not on this list or flagged by the MDM as 'sideloaded' or 'unmanaged'. 2. (Statistical) Profile permission grants across the mobile device fleet to calculate the prevalence of specific permission combinations. An application possessing a permission set (e.g., `MANAGE_EXTERNAL_STORAGE` and `INTERNET`) that is present in less than 1% of all applications and is the source of a file I/O anomaly is a high-confidence indicator. 3. (Machine Learning) Employ a clustering algorithm (e.g., DBSCAN) on application metadata (permissions requested, installation source, app store category). Identify and label clusters of 'anomalous' or 'outlier' applications. Any new file I/O alert originating from an application that falls into an anomalous cluster should trigger an immediate incident response."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]