[
  {
    "information_requirement": "Is an adversary using a legitimate external web service for command and control of a compromised mobile device? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1481.002",
        "name": "Bidirectional Communication",
        "evidence": [
          {
            "description": "A mobile device application exhibits unusually high data transfer volumes or periodic, small, 'heartbeat-like' data transfers to a common web service (e.g., social media, cloud storage) that is inconsistent with normal user behavior for that application.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways and VPN concentrators serving mobile devices.",
            "action": "Filter Zeek conn.log for traffic originating from the mobile device IP address space to known legitimate web service domains (e.g., *.twitter.com, *.google.com, api.github.com), identified via Zeek ssl.log SNI fields. For each source IP and destination service pair, establish a baseline of data transfer volume (orig_bytes, resp_bytes) and connection frequency over a 30-day period. Use statistical methods to detect anomalies, such as identifying connections where the data volume is in the 99th percentile of the established baseline. Additionally, analyze the time delta between connections to the same service to identify periodic, low-volume heartbeats; a consistent interval (e.g., every 5 minutes +/- 10 seconds) is highly suspicious."
          },
          {
            "description": "A mobile application makes requests to non-standard or unusual API endpoints of a legitimate web service, or embeds data in unexpected URI parameters, suggesting it is not using the service for its intended purpose.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS servers and Corporate Wi-Fi network gateways.",
            "action": "From Zeek http.log, extract the URI and user-agent for all requests to known legitimate web services from the mobile device IP address space. Establish a baseline of common URIs for these services. Search for outliers, such as URIs with high entropy scores in the path or query parameters, which could indicate encoded C2 data. Correlate with Zeek dns.log to identify requests to unusual or newly observed subdomains of these services. Analyze user-agent strings; a non-standard, missing, or unique user-agent for a mobile app connecting to a common service is an anomaly worth investigating."
          },
          {
            "description": "An application whose primary function does not involve interacting with a specific web service (e.g., a calculator app) is observed communicating with that service (e.g., a social media site or code repository).",
            "data_sources": [
              "Mobile EDR/MDM logs",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile endpoints and MDM/EDR management console.",
            "action": "Using Mobile EDR/MDM logs, create an inventory of applications installed on managed devices and their expected network destinations. Monitor network traffic from mobile devices using Zeek logs (using ssl.log for SNI to identify the destination FQDN and conn.log for connection details). Correlate the source IP and timestamp from Zeek logs with EDR/MDM network connection logs to attribute the traffic to a specific mobile application. Generate an alert for any connection where the application's known function does not align with the destination service (e.g., a 'Flashlight' app connecting to api.github.com)."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]