[
  {
    "information_requirement": "Is an adversary using legitimate external web services for command and control on our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1481",
        "name": "Web Service",
        "evidence": [
          {
            "description": "A mobile application makes periodic, small, and highly regular connections (beaconing) to a legitimate web service (e.g., a social media API, cloud storage provider) that are not consistent with normal user interaction.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments for mobile devices",
            "action": "Filter network logs (Zeek conn.log, ssl.log) for traffic originating from the mobile device IP space to known legitimate web service domains (e.g., api.twitter.com, graph.facebook.com, storage.googleapis.com). For each source IP and destination service pair, analyze the connection timings (ts field). Calculate the inter-arrival time between connections. A low standard deviation or low entropy in these timings suggests automated, periodic beaconing. Analyze the data volume (orig_bytes, resp_bytes in conn.log). C2 traffic is often small and periodic. Calculate the mean and standard deviation of payload sizes. Use statistical methods to flag connections with inter-arrival times and payload sizes exceeding 2 standard deviations from an established baseline for that service."
          },
          {
            "description": "A mobile application communicates with a legitimate web service using a user agent string that does not match a known mobile browser or the legitimate application's user agent, or it accesses unusual API endpoints.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with HTTP/S inspection capabilities",
            "action": "From Zeek http.log, extract id.orig_h (source IP), host, uri, and user_agent. Create a known-good list of user agents for your organization's standard mobile browsers and sanctioned applications. For traffic to common web services (e.g., Pastebin, GitHub, social media), search for user agents that are not on the known-good list, are blank, or are indicative of scripting tools (e.g., 'curl/7.68.0', 'python-requests/2.25.1'). Analyze the uri field for requests to raw content endpoints (e.g., pastebin.com/raw/xxxx, gist.githubusercontent.com/...) which are often used to pull down commands. Calculate the frequency of user agents per mobile device IP; a device using an unusually high number of distinct or rare user agents to access a common service should be investigated."
          },
          {
            "description": "A device repeatedly resolves the domain of a legitimate web service but establishes very brief connections or transfers minimal data, indicating a potential 'check-in' C2 mechanism.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers",
            "action": "Aggregate Zeek dns.log data by source IP and query name over a one-hour window. Identify source IPs making an unusually high number of requests for a single web service domain (e.g., in the 95th percentile of request counts). For these high-frequency requesters, correlate the DNS queries with connection logs (Zeek conn.log) using the timestamp and IP addresses. Calculate the ratio of DNS queries to the total bytes transferred (orig_bytes + resp_bytes) for that domain. A significantly high ratio (many lookups, little data) compared to a baseline of normal user activity is anomalous and could indicate a C2 heartbeat that only proceeds to a full connection if a command is available."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]