[
  {
    "information_requirement": "Is an adversary using a legitimate external web service for command and control of a compromised mobile device? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1481.002",
        "name": "Bidirectional Communication",
        "evidence": [
          {
            "description": "A mobile device application establishes periodic, low-volume 'heartbeat' connections characterized by a low standard deviation of inter-arrival times (e.g., less than 1 second over a 10-minute window), or initiates anomalous high-volume data transfers to a legitimate web service, where the traffic pattern deviates more than 3 standard deviations from an established 30-day baseline for that specific user, device, and application.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network security monitoring sensors at internet gateways, corporate Wi-Fi gateways, VPN concentrators, and Cloud Access Security Broker (CASB) log sources where mobile device traffic is observable.",
            "action": "Symbolic: 1. Ingest a threat intelligence feed of domains and subdomains known to be abused for C2 via legitimate services (e.g., specific GitHub repository URLs, Pastebin user accounts). 2. Query network logs (Zeek ssl.log 'server_name' field) to identify any connections from mobile devices to these indicators. 3. Generate a high-severity alert for any match. Statistical: 1. For each unique mobile device IP and destination service pair (from Zeek conn.log and ssl.log), ingest connection data (ts, uid, id.orig_h, id.resp_h, id.resp_p, orig_bytes, resp_bytes, duration) into a time-series database. 2. Establish a 30-day rolling baseline for connection frequency, duration, and data volume. 3. Calculate the inter-arrival time (delta between 'ts' values) for sequential connections. 4. Generate an alert if: a) the sum of 'orig_bytes' and 'resp_bytes' for a single connection exceeds the 99th percentile of its baseline, OR b) the standard deviation of the inter-arrival time over a 10-minute window is less than 1 second, indicating automated, periodic beaconing. Machine Learning: 1. For each device-service pair, create a time series of total data volume (orig_bytes + resp_bytes) aggregated into 5-minute intervals from Zeek conn.log. 2. Train a forecasting model (e.g., SARIMA, Prophet) on at least 30 days of historical data to learn the normal traffic patterns, including daily and weekly seasonality. 3. Score live traffic against the model's forecast in near real-time. 4. Generate an alert when the observed traffic volume in an interval exceeds the model's 99% prediction interval, indicating a statistically significant anomaly from the learned pattern."
          },
          {
            "description": "An outbound HTTP/S request from a mobile application to a legitimate web service contains a URI path or query string with a Shannon entropy value greater than 4.5 (indicating high randomness) or a value that is a statistical outlier for that specific service. Alternatively, the request includes a User-Agent string that does not conform to a known-good format for common mobile browsers or the specific application.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SSL/TLS-inspecting forward proxies, corporate DNS servers, and other network traffic inspection points capable of decrypting and logging HTTP/S metadata.",
            "action": "Symbolic: 1. Maintain a library of regular expressions for known malicious C2 URIs and a curated list of non-standard or known-bad User-Agent strings used by mobile malware (e.g., 'wpost', 'Mozilla/4.0(compatible; MSIE 5.0; Windows 98)'). 2. Scan all decrypted Zeek http.log records. 3. Generate a high-severity alert if the 'uri' field matches a malicious regex OR the 'user_agent' field matches a known-bad string. Statistical: 1. For each destination web service (identified via Zeek ssl.log 'server_name'), establish a baseline of normal URI structures from Zeek http.log. 2. For each live request, calculate the Shannon entropy of the 'uri' field. 3. Generate an alert if the URI entropy score is a statistical outlier (e.g., exceeds 3 standard deviations above the mean entropy for that specific service) or surpasses a high absolute threshold (e.g., 4.5), which suggests encoded data. Machine Learning: 1. From historical Zeek http.log data, engineer features for each URI, including: length, query parameter count, percentage of non-alphanumeric characters, Shannon entropy, and n-gram frequency. 2. Train a classification model (e.g., Random Forest, Gradient Boosting) using a labeled dataset of known-benign and known-malicious C2 URIs. 3. Deploy the trained model to score all new mobile device HTTP requests in near real-time. 4. Generate an alert for any request classified as malicious with a confidence score above 0.9."
          },
          {
            "description": "A mobile application, as identified by MDM/EDR logs, generates network traffic to a destination service (e.g., 'github.com', 'pastebin.com') that is statistically rare for its assigned application category (e.g., a 'Calculator' app connecting to a 'Development Tools' service) or for the user's role within the organization.",
            "data_sources": [
              "Mobile EDR/MDM logs",
              "Zeek conn.log",
              "Zeek ssl.log",
              "HR Information System Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device endpoints via MDM/EDR agents, MDM/EDR management consoles, and network chokepoints like corporate Wi-Fi gateways or Cloud Access Security Brokers (CASBs).",
            "action": "Symbolic: 1. Define a security policy that maps high-risk or sensitive applications to an explicit whitelist of allowed network destinations. 2. Using MDM/EDR logs to identify the source application process name and Zeek ssl.log 'server_name' for the destination, continuously monitor for policy violations. 3. Generate a high-severity alert if a sensitive application communicates with any destination not on its approved whitelist. Example: IF app_name IS 'Corp_Authenticator' AND destination_sni NOT IN ['auth.corp.com', 'sso.corp.com'] THEN ALERT. Statistical: 1. Ingest MDM/EDR logs to categorize all managed applications (e.g., 'Productivity', 'Social', 'Utility'). 2. For each application category, profile the set of destination services (from Zeek ssl.log 'server_name') contacted over a 30-day period. 3. Calculate the prevalence of each service within each app category (e.g., 'github.com' is contacted by 0.5% of 'Utility' apps). 4. Generate a medium-severity alert when an application communicates with a service whose prevalence within that application's category is less than 1%, indicating a rare and potentially suspicious behavior. Machine Learning: 1. Model the relationship between mobile applications and destination services as a bipartite graph, with nodes for apps and nodes for services, using MDM and Zeek log data. 2. Apply a community detection algorithm (e.g., Louvain Modularity) to the graph to identify naturally occurring clusters of apps and the services they use (e.g., a 'Social Media' cluster, a 'Developer Tools' cluster). 3. A connection from an app to a service outside of its primary community represents a behavioral anomaly. 4. Score the anomaly based on the 'distance' between the app's home community and the service's community in the graph, and generate an alert for high-scoring anomalies, indicating a significant deviation from expected behavior."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]