[
  {
    "information_requirement": "Has the adversary established external command and control (C2) channels on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1481.001",
        "name": "Dead Drop Resolver",
        "evidence": [
          {
            "description": "A mobile application makes a network connection to a common public web service (e.g., social media, content-hosting site), followed within a short time window by a new, unrelated network connection to a domain or IP address that is rare or has a low reputation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi egress points and managed mobile devices.",
            "action": "Define a list of potential dead drop resolver services (e.g., pastebin.com, github.com, specific social media APIs). From network logs (Zeek), identify mobile device IPs that connect to these services. For each of these initial connections, analyze all subsequent network connections made by the same IP within a 5-minute window. For each subsequent connection, calculate a risk score based on multiple factors: 1) Domain prevalence: Use a percentile rank to identify if the destination domain is in the bottom 5% of all domains contacted across the enterprise (from Zeek dns.log). 2) Domain/IP reputation: Enrich the destination IP/domain with external threat intelligence to check for known maliciousness. 3) Connection pattern: Check for a small initial download from the resolver service followed by a more persistent or beacon-like connection to the subsequent domain (using Zeek conn.log 'orig_bytes' and 'resp_bytes'). A high cumulative risk score across these factors indicates a likely dead drop resolver event."
          },
          {
            "description": "A mobile application makes DNS requests for a legitimate, high-reputation domain, but the content retrieved from a corresponding HTTP/S request contains an IP address or domain that is subsequently contacted by the device.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors monitoring mobile device subnets.",
            "action": "For traffic from mobile device subnets, monitor DNS queries (Zeek dns.log) to common content hosting or social media sites. Correlate these with subsequent HTTP requests (Zeek http.log) to the same host. Extract and parse the HTTP response body for embedded IP addresses or domains. If an embedded IP/domain is found, check for any subsequent connections from the same source device to that extracted destination within a 2-minute window using Zeek conn.log. Flag any such correlated event for analyst review, prioritizing destinations that are statistically rare across the environment."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]