[
  {
    "information_requirement": "Is an adversary establishing command and control with a mobile device using a non-standard port? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1509",
        "name": "Non-Standard Port",
        "evidence": [
          {
            "description": "A network connection, originating from an IP address within the mobile device DHCP range, is dynamically identified by a network protocol analyzer (e.g., Zeek) as a specific service (e.g., 'ssl'), but the destination port used for the connection is not the IANA-assigned standard port for that service (e.g., 'ssl' service on TCP/8080 instead of TCP/443).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and guest Wi-Fi network segments, VPN termination points, Unified Endpoint Management (UEM) traffic inspection points, and Internet gateway proxies where mobile device traffic is visible.",
            "action": [
              "Create a rule to alert on Zeek 'Known_Services::Non_Standard_Port' notices where the source IP is within a known mobile device IP range. Alternatively, build a lookup table mapping IANA-standard ports to Zeek service names (e.g., ssl:443, http:80). Join live Zeek conn.log streams against this table and alert when a connection from a mobile IP range has a service and port that do not match. Enrich alerts by cross-referencing the destination IP against a threat intelligence feed of known C2 servers.",
              "From a 30-day baseline of Zeek conn.log data, calculate the frequency of all unique (service, id.resp_p) tuples across the network. For each new connection from a mobile device IP, calculate the frequency percentile of its (service, id.resp_p) tuple. Generate a low-severity alert if the tuple's frequency falls below the 5th percentile, indicating a statistically rare service-port combination that requires investigation.",
              "Engineer features from Zeek conn.log for a supervised classification model (e.g., Random Forest). Features should include port, protocol, duration, bytes transferred, Zeek service name, and boolean flags for 'is_mobile_source' and 'is_non_standard_port'. Train the model on a labeled dataset of malicious and benign connections. Deploy the model to score new connections from mobile devices in real-time, generating an alert for any connection with a malicious probability score exceeding a calibrated threshold (e.g., >0.85)."
            ]
          },
          {
            "description": "A series of outbound connections (e.g., >10 connections in one hour) from a single mobile device source IP to a single external destination IP and non-standard port is observed. The connections exhibit low variance in their inter-arrival times (e.g., standard deviation < 2 seconds) and consistently short durations (e.g., average duration < 1 second), characteristic of automated C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points for all corporate and guest networks, specifically monitoring subnets allocated to mobile devices via DHCP for Wi-Fi or VPN pools, and Cloud Access Security Broker (CASB) logs.",
            "action": [
              "Implement a rule to scan Zeek dns.log for queries originating from mobile IP ranges where the queried domain has a Shannon entropy score greater than 3.5, indicating a potential Domain Generation Algorithm (DGA). Correlate the source IP and timestamp of any matching DNS query with Zeek conn.log records. Trigger an alert if a connection is established to the DGA-resolved IP on a non-standard port within 60 seconds of the DNS query.",
              "Using a sliding 60-minute window, group Zeek conn.log records by source IP, destination IP, and destination port. For any group originating from a mobile IP and using a non-standard port, calculate the standard deviation of both the inter-arrival time and the connection duration. Generate an alert if a group contains more than 10 connections and both standard deviations are below a low threshold (e.g., time delta stdev < 2s, duration stdev < 1s), indicating robotic beaconing behavior.",
              "For each unique (source_ip, dest_ip, dest_port) tuple involving a mobile source and a non-standard port, create a time series of connection counts and total bytes per minute. Apply a time series anomaly detection model (e.g., Isolation Forest or Prophet) to identify patterns that deviate from normal, human-driven traffic. Train the model on baseline data and flag new time series that exhibit high periodicity or other machine-like patterns as anomalous C2 communication."
            ]
          },
          {
            "description": "An SSL/TLS connection from a mobile device IP to a non-standard port exhibits anomalous certificate or TLS handshake characteristics. Specific attributes include: a server certificate with a validation status other than 'ok' (e.g., 'self-signed certificate'); a certificate validity period of less than 90 days; or a JA3 or JA3S hash that is statistically rare (<1st percentile) within the environment's baseline.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors with Deep Packet Inspection (DPI) at Internet gateways, SSL/TLS decryption zones, VPN concentrators, and forward proxies. UEM solutions with traffic inspection capabilities are also a key NAI.",
            "action": [
              "Create a query that joins Zeek conn.log, ssl.log, and x509.log on the connection 'uid'. Filter for connections originating from mobile IP ranges to a non-standard destination port. Trigger an alert if ssl.log.validation_status is not 'ok' or if x509.log.certificate.validity_length is less than 90 days. Enrich alerts by checking the certificate's issuer and subject against a deny-list of known malicious entities.",
              "Maintain a 30-day rolling baseline of all JA3 (client) and JA3S (server) TLS fingerprint hashes from Zeek ssl.log, along with their frequencies. For any new SSL/TLS connection from a mobile device to a non-standard port, calculate the frequency percentile of its JA3 and JA3S hash. Generate an alert if either the JA3 or JA3S hash falls below the 1st percentile, indicating a rare client application or server configuration often associated with malware.",
              "Develop an unsupervised clustering model (e.g., DBSCAN) for SSL/TLS connections from mobile devices. Create a feature vector for each connection including: one-hot encoded validation_status, certificate validity duration, a boolean for non-standard port, a categorical representation of the JA3 hash, and connection duration. Apply the model to group connections. Flag any connections classified as noise points or belonging to small, distinct clusters for analyst review, as these represent groups of connections with shared, uncommon characteristics indicative of a specific malicious tool or campaign."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]