[
  {
    "information_requirement": "Is an adversary establishing command and control with a mobile device using a non-standard port? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1509",
        "name": "Non-Standard Port",
        "evidence": [
          {
            "description": "A mobile application initiates a connection where the observed protocol (e.g., SSL/TLS) does not match the IANA-assigned or commonly accepted port number (e.g., SSL/TLS traffic over port 8080 instead of 443).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, VPN termination points, and Internet gateway proxies where mobile device traffic is visible.",
            "action": "Ingest Zeek conn.log and ssl.log. Create a baseline of common service-to-port mappings seen on the network (e.g., 'ssl' on port 443, 'dns' on port 53). Join conn.log and ssl.log on the connection UID to correlate protocol identification with connection details. Search for connections where Zeek's 'service' field (e.g., 'ssl') is associated with a destination port that is statistically uncommon for that service. Use a percentile-based approach, flagging any port that falls outside the 98th percentile of observed ports for a given service to identify rare and potentially malicious pairings originating from mobile devices."
          },
          {
            "description": "A mobile device is observed making connections to a single external destination IP and port with highly regular time intervals and session durations, indicative of automated C2 beaconing, where the port is not a standard one for common applications.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway and network sensors monitoring egress traffic from mobile device subnets.",
            "action": "For each unique source IP (mobile device), destination IP, and destination port tuple from Zeek conn.log, extract the timestamps of all connections over a 24-hour period. Calculate the time difference (delta) between each consecutive connection. For each tuple, compute the standard deviation of these time deltas. A very low standard deviation (e.g., less than 5 seconds) indicates a consistent, machine-generated interval. Filter this list to include only destination ports that are not well-known (e.g., not 80, 443, 53, 22). A low standard deviation in connection timing to a non-standard port is a strong indicator of beaconing."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]