[
  {
    "information_requirement": "Is an adversary capturing sensitive information from user screens on corporate mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1513",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "A non-standard or suspicious application is granted screen recording permissions via the MediaProjectionManager API and is observed making unusual network connections. [1]",
            "data_sources": [
              "MDM/EMM application inventory logs",
              "MDM/EMM permission grant logs",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, network egress points",
            "action": "Correlate MDM logs showing a screen recording permission grant with network logs (Zeek conn.log) from the same device. Establish a baseline of normal network traffic for applications expected to have this permission (e.g., remote support tools). For unauthorized apps with this permission, analyze their network traffic using Zeek files.log to look for exfiltration of image (.png, .jpg) or video (.mp4) files to non-corporate or low-reputation domains. Calculate the entropy of destination domains; a high entropy score may indicate the use of domain generation algorithms (DGAs)."
          },
          {
            "description": "An application with accessibility service privileges, which is not a known accessibility tool, is installed and active on a device, particularly if it also has network permissions. [1]",
            "data_sources": [
              "MDM/EMM application inventory logs",
              "MDM/EMM security policy compliance logs",
              "Android logcat",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, device settings configurations",
            "action": "Maintain an allow-list of approved applications that legitimately require accessibility services. Use MDM/EMM to periodically query devices for the list of applications with enabled accessibility services and alert on any application not on the allow-list. For alerted devices, cross-reference with network logs (Zeek conn.log) to identify any suspicious outbound connections. Use statistical analysis to flag connections with unusually large data transfers (e.g., exceeding the 95th percentile of the device's typical outbound traffic volume), which could indicate exfiltration of captured screen content."
          },
          {
            "description": "Execution of 'screencap' or 'screenrecord' commands on a device, especially if initiated remotely via Android Debug Bridge (adb) or with root privileges. [1]",
            "data_sources": [
              "MDM/EMM developer mode/USB debugging logs",
              "Zeek conn.log",
              "Mobile EDR logs",
              "Android logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, network segments allowing adb traffic (TCP port 5555), developer workstations",
            "action": "Use MDM/EMM policies to prohibit or alert on the enabling of 'Developer Mode' or 'USB Debugging' on corporate devices. Monitor network traffic (Zeek conn.log) for connections on TCP port 5555, the default for remote adb. If mobile EDR or advanced logging is available, create a detection rule to search for process execution of 'screencap' or 'screenrecord'. Correlate alerts from any of these sources to identify a compromised device and analyze subsequent network traffic for data exfiltration patterns."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]