[
  {
    "information_requirement": "Is an adversary using a compromised mobile device's camera to collect video or images? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1512",
        "name": "Video Capture",
        "evidence": [
          {
            "description": "An application possesses camera permissions (`android.permission.CAMERA` or iOS `NSCameraUsageDescription`) that are inconsistent with its stated purpose and functionality.",
            "data_sources": [
              "Mobile Device Management (MDM) application inventory logs",
              "App vetting platform scan results"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed corporate mobile devices",
            "action": "Using MDM data, periodically query for all applications with camera permissions. For each application, compare its category/function against a baseline of expected permissions (e.g., communication and social media apps are expected to have camera access; utility or business apps are not). Calculate an anomaly score based on this comparison. Flag applications with high anomaly scores that are not in an approved application list for manual review."
          },
          {
            "description": "A mobile device exhibits unusual network upload patterns, such as large, recurring data transfers to an unknown or suspicious domain, especially when the device is idle or no user-facing application appears to be active.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for corporate Wi-Fi and VPN concentrators",
            "action": "For each mobile device, establish a baseline of daily data upload volume using Zeek conn.log. Use statistical methods, such as identifying uploads that exceed the 95th percentile of the historical baseline, to detect significant spikes in outbound traffic. When a spike is detected, analyze the corresponding dns.log entries to identify the destination domain. Calculate the entropy of the requested domain names; high entropy can indicate algorithmically generated domains used by malware. Check files.log for file transfers with MIME types corresponding to video or image formats (e.g., 'video/mp4', 'image/jpeg') being sent to these anomalous domains."
          },
          {
            "description": "An application makes frequent or unexpected calls to the mobile device's camera API, particularly when the application is running in the background and has no visible user interface.",
            "data_sources": [
              "Mobile EDR logs",
              "OS-level API call logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-value target mobile devices with EDR agents installed",
            "action": "From Mobile EDR logs, monitor for processes making calls to camera APIs (e.g., `android.hardware.camera2` on Android). Establish a baseline of which foreground applications legitimately call these APIs. Create a rule to alert when a background process or a process without a user interface makes a camera API call. Use time-series analysis to detect an unusual frequency of API calls from any single application, which could indicate the app is capturing images at set intervals."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]