[
  {
    "information_requirement": "Is an adversary capturing sensitive information from user screens on corporate mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1513",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "A non-allowlisted application is granted screen recording permissions, possesses internet access permissions, and subsequently establishes network connections to low-reputation destinations or exfiltrates an anomalously large volume of data.",
            "data_sources": [
              "MDM/EMM application inventory logs",
              "MDM/EMM permission grant logs",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM management servers, corporate-managed mobile devices, network egress points (firewalls, proxies), DNS resolvers, threat intelligence platforms.",
            "action": "1. (Symbolic) Correlate MDM/EMM permission grant logs against an application allowlist. Generate a high-severity alert if an application not on the allowlist is granted permissions related to screen capture (e.g., via MediaProjection API) and also possesses `android.permission.INTERNET`. 2. (Statistical) For devices triggering the symbolic alert, query Zeek conn.log to profile the application's network behavior. Calculate the 98th percentile of daily outbound data volume (`orig_bytes`) over a 30-day baseline. Alert if the current daily volume exceeds this threshold. Simultaneously, query Zeek dns.log to calculate the Shannon entropy of requested subdomains for a given parent domain using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. A sharp increase in entropy correlated with a data volume spike suggests DGA-based C2 communications. 3. (Machine Learning) Ingest Zeek conn.log data into a pre-trained anomaly detection model (e.g., Isolation Forest). Use features such as connection duration, `orig_bytes`, `resp_bytes`, periodicity, destination port, and a categorical feature for destination IP reputation score from a threat intelligence feed. An application's network flow being classified as an outlier with a high anomaly score within minutes of receiving screen recording permissions should be escalated for immediate investigation."
          },
          {
            "description": "An application not on a pre-approved allowlist is granted Android Accessibility Service privileges, and its subsequent network activity shows a statistically significant deviation in data volume or connection patterns compared to its historical baseline.",
            "data_sources": [
              "MDM/EMM application inventory logs",
              "MDM/EMM security policy compliance logs",
              "Android logcat",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM management servers, SIEM/Data Lake containing correlated MDM and network logs, corporate-managed mobile devices.",
            "action": "1. (Symbolic) Using the MDM/EMM platform, create a compliance policy with an explicit allowlist for applications requiring accessibility services (e.g., known password managers). Configure a rule to generate a high-severity alert for any device where an unlisted application has these services enabled. 2. (Statistical) For any alerted device, query Zeek conn.log to compare the total outbound data volume (`orig_bytes`) in the 24 hours post-alert to the device's 30-day rolling average. Flag any increase greater than three standard deviations from the mean. Additionally, calculate the ratio of `orig_bytes` to `resp_bytes`; a ratio significantly skewed towards outbound traffic is indicative of exfiltration. 3. (Machine Learning) For each managed device, implement a time-series forecasting model (e.g., ARIMA) on hourly outbound data volume from Zeek conn.log. An actual data volume that significantly exceeds the model's 95% upper confidence bound constitutes a temporal anomaly. Correlate this network anomaly in the SIEM with an MDM alert for a newly enabled, non-allowlisted accessibility service on the same device within a 1-hour window to increase detection confidence."
          },
          {
            "description": "The execution of `screencap` or `screenrecord` command-line utilities is logged on a mobile endpoint, or network traffic on TCP port 5555, characteristic of a remote Android Debug Bridge (adb) session, is observed from a non-authorized source IP address.",
            "data_sources": [
              "Mobile EDR logs",
              "Android logcat",
              "Zeek conn.log",
              "Firewall logs",
              "MDM/EMM developer mode/USB debugging logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (EDR/log agent), network segments allowing developer access, network perimeter firewalls, IDS/IPS sensors.",
            "action": "1. (Symbolic) Create an IDS/firewall rule to block and alert on all traffic to TCP port 5555 at the network perimeter, creating exceptions only for designated, monitored developer subnets. On Mobile EDR, create a detection rule to alert on any process execution of `screencap` or `screenrecord`. 2. (Statistical) For allowed adb connections on TCP port 5555, query Zeek conn.log to establish a baseline of normal developer session metrics. Flag sessions where the total data volume (`orig_bytes` + `resp_bytes`) exceeds the 95th percentile, or where the session duration is more than two standard deviations above the mean. Monitor for automated beaconing by calculating the variance of time deltas between consecutive connections; low variance suggests non-interactive, automated activity. 3. (Machine Learning) Train a supervised classification model (e.g., Gradient Boosting) to distinguish between benign developer adb sessions and malicious sessions. Use features from Zeek conn.log such as `duration`, `orig_bytes`, `resp_bytes`, `history`, and `conn_state`. A session classified as 'malicious', particularly one originating from an IP not on a developer allowlist, indicates a high-probability compromise and should be automatically escalated."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]