[
  {
    "information_requirement": "Is an adversary using non-standard or suspicious asymmetric cryptography for command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1521.002",
        "name": "Asymmetric Cryptography",
        "evidence": [
          {
            "description": "A mobile device establishes an encrypted TLS session using a self-signed or newly issued certificate, potentially indicating a non-standard C2 channel rather than a legitimate service.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, VPN concentrators for remote mobile devices",
            "action": "Filter Zeek ssl.log for connections originating from mobile device IP ranges. Scan for a 'validation_status' of 'self-signed certificate'. Separately, calculate the age of all certificates based on the 'not_valid_before' timestamp and flag any certificate less than 30 days old. Correlate these findings by destination IP with Zeek conn.log to assess the connection duration and data volume. A long-lived connection using a new, self-signed certificate is highly suspicious."
          },
          {
            "description": "Encrypted network traffic from a mobile device exhibits periodic, 'heartbeat' C2 beaconing behavior, characterized by highly consistent time intervals and data transfer sizes.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, MDM (Mobile Device Management) proxy servers",
            "action": "Ingest Zeek conn.log and group flows by source IP (mobile device), destination IP, and destination port. For each group, calculate the time delta between consecutive connections over an extended period (e.g., 24 hours). Use descriptive statistics to find the standard deviation of both the time deltas and the 'orig_bytes' (client payload size). A very low standard deviation for both metrics (e.g., close to zero) indicates programmatic, non-human communication, which is a strong signal for C2 beaconing, even when the content is encrypted."
          },
          {
            "description": "Data with unusually high entropy, indicative of custom encryption, is observed in non-payload fields of network protocols, such as DNS queries or HTTP headers, originating from mobile devices.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Web proxies serving mobile devices",
            "action": "For Zeek dns.log, isolate the subdomain portion of DNS queries and calculate the Shannon entropy for each. For Zeek http.log, calculate the entropy for User-Agent strings and URI paths. Establish a baseline entropy score for each field across all mobile device traffic. Use a statistical model to flag any value that exceeds the 99th percentile or is more than 3 standard deviations above the mean, as this may represent encrypted C2 data being tunneled within legitimate protocols."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]