[
  {
    "information_requirement": "Is an adversary collecting sensitive data from local system storage on our mobile devices? (TA0035 - Collection) (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1533",
        "name": "Data from Local System",
        "evidence": [
          {
            "description": "An application process exhibits anomalous file read behavior, defined as either a file read rate (files/minute) exceeding the 95th percentile of its historical baseline, or accessing a high number of unique file paths (>50) in sensitive directories within a one-minute window.",
            "data_sources": [
              "MDM file access logs",
              "EDR file system monitoring logs",
              "Android logcat",
              "iOS Unified Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data partitions, application sandboxes, and shared storage on managed mobile devices (e.g., Android: /data/data/, /storage/emulated/0/DCIM/, /storage/emulated/0/Documents/; iOS: /var/mobile/Containers/Data/Application/, /var/mobile/Media/DCIM/, /var/mobile/Library/Mobile Documents/)",
            "action": [
              "Implement a SIEM rule to generate an alert when a process not on an approved application allowlist performs read operations in sensitive mobile directories (e.g., DCIM, Contacts, Documents). Maintain the allowlist based on legitimate business functions and update it with known malicious process names from threat intelligence feeds.",
              "For each application process on each device, ingest MDM/EDR file access logs to calculate a rolling 30-day baseline of file reads per minute. Generate a medium-severity alert if a process's read rate exceeds the 95th percentile of its individual baseline, and a high-severity alert if it exceeds the 99th percentile, indicating a statistically significant spike in activity.",
              "Deploy a time-series anomaly detection model (e.g., LSTM autoencoder) to profile normal file access patterns for each application, using features such as access frequency, file path entropy, and time of day. An alert is generated when the model's reconstruction error for a new activity window surpasses a dynamically tuned threshold, indicating a deviation from learned normal behavior that warrants investigation."
            ]
          },
          {
            "description": "An API call to access a sensitive credential store (Android Keystore or iOS Keychain) is made by a process that is not on a pre-defined allowlist of trusted system or application processes, identified by its process name and cryptographic signer hash.",
            "data_sources": [
              "MDM API monitoring logs",
              "EDR API call monitoring logs",
              "Android logcat",
              "iOS Unified Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Device credential management services and API gateways on mobile endpoints, specifically the Android Keystore and iOS Keychain services.",
            "action": [
              "Maintain an allowlist of process names and their corresponding cryptographic signer hashes that are authorized to access the Android Keystore or iOS Keychain. Create a SIEM rule to generate a critical alert for any access attempt from a process not on this list, based on MDM/EDR API monitoring logs.",
              "For each authorized application, establish an hourly baseline of credential store API call frequency. Generate an alert if the call count in any given hour deviates by more than 3 standard deviations from the established mean for that specific application, suggesting potential credential harvesting or misuse.",
              "Train a one-class SVM model on legitimate credential access patterns, using features like process name, parent process, API function called, and time of day. Deploy the model to score new access attempts in real-time and flag any event classified as an outlier for immediate security review."
            ]
          },
          {
            "description": "An archive file larger than 10MB with a .zip, .tar, .gz, or .7z extension is created in a temporary or user-writable directory by a non-standard process. The creation event is followed within 5 minutes by a network connection to an external, low-reputation IP address.",
            "data_sources": [
              "MDM file creation logs",
              "EDR file system monitoring logs",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User-writable storage locations on mobile devices (e.g., Android: /storage/emulated/0/Download/; iOS: /var/mobile/Library/Mobile Documents/) and corporate network egress points monitored by network sensors.",
            "action": [
              "Create a SIEM rule to detect the creation of archive files (>10MB with extensions .zip, .tar, .gz, .7z) by any process not on an allowlist of approved backup or file management applications. Correlate this event by device IP and timestamp with Zeek conn.log to check for subsequent data transfers >10MB to external IPs within 5 minutes, elevating the alert to high if a correlation is found.",
              "Upon detection of a large archive creation event, automatically calculate the Shannon entropy of the created filename. A filename entropy score > 3.5 is statistically rare and indicates high randomness, increasing the alert's risk score. Combine this with a check for file MIME type in Zeek files.log during any subsequent transfer to confirm it is an archive.",
              "Train and deploy a Random Forest classifier on labeled file creation events, using features such as process name, cryptographic signer, file size, file path depth, filename entropy, and time of day. Score new archive creation events in real-time and flag those with a malicious probability score > 0.8 for priority investigation."
            ]
          },
          {
            "description": "An installed application possesses a combination of high-risk permissions (e.g., READ_CONTACTS, READ_SMS, MANAGE_EXTERNAL_STORAGE) that is statistically rare (<1% prevalence) for its declared application store category and is not justified by its documented function.",
            "data_sources": [
              "MDM application inventory logs",
              "Mobile Threat Defense (MTD) scan results",
              "App store manifest data",
              "Android logcat permission grant logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application manifests, permission grant logs, and application inventory databases stored on managed mobile devices and aggregated by the MDM/UEM platform.",
            "action": [
              "Define and maintain a list of 'toxic' permission combinations (e.g., READ_CONTACTS, ACCESS_INTERNET, and INSTALL_PACKAGES together). Execute a daily query against the MDM application inventory to identify and alert on any installed application possessing one of these pre-defined toxic combinations.",
              "For each application category (e.g., 'Productivity', 'Games'), calculate the prevalence of every permission based on MDM inventory data across the entire device fleet. Assign a risk score to each app by summing the inverse prevalence of its granted permissions (rarer permissions receive higher scores). Flag the top 5% of apps with the highest risk scores in each category for manual review.",
              "Utilize a density-based clustering algorithm, such as DBSCAN, on the multi-hot encoded permission vectors for all managed applications. This will group applications with similar permission sets. Investigate any applications that are flagged as noise points (outliers) by the algorithm, as they represent unusual and potentially malicious permission profiles not seen in other applications."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]