[
  {
    "information_requirement": "Is an adversary transferring malicious tools or files onto our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1544",
        "name": "Ingress Tool Transfer",
        "evidence": [
          {
            "description": "A mobile application downloads an executable, script, or generic binary file from a domain not associated with the app's known function, a common Content Delivery Network (CDN), or the organization's infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, corporate Wi-Fi gateways, and cloud security proxies capturing mobile traffic.",
            "action": "Using Zeek logs, correlate `conn.log` sessions from mobile IP ranges with `files.log` entries. For each file transfer, analyze the file's MIME type and the source domain from `http.log`. Maintain an allow-list of domains for legitimate app updates and functions. Calculate the entropy of the requested URI and the file name; high entropy can be indicative of C2 activity. Flag any transfer of an executable/script MIME type (e.g., `application/octet-stream`, `application/x-executable`, `application/x-elf`) from a domain that is not on the allow-list, has a low reputation score, or was recently registered."
          },
          {
            "description": "A mobile application initiates a large data download that is statistically anomalous compared to its established baseline behavior, outside of a standard application update.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, corporate Wi-Fi gateways, and cloud security proxies capturing mobile traffic.",
            "action": "For each mobile device IP, aggregate `resp_bytes` from Zeek `conn.log` over 1-hour time windows to create a time series of download volume. Establish a baseline for each device using a 14-day moving average and standard deviation. Generate an alert when a device's download volume in a single hour exceeds a dynamic threshold, such as 3 standard deviations above its moving average, especially if the majority of the traffic is to a single, non-CDN IP address. This identifies significant, abnormal data ingress events that could represent a large tool transfer."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]