[
  {
    "information_requirement": "Is an adversary manipulating SMS messages on our mobile devices?",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1582",
        "name": "SMS Control",
        "evidence": [
          {
            "description": "An application not approved by the organization or known for legitimate SMS functionality is set as the default SMS handler on a managed device. Adversaries may set a malicious app as the default handler to intercept, modify, or delete messages by registering the SMS_DELIVER broadcast intent and writing to the SMS content provider [1][2].",
            "data_sources": [
              "MDM/MTD Device Configuration Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet",
            "action": "Periodically query all managed mobile devices via the MDM/MTD platform for the package name of the default SMS handler. Compare this against an allowlist of approved messaging applications (e.g., the native OS messenger, approved corporate messengers). Flag any device where the default handler is not on the allowlist for immediate investigation."
          },
          {
            "description": "A non-messaging application is granted `SEND_SMS` or `RECEIVE_SMS` permissions, especially if the app's primary function does not justify it (e.g., a calculator, flashlight, or game app). This allows the application to read incoming messages or send outgoing messages without user interaction [1].",
            "data_sources": [
              "MDM/MTD Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet",
            "action": "For all managed devices, ingest application inventory data from the MDM/MTD platform. For each application, analyze its granted permissions. Create a risk score based on unusual permission combinations. Specifically, flag any application that has `SEND_SMS` or `RECEIVE_SMS` permissions but is not categorized as a 'Communication' or 'Messaging' app. Calculate the prevalence of each app across the fleet; an app with dangerous permissions installed on only a few devices is a higher priority indicator."
          },
          {
            "description": "Outgoing SMS messages are sent to numbers that are not in the user's contacts or that match known C2 infrastructure patterns (e.g., premium-rate numbers, numbers in unusual country codes, or a high volume of short, encoded messages). This could indicate the device is being used for C2, data exfiltration, or to spread malware.",
            "data_sources": [
              "Telecommunication Billing Records",
              "Mobile VPN/Proxy Network Logs (e.g., Zeek conn.log for SMS over IP)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate mobile VPN concentrators and network egress points",
            "action": "Analyze carrier billing records and network logs from mobile traffic. Establish a baseline of typical SMS destination countries and number formats for each user. Use statistical analysis to flag outliers, such as messages to a country a user has never contacted before, or a sudden spike in SMS volume exceeding two standard deviations from the user's monthly average. Correlate outgoing SMS timestamps with application foreground activity from MDM logs; an SMS sent while no messaging app is in the foreground is highly suspicious."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]