[
  {
    "information_requirement": "Is an adversary manipulating SMS messages on our mobile devices? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1582",
        "name": "SMS Control",
        "evidence": [
          {
            "description": "An application not on an approved allowlist is set as the default SMS handler, or an application with a package name prevalence below the 1st percentile across the device fleet is set as the default handler. Adversaries may set a malicious app as the default handler to intercept, modify, or delete messages by registering for the SMS_DELIVER broadcast intent and writing to the device's SMS content provider [1][2].",
            "data_sources": [
              "MDM device_settings.log",
              "MDM app_inventory.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/MTD Management Console, Device Configuration Profiles, SIEM Log Repository",
            "action": "1. (Symbolic) Query MDM device setting logs for the `default_sms_handler` field. Compare the package name against a managed allowlist of approved messaging applications. Alert on any device where the default handler is not on the allowlist. 2. (Statistical) From MDM application inventory logs, calculate the fleet-wide prevalence of each application package name set as the `default_sms_handler`. Alert on any device using a handler whose package name prevalence falls below the 1st percentile, indicating a statistically rare application. 3. (Machine Learning) Train a binary classification model (e.g., Random Forest) on MDM application inventory data, using features like developer, app category, user ratings, and requested permissions to predict a `is_legitimate_sms_handler` label. Periodically score all active default SMS handlers in the fleet and alert on any application classified as 'not legitimate' with a confidence score greater than $$ 0.9 $$."
          },
          {
            "description": "An application is granted `android.permission.SEND_SMS` or `android.permission.RECEIVE_SMS` permissions, where the application's primary function (e.g., 'Games', 'Utilities') does not require SMS capabilities, or its combination of permissions is a statistical outlier compared to legitimate communication applications [1].",
            "data_sources": [
              "MDM app_permissions.log",
              "MDM app_inventory.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/MTD Management Console, Application Risk Database, SIEM Log Repository",
            "action": "1. (Symbolic) Query MDM logs to find all applications with `android.permission.SEND_SMS` or `android.permission.RECEIVE_SMS`. Cross-reference with application inventory data. Alert if the application's category is not on an allowlist (e.g., 'Communication', 'Messaging', 'Social'). 2. (Statistical) For each app with SMS permissions, generate a vector of all its requested permissions. Compare this vector to a baseline 'golden vector' of permissions typical for legitimate messaging apps using the Jaccard similarity index. Alert on any application with a similarity score below a threshold, for example, $$ J(A, B) < 0.4 $$. 3. (Machine Learning) For all applications in the fleet, vectorize their complete set of requested permissions. Apply a density-based clustering algorithm (e.g., DBSCAN) to identify outliers. Investigate applications that are marked as noise points or belong to small, sparse clusters, as they represent rare and potentially malicious permission combinations."
          },
          {
            "description": "A device sends an outgoing SMS message to a destination number on a threat intelligence watchlist, or the volume or destination of outgoing SMS messages deviates significantly from the user's established baseline. This may indicate C2, smishing-based malware propagation, or premium-rate SMS fraud.",
            "data_sources": [
              "Carrier SMS Detail Records",
              "Threat Intelligence Feed",
              "Zeek conn.log",
              "MDM Network Activity Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Mobile VPN Concentrators, Carrier Billing and Usage Portal, SIEM Log Storage, Threat Intelligence Platform",
            "action": "1. (Symbolic) Ingest a threat intelligence feed of known malicious phone numbers. Correlate the `destination_number` from Carrier SMS Detail Records against this feed in real-time. Generate a high-severity alert upon a match. 2. (Statistical) For each user, establish a 90-day rolling baseline of daily SMS volume and unique destination country codes from Carrier SMS Detail Records. Alert if the daily SMS count exceeds the 98th percentile of the user's historical data, or if an SMS is sent to a country code not seen in the user's past 90 days. 3. (Machine Learning) Train a per-user time-series anomaly detection model (e.g., LSTM autoencoder) on hourly SMS counts from Carrier Detail Records to learn normal communication patterns. Alert when the model's reconstruction error for a given hour exceeds a dynamically set threshold, indicating a statistically improbable deviation from the user's learned behavior. Enrich alerts with recent MDM logs showing new app installations or permission changes."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]