[
  {
    "information_requirement": "Is an adversary using a managed mobile device as a proxy to conceal C2 communications or other malicious activity, such as masquerading traffic to evade IP-based restrictions? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1604",
        "name": "Proxy Through Victim",
        "evidence": [
          {
            "description": "A managed mobile device transmits an anomalously large volume of outbound data over a specific time window (e.g., 1 hour, 24 hours) when compared to its own historical baseline or the baseline of a peer group. This high volume cannot be attributed to legitimate activities like system updates or cloud backups, suggesting its network resources are being used for an unauthorized purpose, such as proxying.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, VPN gateways, and network egress points monitoring traffic from mobile device subnets.",
            "action": [
              "From Zeek conn.log, create a rule to alert when the sum of `orig_bytes` from a single mobile device IP (`id.orig_h`) exceeds a static threshold (e.g., 5 GB in 1 hour). Exclude traffic to known-good destinations such as corporate backup servers or OS update CDNs to reduce false positives.",
              "For each mobile device, calculate the sum of outbound bytes (`orig_bytes`) from Zeek conn.log in 1-hour windows. Using a 30-day history, compute the moving average and standard deviation of this metric for the device and its defined peer group (e.g., 'Sales Team Mobiles'). Generate an alert if a device's outbound traffic exceeds 3 standard deviations from its own mean or surpasses the 99th percentile of its peer group's traffic volume.",
              "Develop a time-series anomaly detection model (e.g., SARIMA, Prophet) for each device using at least 90 days of historical hourly outbound data volume (`orig_bytes`). Continuously score live data against the model's forecast. Generate an alert for analyst review when the observed data volume significantly deviates from the model's prediction and falls outside the established confidence interval, and schedule regular model retraining to account for concept drift."
            ]
          },
          {
            "description": "A mobile device resolves and/or connects to an unusually high number of unique destination domains or IP addresses in a short time. The set of resolved domains may also exhibit high Shannon entropy, indicating a lack of discernible pattern characteristic of automated proxying activity rather than typical user-driven browsing.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, network firewalls, and web proxies that log DNS queries and outbound connections from mobile devices.",
            "action": [
              "From Zeek dns.log, monitor DNS queries originating from mobile device IPs (`id.orig_h`). Trigger an alert if a device queries a high number of unique domains (e.g., >100) within a 5-minute window that are not on a pre-defined allowlist of common corporate and popular domains. Prioritize alerts for domains that are newly observed across the enterprise.",
              "For each mobile device, calculate two metrics over a 1-hour window: 1) the count of unique second-level domains (SLDs) from the `query` field in Zeek dns.log, and 2) the Shannon entropy of that set of SLDs. Generate a high-confidence alert if a device's unique domain count exceeds the 98th percentile of its peer group AND its domain entropy score is more than 2 standard deviations above its own 30-day baseline.",
              "Train an Isolation Forest model using features aggregated per device over 1-hour windows. Source features from Zeek dns.log and conn.log, including: unique destination IP count, unique DNS query count, Shannon entropy of destination SLDs, ratio of failed to successful DNS queries (`rcode` != 'NOERROR'), and ratio of failed to successful TCP connections (`conn_state` != 'SF'). Flag devices that the model identifies as strong outliers for further analysis."
            ]
          },
          {
            "description": "A mobile device establishes outbound connections on destination ports commonly associated with proxy services (e.g., SOCKS on port 1080) or on ports that are inconsistent with the applications known to be installed on the device per its Mobile Device Management (MDM) profile.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/EMM Application Inventory",
              "Firewall Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow collectors at egress points, firewall logs, and MDM/EMM management platforms.",
            "action": [
              "Create a SIEM rule to monitor Zeek conn.log and firewall logs for any connection from the mobile device subnet (`id.orig_h`) to known proxy-related destination ports (e.g., 1080, 3128, 8080, 8888). Generate a high-priority alert, excluding traffic to approved internal services and correlating with MDM/EMM application inventory to verify legitimacy.",
              "For each device, establish a baseline profile of normal destination ports (`id.resp_p` in Zeek conn.log) used over a 30-day period. In a rolling 1-hour window, calculate the ratio of connections made to 'rare' ports (those not in the device's baseline) versus 'common' ports. Alert when this ratio exceeds the 95th percentile for the device's peer group, indicating a significant deviation in network service usage.",
              "Train a one-class SVM (Support Vector Machine) model for each device or device group on historical connection data, using features such as destination port, protocol, and connection duration. Use the trained model to classify new, live connections in real-time. Flag any connection classified as an anomaly, paying special attention to those involving ports or protocols not previously seen for that device's profile."
            ]
          },
          {
            "description": "A mobile device exhibits network behavior characteristic of a relay, such as an anomalously high number of concurrent outbound connections or individual connections that are maintained for exceptionally long durations, suggesting use as a persistent C2 relay or traffic tunnel.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow collectors (e.g., Zeek sensors) at key chokepoints like the Wi-Fi access controller or VPN concentrator.",
            "action": [
              "From Zeek conn.log, query for any single TCP connection from a mobile device (`id.orig_h`) with a `duration` exceeding a static threshold (e.g., 24 hours) and a `conn_state` of 'SF' (Established). Generate a high-priority alert for connections to destination IPs not on an allowlist of known corporate or major cloud services.",
              "In 5-minute intervals, calculate two metrics for each device from Zeek conn.log: a) the count of active outbound connections, and b) the average `duration` of connections that terminated within the interval. Use a multivariate outlier detection algorithm, such as Mahalanobis distance, to identify devices that are anomalous across both metrics simultaneously when compared to their own 30-day historical profile.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN) to the population of mobile devices, using features calculated over a 24-hour period from Zeek conn.log, such as 'average concurrent outbound connections,' '95th percentile of connection duration,' and 'total outbound bytes.' Devices classified as noise points by the algorithm represent significant behavioral outliers from all identified peer groups and should be prioritized for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]