[
  {
    "information_requirement": "Is an adversary using our managed mobile devices to proxy their malicious traffic, evading our network defenses? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1604",
        "name": "Proxy Through Victim",
        "evidence": [
          {
            "description": "A mobile device exhibits an unusually high data egress volume, inconsistent with typical user behavior. This could indicate the device is being used to relay large amounts of data for an adversary.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments and VPN termination points for mobile devices.",
            "action": "For each mobile device IP address, aggregate the total outbound bytes (orig_bytes) from Zeek conn.log over rolling 1-hour and 24-hour time windows. Establish a baseline for each user or device group using at least 30 days of historical data. Calculate the 95th and 99th percentiles for outbound data volume. Generate an alert when a device's traffic volume exceeds its historical 99th percentile, suggesting it may be acting as a data relay or proxy."
          },
          {
            "description": "A single mobile device initiates connections to an abnormally diverse and unrelated set of destination domains or IP addresses over a short period, which is not typical for user-driven browsing.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS resolvers used by mobile devices and network egress points.",
            "action": "For each mobile device IP, analyze Zeek dns.log to count the number of unique second-level domains (SLDs) queried over a 1-hour window. Concurrently, calculate the Shannon entropy of the queried domains for each device. Establish a baseline for the typical number of unique domains and the average entropy score for user devices. An alert should be triggered for devices exhibiting a statistically significant increase (e.g., >3 standard deviations from the mean) in either the unique domain count or the entropy score, indicating the device may be proxying requests to a wide array of adversary-controlled or targeted destinations."
          },
          {
            "description": "Network traffic from a mobile device utilizes protocols or destination ports that do not correspond to any known or approved applications installed on the device, as documented by a Mobile Device Management (MDM) solution. This is highly indicative of a malicious process, such as a SOCKS proxy, opening arbitrary connections.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/EMM Application Inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM management platform and network egress points.",
            "action": "Correlate network connection data from Zeek conn.log with application inventory data from the MDM platform. For each mobile device, create a profile of expected destination ports based on its installed applications (e.g., port 443 for browsers, specific high ports for games). Use descriptive statistics to identify connections to ports that are anomalous for that device's application profile. Flag any device initiating a significant number of connections on ports associated with proxying services like SOCKS (1080) or other non-standard application protocols when no legitimate client is installed."
          },
          {
            "description": "A mobile device maintains an unusually high number of concurrent, long-duration outbound TCP connections. A proxy server often keeps connections open to relay traffic, a pattern distinct from the typically short-lived connections of mobile apps.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network core switches and firewalls monitoring mobile device subnets.",
            "action": "From Zeek conn.log, filter for active TCP connections (conn_state 'SF', 'RSTO', 'RSTR', etc.) originating from mobile device IP ranges. For each device, calculate the average connection duration and the total number of concurrent connections in 5-minute intervals. Baseline these metrics for all devices. Identify outliers where a device's average connection duration and concurrent connection count both exceed two standard deviations above the population mean, suggesting it is maintaining persistent channels for proxying traffic."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]