[
  {
    "information_requirement": "Is an adversary disrupting our communications by blocking or redirecting legitimate phone calls?",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1616",
        "name": "Call Control",
        "evidence": [
          {
            "description": "An application is granted permissions associated with call control (`ANSWER_PHONE_CALLS`, `PROCESS_OUTGOING_CALLS`) that are not consistent with its stated function.",
            "data_sources": [
              "MDM application inventory logs",
              "Android Logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices",
            "action": "Continuously audit applications on managed devices for high-risk permissions related to call control (`ANSWER_PHONE_CALLS`, `PROCESS_OUTGOING_CALLS`). Create a baseline of expected permissions for common enterprise applications. For each app, calculate a permission risk score based on the rarity and danger level of its requested permissions. Use statistical analysis (e.g., Z-score) to flag applications with anomalously high permission scores compared to their category baseline (e.g., a file manager app requesting `PROCESS_OUTGOING_CALLS`)."
          },
          {
            "description": "Outgoing calls are programmatically aborted or redirected, or incoming calls are blocked without user interaction.",
            "data_sources": [
              "Android Logcat",
              "iOS CallKit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices",
            "action": "Analyze device-level logs (Android Logcat, iOS CallKit) for events indicating call redirection or termination (e.g., `ACTION_NEW_OUTGOING_CALL` broadcasts on Android followed by an abort). Establish a baseline for normal call termination rates and reasons. Use time-series analysis to detect spikes in aborted or blocked calls across the device fleet that correlate with a specific application's activity or update."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary performing audio surveillance by programmatically answering or initiating calls?",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1616",
        "name": "Call Control",
        "evidence": [
          {
            "description": "An application possesses a suspicious combination of permissions, such as call control (`CALL_PHONE`, `ANSWER_PHONE_CALLS`), microphone access (`RECORD_AUDIO`), and the ability to hide its activity (`WRITE_CALL_LOG`).",
            "data_sources": [
              "MDM application inventory logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM server",
            "action": "For all applications on managed devices, create a feature set including all granted permissions. Use a rule-based system to flag any application that possesses a suspicious combination of permissions, such as `CALL_PHONE`, `RECORD_AUDIO`, and `WRITE_CALL_LOG`. Prioritize investigation of apps that have this combination but are not a known dialer or unified communications app."
          },
          {
            "description": "The device's call log shows calls made or received at unusual times or to/from unknown numbers, which may be subsequently deleted from the log by the malware.",
            "data_sources": [
              "Carrier Call Detail Records (CDRs)",
              "Device Call Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Telecom provider data feeds",
            "action": "Correlate device-level call logs with carrier-provided Call Detail Records (CDRs). Use a join operation on timestamp and phone number to identify calls present in CDRs but missing from the device's user-visible call log. Calculate the entropy of the phone numbers contacted by each device; a sudden increase in entropy or calls to numbers in a 'low-reputation' block could indicate malicious activity. Monitor for calls with a duration of zero or very short duration, which could indicate automated 'check-in' calls."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary using phone calls as a C2 channel?",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1616",
        "name": "Call Control",
        "evidence": [
          {
            "description": "A non-dialer application makes frequent, short-duration outgoing calls to a specific number or set of numbers.",
            "data_sources": [
              "Carrier Call Detail Records (CDRs)",
              "Android Logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Telecom provider data feeds",
            "action": "From carrier CDRs, group calls by device and destination number. For each device, analyze the distribution of call durations. Use descriptive statistics (e.g., 95th percentile) to identify devices making an unusually high number of calls below a certain threshold (e.g., < 5 seconds), which is anomalous for human behavior. Calculate the frequency of calls to specific numbers; a high frequency of short calls to the same number is a strong indicator of C2."
          },
          {
            "description": "Network traffic (e.g., DNS requests, HTTP traffic) occurs immediately following a short, automated phone call, suggesting the call was a trigger mechanism.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Carrier Call Detail Records (CDRs)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points",
            "action": "Correlate timestamps between Carrier CDRs and network logs (Zeek). For each short-duration outgoing call identified in the CDRs, search for any network connections (Zeek conn.log) or DNS queries (Zeek dns.log) originating from the device's IP address within a short time window (e.g., 1-5 seconds) after the call ends. A consistent pattern of 'call -> beacon' across multiple devices is a strong signal of a C2 channel using phone calls as a wake-up trigger."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]