[
  {
    "information_requirement": "Is the adversary using geofencing to evade detection or analysis on our mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1627.001",
        "name": "Geofencing",
        "evidence": [
          {
            "description": "A mobile application possesses location permissions (e.g., ACCESS_FINE_LOCATION, ACCESS_BACKGROUND_LOCATION on Android; WhenInUse/AlwaysAuthorization on iOS) that are not justified by the application's stated purpose or functionality.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Mobile Application Vetting Reports"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices and the associated Mobile Device Management (MDM) platform.",
            "action": "Continuously ingest application inventory data from the MDM platform for all managed devices. For each application, cross-reference its requested permissions (specifically location-related) with its category and description from the app store or internal documentation. Maintain a whitelist of applications where location access is justified (e.g., mapping apps, ride-sharing). Use a rule-based system to flag any application that requests `ACCESS_BACKGROUND_LOCATION` or `requestAlwaysAuthorization()` without a clear business justification. Calculate the percentage of non-whitelisted apps requesting location data to identify trends and prioritize investigation."
          },
          {
            "description": "A mobile application makes API calls related to geofencing or exfiltrates location data without a clear, user-facing feature that requires it.",
            "data_sources": [
              "Mobile Application Vetting Reports",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application Vetting Sandbox and network egress points for mobile device traffic (e.g., corporate Wi-Fi, VPN gateway).",
            "action": "During pre-deployment application vetting, perform static analysis on the application package (APK/IPA) to identify calls to geofencing APIs (e.g., Android GeofencingClient, iOS CLLocationManager region monitoring). Perform dynamic analysis in a sandboxed environment, manipulating the device's reported GPS coordinates to trigger geofencing logic. Correlate the activation of these geofencing functions with network traffic analysis (using Zeek conn.log and dns.log from the sandbox) to detect if the logic triggers or halts data exfiltration to specific domains. Calculate the entropy of DNS requests made by the application; a sudden drop or change in requested domains after a location change may indicate evasive geofencing logic. Flag applications that contain latent or undocumented geofencing capabilities."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]