[
  {
    "information_requirement": "Is an adversary maintaining persistence on mobile devices by abusing broadcast receivers? (TA0028 - Persistence)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1624.001",
        "name": "Broadcast Receivers",
        "evidence": [
          {
            "description": "An application's manifest (AndroidManifest.xml) statically declares a broadcast receiver for a high-risk system event, such as 'android.intent.action.BOOT_COMPLETED' or 'android.provider.Telephony.SMS_RECEIVED', allowing the app to execute code upon device startup or receipt of an SMS.",
            "data_sources": [
              "Application manifest files (AndroidManifest.xml) from APKs",
              "Mobile Device Management (MDM) logs reporting application manifests"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices, Internal application stores, Application vetting systems",
            "action": "Scan the manifests of all applications installed on managed devices to extract registered broadcast receivers. Create a watchlist of sensitive intents (e.g., 'BOOT_COMPLETED', 'SMS_RECEIVED', 'NEW_OUTGOING_CALL'). Flag applications that register for these intents and correlate with the app's requested permissions. An application registering for 'BOOT_COMPLETED' that is not a core utility or productivity app should be considered high-risk. Use descriptive statistics to identify outlier applications that register for an unusually high number of sensitive receivers compared to a baseline of all managed apps."
          },
          {
            "description": "An application dynamically registers a broadcast receiver at runtime for an event that is unusual for its stated functionality, particularly on devices running Android 8 (API 26) or newer where manifest-declared receivers are restricted.",
            "data_sources": [
              "Mobile Endpoint Detection and Response (EDR) agent logs",
              "Dynamic application analysis sandbox logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices with EDR agents installed, Dynamic application analysis sandbox environment",
            "action": "Using a mobile EDR agent or sandbox, monitor for API calls to 'registerReceiver()'. For each call, log the parent application process and the specific intent filter being registered. Establish a baseline of normal 'registerReceiver' activity for sanctioned corporate applications. Generate an alert when a non-standard application registers a receiver for an event outside its expected functional scope (e.g., a calculator app monitoring for new outgoing calls)."
          },
          {
            "description": "An application that has registered a broadcast receiver also requests a suspicious combination of permissions that could be used maliciously when the broadcast is received, such as reading contacts and sending SMS messages.",
            "data_sources": [
              "MDM logs detailing application permissions",
              "Application manifest files (AndroidManifest.xml)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices, Application vetting systems",
            "action": "For every application identified with a registered broadcast receiver, perform a co-occurrence analysis of its requested permissions. Develop a scoring model where high-risk combinations (e.g., 'RECEIVE_SMS' + 'SEND_SMS' + 'INTERNET') receive a high score. Calculate the entropy of permissions for apps sharing the same receiver; a low entropy may indicate a very specialized, potentially malicious, function. Flag applications with risk scores exceeding the 95th percentile for manual review."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]