[
  {
    "information_requirement": "Is an adversary executing commands or scripts on our managed mobile endpoints? (PIR)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1623.001",
        "name": "Unix Shell",
        "evidence": [
          {
            "description": "An MTD agent observes a mobile application invoking a Java method for shell execution (`java.lang.Runtime.exec()` or `java.lang.ProcessBuilder`). This event is considered evidence if: (a) the calling application is not on a pre-defined 'shell execution allowlist', or (b) the command arguments are anomalous, characterized by high Shannon entropy ($$ > 4.5 $$), presence of keywords associated with reconnaissance or execution (e.g., `id`, `uname`, `pm install`), or arguments that are statistically rare for the calling application.",
            "data_sources": [
              "MDM/MTD API Call Log",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android and iOS device fleet (source of MTD API call telemetry); Centralized log management platform (for MDM/MTD logs); Network egress points including VPN concentrators and Wi-Fi access points (source of Zeek logs).",
            "action": [
              "Create a detection rule that triggers a high-severity alert when an `MDM/MTD API Call Log` records a call to `java.lang.Runtime.exec()` or `java.lang.ProcessBuilder` and either condition is met: (a) the source application's package name is not on a managed allowlist of apps permitted to execute shell commands; or (b) the command argument string matches a watchlist of suspicious keywords, including `su`, `pm install`, `am start`, `reboot`, `chmod`, `wget`, `curl`, `base64`, or patterns indicative of reverse shells (e.g., `sh -i`).",
              "For each application, baseline its shell execution behavior over a 30-day window. Generate a medium-severity alert if: (a) the frequency of shell executions by an app on a single device exceeds the 99th percentile for that app across the fleet; (b) the Shannon entropy of the command string exceeds a dynamic threshold (e.g., 3 standard deviations above the mean entropy for that app) or a static threshold of $$ 4.5 $$ for high randomness; or (c) the command string itself is novel, having a Jaccard similarity index below $$ 0.2 $$ when compared to the set of known-good commands for that application.",
              "For devices triggering a shell execution alert, correlate the event with network telemetry. Train a time-series anomaly detection model (e.g., LSTM Autoencoder) on per-minute network flow features for each device (e.g., `sum(orig_bytes)`, `sum(resp_bytes)`, `count(distinct id.resp_h)`, `count(connections)` from `Zeek conn.log`). A shell execution event followed within a 5-minute window by a network anomaly (reconstruction error > 3 standard deviations from the mean) should generate a correlated, critical-severity alert. This alert should be enriched with the destination IP's reputation and ASN information and trigger an automated workflow to isolate the device from the network pending investigation."
            ]
          },
          {
            "description": "An MTD agent logs the creation of a shell process (e.g., `sh`, `bash`) where the parent process is a mobile application. This is considered evidence if: (a) the parent application is on a deny-list of apps forbidden from spawning shells (e.g., third-party social media or productivity apps); or (b) the specific parent-child process pair is statistically rare, occurring on less than 1% of devices where the parent app is installed over a 90-day observation period.",
            "data_sources": [
              "MDM/MTD Process Event Log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android and iOS device fleet (source of MTD process event telemetry); Centralized log management platform (for MDM/MTD logs); Corporate DNS resolvers and network egress points (source of Zeek logs).",
            "action": [
              "Deploy a SIEM rule that generates a critical alert when an `MDM/MTD Process Event Log` records a shell process (`sh`, `bash`) spawned by a parent application on a 'no-shell' deny-list (e.g., apps from untrusted sources, social media, games). The alert workflow must automatically enrich the event with: (a) device owner information from the MDM; and (b) threat intelligence data for any IP address or domain name found in the process command-line arguments.",
              "For each parent application, profile its child processes across the fleet over a 90-day baseline. Generate a medium-severity alert when a parent-child relationship is observed that has not been seen before. Escalate the alert severity to high if this novel pairing is present on fewer than 0.5% of the devices running the parent app. Additionally, for known parent-shell pairings, flag any process whose command-line arguments have a length exceeding the 98th percentile for that pair, or whose arguments contain tokens not present in a pre-computed dictionary of legitimate arguments.",
              "Develop and deploy a supervised classification model (e.g., Random Forest) to score each process creation event as benign, suspicious, or malicious. Train the model on labeled data using features such as: parent process package name, child process name, command-line argument entropy, command-line length, parent-child prevalence score (from statistical analysis), time of day, a boolean for `is_parent_system_app`, and a boolean for `has_network_indicator_in_args`. An event classified as malicious with a confidence score $$ p > 0.9 $$ should generate a high-severity alert for immediate investigation. Analyst feedback on alert validity should be captured to periodically retrain and improve the model."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]