[
  {
    "information_requirement": "Is an adversary abusing elevation control mechanisms to escalate privileges on managed mobile devices? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1626",
        "name": "Abuse Elevation Control Mechanism",
        "evidence": [
          {
            "description": "A device administrator privilege grant event is observed for a mobile application where the app's package ID is either absent from a corporate allowlist or the application's installation prevalence is in the bottom 5th percentile across all managed devices.",
            "data_sources": [
              "MDM Device Administrator Event Log",
              "MDM Application Inventory Report",
              "Corporate App Store Metadata"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized MDM/EMM log platform, Corporate Application Store database, and the population of managed mobile devices.",
            "action": [
              "Create a SIEM rule that triggers on any 'Device Administrator Granted' event from MDM logs. The rule logic must extract the application's package ID and perform a real-time lookup against a maintained allowlist of approved administrative apps. Generate a high-severity alert if the package ID is not found.",
              "Develop a scheduled query that runs daily to calculate the installation count for every application across the mobile device fleet, storing the results in a prevalence lookup table. For each 'Device Administrator Granted' event, enrich the event with the application's prevalence score. Trigger a medium-severity alert if the prevalence score is below the 5th percentile, indicating statistical rarity.",
              "Train a logistic regression model to predict the likelihood of a privilege grant being malicious. Use features such as: application prevalence score, application age (days since first seen), number of requested permissions, reputation of the signing certificate, and whether the app was installed from the official corporate app store. Deploy the model to score all new grant events in real-time. Automatically create a high-priority incident ticket for an analyst to investigate any event with a predicted malicious probability score above 0.85."
            ]
          },
          {
            "description": "Within a 5-minute window after a device administrator privilege grant, the associated device's network traffic matches a known malicious indicator (IP/domain), or exhibits statistical anomalies such as high-entropy DNS queries or data transfer volumes exceeding the 99th percentile of the device's baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM Device Administrator Event Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs or switch SPAN ports feeding Zeek sensors at the network egress, centralized DNS server logs, and the centralized MDM/EMM log platform.",
            "action": [
              "Implement a correlation search in the SIEM that joins 'Device Administrator Granted' events from MDM logs with network logs (Zeek conn.log, Zeek dns.log) on the device's source IP address within a 5-minute trailing window. The search must compare the destination IP (`id.resp_h`) and DNS query (`query`) fields against a threat intelligence feed of known malicious indicators. Generate a critical alert containing both the privilege event and the matched IOC upon a match.",
              "For the 5-minute period following a grant event, use a SIEM query to calculate the Shannon entropy for all unique DNS queries made by the device (from Zeek dns.log). Alert if the average entropy score exceeds 4.5, suggesting potential DGA activity. Concurrently, calculate the sum of outbound bytes (`resp_bytes` from Zeek conn.log) and alert if this sum exceeds the 99th percentile of the device's own 30-day historical baseline for a 5-minute window.",
              "For each managed mobile device, build a baseline of normal network behavior using an LSTM autoencoder trained on time-series data of key metrics (e.g., bytes out, connection count, DNS query rate per minute from Zeek logs). After a 'Device Administrator Granted' event, feed the device's network telemetry for the next 10 minutes into its corresponding trained model. If the model's reconstruction error surpasses a dynamically tuned threshold (e.g., 3 standard deviations above the mean reconstruction error), flag the event as a high-confidence anomaly indicative of post-escalation C2 activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]