[
  {
    "information_requirement": "Is an adversary using execution guardrails to evade detection and ensure payload execution only on targeted mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1627",
        "name": "Execution Guardrails",
        "evidence": [
          {
            "description": "An application requests permissions that are not justified by its stated functionality, particularly those related to device environment (e.g., location, network state, phone identity), and makes API calls to check these values early in its execution flow before any overt malicious activity.",
            "data_sources": [
              "Mobile Application Manifest Files (e.g., AndroidManifest.xml)",
              "Mobile Threat Defense (MTD) logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices and application vetting/sandbox environments.",
            "action": "For all new or updated applications, parse manifest files to extract requested permissions. Establish a baseline of normal permissions for common application categories (e.g., productivity, communication). Use a statistical model to flag applications with anomalous permission sets, such as a utility app requesting ACCESS_FINE_LOCATION. Calculate an entropy score for the permission set of each app; a high score, indicating an unusual combination of rare permissions, should trigger a high-priority alert for manual review."
          },
          {
            "description": "An application remains dormant during dynamic analysis in a sandbox but initiates malicious network activity or behavior when a specific environmental condition is met (e.g., device is within a specific geographic area, connected to a non-corporate Wi-Fi network, or a specific SIM card is present).",
            "data_sources": [
              "Zeek conn.log",
              "Dynamic analysis logs from a mobile sandbox"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile device network segments and dedicated mobile security analysis sandboxes.",
            "action": "In a sandbox environment, execute the application while systematically altering environmental parameters (e.g., GPS coordinates, network information, SIM details). Monitor for behavioral changes by correlating device state logs with network logs (Zeek conn.log). Establish a baseline of the application's network activity in a default environment. A sudden deviation from this baseline, such as new connections to previously unobserved IP addresses or a significant increase in data egress volume that occurs immediately after an environmental variable is changed, indicates a likely guardrail trigger."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]