[
  {
    "information_requirement": "Is an adversary attempting to evade user detection on corporate-managed mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628.002",
        "name": "User Evasion",
        "evidence": [
          {
            "description": "An application not on a pre-defined 'motion-access allowlist' (e.g., 'Fitness', 'AR/VR') accesses the device's motion sensors (accelerometer, gyroscope). This sensor access is immediately followed by the cessation of previously observed periodic network beaconing. The suspicious pattern consists of: 1) C2-like network traffic (low-byte, regular intervals, low destination entropy) from the app while the device is at rest, followed by 2) an MTD event indicating motion sensor access and device movement, and 3) a greater than 95% reduction in the app's network connections for at least 5 minutes following the start of motion.",
            "data_sources": [
              "Mobile Threat Defense (MTD) sensor access logs",
              "Mobile Device Management (MDM) application inventory logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints: Corporate-managed mobile devices with MTD/MDM agents. Network: Network taps at corporate Wi-Fi access points, VPN egress points, and internet gateways where Zeek sensors are deployed. Infrastructure: MDM servers and DNS servers. Analytics Platform: SIEM or data lake where MTD, MDM, and Zeek logs are aggregated for correlation.",
            "action": [
              "Create a stateful SIEM correlation rule that triggers on an MTD event for accelerometer or gyroscope access from an application not on the motion-access allowlist. The rule should then query Zeek conn.log for that device's activity in the 10 minutes prior to the event. If the query finds periodic, low-volume connections characteristic of C2 beaconing, and a subsequent query shows this traffic has ceased for at least 5 minutes after the motion event, generate a high-severity alert for potential user evasion.",
              "For each application not on the motion-access allowlist, continuously calculate a rolling 24-hour Pearson correlation coefficient ('r') between two time series: 1) a binary series from MTD logs indicating motion (1 for motion, 0 for at rest), and 2) a series of the application's network connection count per minute from Zeek conn.log. Generate a medium-severity alert if the correlation is strongly negative (e.g., $$ r < -0.8 $$), which indicates network activity consistently stops when the user is active. Elevate the risk score if the network traffic during 'at rest' periods exhibits low Shannon entropy of destination IP addresses, a common C2 trait.",
              "For each non-allowlisted application, train a multi-class classifier (e.g., Random Forest) to predict the device's motion state ('at rest' vs. 'in motion') using only the application's network traffic features from Zeek logs (e.g., `connection_rate`, `byte_rate`, `protocol_mix`). A model that achieves high predictive accuracy (e.g., >85%) is anomalous, as an app's network behavior should not normally correlate strongly with device motion. Flag any application whose model demonstrates such high accuracy as highly suspicious of implementing user evasion logic."
            ]
          },
          {
            "description": "An application not categorized for communication or system functions accesses the proximity sensor, and this access coincides with a change in network behavior. The evidence is observed when: 1) MTD logs show the proximity sensor state changes to 'covered' for over 60 seconds. 2) During this 'covered' state, Zeek logs show the application's network data transfer volume exceeds the 95th percentile of its own historical background usage. 3) The anomalous network activity ceases within 10 seconds of the MTD log showing the proximity sensor state has changed back to 'uncovered'.",
            "data_sources": [
              "Mobile Threat Defense (MTD) sensor access logs",
              "Mobile Device Management (MDM) application inventory logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints: Corporate-managed mobile devices with MTD/MDM agents. Network: Network taps at corporate Wi-Fi access points, VPN egress points, and internet gateways where Zeek sensors are deployed. Infrastructure: MDM servers and DNS servers. Analytics Platform: SIEM or data lake where MTD, MDM, and Zeek logs are aggregated for correlation.",
            "action": [
              "Define an allowlist of applications permitted to access the proximity sensor (e.g., 'Phone', 'Skype'). Create a SIEM rule that triggers when an application *not* on this list accesses the proximity sensor and the MTD log state is 'covered'. If, during this 'covered' state, the application's outbound data volume in Zeek conn.log exceeds a dynamic threshold (e.g., 5 times its 30-day baseline for background traffic), generate a medium-severity alert. Escalate the alert to high-severity if the anomalous traffic ceases within 10 seconds of the MTD log state changing to 'uncovered'.",
              "For each application, establish a statistical baseline (mean and standard deviation) of its network data transfer rate (bytes per minute) from Zeek conn.log during 'uncovered' proximity sensor states. Continuously monitor for periods when the sensor is 'covered'. For each 5-minute interval in a 'covered' state, calculate the Z-score of the data transfer rate against the 'uncovered' baseline distribution. Generate an alert if the Z-score persistently exceeds a threshold (e.g., $$ Z > 3 $$ for more than two consecutive intervals), indicating an abnormal increase in network activity specifically when the device screen is likely obscured.",
              "Train a binary logistic regression classifier to predict the proximity sensor's state ('covered' or 'uncovered') using only network features from Zeek logs as input. Use features such as `connection_rate`, `dns_query_rate`, `total_bytes_out`, `avg_flow_duration`, and `entropy_of_destination_ports`. Train the model using ground truth labels from MTD sensor logs. After deployment, if the model predicts the state is 'covered' with high probability (e.g., >0.9) based on a surge in network traffic, but the actual MTD log reports the sensor is 'uncovered', this logical contradiction indicates the application's network behavior is abnormal and potentially evasive. Generate a high-confidence alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]