[
  {
    "information_requirement": "Is an adversary attempting to evade defenses by locking users out of their mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629.002",
        "name": "Device Lockout",
        "evidence": [
          {
            "description": "A non-standard or recently installed application is granted device administrator privileges, especially if it is not from a trusted developer or the official app store.",
            "data_sources": [
              "Mobile Device Management (MDM) Logs",
              "Android Logcat",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices",
            "action": "Monitor MDM logs for all 'add-device-admin' events. Establish a baseline of legitimate applications that require these privileges within the organization (e.g., corporate security tools, email clients). Create a statistical model to score the risk of a new admin grant based on factors like application age, installation source, and number of installs across the enterprise. Alert when a new application is granted admin privileges and deviates significantly from the established baseline, especially if it's a low-prevalence application."
          },
          {
            "description": "An application known to use device lockout capabilities makes network connections to suspicious or known-malicious command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile EDR/MDR Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Our organization's internet gateway",
            "action": "Ingest a threat intelligence feed of known mobile malware C2 domains and IPs. For devices running applications with device administrator or overlay permissions, continuously monitor their outbound network traffic (Zeek conn.log, dns.log). Correlate destination IPs and domains against the threat feed. Use descriptive statistics to identify connections to domains with low prevalence (rarely visited across the organization) or high entropy scores in the domain name, which could indicate the use of a Domain Generation Algorithm (DGA). A match or high-risk connection from a sensitive app should trigger an immediate alert."
          },
          {
            "description": "A mobile application requests permissions to draw over other applications (`SYSTEM_ALERT_WINDOW`) and then generates persistent, non-dismissible screen overlays.",
            "data_sources": [
              "Mobile Application Vetting Scans",
              "Mobile EDR/MDR Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application sandboxing environments",
            "action": "During application vetting, statically and dynamically analyze APKs to identify the request and use of the `SYSTEM_ALERT_WINDOW` permission. On endpoints, use mobile EDR to monitor for applications that are persistently in the foreground or have an activity that is drawing over other apps. Establish a baseline for legitimate apps that use this feature (e.g., chat heads, screen recorders). Alert when a non-whitelisted app uses this capability, especially if it coincides with a loss of user control over the device UI."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]