[
  {
    "information_requirement": "Is an adversary hiding artifacts on managed mobile devices to evade detection?",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628",
        "name": "Hide Artifacts",
        "evidence": [
          {
            "description": "An application package installed on a mobile device, as reported by MDM/UEM inventory logs, possesses a manifest flag indicating it has no launcher icon. This package is not present on the pre-approved corporate whitelist of applications known to operate without a user-facing icon.",
            "data_sources": [
              "MDM/UEM Application Inventory Log",
              "Corporate Application Whitelist Database",
              "Threat Intelligence Platform (TIP) Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM management console and underlying database; The population of managed corporate-owned and BYOD mobile devices.",
            "action": [
              "Query MDM/UEM inventory logs for all application packages where the 'has_launcher_icon' attribute is 'false'. Cross-reference the resulting package names against the internal application whitelist. For any non-whitelisted package, query its hash (e.g., SHA256) against the threat intelligence platform. Generate a high-severity alert for any match found.",
              "For all non-whitelisted, iconless applications, calculate the fleet-wide installation prevalence. Flag applications with a prevalence below the 5th percentile as rare and potentially suspicious. Separately, for each device, count the total number of non-whitelisted, iconless applications and flag any device with a count exceeding the 98th percentile for the entire device fleet. Finally, compute the Shannon entropy of declared permissions for each iconless app; flag apps where this entropy score is more than 2 standard deviations above the mean entropy of whitelisted applications.",
              "Develop a Random Forest or Gradient Boosting classifier to predict the likelihood of an iconless application being malicious. Feature engineering should include: fleet-wide prevalence, a binary flag for installation from an unofficial app store, the count and entropy of requested permissions, and binary flags for specific high-risk permissions. Train the model on a labeled dataset from historical analysis and threat intelligence. In production, score all new non-whitelisted, iconless applications. An application with a predicted malicious probability score exceeding a tuned threshold, such as $$ > 0.85 $$, should trigger an automated workflow to quarantine the app and generate a medium-severity alert for analyst investigation."
            ]
          },
          {
            "description": "A running process, identified by a Mobile Threat Protection (MTP) agent, does not correspond to any application package listed in the MDM/UEM's inventory for that same device. This indicates a process is running from a source that is not a formally installed application.",
            "data_sources": [
              "Mobile Threat Protection (MTP) Process Execution Log",
              "MDM/UEM Application Inventory Log",
              "Threat Intelligence Platform (TIP) Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Threat Protection (MTP) platform console; MDM/UEM management console; Endpoint file systems and process tables on managed mobile devices.",
            "action": [
              "On a per-device basis, retrieve the list of running processes from the MTP agent. For each process, attempt to map it to an installed application package from the MDM inventory log using the package name or associated file path. Flag any process that has no corresponding installed application package. Cross-reference the unmapped process name or associated file hashes against a threat intelligence feed for known malware.",
              "Periodically baseline the set of running processes that do not map to an installed application on a 'golden image' or a set of known-good devices. For all other devices, calculate the Jaccard similarity between their set of unmapped processes and the baseline set. A device with a Jaccard similarity score below a statistically determined threshold, such as $$ < 0.5 $$, indicates significant deviation and potential compromise.",
              "Implement a time-series anomaly detection model, such as an LSTM Autoencoder, on MTP process data. For each device, create a time series of the count of unmapped processes over time (e.g., hourly). Train the model on historical data from the device fleet to learn normal patterns of transient or background processes. An alert is generated when the model's reconstruction error for a given device's time series exceeds a dynamic threshold, indicating an abnormal and sustained presence of unmapped processes."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]