[
  {
    "information_requirement": "Is an adversary attempting to evade our mobile security controls by disabling or modifying security tools? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629.003",
        "name": "Disable or Modify Tools",
        "evidence": [
          {
            "description": "A mobile device reports a change in the list of active device administrators, specifically the removal of a corporate security application or the addition of an unauthorized one.",
            "data_sources": [
              "MDM Device Compliance Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile device fleet",
            "action": "Continuously monitor MDM Device Compliance Logs for events indicating a change in device administrator status. Create an allow-list of expected device administrators for standard device profiles. Generate a high-priority alert when a security application (e.g., MTD agent) is removed from the device administrator list or when an unknown application is added. Correlate this change with other device activity, such as the installation of a new application within the last 24 hours, to increase confidence."
          },
          {
            "description": "A mobile device with a known Mobile Threat Defense (MTD) tool installed suddenly stops reporting telemetry or health status, or its management console reports the agent as 'disabled'.",
            "data_sources": [
              "MTD Agent Health Status Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile device fleet",
            "action": "Ingest MTD Agent Health Status Logs into a central monitoring system. For each managed device, establish a baseline heartbeat interval (e.g., every 15 minutes). Use a time-series analysis to detect devices that have stopped sending heartbeats for a period exceeding a defined threshold (e.g., 3 times the normal interval). Calculate the percentage of the fleet that is 'silent' over rolling time windows; a sudden spike in this percentage could indicate a widespread campaign. Cross-reference silent devices against MDM logs to differentiate between a user-initiated unenrollment and a more suspicious silent failure."
          },
          {
            "description": "A mobile device reports a change in its SELinux policy state from 'enforcing' to 'permissive', indicating a core security control has been weakened.",
            "data_sources": [
              "MDM Device Compliance Log",
              "MTD Agent Security Posture Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile device fleet",
            "action": "Configure MDM/MTD policies to periodically query and log the SELinux status ('getenforce' command output on Android) of all managed devices. Establish a baseline where 100% of devices report 'Enforcing'. Create a high-severity alert for any device that reports a status of 'Permissive' or 'Disabled'. Investigate these alerts immediately as this change typically requires elevated (root) privileges and is a strong indicator of a compromised device."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]