[
  {
    "information_requirement": "Is an adversary abusing elevation control mechanisms to escalate privileges on mobile devices? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1626",
        "name": "Abuse Elevation Control Mechanism",
        "evidence": [
          {
            "description": "An application not typically associated with administrative functions is granted administrator/root privileges on a mobile device.",
            "data_sources": [
              "Mobile OS System Logs (e.g., Android Logcat)",
              "MDM/EMM Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet, Mobile Device Management (MDM) platform",
            "action": "Establish and maintain a baseline of applications that legitimately require administrator privileges (e.g., MDM client, enterprise security tools). Monitor MDM/EMM logs for all administrator privilege grant events. Generate an alert when an application not on the established baseline is granted these privileges. Calculate the prevalence of applications requesting admin rights across the fleet; an application with a very low installation count (e.g., bottom 5th percentile) making such a request should be considered highly suspicious and prioritized for investigation."
          },
          {
            "description": "A mobile device exhibits anomalous network behavior immediately following a user-approved elevation of application privileges.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM/EMM Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network gateways monitoring mobile device traffic, MDM/EMM platform",
            "action": "Correlate the timestamp of an administrator privilege grant event from MDM/EMM logs with network logs from the associated device IP address. Within a 5-minute window following the grant, search for new connections to known malicious IPs/domains, connections to domains with low reputation scores, or a sudden increase in high-entropy DNS queries (potential DGA). Establish a baseline of the device's typical network traffic volume and protocol mix; alert if the post-privilege-grant traffic deviates by more than three standard deviations from this baseline."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]