[
  {
    "information_requirement": "Has an adversary illegitimately gained Device Administrator permissions on a corporate mobile device? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1626.001",
        "name": "Device Administrator Permissions",
        "evidence": [
          {
            "description": "An application's AndroidManifest.xml file contains the `BIND_DEVICE_ADMIN` permission, especially if the application is not a known, legitimate Mobile Device Management (MDM) or security tool.",
            "data_sources": [
              "Application Package (APK) Manifest File"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate application repository / Mobile Application Management (MAM) platform",
            "action": "Automate static analysis of all new and updated applications provisioned to corporate devices. Create a whitelist of legitimate applications known to require Device Administrator permissions (e.g., official MDM client, security software). Flag any application outside this whitelist that requests `BIND_DEVICE_ADMIN`. Calculate the entropy of the application's package name and signing certificate details; unusually high entropy or a mismatch with known developer profiles can increase the risk score of the flagged application."
          },
          {
            "description": "A non-standard or newly installed application is added to the list of active Device Administrators on a user's device, particularly if the addition occurs outside of a managed provisioning process or at an unusual time.",
            "data_sources": [
              "MDM/EMM device compliance logs",
              "Android logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile endpoint devices (Android)",
            "action": "Continuously ingest device compliance logs from the MDM/EMM platform. Establish a baseline of approved Device Administrator applications for each device profile. Create a high-priority alert whenever a new, non-whitelisted application is added to the active Device Administrator list. Correlate this event with other logs from the same device within a short time window (e.g., +/- 5 minutes), such as network connections to suspicious domains (from Zeek conn.log if traffic is routed through a monitored gateway) or user-reported behavior, to rapidly assess the event's context and risk."
          },
          {
            "description": "Device Administrator permissions are granted to an application immediately following or concurrent with events indicative of Input Injection (T1516), such as unexpected screen taps or UI interactions that were not user-initiated.",
            "data_sources": [
              "Android logcat (verbose/debug level)",
              "MDM/EMM event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "High-value users' mobile devices",
            "action": "On high-risk devices, monitor verbose Android logcat streams for sequences of rapid, non-standard UI events (e.g., programmatic taps on screen coordinates corresponding to the 'Activate' button on a permission dialog). If such a sequence is detected, immediately query the MDM for a change in the Device Administrator list. A temporal correlation between these event types (UI manipulation followed by permission grant) is a strong indicator of malicious activity. Use statistical analysis to define a baseline for normal touch event frequency and patterns per user to help identify anomalous programmatic interactions."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]