[
  {
    "information_requirement": "Is an adversary exfiltrating data from mobile devices using an unusual or high-volume protocol?",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1639",
        "name": "Exfiltration Over Alternative Protocol",
        "evidence": [
          {
            "description": "A mobile device is observed sending a large volume of data over a protocol not typically associated with its normal application usage (e.g., FTP, IRC, or raw TCP/UDP sockets to non-standard ports).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments and guest networks where mobile devices connect.",
            "action": "For each mobile device IP address, establish a baseline of commonly used protocols and destination ports over a 30-day period using Zeek conn.log. Calculate the 95th percentile for outbound data volume ('orig_bytes') for each protocol per device. Generate an alert when a device initiates a connection using a protocol outside its established baseline (e.g., FTP, SMTP) OR when the outbound data volume for any protocol exceeds its 95th percentile by a significant margin (e.g., > 3x). The risk score can be increased if the destination port is rare across the entire mobile device population."
          },
          {
            "description": "An unusually high volume of DNS requests, or DNS requests with abnormally long or high-entropy hostnames, are originating from a mobile device, suggesting data is being encoded and exfiltrated within the queries.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers and network egress points.",
            "action": "Using Zeek dns.log, monitor DNS queries originating from the mobile device IP space. For each device, calculate a baseline average and standard deviation for (1) the number of daily DNS queries and (2) the character length of the queried domain names. Additionally, calculate the Shannon entropy of the subdomain portion of the query string. An alert should be generated if a device's daily query count or average query length exceeds 3 standard deviations from its historical norm, or if the average entropy of its queried subdomains is consistently high, which suggests non-human-readable, encoded data."
          },
          {
            "description": "A mobile device is observed sending a large, sustained volume of data via HTTP/S POST requests to a destination that is not a known cloud storage provider, social media site, or other legitimate service used by the organization.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies and internet gateways.",
            "action": "Correlate Zeek conn.log with http.log and ssl.log for traffic from mobile devices. For each destination domain (from http.log 'host' field or ssl.log 'server_name' field), profile the total outbound bytes ('orig_bytes' in conn.log) associated with HTTP POST methods. Enrich destination domains with external threat intelligence (reputation, age, category). Flag destinations that are newly registered, have a poor reputation, or are uncategorized, especially when they receive an amount of POST data that is statistically anomalous (e.g., in the top 99th percentile of all POST sizes observed from mobile devices)."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]