[
  {
    "information_requirement": "Is an adversary collecting calendar entries from managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1636.001",
        "name": "Calendar Entries",
        "evidence": [
          {
            "description": "An application with calendar access permissions makes a network connection to a known malicious C2 or data exfiltration FQDN/IP, or the volume of data transferred in the session is a statistical outlier compared to the application's historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile Device Management (MDM) Application Inventory",
              "Threat Intelligence Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network gateways, VPN concentrators, DNS resolvers, and MDM/UEM platforms monitoring mobile device traffic and application installations.",
            "action": [
              "For each mobile device IP, retrieve its installed applications with calendar permissions from the MDM inventory. Correlate this with network logs by filtering Zeek conn.log and dns.log for connections from that IP. Join the destination FQDN/IP against a threat intelligence feed of known malicious indicators. A match triggers a high-severity alert.",
              "For each application with calendar permissions, build a 30-day rolling baseline of outbound data volume (orig_bytes) per network session from Zeek conn.log. Generate an alert when any new session's volume exceeds the 99.5th percentile of its specific baseline. Concurrently, calculate the Shannon entropy of the FQDN label in Zeek dns.log; an entropy score > 3.5 combined with a volume anomaly suggests DGA and elevates the alert priority.",
              "Apply a pre-trained time-series anomaly detection model (e.g., LSTM autoencoder) to outbound data volume per device, aggregated in 1-hour windows from Zeek conn.log. The model, trained on historical data, identifies normal network traffic patterns. An alert is generated if the model's reconstruction error for any given hour exceeds 3 standard deviations above the mean reconstruction error, indicating a significant deviation from the norm."
            ]
          },
          {
            "description": "A newly installed mobile application is observed with calendar access permissions, is not on the corporate application allowlist, and exhibits risk factors such as low enterprise-wide installation prevalence or an application category not typically requiring calendar access (e.g., 'Games', 'Social').",
            "data_sources": [
              "Mobile Device Management (MDM) Application Inventory",
              "Mobile Threat Defense (MTD) Scan Results",
              "Public App Store Metadata"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform, Mobile Threat Defense (MTD) platform, and public application stores (e.g., Google Play, Apple App Store).",
            "action": [
              "Continuously ingest application inventory data from the MDM/MTD platform. For any application with 'READ_CALENDAR' or 'WRITE_CALENDAR' permissions, check its bundle ID against a curated corporate allowlist and a denylist of known malicious apps. Trigger a medium-severity alert for any app not on the allowlist and a high-severity alert for any app on the denylist.",
              "For each application with calendar permissions not on the allowlist, calculate its installation prevalence as a percentage of the total managed device fleet. Use a heuristic risk score by adding points for low prevalence (<1% of fleet = 10 pts) and high-risk App Store category ('Game' = 10 pts, 'Utility' = 5 pts). Flag applications with a total score exceeding a threshold (e.g., 15) for manual security review.",
              "Feed application metadata from MDM and public app stores into a pre-trained classification model (e.g., Random Forest) that generates a 'malice probability score' from 0.0 to 1.0. Features should include: permission count, developer reputation, app category, user rating standard deviation, and enterprise installation prevalence. Rank all applications with calendar access by this score to create a prioritized investigation queue for security analysts."
            ]
          },
          {
            "description": "On a device flagged as jailbroken or rooted by an MDM/MTD solution, a process is observed making an outbound network connection within seconds of accessing the local calendar database file directly.",
            "data_sources": [
              "Mobile Device Management (MDM) Device Status",
              "Mobile Threat Defense (MTD) File Integrity Monitoring Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/MTD platforms, Endpoint file systems on high-risk mobile devices, Corporate network egress points",
            "action": [
              "Create a correlation rule that joins MDM device status with MTD file access alerts. Trigger a critical alert if a device has a status of 'rooted' or 'jailbroken' and an MTD alert shows any process accessing the calendar database path (e.g., '*/Calendar.sqlitedb').",
              "For devices flagged as rooted/jailbroken, correlate MTD file access events for the calendar database with network connection events (Zeek conn.log) from the same device IP. Calculate the time delta between the file access and the start of the network connection. An alert is generated if the median time delta for a specific process is less than 5 seconds over a 24-hour period.",
              "Employ a sequence analysis model (e.g., a Hidden Markov Model) to detect suspicious event chains on rooted/jailbroken devices. The model should be trained to recognize legitimate vs. suspicious sequences of [process_name, file_path_accessed, destination_ip]. Generate a high-confidence alert when the model identifies the sequence ['non-system_process', '*/Calendar.sqlitedb', 'new_external_ip'] with high probability."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]