[
  {
    "information_requirement": "Is the adversary using Domain Generation Algorithms (DGAs) to establish command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637.001",
        "name": "Domain Generation Algorithms",
        "evidence": [
          {
            "description": "A single mobile device's IP address generates a high rate of DNS requests for unique, non-existent domains (NXDOMAIN) within a short time frame. The queried domains also exhibit non-linguistic characteristics, such as a Shannon entropy score above 3.5 and a high n-gram abnormality score.",
            "data_sources": [
              "Zeek dns.log",
              "Windows DNS Server Analytic Event ID 260"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal and external DNS server logs; VPN concentrator logs for remote mobile devices; Enterprise Wi-Fi access point logs; Mobile Device Management (MDM) platform logs; Cloud Access Security Broker (CASB) traffic logs.",
            "action": "Symbolic: Match the 'query' field from Zeek dns.log against a threat intelligence feed of known DGA domain patterns. Generate a high-severity alert for any match originating from an IP address within the mobile device range. Statistical: In a 5-minute window, group Zeek dns.log records by source IP ('id.orig_h'). Calculate the count of unique queries where 'rcode_name' is 'NXDOMAIN' and the average Shannon entropy of those queried domains. Establish a baseline for both metrics across mobile device subnets. Alert when a single IP's NXDOMAIN count exceeds the 99th percentile and its average domain entropy exceeds 3.5. Machine Learning: For each unique domain from Zeek dns.log not on an allowlist, extract a feature vector (e.g., domain length, entropy, n-gram frequency, numeric character ratio). Use a pre-trained classifier (e.g., Random Forest) to assign a DGA probability score. Escalate alerts for domains with a score > 0.90 that are also associated with a high NXDOMAIN rate from a single mobile client IP."
          },
          {
            "description": "A mobile device initiates a successful network connection (TCP/UDP) to an IP address that was resolved from a domain registered within the last 72 hours. The domain has a low internal prevalence, meaning fewer than 5 other unique organizational devices have connected to it.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points; Internet gateway proxy and firewall logs; DNS resolver caches and logs; Mobile Device Management (MDM) solution logs; External WHOIS registration databases.",
            "action": "Symbolic: For every successful DNS resolution in Zeek dns.log from a mobile device IP, perform a WHOIS lookup on the domain query. Generate a medium-severity alert if the domain's creation date is within the last 3 days. Statistical: Join Zeek dns.log records (rcode='NOERROR') with Zeek conn.log records on the resolved IP. Filter for connections to domains created within the last 3 days (via WHOIS data). For each of these young domains, count the unique source IPs ('id.orig_h') that connected. Escalate alerts for connections to young domains where this internal prevalence count is less than 5. Machine Learning: For each mobile device IP, generate a daily time series of the count of connections to newly registered domains (created within the last 7 days). Apply a time series anomaly detection model (e.g., Seasonal Hybrid ESD) to identify statistically significant spikes in this activity. Flag anomalous spikes for investigation as potential beaconing to new C2 infrastructure."
          },
          {
            "description": "A mobile device, after making multiple failed DNS requests to domains with DGA characteristics, successfully resolves a domain and then begins sending an abnormally high volume of DNS queries or queries with large payloads (e.g., >100 bytes) to subdomains of that resolved domain, indicative of DNS tunneling over a DGA-based C2 channel.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers; DNS firewalls; Network Security Monitoring (NSM) sensors at network egress points; Packet capture (PCAP) from network taps.",
            "action": "Symbolic: Create a detection rule for DNS queries where the query length exceeds 255 bytes or the query label contains patterns indicative of Base64 or hex encoding. Correlate these hits with previous DGA-like activity (high NXDOMAIN rate or high entropy queries) from the same source IP in the last hour and generate a high-severity alert. Statistical: For each source IP ('id.orig_h') and parent domain pair, calculate the total data volume (sum of 'query_length' + response size) and the number of queries over a 1-hour window. Establish a baseline for these metrics across mobile subnets. Alert when a device-domain pair exceeds the 99.5th percentile for either metric, prioritizing alerts where the parent domain was recently registered or has high entropy. Machine Learning: Use an unsupervised learning model (e.g., K-Means or DBSCAN) on features extracted from DNS traffic per source IP (e.g., query frequency, query length distribution, response size distribution, subdomain entropy). Isolate and investigate outlier clusters characterized by high-frequency, large-payload queries to a limited set of parent domains, as these are strong indicators of DNS tunneling."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]