[
  {
    "information_requirement": "Has an adversary modified device security policies to evade defenses? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1632.001",
        "name": "Code Signing Policy Modification",
        "evidence": [
          {
            "description": "An Android device has the 'Install unknown apps' setting enabled for an application that is not a standard app store or an organizationally approved application.",
            "data_sources": [
              "MDM Policy Compliance Logs",
              "MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed Android device fleet",
            "action": "Establish an organizational baseline of applications that are authorized to have the 'Install unknown apps' permission (e.g., official internal app store). Continuously monitor MDM policy logs for any device reporting a deviation from this baseline. For any deviation, calculate the prevalence of the granting application across the fleet. An application with low prevalence (e.g., <1% of devices) receiving this permission should be flagged as a high-priority alert. Correlate with recent application installation logs to identify the source of the change."
          },
          {
            "description": "An Android device has an unexpected or non-standard Certificate Authority (CA) certificate installed in its trusted store.",
            "data_sources": [
              "MDM Device Security State Logs",
              "MDM Certificate Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed Android device fleet",
            "action": "Maintain an allowlist of all approved CA certificates for corporate Android devices. Periodically query the MDM platform to inventory all installed CA certificates on every device. Use a set-based comparison to identify any certificate not present in the organizational allowlist. For any anomalous certificate, calculate its entropy and subject name rarity. A high-entropy, rare, or self-signed certificate installed on a small number of devices is a strong indicator of compromise and requires immediate investigation."
          },
          {
            "description": "An iOS device has a new, non-standard, or unapproved Configuration Profile installed.",
            "data_sources": [
              "MDM Configuration Profile Inventory Logs",
              "MDM Device Compliance Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed iOS device fleet",
            "action": "Define and maintain a 'golden' set of approved Configuration Profiles for all managed iOS devices, segmented by device role or user group. Ingest MDM logs that detail the installed profiles on each device. For each device, perform a set difference between its installed profiles and the approved set for its role. Any profile present on the device but not in the approved set constitutes an anomaly. Prioritize alerts based on the profile's installation timestamp; profiles installed outside of normal provisioning or IT support windows should be considered more suspicious. Analyze the contents of the anomalous profile for suspicious payloads or permission grants."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]