[
  {
    "information_requirement": "Is an adversary attempting to intercept credentials or access tokens by hijacking URI schemes on mobile devices? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1635.001",
        "name": "URI Hijacking",
        "evidence": [
          {
            "description": "A newly installed or low-reputation application registers a URI scheme that is identical to a URI scheme registered by a known, legitimate application, particularly one used for authentication (e.g., OAuth).",
            "data_sources": [
              "Mobile Device Management (MDM) application inventory logs",
              "Mobile Threat Defense (MTD) scan results",
              "Application manifest files (e.g., AndroidManifest.xml, Info.plist)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile endpoints (iOS and Android devices)",
            "action": "Continuously collect an inventory of all installed applications and their registered URI schemes from all managed mobile devices via MDM/MTD. Establish and maintain an allow-list of known, legitimate applications and their expected URI schemes (e.g., 'mybank://', 'corp-sso://'). For each device, programmatically identify any instances where two or more applications register the same URI scheme, indicating a collision. For each collision, apply a risk score. Increase the score if one app is a known, high-value target (e.g., banking, SSO) and the other has a low reputation, is from an untrusted developer, or was recently installed. Use descriptive statistics to identify apps that register an anomalous number of URI schemes compared to a fleet-wide baseline. High-risk collisions should trigger an alert for analyst investigation."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]