[
  {
    "information_requirement": "Is an adversary collecting calendar entries from managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1636.001",
        "name": "Calendar Entries",
        "evidence": [
          {
            "description": "An application with calendar access permissions exhibits anomalous network behavior, such as communicating with a rare domain or exfiltrating an unusually large amount of data.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile Device Management (MDM) Application Inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network gateways monitoring mobile device traffic",
            "action": "First, use MDM logs to identify all applications with calendar access permissions (`android.permission.READ_CALENDAR` or `NSCalendarsUsageDescription`). For network traffic originating from mobile devices (identified by IP range), join Zeek conn.log data with Zeek dns.log data. Filter this traffic to isolate connections made by the previously identified applications (if process-to-network mapping is available) or from the device as a whole. For each connection, establish a baseline for destination FQDNs and ASNs. Calculate the Shannon entropy of subdomain labels in DNS requests; a high entropy score can indicate DGA activity. For each flow in conn.log, calculate the total bytes transferred (`orig_bytes` + `resp_bytes`) and flag flows that exceed the 95th percentile for that specific application or device. A combination of a high data transfer volume to a statistically uncommon domain or IP address should generate a high-priority alert for potential data exfiltration."
          },
          {
            "description": "An application requests calendar permissions that are not required for its core functionality, indicating a potential overreach of privileges for data collection purposes.",
            "data_sources": [
              "Mobile Device Management (MDM) Application Inventory",
              "Mobile Threat Defense (MTD) Scan Results"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform",
            "action": "Continuously ingest application inventory data from the MDM/MTD platform for all managed Android and iOS devices. For each application, parse its manifest to extract requested permissions, specifically looking for `android.permission.READ_CALENDAR`, `android.permission.WRITE_CALENDAR` (Android), and `NSCalendarsUsageDescription` (iOS). Categorize each application by its function (e.g., 'Calendar App', 'Productivity', 'Game', 'Utility'). Create a risk score based on the mismatch between the app category and the permission request; for example, a 'Game' requesting `READ_CALENDAR` receives a high risk score. Use descriptive statistics to identify the prevalence of each application across the fleet. An application with a high-risk score that is installed on a very small number of devices (e.g., <1% of the fleet) should be prioritized for manual review and vetting."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]