[
  {
    "information_requirement": "Is an adversary exfiltrating data from our mobile devices over unencrypted, non-C2 protocols? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1639.001",
        "name": "Exfiltration Over Unencrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "A series of DNS queries, often using TXT, CNAME, or NULL record types, originating from a single mobile device IP to a single parent domain. These queries exhibit characteristics of DNS Tunneling: the subdomain portion of the query is abnormally long (e.g., > 100 characters), has high Shannon entropy (e.g., > 4.5, indicating Base64 or similar encoding), and occurs at a high, sustained frequency (e.g., > 50 queries per minute).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "MDM/UEM Network Flow Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolver logs, VPN concentrators, corporate Wi-Fi access point logs, Mobile Device Management (MDM) platforms, Cloud Access Security Broker (CASB) logs.",
            "action": [
              "Create a symbolic rule to generate a high-severity alert IF (zeek_dns.qtype_name == 'NULL') OR (zeek_dns.query matches a threat intelligence list of known DNS tunneling domains). This provides a fast, high-confidence initial detection.",
              "For each source IP in Zeek dns.log, calculate the length and Shannon entropy of the query's subdomain. Establish a 30-day rolling baseline for these metrics per device. Generate a medium-severity alert if a query's length exceeds the 99th percentile or its entropy is > 4.5. Concurrently, track the query rate per source IP to a specific second-level domain over a 1-minute rolling window. If this rate exceeds 3 standard deviations above the device's historical baseline, generate another alert. Escalate to a high-severity incident if a single source IP triggers both a high-entropy/length alert and a high-frequency alert for the same domain within a 5-minute window.",
              "Train and deploy a Random Forest classifier to predict the probability of a DNS query being malicious. Features must include: query length, subdomain entropy, ratio of numeric to alphabetic characters, query type (one-hot encoded), historical rarity of the parent domain across the enterprise, and the entropy of query types from the source IP over the last hour. Flag queries with a predicted probability > 0.9 for analyst investigation. A supporting time-series anomaly detection model (e.g., SARIMA) on the volume of DNS TXT record queries per device can also detect uncharacteristic bursts indicative of exfiltration."
            ]
          },
          {
            "description": "An outbound HTTP POST or PUT request from a mobile device to a low-reputation or newly registered domain. The request body size ('post_body_len') is anomalously large (e.g., > 5MB), or a series of smaller, chunked requests are made in rapid succession. The request body content has high Shannon entropy (e.g., > 4.2), and the request features a non-standard User-Agent (e.g., 'curl/7.68.0', 'python-requests/2.25.1') or a 'Content-Type' header of 'application/octet-stream' directed to a non-API endpoint.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "MDM/UEM Network Flow Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, API Gateways, web proxy logs, MDM/UEM logs with network activity, and Cloud Access Security Broker (CASB) logs.",
            "action": [
              "In Zeek http.log, create a rule to alert on any POST/PUT request where the 'host' or destination IP matches a threat intelligence feed of malicious domains, has a domain registration age of < 30 days, or where the 'user_agent' field contains substrings like 'curl', 'wget', or 'python-requests', as these are atypical for standard mobile applications.",
              "For each source IP, establish a baseline of outbound POST/PUT request body sizes ('post_body_len' in Zeek http.log) and the ratio of POST/PUT requests to GET requests for each destination domain. Alert when a request's size exceeds the 99th percentile of the IP's baseline or if the POST/GET ratio for a domain exceeds 3 standard deviations from the norm. Upon alert, automatically calculate the Shannon entropy of the request body; an entropy score > 4.2 should escalate the alert severity.",
              "Use an Isolation Forest model to detect anomalous HTTP requests from mobile devices. The feature set should include: 'post_body_len', destination IP rarity, request body entropy, rarity of the 'user_agent' string, rarity of the 'Content-Type' header, and the POST-to-GET request ratio for the destination. Requests flagged as outliers require analyst review. A companion LSTM autoencoder model can monitor the time-series of outbound data volume per user to detect sudden, uncharacteristic spikes in data transfer."
            ]
          },
          {
            "description": "Any outbound FTP connection (port 21/TCP) from an IP address associated with a mobile device. This protocol is highly atypical for modern mobile applications and is considered suspicious by default, especially if an FTP client is not on the approved application list for the device. The suspicion is elevated if the session involves file upload commands like 'STOR' or transfers a large volume of data (e.g., > 10MB).",
            "data_sources": [
              "Zeek ftp.log",
              "Zeek conn.log",
              "MDM/UEM Network Flow Logs",
              "MDM/UEM Application Inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, network firewalls, VPN concentrators, corporate Wi-Fi access points, and DMZ network segments.",
            "action": [
              "Implement a zero-tolerance rule in the SIEM to generate a critical alert for any connection from a mobile device IP range to an external destination on port 21/TCP, as logged in Zeek conn.log. If Zeek ftp.log is available, escalate the alert to critical if the 'command' field is 'STOR' (store file). Correlate with MDM application inventory to confirm if an FTP client is installed on the device.",
              "Upon a symbolic FTP alert, analyze the total bytes transferred ('orig_bytes' + 'resp_bytes' in Zeek conn.log). If the data volume exceeds the 99.9th percentile of all of that device's network sessions over the past 30 days, or is greater than a hard threshold like 10MB, escalate the alert's priority. A first-time use of FTP from the device in its recorded history also serves as a strong escalating factor.",
              "Employ K-Means clustering for peer group analysis. For each mobile device, create a feature vector including a count of distinct protocols used (e.g., DNS, HTTP, HTTPS), the entropy of destination ports, and average daily outbound bytes. A mobile device falling into a small cluster by itself, or one characterized by the presence of FTP usage, should be flagged as a high-confidence outlier requiring immediate investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]