[
  {
    "information_requirement": "Is an adversary attempting to remove their tools from a compromised mobile device to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.001",
        "name": "Uninstall Malicious Application",
        "evidence": [
          {
            "description": "A series of DNS queries or network connections from a specific mobile device IP address to a consistent external destination (C2 server) with a highly regular inter-arrival time (e.g., coefficient of variation < 0.2) and consistent data volume (e.g., standard deviation of bytes transferred < 10% of mean) unexpectedly stops for a period exceeding 3 standard deviations of its established inter-arrival time, without corresponding mobile device shutdown or network disconnection logs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile Device Management (MDM) Device Status Logs",
              "VPN/Proxy Access Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, corporate DMZ, and DNS resolvers servicing mobile devices.",
            "action": "1. (Symbolic) Ingest a threat intelligence feed of known C2 servers. Configure a SIEM rule to alert on Zeek conn.log records where `id.orig_h` is a corporate mobile device IP and `id.resp_h` matches an indicator from the C2 feed, OR Zeek dns.log records where `id.orig_h` is a corporate mobile device IP and `query` matches a C2 domain from the feed. 2. (Statistical) For each unique `id.orig_h` (mobile device IP) and `id.resp_h` (destination IP) pair in Zeek conn.log, calculate the rolling 24-hour mean and standard deviation of `duration` and `orig_bytes`. Identify potential beacons where the coefficient of variation (stddev/mean) for `duration` is below 0.2 and `orig_bytes` is relatively consistent (e.g., standard deviation < 10% of mean). Generate a high-priority alert if a beaconing series stops for a period exceeding its mean `duration` plus 3 standard deviations, and no corresponding MDM device shutdown or network disconnect event is observed. 3. (Machine Learning) Utilize a time series anomaly detection model (e.g., Isolation Forest or Prophet) on the `duration` and `orig_bytes` of statistically identified beaconing connections from Zeek conn.log for each mobile device. Train the model to establish a baseline for normal beaconing patterns. If the model detects a significant deviation from the baseline, specifically a cessation of expected activity that falls outside the 99% prediction interval, classify this as a 'Beacon Cessation Anomaly' and trigger an alert."
          },
          {
            "description": "A `MobileApplicationUninstall` event (or similar) is recorded in the Mobile Device Management (MDM) platform audit logs for a corporate-managed mobile device, where the `application_name`, `device_id`, and `user_id` fields are present, and no corresponding `ApprovedChangeRequest` or `ServiceTicket` for the specific application and device exists in the IT Service Management (ITSM) system logs within a 24-hour lookback window.",
            "data_sources": [
              "MDM Platform Audit Logs (e.g., specific event type for uninstall)",
              "IT Service Management (ITSM) System Logs (e.g., change request or incident ticket creation logs)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM/log aggregators, servers hosting the Mobile Device Management (MDM) platform, and servers hosting the IT Service Management (ITSM) platform.",
            "action": "1. (Symbolic) Configure a SIEM rule to ingest and parse MDM Platform Audit Logs for events with `event_type='MobileApplicationUninstall'`. For each detected uninstall, automatically query the ITSM system's API or database (e.g., `SELECT * FROM ITSM_Tickets WHERE type='ChangeRequest' AND status='Approved' AND application_name='<MDM_App_Name>' AND device_id='<MDM_Device_ID>' AND timestamp BETWEEN NOW() - 24_HOURS AND NOW()`) to verify an authorized change request. Generate a high-priority alert if no matching approved request is found. 2. (Statistical) For all unauthorized uninstalls identified via the symbolic method, calculate the daily count of unique unauthorized uninstall events per device (`device_id`). Establish a 30-day moving average and standard deviation for this metric for each device. Flag any device whose daily count of unauthorized uninstalls exceeds the moving average by more than 3 standard deviations as a 'Suspicious Uninstall Spike'. 3. (Machine Learning) Train a supervised classification model (e.g., Gradient Boosting or Random Forest) using historical MDM uninstall events, labeled as 'authorized' or 'unauthorized' based on ITSM correlation. Features for the model should include: `application_name` (one-hot encoded or embedded), `time_of_day_utc`, `day_of_week`, `device_model`, `user_department`, and `time_since_installation_days`. Apply the trained model to new unauthorized uninstall events; flag events with a model confidence score above the 95th percentile for 'unauthorized' as 'High-Confidence Malicious Uninstall'."
          },
          {
            "description": "A mobile device's network traffic (DNS query or connection) matches a known indicator of compromise (IOC) for mobile rooting toolkits (e.g., specific domains, IP addresses, or JA3/JA4 hashes) from a threat intelligence feed. This event is observed within a 60-minute window prior to the unexpected cessation of a previously established beaconing communication from the same mobile device, where the beacon cessation is identified by a prolonged absence of expected traffic patterns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Platform Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, network gateways (e.g., firewalls, proxies), and VPN concentrators servicing the mobile device fleet.",
            "action": "1. (Symbolic) Configure a SIEM rule to ingest Threat Intelligence Platform Feeds containing IOCs for mobile rooting toolkits. Create an alert whenever `id.orig_h` (mobile device IP) in Zeek conn.log or `query` in Zeek dns.log matches a known rooting toolkit IOC. Tag these events as `RootingToolkit_Communication`. 2. (Statistical) Upon a `RootingToolkit_Communication` alert for a specific mobile device (`device_ip`), query Zeek conn.log and dns.log for the preceding 24 hours to identify any active C2-like beacons (using the statistical methods defined in the first evidence block). If a beacon's activity from `device_ip` ceases within 60 minutes *after* the `RootingToolkit_Communication` timestamp, and no legitimate reason (MDM shutdown, network disconnect) is found, escalate the alert priority to 'Critical - Suspected Malicious Uninstall'. 3. (Machine Learning) Develop a sequence anomaly detection model (e.g., using Hidden Markov Models or recurrent neural networks) to analyze event streams for each mobile device. Define a sequence of interest as `RootingToolkit_Communication` followed by `BeaconCessationAnomaly` (as detected by the ML model in the first evidence block) within a 60-minute window. Train the model on historical sequences, and trigger a 'High-Confidence Malicious Uninstall Chain' alert when this specific sequence is observed, initiating automated response actions like device quarantine or forensic imaging via MDM."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]