[
  {
    "information_requirement": "Is the adversary using Domain Generation Algorithms (DGAs) to establish command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637.001",
        "name": "Domain Generation Algorithms",
        "evidence": [
          {
            "description": "A single mobile device IP address generates a high volume of DNS requests (e.g., greater than 50) for unique, non-existent domains (NXDOMAIN response) within a 5-minute window. The queried domains also exhibit non-linguistic characteristics, indicated by a calculated Shannon entropy score greater than 3.5.",
            "data_sources": [
              "Zeek dns.log",
              "Windows DNS Server Analytic Event ID 260"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic from mobile device subnets, specifically DNS queries captured at internal DNS resolvers, egress firewalls, or via Network Security Monitoring (NSM) sensors. Logs from Mobile Device Management (MDM) or Cloud Access Security Broker (CASB) platforms can also provide DNS context.",
            "action": [
              "From Zeek dns.log, filter for DNS queries originating from designated mobile device IP ranges. Match the 'query' field against a threat intelligence feed of known DGA domain regular expressions. Generate a high-severity alert for any match.",
              "Using Zeek dns.log, aggregate records by source IP ('id.orig_h') in 5-minute windows. For each IP, count the number of unique queries resulting in an 'NXDOMAIN' response and calculate the average Shannon entropy of those query strings. Establish a baseline for these two metrics across the mobile device IP space. Generate an alert when a single IP's NXDOMAIN count exceeds the 99th percentile of its baseline and its average domain entropy is greater than 3.5.",
              "For all unique domains queried from mobile IPs that are not on an organizational allowlist, extract a feature vector including domain length, Shannon entropy, n-gram frequency, numeric character ratio, and vowel-to-consonant ratio. Input this vector into a pre-trained classification model (e.g., Random Forest, LSTM) to produce a DGA probability score. Escalate any domain with a score greater than 0.90 for analyst review, prioritizing those associated with high NXDOMAIN rates from a single client."
            ]
          },
          {
            "description": "A mobile device successfully resolves a domain name that was registered within the last 72 hours. The subsequent network connection to the resolved IP address shows low internal prevalence, with fewer than 5 unique organizational devices having connected to the domain in the past 30 days.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "External WHOIS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network traffic captured at internet gateways or proxies, correlated with DNS resolution logs from internal resolvers. Enrichment data from external WHOIS services is required. Logs from MDM or CASB solutions can provide device context for connections.",
            "action": [
              "For each successful DNS resolution (where 'rcode' is 'NOERROR') in Zeek dns.log from a mobile IP address, perform a WHOIS lookup to retrieve the domain's creation date. Generate a medium-severity alert if the 'create_date' is less than 3 days from the current date.",
              "Join successful DNS resolutions from Zeek dns.log with network connections from Zeek conn.log on the resolved IP for all mobile device IP ranges. Filter for connections to domains created within the last 30 days. For each of these young domains, count the number of unique source IPs ('id.orig_h') that have connected. Escalate alerts for connections to domains where this internal prevalence count is less than 5, indicating anomalous rarity.",
              "For each mobile device, create a daily time series representing the count of connections to newly registered domains (e.g., created within the last 7 days). Apply a time series anomaly detection algorithm (e.g., SARIMA, Prophet) to this series. Flag any day where the observed count is a statistically significant anomaly (e.g., exceeds the 99th percentile of the forecast confidence interval) as potential beaconing to new C2 infrastructure."
            ]
          },
          {
            "description": "A mobile device, after a pattern of failed DNS lookups (NXDOMAIN), successfully resolves a parent domain. It then initiates a high volume of DNS queries (e.g., >100 in 10 minutes) for numerous unique subdomains of that parent domain. These queries may also exhibit large query lengths (e.g., average length > 100 bytes) or contain encoded data.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS traffic logs from internal DNS resolvers and forwarders. Network Security Monitoring (NSM) sensors at key network chokepoints (e.g., data center core, internet egress) can provide the necessary granularity from full packet capture if needed.",
            "action": [
              "Create a rule to inspect Zeek dns.log records from mobile IPs. Generate an alert if a DNS query label exceeds 63 characters, the total query length exceeds 255 bytes, or the query string contains patterns matching Base64 or hexadecimal encoding. Correlate these alerts with recent high-entropy NXDOMAIN activity from the same source IP within the last hour.",
              "In 10-minute windows, group Zeek dns.log records by source IP ('id.orig_h') and the parent domain (e.g., second-level and top-level domain). Calculate the query frequency, the count of unique subdomains, and the average query length. Establish a baseline for these metrics. Alert when a source IP/parent domain pair exceeds the 99.5th percentile for either query frequency or unique subdomain count, especially if the parent domain was recently registered.",
              "From 1-hour windows of DNS traffic, extract features per source IP, including query frequency, query/response size distributions, subdomain entropy, and the count of unique subdomains per parent domain. Apply an unsupervised clustering model (e.g., DBSCAN, Isolation Forest) to identify anomalous IP behavior. Manually investigate clusters characterized by high-frequency, large-payload, and high-subdomain-count queries as probable DNS tunneling activity used for C2."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]