[
  {
    "information_requirement": "Is an adversary maintaining command and control over a compromised mobile device via dynamic resolution? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637",
        "name": "Dynamic Resolution",
        "evidence": [
          {
            "description": "A DNS query from a mobile device is for a domain that exhibits characteristics of algorithmic generation, such as a Shannon entropy score exceeding the 98th percentile of a 30-day baseline and a character-level n-gram frequency that deviates significantly (e.g., >3 standard deviations) from the norm for legitimate domains [1].",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and Mobile Device Management (MDM) platform logs.",
            "action": [
              "Continuously match the 'query' field in Zeek dns.log against a threat intelligence feed of known DGA domains. A direct match must trigger a high-priority alert for immediate investigation.",
              "For each unique domain name from mobile device IP ranges, calculate its Shannon entropy and the ratio of numerical characters to total characters. Establish a 30-day rolling baseline for these metrics, calculating the 98th percentile for each. Flag any domain where both the entropy and numerical ratio exceed their respective 98th percentile thresholds.",
              "Develop and apply a random forest classifier trained on a labeled dataset (e.g., public DGA lists vs. Tranco [2] list) to classify DNS queries from mobile devices. Use features such as domain length, Shannon entropy, numerical character ratio, and n-gram frequencies. Escalate queries classified as 'DGA' with a confidence score greater than 0.90 for analyst review."
            ]
          },
          {
            "description": "A mobile device establishes a network connection to a domain that is both recently registered (e.g., <30 days ago) and unpopular (e.g., not in the Tranco Top 1 Million list [2]), and the connection pattern to that domain exhibits low data volume and highly periodic timing, characteristic of C2 beaconing.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "External WHOIS Data",
              "External Domain Prevalence Lists"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and external WHOIS services.",
            "action": [
              "For each unique domain resolved in Zeek dns.log originating from a mobile device, query a threat intelligence platform API to check if the domain or its resolved IP is on a blocklist of known C2 infrastructure. An exact match must generate a critical alert.",
              "Automate a process to enrich each unique domain from Zeek dns.log with its WHOIS registration date and Tranco [2] rank. Calculate a risk score where $$ risk = (10 * is\\_new) + (5 * is\\_unpopular) $$, where $$ is\\_new $$ is 1 if registered < 30 days ago, and $$ is\\_unpopular $$ is 1 if not in the top 1 million. For connections in Zeek conn.log to domains with a risk score > 10, analyze the source IP's connection patterns over 24 hours. Flag source IPs that exhibit both low data volume (e.g., total bytes < 20th percentile) and highly regular connection timing (e.g., standard deviation of inter-arrival times < 10th percentile).",
              "For traffic directed to high-risk domains identified by the statistical method, perform a time-series analysis on the connection timestamps for each source IP. Create a time series of connection events and apply an autocorrelation function (ACF). A clear, dominant peak in the ACF plot at a non-zero lag, indicating a repeating pattern, should classify the connection as automated beaconing and trigger an alert. The lag at which the peak occurs represents the beaconing interval."
            ]
          },
          {
            "description": "A single domain name queried by a mobile device rapidly resolves to a large and diverse set of IP addresses (e.g., >10 unique IPs across >3 distinct ASNs in 60 minutes) with a low DNS Time-To-Live (TTL) value (e.g., <300 seconds), indicative of fast-flux DNS.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "External IP to ASN Database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and DNS resolution infrastructure.",
            "action": [
              "Create and maintain a rule to flag any DNS query from a mobile device IP range that matches a watchlist of known dynamic DNS provider patterns (e.g., *.ddns.net, *.no-ip.com, *.duckdns.org). Matching queries should be flagged for analyst review.",
              "For each domain in Zeek dns.log, count the number of unique IP addresses and unique ASNs it resolves to over a rolling 1-hour window. Calculate the 99th percentile for both unique IP and unique ASN counts across all domains queried by mobile devices. Flag domains that simultaneously exceed both thresholds and have an average DNS Time-To-Live (TTL) value below 300 seconds as potential fast-flux C2 infrastructure.",
              "For each mobile device source IP, extract all outbound connection metadata from Zeek conn.log over a 15-minute window. Apply a density-based clustering algorithm (e.g., DBSCAN) using features such as destination IP, destination port, and destination ASN. A distinct cluster of connections to a large number of IPs across multiple ASNs, identified by the algorithm as a single group, indicates a high likelihood of a fast-flux C2 channel and should be alerted for further analysis."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]