[
  {
    "information_requirement": "Is an adversary removing indicators of compromise from mobile devices to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630",
        "name": "Indicator Removal on Host",
        "evidence": [
          {
            "description": "An MDM/EDR event log indicates an application invoked a data or cache clearing API call (e.g., Android's `clearApplicationUserData`, iOS's `FileManager.removeItem`) where the event properties do not explicitly flag the action as user-initiated, and the event occurs outside of established behavioral baselines for the application or its category.",
            "data_sources": [
              "MDM Application Activity Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); Corporate Wi-Fi access points; VPN concentrators; Cloud-based MDM/UEM management consoles",
            "action": "1. (Symbolic) Create a SIEM correlation rule that triggers when a Mobile EDR log shows an API call event with `api.name` as 'clearApplicationUserData' or 'FileManager.removeItem' AND the `app.hash` or `app.package_name` exists on a threat intelligence feed of known malware. 2. (Statistical) For each application (`app.package_name`), execute a scheduled hourly query to calculate the frequency of non-user-initiated data-clearing events per device. Establish a 30-day rolling baseline of this frequency. Generate an alert if the current hour's frequency for an application on any device exceeds the 99th percentile of its historical baseline, indicating an unusual spike in activity. 3. (Machine Learning) Train a Random Forest classifier to predict if a data-clearing event is malicious (`is_malicious` = 1) or benign (`is_malicious` = 0). Engineer features from MDM/EDR and Zeek logs including: `app_category`, `is_user_initiated` (boolean), `time_of_day_bucket` (e.g., 'business_hours', 'after_hours'), `day_of_week`, and `sum_bytes_out_5min_prior` (calculated from Zeek conn.log). An event with a predicted probability score > 0.9 should trigger an automated workflow to isolate the device via MDM API and create a high-priority incident."
          },
          {
            "description": "An EDR or FIM agent log shows an application process generating a high volume of file deletion events or deleting files outside its designated sandboxed directory. The activity targets sensitive, non-application-specific locations such as user data folders (e.g., `/storage/emulated/0/DCIM`, `/storage/emulated/0/Documents` on Android) or system log directories (e.g., `/var/log` on jailbroken iOS).",
            "data_sources": [
              "MDM File Integrity Monitoring Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); MDM/UEM servers; Network egress points with file transfer monitoring",
            "action": "1. (Symbolic) Deploy an EDR/FIM policy to generate a critical alert if a process whose `process.name` is not on an enterprise allowlist performs a delete operation (`event.type` = 'deletion') within protected directories like `/var/logs`, `DCIM`, or `Downloads`. The rule should filter out known good processes like system updaters or security agents. 2. (Statistical) Run an hourly SIEM query grouping by `app.package_name` to compute two metrics: (1) the total count of deleted files, and (2) the Shannon entropy of the file extensions of deleted files using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. High entropy suggests indiscriminate deletion of varied file types, unlike a targeted cache clear. Alert if the deletion count exceeds 3 standard deviations of the application's 30-day hourly baseline OR if the entropy score increases by more than 50% from its baseline. 3. (Machine Learning) Ingest EDR file events into a data analytics platform. Use a DBSCAN clustering model on a feature set including `deletion_count_per_minute`, `total_bytes_deleted`, and `directory_path_depth` for each application burst of activity. DBSCAN is effective here as it does not require a predefined number of clusters. Isolate and investigate outlier event clusters, which represent anomalous deletion patterns. Correlate these outlier device and timestamp events with Zeek `files.log` (for `mime_type`) and `conn.log` (for `orig_bytes` and `resp_bytes`) to check for preceding data exfiltration."
          },
          {
            "description": "MDM application inventory logs show an application was uninstalled from a device in a time period that is anomalously short (e.g., under one hour) following its installation. This is especially suspicious when the uninstall event is not explicitly user-initiated or is preceded by high-volume or suspicious network activity, such as connections to known malicious domains or a high rate of DNS failures.",
            "data_sources": [
              "MDM Application Inventory Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); MDM/UEM servers; Enterprise DNS resolvers",
            "action": "1. (Symbolic) Create a SIEM rule to alert when an MDM log shows an `app_uninstall` event AND the `app.package_name` or `app.hash` is present on a threat intelligence feed specifically categorized as 'short-lived malware' or 'dropper'. 2. (Statistical) Using a scheduled query, join MDM application install and uninstall logs on `device_id` and `app.name` to calculate `app_lifetime_seconds`. Alert if `app_lifetime_seconds` is below the 5th percentile of all app lifetimes calculated across the enterprise over the last 90 days. To reduce false positives, enrich alerts by querying Zeek `dns.log` for the `device_id` during the app's lifetime; a ratio of NXDOMAIN responses to total queries greater than 0.5 is a strong corroborating indicator of DGA-like behavior. 3. (Machine Learning) Train a logistic regression model to produce a risk score for each uninstallation event. Engineer features such as: `app_lifetime_seconds`, `install_source` (categorical: 'AppStore', 'Sideloaded', 'EnterpriseStore'), `unique_dns_domains_contacted` (from Zeek `dns.log`), `total_bytes_transferred` (from Zeek `conn.log`), and `is_user_initiated` (boolean from EDR). A predicted risk score > 0.85 should automatically create an incident ticket for Tier 2 analysis, including all feature values for the analyst's review."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.3",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]