[
  {
    "information_requirement": "Is an adversary attempting to steal credentials from mobile device keychains? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1634.001",
        "name": "Keychain",
        "evidence": [
          {
            "description": "A mobile device connected to the corporate network exhibits network traffic patterns indicative of a jailbreak, which is a common prerequisite for unauthorized access to the keychain database.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments and VPN termination points used by mobile devices.",
            "action": "Analyze Zeek ssl.log for mobile device IP ranges, looking for a high rate of certificate validation failures (e.g., validation_status of 'self-signed certificate in certificate chain' or 'unable to get local issuer certificate'). Compare DNS requests in dns.log from these devices against threat intelligence feeds for domains associated with jailbreaking tools or repositories (e.g., Cydia). Establish a baseline of normal TLS validation statuses and DNS query patterns per device or user agent. Use statistical analysis to alert on significant deviations, such as a sudden spike in validation errors or queries to known suspicious domains, which could indicate a jailbreak."
          },
          {
            "description": "Anomalous data transfer occurs from a mobile device, potentially representing the exfiltration of stolen keychain data.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and firewalls monitoring traffic from mobile device subnets.",
            "action": "For mobile devices, establish a baseline of typical daily outbound data volume (orig_bytes) using a statistical measure like the 95th percentile. Monitor Zeek conn.log for connections from these devices that significantly exceed their individual baselines, especially to IP addresses with low reputation or those not previously seen in the organization's traffic. A high-volume data transfer occurring outside of normal business hours or immediately following other suspicious network activity (like the evidence described above) should be prioritized for investigation as potential credential exfiltration."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]