[
  {
    "information_requirement": "Is an adversary collecting call log data from our managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1636.002",
        "name": "Call Log",
        "evidence": [
          {
            "description": "An application installed on a managed Android device requests the 'READ_CALL_LOG' permission without a clear, documented business or functional justification.",
            "data_sources": [
              "Application Manifest Files (AndroidManifest.xml)",
              "Mobile Application Management (MAM) Policy Reports"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate application store, Mobile Application Management (MAM) platform, Application vetting environment",
            "action": "During pre-deployment vetting, parse the `AndroidManifest.xml` of all applications to identify the presence of the `android.permission.READ_CALL_LOG` permission. Maintain an allowlist of applications where this permission is justified. For any application not on the allowlist, calculate its rarity score based on the prevalence of this permission across the entire application portfolio. Applications with a high rarity score (e.g., in the 99th percentile) should be flagged for mandatory manual security review before being approved for deployment."
          },
          {
            "description": "An unauthorized or suspicious process is observed making API calls to access the Android Call Log Content Provider during runtime.",
            "data_sources": [
              "Mobile Endpoint Detection and Response (EDR) logs",
              "Mobile Device Management (MDM) audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android endpoints, Unified Endpoint Management (UEM) console",
            "action": "Using a mobile EDR agent, monitor for API calls to the 'Call Log Content Provider'. Baseline legitimate applications that access this provider (e.g., dialer, visual voicemail). Generate a high-severity alert for any process not on the baseline that attempts this action. Correlate this activity with other on-device events, such as network connections to unusual domains or attempts at privilege escalation, to calculate a cumulative risk score for the device. A score exceeding a predefined threshold triggers an automated response, such as device isolation."
          },
          {
            "description": "A mobile device exhibits anomalous data exfiltration patterns, such as a significant increase in data uploaded to an unusual destination, shortly after the installation or update of an application with call log permissions.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM application inventory logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi network gateways, VPN concentrators",
            "action": "Correlate MDM logs showing the installation time of new applications with network flow data (Zeek conn.log). For devices where an app with `READ_CALL_LOG` permission was recently installed, monitor for anomalous data upload volumes. Establish a baseline of normal upload traffic volume per device/user and alert on significant deviations (e.g., > 3 standard deviations above the mean) that occur post-installation. Concurrently, analyze DNS requests (Zeek dns.log) from the device for queries to new or rare domains, which could indicate a C2 channel for exfiltration."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]