[
  {
    "information_requirement": "Are adversaries accessing credentials stored on corporate mobile devices? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1634",
        "name": "Credentials from Password Store",
        "evidence": [
          {
            "description": "A mobile device's compliance status in MDM/UEM logs changes to 'non-compliant' with a reason of 'jailbreak' or 'root'. Within 24 hours, the associated user account is linked to authentication anomalies, including a spike of >10 failed logins (Windows Event ID 4625) in 5 minutes from multiple source hosts, followed by a successful login (Windows Event ID 4624) from an atypical geolocation. This is correlated with an outbound data transfer from the mobile device's IP address in Zeek conn.log that exceeds the 95th percentile of its 30-day baseline.",
            "data_sources": [
              "MDM/UEM device compliance logs",
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Windows Event ID 4768",
              "Windows Event ID 4769"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/UEM management server; Network egress points instrumented with Zeek sensors; VPN concentrators; Corporate Wi-Fi Access Point Controllers; Domain Controllers and Authentication Servers; Cloud identity provider logs (e.g., Azure AD, Okta).",
            "action": [
              "Create a correlation rule that triggers when an MDM/UEM log records a 'compliance_status' of 'non-compliant' with a 'reason' of 'jailbreak_detected' or 'root_detected'. Upon trigger, query for the affected user's activity and alert if >10 failed logon events (Windows Event ID 4625) occur within a 5-minute window. Additionally, cross-reference the device's IP from Zeek conn.log against a threat intelligence feed of known malicious infrastructure and alert on any match.",
              "For each device flagged for jailbreaking, establish and monitor a 30-day rolling baseline of its daily outbound data volume ('orig_bytes' in Zeek conn.log). Generate an alert if the daily volume exceeds the 95th percentile of its historical distribution. Separately, for the affected user, baseline the set of source countries and ASNs for all successful logins (Windows Event ID 4624). Alert if a successful login occurs from a country or ASN not seen for that user in the past 90 days.",
              "Deploy a time-series anomaly detection model (e.g., ARIMA) on per-device, per-hour outbound byte counts and distinct destination connection counts derived from Zeek conn.log. Flag any significant spike that occurs within 24 hours of a jailbreak event as a high-risk anomaly. Train a classification model (e.g., Random Forest) to produce a 'credential compromise risk score' for each user, using features such as: 'is_jailbroken' (binary), 'outbound_bytes_zscore_vs_30d_baseline', 'failed_login_count_1hr', 'is_new_country_login', and 'connection_entropy_score'. The model's output should include a probability score and the top contributing features for analyst review."
            ]
          },
          {
            "description": "An application not present on the corporate MDM/UEM allowlist is installed on a mobile device. Subsequently, that device is observed in Zeek dns.log generating DNS queries for domains with Shannon entropy scores above 3.5, or it is observed in Zeek conn.log initiating periodic, direct-to-IP connections with a low variance (<10 seconds) in inter-arrival time, indicative of C2 beaconing.",
            "data_sources": [
              "MDM/UEM application inventory logs",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/UEM management server; Corporate DNS resolvers logging to Zeek; Network egress points instrumented with Zeek sensors; Cloud Access Security Broker (CASB) logs; Mobile Application Management (MAM) servers.",
            "action": [
              "Ingest MDM/UEM application inventory logs and compare each new application's package name and signing certificate hash against a corporate allowlist and a threat intelligence feed of malicious application indicators. Generate an alert for any non-allowlisted application. For devices with such apps, create a rule to alert if the device IP initiates connections in Zeek conn.log to a destination IP that has no corresponding successful DNS query in Zeek dns.log within a 5-minute lookback window.",
              "For all network traffic from devices with unauthorized applications, calculate the Shannon entropy of all requested second-level domains in Zeek dns.log over a 1-hour sliding window. Trigger an alert for potential Domain Generation Algorithm (DGA) activity if the average entropy score exceeds 3.5. For direct-to-IP connections from these devices, calculate the standard deviation of the inter-arrival time between connections to the same destination IP in Zeek conn.log over a 24-hour period. Alert if the standard deviation is less than 10 seconds for a connection series with more than 10 events, indicating automated C2 beaconing.",
              "Use a clustering algorithm (e.g., DBSCAN) on features extracted from Zeek conn.log for all mobile device traffic. Features must include 'protocol', 'destination_port', 'connection_duration', 'total_bytes_sent', 'periodicity_score' (derived from inter-arrival time variance), and 'dns_query_entropy_score'. Flag traffic from devices with unauthorized apps that falls into small, distant clusters as high-confidence anomalies. Alternatively, train an autoencoder neural network on the same feature set using only traffic from compliant devices; a high reconstruction error for traffic from a device with an unauthorized app indicates anomalous behavior requiring investigation."
            ]
          },
          {
            "description": "A user's credentials are used for a successful login (Windows Event ID 4624) from a source IP address (correlated via Zeek conn.log) that is on a threat intelligence list of anonymizing proxies or has no geographical or ASN overlap with the user's 90-day login history. Following this login, the account is used to access a new, previously unused critical application or initiates a data download from a cloud repository that is >3 standard deviations above the user's daily average.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Cloud/SaaS application access logs",
              "VPN Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers; VPN Concentrators; Cloud Identity Providers (e.g., Azure AD, Okta); SaaS application platforms (e.g., O365, Salesforce); Network egress points instrumented with Zeek sensors.",
            "action": [
              "Create a rule that enriches every successful authentication event (Windows Event ID 4624) with the source IP's threat intelligence reputation from Zeek logs. Generate a high-priority alert if the source IP address is on a blocklist for anonymizing services (e.g., TOR exit nodes, commercial VPNs) and the user's role does not require such tools.",
              "For each user, maintain a 90-day rolling baseline of source Autonomous Systems (ASNs) and countries for all successful logins, derived by correlating Windows Event ID 4624 with IP geolocation data from Zeek conn.log. Generate an 'impossible travel' alert if a successful login occurs from an ASN or country from which the user has never logged in before. Calculate a risk score based on the rarity of the ASN/country across the entire organization.",
              "Train a peer group analysis model using k-means clustering to group users by their typical login behaviors (source ASNs, time-of-day, day-of-week, systems accessed). Flag a user login as anomalous if it shifts the user's profile to a new, distant cluster. Augment this with a supervised classifier (e.g., XGBoost) trained on labeled historical data to predict credential reuse, using features like 'is_new_ASN_for_user', 'is_new_country_for_user', 'time_of_day_zscore', and 'is_anonymizer_IP'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]