[
  {
    "information_requirement": "Is an adversary maintaining command and control over a compromised mobile device via dynamic resolution? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637",
        "name": "Dynamic Resolution",
        "evidence": [
          {
            "description": "A mobile device is observed making DNS requests for domains that exhibit statistical properties of being algorithmically generated, such as high character entropy or non-standard n-gram frequencies. [1]",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, and guest network segments used by mobile devices.",
            "action": "For all DNS requests captured in Zeek dns.log, calculate the Shannon entropy and the vowel-to-consonant ratio of the queried domain name (the 'query' field). Establish a baseline for these metrics across all devices on the network over a 30-day period. Use statistical methods to identify outliers; for example, flag any domain request where the entropy score is in the 99th percentile or higher for the monitored environment. Correlate these high-entropy requests back to the originating device IP ('id.orig_h') to identify potential DGA activity from a mobile device."
          },
          {
            "description": "A mobile device is observed communicating with a domain that was very recently registered and has a low global popularity ranking, suggesting it was created for a specific, malicious purpose.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, and guest network segments used by mobile devices.",
            "action": "For each unique domain in Zeek dns.log, enrich the domain with WHOIS registration data to obtain the creation date and with a domain prevalence list (e.g., Tranco Top 1M). Create a simple scoring model: assign a high score to domains registered within the last 30 days and an additional high score to domains not appearing on the prevalence list. Sum these scores for a total risk rating. Isolate all connections from Zeek conn.log where the destination IP corresponds to a high-risk domain. Analyze the traffic patterns (e.g., connection duration, data volume, port) for these connections to identify potential C2 beacons."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]