[
  {
    "information_requirement": "Is an adversary using out-of-band channels for command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1644",
        "name": "Out of Band Data",
        "evidence": [
          {
            "description": "An Android application, not on a pre-defined whitelist, is granted 'Notification Access' permission and subsequently exhibits suspicious network behavior, such as communicating with known malicious domains, domains with high-entropy names, or an anomalous volume of outbound data.",
            "data_sources": [
              "MDM application inventory logs",
              "Android OS security logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed and BYOD Android devices, Mobile Device Management (MDM) servers, Network egress points, DNS resolvers, VPN concentrators",
            "action": [
              "Create a rule that triggers when an MDM log shows the 'Notification Access' permission grant for an application package name not on the approved whitelist. Upon trigger, query threat intelligence feeds for the package name and any domains the device connects to (from Zeek conn.log) within 24 hours. Alert if a match is found.",
              "For any device where a non-whitelisted app is granted 'Notification Access', monitor its subsequent DNS queries in Zeek dns.log. Calculate the Shannon entropy for all requested domain names. Alert if the entropy exceeds a dynamic threshold, such as the 98th percentile of all domain entropy scores in the last 7 days. Also, monitor the total outbound bytes (orig_bytes) in Zeek conn.log from the device and alert if it exceeds the 95th percentile of the device's 30-day baseline.",
              "Using Zeek conn.log, train a time-series forecasting model (e.g., Prophet or ARIMA) on the hourly count of new outbound connections per device to establish a behavioral baseline. After a 'Notification Access' grant event for a non-whitelisted app, if the observed connection count exceeds the model's forecasted upper confidence bound (e.g., 99% confidence interval) for two consecutive hours, generate a high-priority alert."
            ]
          },
          {
            "description": "An inbound SMS or MMS message on a managed device contains a URL linking to a known malicious or newly registered domain, or the message content itself has characteristics of automated or obfuscated text, such as abnormally high entropy.",
            "data_sources": [
              "MDM security event logs",
              "Carrier SMS/MMS detail records",
              "Threat Intelligence Feeds",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Telecommunication provider gateways for corporate mobile accounts, Corporate mobile devices, SIEM/Log aggregator, Threat Intelligence Platform",
            "action": [
              "Continuously parse inbound SMS/MMS logs from the MDM platform. Extract all URLs and compare their domains against a threat intelligence feed of malicious domains and a list of domains registered in the last 30 days. Alert on any match. Correlate alerts by checking Zeek conn.log for network connections from the recipient device to the flagged domain within 10 minutes of message receipt.",
              "For each inbound SMS/MMS, calculate the character-level Shannon entropy of the message body. Establish and maintain a rolling 30-day baseline (mean and standard deviation) of entropy scores for all messages organization-wide. Alert if a message's entropy score exceeds the baseline mean by more than 3 standard deviations, indicating potential obfuscation or machine-generated content.",
              "Implement a text classification model, such as a fine-tuned BERT model or a simpler Naive Bayes classifier, trained on a labeled dataset of smishing and benign messages. Score every new incoming SMS message based on features like message length, presence of URLs, special character count, and the entropy score. Generate a high-confidence alert for any message classified as malicious with a probability score above 0.95."
            ]
          },
          {
            "description": "A managed mobile device establishes a Bluetooth or NFC connection with an unauthorized peripheral, not on a pre-defined whitelist, while inside a sensitive, geofenced location, and this connection is associated with an anomalously large data transfer.",
            "data_sources": [
              "MDM security logs",
              "Mobile OS Bluetooth/NFC logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physically controlled spaces (e.g., executive suites, R&D labs), Corporate-managed mobile devices with Bluetooth/NFC enabled",
            "action": [
              "Define geofences for sensitive physical locations in the MDM platform and maintain a MAC address whitelist of approved Bluetooth/NFC peripherals. Create a real-time rule that generates a high-priority alert when an MDM log shows a device pairing with a non-whitelisted MAC address while the device's GPS coordinates are within a defined geofence.",
              "For each user, establish a 30-day rolling baseline of Bluetooth/NFC data transfer volume using MDM logs. Following a pairing event with a non-whitelisted device, monitor the size of any subsequent data transfer. Generate an alert if the transfer volume exceeds the 99th percentile of that user's historical baseline, suggesting unusual data movement.",
              "Aggregate Bluetooth pairing event logs (user, device MAC, paired MAC, location, timestamp, data transfer size) into a central repository. Apply a clustering algorithm like DBSCAN to identify anomalous behavior using features such as pairing frequency per user, number of unique devices paired within an hour, and location of pairings. Outlier points identified by the model, such as a user rapidly pairing with multiple unknown devices in a secure area, should trigger an investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]