[
  {
    "information_requirement": "Is an adversary leveraging compromised mobile devices to remove or deny access to corporate user accounts? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1640",
        "name": "Account Access Removal",
        "evidence": [
          {
            "description": "Anomalous account lockout or password reset activity originates from an IP address associated with a mobile device, potentially indicating an adversary is attempting to inhibit access to a legitimate user's account.",
            "data_sources": [
              "Windows Event ID 4740",
              "Windows Event ID 4724",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, VPN Concentrators, Internet Gateway",
            "action": "Continuously monitor Active Directory for Windows Event ID 4740 (A user account was locked out) and 4724 (An attempt was made to reset an account's password). For each event, extract the 'Source Network Address'. Correlate this IP with Zeek conn.log data to identify the connection history and user agent, if available, to confirm it is a mobile device. Create a baseline of normal lockout/reset activity per user over a 30-day period. Use statistical analysis to flag any user account that exceeds its 95th percentile for these events in a 24-hour window, especially if the source IP is from a mobile network or an unexpected geolocation. A high frequency of these events from a mobile source IP indicates a likely account access removal attempt."
          },
          {
            "description": "A mobile application makes an unusual volume or type of API calls to account management endpoints, such as those for password changes or account deletion, inconsistent with normal application behavior.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "API Gateway Servers, Web Application Firewalls (WAFs), Internet-facing application servers",
            "action": "Parse Zeek http.log to extract API endpoints (URIs), HTTP methods (POST, DELETE), and source IPs for requests targeting account management functions (e.g., '/api/v1/user/password', '/api/v1/account/delete'). For each user account or session token, establish a baseline of normal API call frequency and patterns. Use entropy scoring on the sequence of API calls from a single session or source IP; a sudden, high-entropy sequence or a high-velocity burst of calls to sensitive endpoints from a mobile IP range indicates potential programmatic abuse aimed at account removal or lockout. Correlate the source IP with Zeek conn.log to confirm the traffic originates from a mobile device."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]