[
  {
    "information_requirement": "Is an adversary attempting to deny access to mobile endpoints? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1642",
        "name": "Endpoint Denial of Service",
        "evidence": [
          {
            "description": "A mobile device is communicating with a known malicious Command and Control (C2) server associated with mobile malware that has Endpoint DoS capabilities.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek intel.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's Wi-Fi network egress points (Corporate and Guest)",
            "action": "Correlate network connections from mobile device IP address ranges (Zeek conn.log) against a threat intelligence feed of known malicious C2 domains/IPs, specifically those tagged as 'mobile malware' or 'DoS' (Zeek intel.log). Generate a high-priority alert for any matches, as this indicates direct communication with an infrastructure known to facilitate this attack."
          },
          {
            "description": "A mobile device exhibits anomalous DNS and network connection patterns, such as communicating with a newly registered domain or a domain generated by a DGA, immediately before the device becomes unavailable.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's DNS resolvers and internet gateway",
            "action": "For mobile device IP ranges, monitor for first-seen DNS requests to domains with low age or reputation (Zeek dns.log). Calculate the Shannon entropy of requested domain names to identify patterns consistent with Domain Generation Algorithms (DGAs). A high entropy score (e.g., > 3.5) for a requested domain is anomalous. Correlate high-entropy or low-reputation DNS requests with subsequent outbound connections (Zeek conn.log). A cluster of these indicators from a single device followed by a cessation of all network traffic from that device is a strong indicator of a potential DoS event."
          },
          {
            "description": "A mobile device communicates with domains or IP addresses known to host jailbreaking or rooting tools. This indicates the device is in a compromised, high-risk state and is vulnerable to advanced malware that can perform an Endpoint DoS.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek intel.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators and corporate Wi-Fi network segments",
            "action": "Maintain a watchlist of domains and IP addresses associated with common mobile device rooting (Android) and jailbreaking (iOS) tools. Ingest this list into a threat intelligence framework. Use Zeek's intel.log to generate an alert whenever a device on the mobile network segment (identified by IP range) attempts to resolve or connect to an indicator on this list. An alert signifies that a device's security posture has been severely weakened, making it a prime target for attacks like T1642."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]