[
  {
    "information_requirement": "Has an adversary achieved persistence by modifying a client software binary on a mobile device?",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1645",
        "name": "Compromise Client Software Binary",
        "evidence": [
          {
            "description": "A mobile device fails a remote attestation check, indicating a potential integrity violation of the system partition or critical software binaries.",
            "data_sources": [
              "Mobile Device Management (MDM) logs",
              "Google SafetyNet Attestation API logs",
              "Samsung Knox Attestation logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet and Mobile Device Management (MDM) Platform",
            "action": "Continuously ingest remote attestation results (e.g., SafetyNet, Knox) from the MDM platform. Establish a baseline of successful attestation rates across the device fleet. Create alerts for any device that fails an attestation check (e.g., `ctsProfileMatch` or `basicIntegrity` is false). For any failing device, use descriptive statistics to identify a cluster of failures (e.g., multiple devices of the same model/OS version failing simultaneously, suggesting a targeted campaign). Correlate the timestamp of the first failed attestation with network logs (Zeek conn.log) from that device's IP to search for anomalous connections (e.g., connections to rare domains, non-standard ports) that may have delivered the malicious binary or represent C2 activity."
          },
          {
            "description": "A standard system binary on a mobile device, which is not typically network-facing, initiates an external network connection, or a standard binary initiates connections to known malicious or statistically unusual destinations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN terminators, and Cloud Access Security Brokers (CASB)",
            "action": "Create an inventory of standard mobile OS processes and applications and their expected network behaviors. Monitor Zeek conn.log for connections originating from the managed mobile device IP space. For each connection, calculate the entropy of the destination domain name (from dns.log) and the prevalence of the destination IP/domain across the enterprise. Alert on connections from mobile devices to domains with high entropy or to IPs/domains that are statistically rare (e.g., seen by less than 1% of devices). Use time-series analysis to model the volume of outbound data per device and flag significant deviations from the established baseline (e.g., a 3-sigma increase in data transfer), which could indicate data exfiltration by a compromised binary."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]