[
  {
    "information_requirement": "Has an adversary performed an Endpoint Denial of Service attack against a mobile device? (TA0034 - Impact)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1642",
        "name": "Endpoint Denial of Service",
        "evidence": [
          {
            "description": "A network connection is observed in Zeek conn.log from a managed mobile device's IP address to a destination IP or domain that matches an entry in a threat intelligence feed categorized as mobile malware C2 infrastructure with Endpoint DoS capabilities (e.g., KeyRaider).",
            "data_sources": [
              "Zeek intel.log",
              "Zeek conn.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and Guest Wi-Fi network gateways, VPN concentrators, DNS resolvers, Mobile Device Management (MDM) platform.",
            "action": [
              "Create a SIEM rule that correlates Zeek intel.log with conn.log on the `uid` field. Trigger a high-severity alert when `intel.log$seen.where` is `Conn::IN_ORIG` or `DNS::IN_QUERY`, the source IP (`conn.log$id.orig_h`) is within a known mobile device IP range, and the `intel.log$meta.source` field contains tags such as 'mobile_malware', 'KeyRaider', or 'T1642'.",
              "For each mobile device, establish a 30-day rolling baseline of unique destination Autonomous System Numbers (ASNs) derived from the `id.resp_h` field in Zeek conn.log. Generate a medium-severity alert when a device initiates a connection to an ASN not present in its historical baseline. Enrich the alert by joining the destination ASN with a reputation service; elevate severity if reputation is 'malicious' or 'suspicious'. Further prioritize if the hourly connection count to the new ASN exceeds the 99th percentile for the device's peer group, defined as all devices with the same OS type and version.",
              "Train and deploy a supervised classification model (e.g., Gradient Boosting) to calculate a real-time risk score for each connection in Zeek conn.log originating from a mobile device. Engineer features including: `duration`, `proto`, `service`, `orig_bytes`, `resp_bytes`, `conn_state`, and enrichments like destination IP/ASN reputation, ASN geolocation, and the historical frequency of the destination IP for that specific device. A sustained score above a predefined threshold (e.g., > 0.9) for more than 3 consecutive connections should trigger an automated SOAR playbook to query the MDM via API for the device's owner, compliance status, and recent activity log."
            ]
          },
          {
            "description": "A managed mobile device's IP address generates a burst of DNS queries for domains exhibiting characteristics of Domain Generation Algorithms (DGA), such as high Shannon entropy (>3.5) or recent registration (<72 hours), immediately followed by a complete cessation of all network traffic from that IP in Zeek conn.log for a duration that is statistically anomalous for that device.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, network traffic monitoring points at internet gateways.",
            "action": [
              "Create a SIEM rule that triggers if a `query` in Zeek dns.log from a mobile IP is for a domain whose WHOIS registration date is less than 3 days old, based on enrichment from a passive DNS or domain intelligence source. The rule's second condition is that no subsequent network traffic is observed from that source IP (`id.orig_h`) in Zeek conn.log for a period of 15 minutes, which may indicate the device has been locked or disabled.",
              "In a streaming analytics platform, calculate the Shannon entropy for every `query` field in Zeek dns.log. For each mobile source IP (`id.orig_h`), maintain a 5-minute rolling window and count the number of queries with an entropy score > 3.5. If this count exceeds a threshold of 5, flag the IP as 'Potential DGA Activity'. As a second step, query Zeek conn.log to find the `ts` of the last connection from that IP. If the time since the last connection is greater than the 95th percentile of that device's historical 'time between sessions' (offline duration), generate a 'Potential Endpoint DoS' alert.",
              "Deploy a time-series anomaly detection model, such as an LSTM autoencoder, trained on 1-minute aggregations of network traffic metrics for each mobile device from Zeek conn.log. Features should include connection count, total bytes transferred (`orig_bytes` + `resp_bytes`), count of unique destination IPs, and protocol distribution. Generate a high-severity alert when the model's reconstruction error for the current time window exceeds a dynamically adjusted threshold (e.g., 3 standard deviations above the mean error), indicating a significant deviation from the learned normal pattern. Elevate the alert's priority if this anomaly consists of a sudden drop to zero activity and was preceded within the last 30 minutes by a 'Potential DGA Activity' flag for the same IP."
            ]
          },
          {
            "description": "A managed mobile device's IP address is observed in Zeek logs connecting to a domain or IP on a threat intelligence list of known rooting/jailbreaking sites, or the device's HTTP `User-Agent` string in Zeek http.log is statistically rare (e.g., <1% prevalence) compared to the population of managed mobile devices with the same OS and version.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek intel.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, web proxies, Mobile Device Management (MDM) platform.",
            "action": [
              "Ingest and tag a threat intelligence feed of domains and IP addresses associated with mobile device rooting and jailbreaking tools into the Zeek Intel Framework. Configure a SIEM rule to generate a critical alert upon a match in Zeek intel.log where `seen.where` is `Conn::IN_ORIG` or `DNS::IN_QUERY` and the source IP originates from the corporate mobile device DHCP range. The alert should trigger an automated query to the MDM API to check the compliance status of the device.",
              "On a daily basis, execute a batch job to aggregate and count all unique `user_agent` strings from Zeek http.log across the mobile device fleet, grouped by OS type (iOS/Android). Calculate the frequency percentage for each string within its OS group. Generate a 'Rare User-Agent' alert for any device reporting a user agent string with a frequency below 1%, as this can indicate non-standard browsers, custom applications used for jailbreaking, or malicious software impersonation.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to 24-hour network behavior profiles for each mobile device. Engineer features from Zeek logs, including: count of unique destination ports, ratio of UDP to TCP connections, average connection duration, total data transfer volume, count of distinct DNS servers queried, and the entropy of destination IP addresses. Devices that are identified as outliers (noise points in DBSCAN) are considered anomalous. Automatically cross-reference these anomalous devices with MDM compliance data to check for a 'jailbroken' or 'rooted' status, which elevates the risk associated with the anomaly."
            ]
          },
          {
            "description": "An audit event is logged by the Mobile Device Management (MDM) platform indicating either: (a) an application has been granted Device Administrator privileges on an Android device, or (b) a new, unsigned, or unexpected configuration profile has been installed on an iOS device, where the application's package name or profile's signing certificate is not on a pre-defined enterprise allowlist.",
            "data_sources": [
              "MDM Logs",
              "SIEM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform, Enterprise Mobility Management (EMM) server logs, SIEM.",
            "action": [
              "Forward all MDM audit logs to the SIEM. Create a high-priority rule that triggers for any 'Device Administrator Granted' event (Android) or 'Profile Installed' event (iOS) where the application package name or profile signing certificate does not match an entry in an enterprise-managed allowlist. The alert must include the device identifier, device owner, and a deep link to the device's page in the MDM console for immediate investigation.",
              "From MDM logs, establish a 90-day baseline of the rate of new application installations and profile modifications for each device and for peer groups (e.g., all devices in the 'Sales' department). Trigger an alert if the daily rate of these events for a single device exceeds its personal 99th percentile AND the peer group's 99th percentile. This dual condition reduces false positives from users who legitimately install many apps while highlighting abnormal velocity of configuration changes which may be automated and malicious.",
              "Develop and deploy a classification model (e.g., Random Forest) to assign a risk score to every newly installed application reported by the MDM. Train the model on historical data, labeling apps based on source, permissions, and known-good/known-bad status from threat intelligence. Features should include: number and category of permissions requested (e.g., Device Administrator, Accessibility Services, Location), application source (e.g., Google Play Store, Apple App Store, Sideloaded), prevalence across the device fleet, application age, and reputation of the developer/signer. An application receiving a 'high risk' classification should trigger an automated workflow to quarantine the device via MDM API and create a high-priority incident ticket for the security team."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]