[
  {
    "information_requirement": "Is an adversary leveraging compromised mobile devices to remove or deny access to corporate user accounts? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1640",
        "name": "Account Access Removal",
        "evidence": [
          {
            "description": "A user account experiences a count of lockouts (Windows Event ID 4740) or password reset attempts (Windows Event ID 4724) that exceeds the 99th percentile of the user's individual 30-day baseline, where the source IP address is correlated via Zeek conn.log to an ASN belonging to a mobile network provider, and the device context (e.g., user-agent from Zeek http.log) is inconsistent with the user's established device profile stored in the Mobile Device Management (MDM) platform.",
            "data_sources": [
              "Windows Event ID 4740",
              "Windows Event ID 4724",
              "Zeek conn.log",
              "Zeek http.log",
              "MDM Device Logs",
              "Cloud Identity Provider Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, VPN Concentrators, Internet Gateway, Mobile Device Management (MDM) Platform, Cloud Identity Provider (e.g., Azure AD, Okta)",
            "action": "1. Symbolic Detection: In a SIEM, create a rule that joins Windows Event ID 4724 (password reset attempt) and 4740 (account lockout) on 'TargetUserName' and 'Source Network Address'. Trigger a high-severity alert if Event ID 4724 is followed by Event ID 4740 for the same user within a 60-second window. As an automated enrichment, query Zeek conn.log using the source IP to retrieve the ASN. The alert should fire only if the ASN belongs to a watchlist of mobile network providers. A final enrichment step queries MDM logs; if the device initiating the request is not the user's registered compliant device, escalate alert priority to critical. 2. Statistical Detection: For each user, ingest Windows event logs (4740, 4724) and cloud identity provider logs into a time-series database. Establish a 30-day rolling baseline of hourly event counts for each user and calculate the 99th percentile. Generate a medium-severity alert if the current hourly count for a user exceeds this percentile. Upon alert, automatically enrich with the source IP's ASN (from Zeek conn.log) and user-agent (from Zeek http.log). If the ASN is a mobile carrier and the user-agent is either new for the user or inconsistent with their MDM device profile, escalate the alert severity to high. 3. Machine Learning Detection: For each user, train a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) on event counts (4724, 4740) aggregated in 5-minute intervals. Features should include the event count, time of day and day of week (encoded cyclically), and a binary feature for 'business hours'. An anomaly flagged by the model triggers an enrichment workflow that gathers the source IP's ASN (Zeek conn.log), geolocation, and user-agent (Zeek http.log). A risk score is calculated using a weighted sum based on: (1) the anomaly score from the model, (2) a flag if the ASN is a mobile provider, (3) a flag if the geolocation is rare for the user, and (4) a flag if the device is not registered in the MDM. A cumulative score exceeding a predefined threshold is flagged as a high-confidence event."
          },
          {
            "description": "A source IP address, associated with a mobile network provider via its ASN in Zeek conn.log, generates a volume of HTTP POST or DELETE requests to critical account management API endpoints (e.g., password reset, account deletion, MFA revocation) that exceeds the 99th percentile of the 30-day request rate baseline for all source IPs accessing that specific endpoint.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "WAF Logs",
              "API Gateway Logs",
              "Cloud Identity Provider Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "API Gateway Servers, Web Application Firewalls (WAFs), Internet-facing application servers, Cloud Identity Provider Logs, Microservice infrastructure hosting account management functions",
            "action": "1. Symbolic Detection: Maintain a watchlist of critical API URI paths (e.g., '/api/v1/user/delete', '/api/v2/account/password', '/auth/revoke-sessions'). Ingest Zeek http.log and API Gateway logs. Create a high-severity alert for any HTTP DELETE or POST request to a watched endpoint where the source IP's ASN (from Zeek conn.log) is on a mobile network watchlist and the API request's authentication token (e.g., JWT) lacks a claim indicating recent successful multi-factor authentication. This requires a SIEM or script capable of parsing JWTs from Authorization headers. 2. Statistical Detection: For each critical API endpoint, establish a 30-day baseline of request counts per source IP in 5-minute windows and calculate the 99th percentile. Generate a medium-severity alert if a source IP, identified as mobile via its ASN, has a request rate exceeding this threshold. Concurrently, for each mobile source IP, calculate the Shannon entropy of the requested URI paths in 5-minute windows. A sudden drop in entropy below a baseline threshold (e.g., entropy score < 1.0), indicating repetitive, programmatic requests, combined with a high request rate for the same IP, should escalate the alert to high severity. 3. Machine Learning Detection: Implement an Isolation Forest or Local Outlier Factor (LOF) model to detect anomalous API access patterns. For each HTTP request to a sensitive endpoint, create a feature vector including: URI path (using a hashing vectorizer), HTTP method (one-hot encoded), request body length, user-agent string (hashing vectorizer), time since last request from the same IP, and the source IP's ASN. Train the model on a baseline of known-good traffic. Any request flagged as an outlier, particularly POST or DELETE requests from an IP associated with a mobile ASN, should be escalated for immediate investigation. The model's anomaly score can be used to prioritize alerts for analyst review."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]