[
  {
    "information_requirement": "Is an adversary using masquerading techniques on corporate mobile devices to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1655.001",
        "name": "Match Legitimate Name or Location",
        "evidence": [
          {
            "description": "An application installed on a mobile device has a display name (e.g., 'Settings') or package name (e.g., 'com.google.androld.gms') that mimics a legitimate, trusted application but possesses a different digital signature or is not on an approved application allowlist.",
            "data_sources": [
              "Mobile Device Management (MDM) Application Inventory Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet",
            "action": "Ingest application inventory logs from the Mobile Device Management (MDM) platform, ensuring fields for device ID, application display name, package name, and signer certificate details are parsed. Create and maintain an allowlist of known-good tuples (package_name, signer_certificate) for common system and corporate applications. Group all installed applications by display name. For any group containing more than one unique package name or signer, flag it for immediate review. Use a string similarity algorithm (e.g., Levenshtein distance) to compare all installed package names against the allowlist; flag any name with a distance greater than 0 but less than a threshold of 3 as potential typosquatting."
          },
          {
            "description": "A mobile application identified as potentially masqueraded exhibits anomalous network behavior, such as communicating with unusual, high-entropy, or known-malicious domains not associated with the legitimate application it impersonates.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Mobile Device Management (MDM) Application Inventory Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for mobile devices",
            "action": "Correlate MDM inventory data with network logs by joining on device ID and source IP address (assuming a reliable IP-to-device mapping). For applications flagged as potentially masqueraded, isolate their corresponding network traffic. Analyze DNS requests (Zeek dns.log) from these applications. Calculate the entropy of the queried domains; flag domains exceeding a high percentile (e.g., 95th) of entropy scores across the organization. For all connections (Zeek conn.log), establish a baseline of typical destination ports and data volumes for the legitimate applications being impersonated. Use descriptive statistics to flag connections from a suspected masqueraded app that deviate more than two standard deviations from the legitimate application's baseline behavior."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]