[
  {
    "information_requirement": "Is an adversary using masqueraded applications or files on mobile devices to evade defenses? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1655",
        "name": "Masquerading",
        "evidence": [
          {
            "description": "A mobile device, identified by its OS in the HTTP User-Agent string, generates an outbound network connection where: (1) the destination IP or domain is present on a C2 threat intelligence list; (2) the requested domain in the corresponding DNS query has a Shannon entropy score greater than 3.5, suggesting DGA; or (3) the connection's outbound data volume and destination port are both statistical outliers when compared to a 30-day baseline for that specific device (e.g., >3 standard deviations from the mean).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi Network Egress Points, VPN Concentrators, DNS Resolvers, Cloud Access Security Brokers (CASBs), Mobile Device Management (MDM) Platforms",
            "action": [
              "Query Zeek dns.log and conn.log for connections from mobile device IP ranges to destination domains or IPs on a C2 threat intelligence feed. Join with http.log using the connection UID to retrieve the User-Agent and alert on matches.",
              "For each mobile device (identified by IP or MDM-provided hostname), establish a baseline of network behavior including the 95th percentile of outbound data volume (orig_bytes in conn.log) and the set of common destination ports. Calculate the Shannon entropy for all DNS queries in dns.log. Alert when a device exceeds its data volume baseline, uses a port outside its common set, or makes a DNS query with an entropy score over 3.5.",
              "Train a time-series forecasting model (e.g., ARIMA) on total outbound data volume per mobile device to detect anomalous spikes. Concurrently, apply an unsupervised clustering algorithm (e.g., DBSCAN) to network connection features (duration, protocol, service, orig_bytes, resp_bytes, dest_port) from conn.log to identify connections that are statistical outliers, which may indicate masquerading."
            ]
          },
          {
            "description": "A file is transferred to a mobile device where the filename extension (e.g., .pdf, .jpg) is inconsistent with the true file type identified by Zeek's file analysis, which reports a mobile application package mime_type ('application/vnd.android.package-archive' or 'application/x-itunes-ipa').",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organizational Internet Gateway, Web Proxies, Email Gateways, Cloud File Storage Services, Mobile Device Management (MDM) Platforms",
            "action": [
              "Create a detection rule that joins Zeek files.log with conn.log on the connection UID. Alert when files.log shows a mime_type of 'application/vnd.android.package-archive' or 'application/x-itunes-ipa' and the filename does not end in '.apk' or '.ipa', respectively, for connections originating from the mobile device IP address space.",
              "For each user, establish a 30-day baseline of the count of file downloads where the filename extension does not match the MIME type's common extension (e.g., '.jpg' for 'image/jpeg'). Calculate the 99th percentile for this mismatch count across all users. Alert when an individual user's daily mismatch count exceeds this organizational threshold.",
              "Develop a supervised classification model (e.g., Random Forest) using features from files.log and http.log (mime_type, filename extension, file size, source IP reputation, ASN, Referer header) to predict a 'masquerade_risk_score'. Automatically generate alerts for file transfers with a predicted score above a defined threshold (e.g., 0.8)."
            ]
          },
          {
            "description": "A high rate of failed authentication attempts (Windows Event ID 4625) for single or multiple accounts originates from a single IP address within the mobile device VPN address range, followed by a successful authentication (Windows Event ID 4624) from the same IP, indicating a successful brute-force or password spray attack from a compromised mobile device.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Authentication Servers, Domain Controllers, Active Directory, Identity and Access Management (IAM) Platforms, Internal File Servers",
            "action": [
              "Create a correlation rule that triggers when a single source IP from the mobile VPN pool generates over 10 failed logons (Windows Event ID 4625) within 5 minutes. Differentiate alerts between 'Potential Brute-Force' (same target user) and 'Potential Password Spray' (different target users).",
              "Establish an hourly baseline of failed logon counts (Event ID 4625) from the mobile VPN IP range. Use a moving average to monitor this metric and generate an alert when the current failure rate exceeds three standard deviations above the historical average for that time window.",
              "Deploy a UEBA model on authentication logs (Event IDs 4624 and 4625) to profile normal user behavior, including login times and systems accessed. Generate a high-risk anomaly alert when a user on the mobile VPN deviates significantly, such as generating numerous logon failures at an unusual time, followed by a successful login to a system they have never accessed before."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]