[
  {
    "information_requirement": "Is an adversary using masqueraded applications or files on mobile devices to evade defenses? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1655",
        "name": "Masquerading",
        "evidence": [
          {
            "description": "A mobile application, masquerading as a benign utility (e.g., calculator, flashlight), establishes network connections inconsistent with its purported function, such as communicating with a known malicious or newly registered domain.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi Network Egress Points",
            "action": "Identify IP address ranges for corporate mobile devices. Monitor Zeek dns.log for DNS queries originating from these IPs to domains with high Shannon entropy scores or those registered within the last 30 days. Correlate these DNS lookups with connection events in Zeek conn.log. Establish a baseline of normal network behavior (protocols, ports, destination categories) for legitimate, high-population mobile applications. Flag connections from mobile devices that deviate significantly from this baseline (e.g., an application with a user-agent for a calculator app using port 8080 to connect to a dynamic DNS domain)."
          },
          {
            "description": "A file downloaded to a mobile device has a misleading filename intended to trick the user into execution, such as an Android Application Package (APK) disguised as a document.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organizational Internet Gateway",
            "action": "Filter Zeek files.log for traffic involving mobile device IP ranges. For each file transfer, compare the filename extension against the 'mime_type' identified by Zeek. Create a high-risk alert for mismatches, especially where the mime_type is 'application/vnd.android.package-archive' (APK) but the filename ends in '.pdf', '.jpg', or '.docx'. Further analyze the corresponding http.log entry to check the User-Agent and Referer headers for additional context. Calculate the percentage of such mismatched files per user; a user with a statistically significant higher percentage (e.g., > 3 standard deviations from the mean) could be a specific target."
          },
          {
            "description": "A compromised mobile device, potentially infected via a masqueraded application, is used to attempt unauthorized access to internal Windows-based resources, indicating a pivot from mobile to the enterprise network.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators and Authentication Servers",
            "action": "Correlate external IP addresses from Zeek conn.log that are identified as belonging to mobile devices (e.g., from a known mobile carrier ISP or connecting to the VPN) with logon events on internal authentication servers. Specifically, monitor for a high frequency of failed logon attempts (Windows Event ID 4625) originating from a single mobile device's IP address over a short period. A rate exceeding a baseline threshold (e.g., >20 failures in 5 minutes) for protocols like RDP (port 3389) or SMB (port 445) from a mobile source IP is a strong indicator of a compromised device being used for lateral movement attempts."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]