[
  {
    "information_requirement": "Is an adversary exploiting client application vulnerabilities to achieve code execution on managed mobile devices? (TA0041 - Execution)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1658",
        "name": "Exploitation for Client Execution",
        "evidence": [
          {
            "description": "A mobile application process (e.g., com.apple.mobilesafari, com.google.android.gm) spawns an unexpected child process, such as a shell (/bin/sh), or establishes a network connection to a destination exhibiting multiple suspicious indicators simultaneously, such as being a newly registered domain (NRD), having a high-entropy name suggestive of a Domain Generation Algorithm (DGA), or belonging to a non-standard Top-Level Domain (TLD).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile EDR/MDM process logs",
              "Mobile OS crash logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, Cloud-based mobile security gateways, Mobile Device Management (MDM) servers, Endpoint mobile devices",
            "action": "1. (Symbolic) Query Zeek dns.log for requests originating from the mobile device IP address space. Join DNS queries against a threat intelligence list of known malicious domains and a dynamic list of domains registered within the last 30 days. Generate an alert for any match. Correlate alerts with Zeek conn.log data for the same source IP within a 2-minute window to confirm a connection was established to the suspicious domain. 2. (Statistical) From MDM/EDR process logs, create a baseline of all parent-child process relationships observed across the mobile fleet over a 30-day period. Calculate the frequency of each unique pair (e.g., 'com.apple.mobilesafari' -> '/bin/sh'). Alert on the execution of any process pair that falls into the rarest 1% of all observed pairs. Additionally, for each device, calculate the 95th percentile of hourly outbound data transfer volume from its 30-day Zeek conn.log history; alert if a device's outbound traffic in any given hour exceeds this personal threshold. 3. (Machine Learning) Apply a pre-trained Random Forest classification model to all new DNS requests and subsequent outbound connections from mobile devices. The model should use features such as: DNS query length, subdomain count, query string entropy, TLD frequency score, destination port, connection duration, outbound bytes, and the ratio of outbound to inbound bytes. Generate a high-severity alert for any connection classified as 'malicious' with a confidence score greater than 0.9."
          },
          {
            "description": "A mobile device reports a number of application or OS-level crashes (e.g., WebKit, SpringBoard) that is statistically anomalous compared to its peer group (same device model and OS version). This crash anomaly is temporally correlated within a 60-minute window of a non-sanctioned event, such as the installation of an application not present in the corporate app store or a configuration profile not deployed via MDM.",
            "data_sources": [
              "Mobile OS crash logs",
              "Mobile Device Management (MDM) application inventory logs",
              "Mobile Device Management (MDM) configuration profile logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) servers, Endpoint mobile devices, Corporate Wi-Fi network gateways",
            "action": "1. (Symbolic) Continuously monitor MDM application and configuration profile logs. Maintain an allow-list of approved application bundle IDs and profile identifiers based on the corporate app store and MDM policies. Generate an immediate alert upon the detection of any application or profile not on the allow-list. As automated enrichment, query the device's log history for any crash events (e.g., kernel_panic, segmentation fault) within the preceding 24 hours. 2. (Statistical) For each device cohort (defined by model and OS version), calculate a 30-day rolling baseline mean and standard deviation for the hourly crash rate from MDM crash logs. Generate an alert if any single device's hourly crash count exceeds three standard deviations above its cohort's mean. Following a crash alert, analyze the device's network traffic in Zeek conn.log for the subsequent 15 minutes. Escalate the alert if the device initiates a connection to a raw IP address (no preceding DNS query in dns.log) or if the outbound-to-inbound byte ratio exceeds the 98th percentile of the device's historical behavior. 3. (Machine Learning) Utilize a time-series anomaly detection model (e.g., LSTM or Prophet) to monitor the fleet-wide count of specific, critical crash types (e.g., 'WebKit Process Crash'). An anomalous spike across multiple devices sharing a common attribute (e.g., OS version, specific app installed) indicates a potential zero-day exploit campaign. Separately, apply an unsupervised clustering algorithm (e.g., DBSCAN) to MDM application inventory data, using features like app name string similarity, requested permissions count, signing certificate authority, and installation timestamp, to identify outlier applications that do not group with legitimate software."
          },
          {
            "description": "Peer-to-peer (P2P) traffic, specifically identified as Apple Wireless Direct Link (AWDL) via IPv6 link-local addressing (fe80::/10) and specific multicast groups, is detected between mobile devices on a corporate wireless segment where such traffic is not expected. This activity is followed within 5 minutes by a system crash, the execution of an unauthorized process, or a connection to an external command and control server.",
            "data_sources": [
              "Zeek conn.log",
              "Mobile OS crash logs",
              "Mobile EDR/MDM process logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, Endpoint mobile devices",
            "action": "1. (Symbolic) Deploy a SIEM rule to monitor Zeek conn.log for traffic on corporate wireless subnets that matches AWDL signatures (e.g., traffic to/from IPv6 link-local addresses in the fe80::/10 range, specific UDP/TCP ports associated with Apple services like AirDrop). Since enterprise policy typically disables this, generate an alert for any detected AWDL session. Correlate with MDM process logs to confirm no legitimate user-initiated app was active. 2. (Statistical) If limited P2P is permitted, establish a per-device 30-day baseline for P2P traffic, measuring total bytes and connection counts per hour. Generate an alert if a device's hourly P2P traffic volume or connection count exceeds the 99th percentile of its own historical distribution. Increase the alert priority if it is temporally correlated (within 5 minutes) with a crash log event or an anomalous process execution on the same device. 3. (Machine Learning) Employ an unsupervised anomaly detection model (e.g., Isolation Forest) on intra-WLAN connection data from Zeek conn.log. Use features including source/destination ports, protocol, connection duration, total bytes transferred, and connection state. Train the model on historical data to learn normal device-to-device communication patterns. A connection flagged with a high anomaly score, especially if it involves non-standard ports and is not associated with user-driven applications, could indicate a zero-click exploit attempt over a P2P link."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]