[
  {
    "information_requirement": "Is an adversary using legitimate remote access software for Command and Control on our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1663",
        "name": "Remote Access Software",
        "evidence": [
          {
            "description": "Network traffic from corporate mobile devices is observed communicating with known public domains or IP addresses associated with common remote access software (e.g., TeamViewer, AirDroid, AnyDesk).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Corporate DNS servers, Windows-based web proxies, VPN concentrators",
            "action": "Maintain and monitor a watchlist of domains associated with remote access software. Query Zeek dns.log and Windows DNS server logs for requests matching this list originating from mobile device IP subnets. For any matches, pivot to Zeek conn.log and Windows Event ID 5156 (Filtering Platform Connection Events on a proxy/gateway) to analyze the corresponding connections. Establish a baseline of authorized remote access software usage. Alert on connections to unapproved services or on connections exhibiting anomalous characteristics, such as unusually high data transfer volumes or long durations, by calculating the 95th percentile for these metrics and flagging outliers."
          },
          {
            "description": "A mobile device initiates a connection using a protocol commonly associated with remote access, such as VNC, but on a non-standard port to evade simple port-based firewall rules.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Network segments hosting corporate mobile devices",
            "action": "Utilize Zeek's dynamic protocol detection to identify VNC or RDP traffic regardless of the port used. Scan Zeek conn.log for long-lived TCP sessions with periodic, small data transfers (heartbeats) followed by bursts of traffic, characteristic of an interactive session. Calculate the entropy of destination ports used by each mobile device over a rolling time window; a sudden increase in entropy or the use of a statistically rare port for a high-volume connection is suspicious. Correlate findings with Zeek's notice.log for any protocol-specific alerts. Investigate any mobile device identified as running a remote access protocol on an unconventional port."
          },
          {
            "description": "A mobile device is observed receiving an inbound connection from an external source on a port associated with remote access software, suggesting it is configured to act as a host.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Demilitarized Zone (DMZ), Wi-Fi network segments",
            "action": "Filter Zeek conn.log and Windows Event ID 5156 logs (from a border gateway/firewall) for all inbound connection attempts (`id.orig_h` is external, `id.resp_h` is in the mobile IP range) to ports commonly used by remote access tools (e.g., 5900-5905 for VNC, 5938 for TeamViewer). Since corporate mobile devices should almost never accept direct inbound connections from the internet, any successful connection (`conn_state` is 'SF' in Zeek) on these ports is highly suspicious. Triage alerts by prioritizing connections from IP addresses with poor reputation scores or those originating from unexpected geographic locations."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]