[
  {
    "information_requirement": "Has an adversary exploited a software vulnerability to gain initial access to a mobile device? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1664",
        "name": "Exploitation for Initial Access",
        "evidence": [
          {
            "description": "A mobile device exhibits anomalous network behavior, such as communicating with known malicious command and control (C2) servers, using non-standard ports, or connecting to domains associated with exploit kits.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments and Internet gateway",
            "action": "Filter Zeek logs for traffic originating from mobile device IP ranges. For each device, establish a baseline of typical destination countries, autonomous systems, data transfer volumes, and protocols used. Use statistical analysis to flag significant deviations (e.g., > 3 standard deviations from the mean data transfer volume, or connections to a country for the first time). Cross-reference destination IPs and domains against threat intelligence feeds for mobile malware. Analyze DNS query entropy and domain age to identify potential connections to newly created malicious domains."
          },
          {
            "description": "A mobile device is observed downloading content consistent with known mobile exploits, such as specific file types from untrusted sources or traffic patterns matching a known zero-click exploit.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway and Guest Wi-Fi network",
            "action": "Monitor Zeek http.log for downloads of mobile application packages (.apk, .ipa) from URLs not associated with official app stores. In files.log, analyze extracted file hashes and compare them against known malware databases (e.g., VirusTotal). Hunt for traffic patterns matching public signatures of known exploits, such as unusual content types or server headers in HTTP traffic that are characteristic of an exploit kit landing page."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]