[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to mobile devices via phishing? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1660",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A network connection originates from a mobile device, identified by its User-Agent string in Zeek http.log, to a domain that was recently registered (e.g., less than 30 days via WHOIS data), has a high character entropy score (e.g., >3.5), and uses a Top-Level Domain (TLD) statistically uncommon for the organization (e.g., .xyz, .top).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log",
              "External WHOIS data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and guest Wi-Fi network segments, VPN concentrators, Mobile Device Management (MDM) logs, and network egress points.",
            "action": [
              "Monitor Zeek dns.log for queries originating from mobile device IP ranges to domains matching known phishing threat intelligence lists. Generate a high-severity alert upon a match, enriching the alert with the User-Agent from the corresponding Zeek http.log entry.",
              "For each DNS query from a mobile device IP range, calculate a risk score. Increment the score for: (1) domain Shannon entropy is above the 98th percentile of a 30-day baseline; (2) domain age from WHOIS data is less than 30 days; (3) the TLD is in the top 1% of rarest TLDs seen in the last 30 days. An aggregated score of 2 or more triggers an alert for analyst review. Correlate with Zeek http.log to confirm the User-Agent is a mobile browser.",
              "Deploy a pre-trained logistic regression model to classify DNS requests from mobile devices as benign or malicious. Use features including domain length, Shannon entropy, n-gram frequency profile, TLD rarity, number of dictionary words in the subdomain, and domain age. Generate an alert for analyst review when the model's output probability for a malicious classification exceeds a predefined threshold (e.g., 0.9)."
            ]
          },
          {
            "description": "A mobile device initiates a DNS query and subsequent HTTP/S connection to a domain that has not been observed across the enterprise in the last 30 days. The TLS certificate for the connection, observed in Zeek ssl.log, is issued by a free Certificate Authority for a subject name that does not match any known corporate or partner service, and the HTTP Referer header in Zeek http.log is either null or from a non-standard source.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring corporate and guest Wi-Fi networks, and VPN concentrators logging traffic from remote mobile devices.",
            "action": [
              "Scan Zeek ssl.log for TLS certificates from mobile device connections whose SHA1/SHA256 fingerprints match a threat intelligence feed of malicious certificates. Also, create rules to alert on certificates that are self-signed for external-facing domains or contain suspicious issuer strings (e.g., 'PhishCert', 'Acme-Phish').",
              "Maintain a 30-day baseline of all domains requested enterprise-wide. For each DNS query from a mobile device, if the domain is not in the baseline ('globally rare') and has been requested by fewer than 3 unique users in the past 24 hours ('locally rare'), flag it. Calculate the Jaccard similarity between the user's set of visited domains in the current session and their historical 30-day profile. A similarity score below 0.2 for a session involving a globally and locally rare domain indicates a high-risk anomaly requiring investigation.",
              "For each user, train a one-class SVM model on their typical network activity profile using features from Zeek logs (e.g., set of requested TLDs, server ports, protocols used, JA3/JA3S hashes, connection durations, data transfer volumes). Flag any new connection from the user's mobile device that the model classifies as an outlier for investigation, as it may indicate a 'quishing' redirect to an anomalous destination."
            ]
          },
          {
            "description": "A sequence of events occurs within a short time window (e.g., 5 minutes): 1) a mobile device resolves a known URL shortener domain; 2) the device connects to the resolved IP address over TLS, presenting a certificate with a short validity period (e.g., < 90 days) from a free Certificate Authority; 3) a successful authentication event (e.g., Windows Event ID 4624, Azure AD successful sign-in) is logged for the associated user from the same source IP address.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Azure AD Sign-in logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, Active Directory Domain Controllers, and cloud identity provider infrastructure (e.g., Azure AD, Okta).",
            "action": [
              "Maintain a list of known URL shortener domains. When a DNS request from a mobile device is made to one of these domains, track the final resolved IP address from Zeek dns.log. Query this IP against a threat intelligence feed of known phishing infrastructure. Generate a high-severity alert on a match and correlate with any subsequent authentication events from that source IP.",
              "From Zeek ssl.log for mobile device traffic, create a rule to flag connections where the TLS certificate meets multiple risk criteria: (1) validity period is in the bottom 5th percentile of observed durations (typically < 90 days), (2) the issuer is a known free Certificate Authority, AND (3) the server_name (SNI) field is a typosquatted or homoglyph variation of an internal or partner domain. When a connection is flagged, automatically query authentication logs (Windows Event ID 4624, Azure AD logs) for a successful login from the same source IP within the next 5 minutes and escalate upon finding one.",
              "Implement a two-stage detection. Stage 1: A Random Forest classifier, trained on features from Zeek logs (certificate validity, issuer, domain entropy, TLD rarity, connection duration, bytes transferred), flags high-risk network connections from mobile devices (probability > 0.9). Stage 2: A high-risk flag automatically triggers a real-time, time-bounded (5-minute window) search for a successful authentication event (Windows Event ID 4624 or cloud equivalent) from the same source IP. A match between the two stages generates a critical alert for immediate credential compromise response."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]