[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to mobile devices via phishing? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1660",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A mobile device, identified by its User-Agent string in Zeek http.log, connects to a domain that exhibits a combination of at least three high-risk characteristics: registration age under 30 days, character entropy greater than 3.5, a Top-Level Domain (TLD) in the top 1% of least common TLDs seen in corporate traffic (e.g., .xyz, .top), or is a known typosquat of a legitimate domain. This activity indicates a potential smishing or other mobile phishing attack.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic logs from corporate Wi-Fi access points, VPN concentrators, and network egress points. Cloud Access Security Broker (CASB) logs. Secure Web Gateway (SWG) logs. Logs from Mobile Device Management (MDM) platforms providing device context.",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Continuously monitor Zeek dns.log for requests to domains matching a high-confidence phishing domain threat intelligence feed (e.g., from a STIX/TAXII source). Generate a critical alert upon a match and cross-reference the source IP in Zeek conn.log to confirm it belongs to a mobile device IP range. 2. (Statistical) For all DNS requests from mobile IP address ranges, script a process to: 1. Calculate the Shannon entropy of the domain name. 2. Perform a WHOIS lookup to get the registration date. 3. Compare the TLD against a 30-day baseline of TLD frequencies. Create a risk score where Score = (1 if entropy > 98th percentile) + (1 if age < 30 days) + (1 if TLD in top 1% rarest). An alert is triggered for scores >= 2. Correlate with Zeek http.log to confirm the User-Agent is a mobile browser. 3. (Machine Learning) Implement a pre-trained domain generation algorithm (DGA) detection model or train a logistic regression classifier on DNS query data. Use features including domain length, Shannon entropy, n-gram frequency, TLD, and the number of dictionary words. A model output probability > 0.9 for a domain being malicious triggers an alert for analyst investigation and device quarantine via MDM."
          },
          {
            "description": "A mobile device initiates a DNS request for a domain never before seen across the enterprise ('globally rare'), followed by an HTTP/S connection. The domain itself has a high character entropy score (> 3.5) and the TLS certificate's server_name in Zeek ssl.log does not match any known enterprise service. This pattern suggests a user was redirected from a malicious QR code ('quishing').",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Proxy logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors (e.g., Zeek) monitoring corporate and guest Wi-Fi networks. VPN concentrators logging traffic from remote mobile devices. Proxy logs from Secure Web Gateways. MDM platforms that provide an inventory of installed applications to rule out legitimate traffic from newly installed apps.",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Scan Zeek ssl.log for TLS certificates matching known-bad SHA1/SHA256 fingerprints from threat intelligence or containing suspicious issuer strings like 'PhishCert', 'Acme Co Phishing', or self-signed certs for external domains. Generate an alert on any match originating from a mobile device IP. 2. (Statistical) Maintain a baseline set of all domains requested across the enterprise in the last 24 hours. For each new DNS request from a mobile device, check if the domain is 'globally rare' (not in the 24-hour set). If it is, and it is also 'locally rare' (only requested by one user in the last hour), flag it. Calculate the Jaccard similarity between the set of domains visited by the user in the current 5-minute session and their historical 30-day profile. A similarity score < 0.2 for a session containing a 'globally rare' domain indicates a high-risk deviation requiring investigation. 3. (Machine Learning) Deploy a one-class SVM (Support Vector Machine) model for each user, trained on their normal network activity profile (features: set of domains visited, protocols used, data volume patterns, typical session duration). A new connection from the user's mobile device that the model classifies as an outlier (i.e., falls outside the learned boundary) is flagged as an anomaly, potentially indicating a user was redirected via a QR code to a malicious site."
          },
          {
            "description": "A mobile device, identified by its User-Agent, resolves a known URL shortener domain, and the resulting IP address is then connected to via HTTP/S. The TLS certificate for this connection, observed in Zeek ssl.log, has a validity period of less than 90 days and was issued by a free Certificate Authority. This activity is followed within 5 minutes by a successful authentication event from the same source IP, suggesting a successful credential phishing attack.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "SSO Authentication Logs",
              "Cloud Identity Provider Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, email security gateway logs, corporate VPN concentrators, and authentication logs from Single Sign-On (SSO) servers. Cloud Identity Provider (e.g., Okta, Azure AD) audit logs.",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Maintain a watchlist of popular URL shortener domains (e.g., bit.ly, t.co). For DNS requests to these domains from mobile devices, track the final resolved IP address in Zeek dns.log. Query a real-time threat intelligence feed of malicious C2 or phishing infrastructure for this IP. Generate a high-priority alert on a match. 2. (Statistical) From Zeek ssl.log for traffic from mobile IP ranges, profile TLS certificate attributes. Generate an alert if a connection uses a certificate where: (1) the validity duration is in the bottom 5th percentile (typically < 90 days), (2) the issuer is a known free CA (e.g., Let's Encrypt, ZeroSSL), AND (3) the server_name contains a typosquatted or confusingly similar variation of a corporate brand or service (e.g., 'microsft-login'). 3. (Machine Learning) Train a Random Forest classifier to predict malicious connections. Use features from Zeek logs (e.g., from ssl.log: cert_validity_length, issuer_is_free_ca, self_signed_status; from dns.log: domain_entropy, tld_rarity; from conn.log: connection_duration, bytes_transferred). Correlate high-probability alerts from the model with subsequent successful authentication events from the same source IP in SSO/Cloud Identity logs within a 5-minute window to prioritize incidents indicating potential credential compromise."
          }
        ]
      }
    ],
    "version": "1.3",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]