[
  {
    "information_requirement": "Has an adversary leveraged Autorun functionality or virtual disk images to execute malicious code on an ICS system? (PIR)",
    "tactic_id": "TA0104",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T0895",
        "name": "Autorun Image",
        "evidence": [
          {
            "description": "Evidence of a process created from removable media within 30 seconds of the media being mounted on an ICS endpoint. The process is launched from a non-fixed drive (e.g., E:\\), its parent process is explorer.exe, cmd.exe, or svchost.exe, and the executable's hash matches a known threat, is unsigned, or has a filename entropy score exceeding the 98th percentile for the host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Windows System Log Event ID 12",
              "Windows System Log Event ID 1006",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical USB ports on Windows-based Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), data historians, and any servers within the Process Control Network (PCN) or ICS DMZ. Includes endpoints used for device programming or maintenance updates.",
            "action": [
              "Create a SIEM correlation rule that joins a removable device insertion event (Windows System Log Event ID 12 or 1006) with a process creation event (Windows Event ID 4688 or Sysmon Event ID 1) on the same host within a 30-second window. Alert if the new process path is on a non-fixed drive and the executable's hash matches a known malicious IOC from a threat intelligence feed, or if the executable is unsigned and an 'autorun.inf' file was created on the same drive (Sysmon Event ID 11) just prior to execution.",
              "For any process launched from removable media, calculate the Shannon entropy of its filename. Compare this value against a 30-day rolling baseline of filename entropy for all executables on that host class (e.g., HMIs). Generate an alert if the entropy score exceeds the 98th percentile. Concurrently, monitor network connections (Zeek conn.log) from the host for five minutes following the process execution and alert if the number of new, unique destination IP:port combinations exceeds the 99th percentile of the host's normal hourly rate.",
              "Train a binary classification model (e.g., Random Forest) using historical process creation events (Sysmon Event ID 1) as input. Feature engineer variables including: parent process name, command-line length, executable path entropy, a boolean for being unsigned, and a boolean indicating if the process launched from removable media within 30 seconds of a mount event. Label known-good and known-bad (e.g., from past incidents or sandboxing) events. Deploy the model to score new processes in real-time and alert on any process with a 'malicious' prediction probability above 0.85, especially when originating from removable media."
            ]
          },
          {
            "description": "Evidence of a process created from a newly mounted virtual disk image on a guest VM within 60 seconds of the mount event. The process creation is followed by network activity that is anomalous for the VM, such as connections to blocklisted IPs, DNS queries for domains with low reputation or low Jaccard similarity to historical queries, or a data egress volume in the top 5th percentile.",
            "data_sources": [
              "Hypervisor API logs (e.g., vSphere, Hyper-V)",
              "Windows System Log Event ID 15",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Sysmon Event ID 22",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Virtualization hosts (hypervisors) managing guest VMs in the ICS DMZ or Process Control Network. Specific targets include virtualized HMIs, EWS, data historians, and domain controllers. Also includes VM templates, golden images, and network egress points monitoring traffic from the virtualization cluster.",
            "action": [
              "Create a SIEM correlation rule that joins a hypervisor 'virtual disk attach' event with a guest OS disk initialization event (Windows System Log Event ID 15). Alert if this is followed within 60 seconds by a process creation event (Sysmon Event ID 1) from the new disk volume, and that process subsequently initiates a network connection (Sysmon Event ID 3 or Zeek conn.log) to an IP address present on a threat intelligence blocklist.",
              "For any process launched from a newly mounted virtual disk, analyze its subsequent DNS queries (Sysmon Event ID 22 or Zeek dns.log). Calculate the Jaccard similarity index between the set of domains queried in the first 10 minutes and the set of all unique domains queried by that VM over the past 30 days. Alert if the score is below 0.10. Additionally, analyze associated network flows (Zeek conn.log) and alert if the ratio of outbound bytes to inbound bytes ('orig_bytes' / 'resp_bytes') exceeds the 95th percentile for that VM's historical connections.",
              "For critical ICS VMs (e.g., EWS, Historians), deploy a multivariate time-series anomaly detection model (e.g., Isolation Forest or VAE). Aggregate the following metrics into 1-minute time windows: count of process creations, count of network connections, total bytes sent, count of unique DNS queries, and a binary flag indicating if a virtual disk was mounted in that window. After training on a 30-day baseline of normal activity, alert on any time window that receives an anomaly score in the top 1%, prioritizing alerts where the 'vdisk_mounted_in_window' flag is true."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "AI Assistant"
    ]
  }
]