[
  {
    "information_requirement": "Has an adversary begun active internal reconnaissance by enumerating remote systems on the network?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1018",
        "name": "Remote System Discovery",
        "evidence": [
          {
            "description": "A process execution event (Windows Event ID 4688) on a host, correlated with network traffic from the same host (Zeek logs), where the process name, file hash, or command-line arguments match a known non-native remote discovery tool (e.g., Nmap, Advanced IP Scanner), or the network traffic (e.g., Zeek http.log User-Agent) exhibits signatures unique to such tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints and servers across all user and data center subnets, with a focus on ingress/egress points, DMZ servers, and developer workstations where such tools might be illegitimately staged or used.",
            "action": [
              "Query for process creation events (Windows Event ID 4688) where the ProcessName or OriginalFileName matches a watchlist of unauthorized discovery tools (e.g., 'nmap.exe', 'masscan.exe', 'Advanced_IP_Scanner.exe') or where the file hash is present in a threat intelligence feed. Correlate with Zeek http.log to find matching User-Agent strings (e.g., 'Nmap Scripting Engine').",
              "Over a 30-day rolling window, calculate the prevalence of each executable name across all endpoints. Generate an alert for any process execution that falls below the 1st percentile of prevalence, indicating a rare tool. Enrich alerts with process parent, user context, and command-line arguments for prioritization.",
              "Utilize a pre-trained classification model (e.g., Random Forest) that ingests features from process execution events (e.g., parent process name, command-line length and entropy, user context, binary signing status). Flag any process classified as a 'Discovery Tool' with a confidence score above 0.9 for analyst review."
            ]
          },
          {
            "description": "A single source host executes native discovery utilities (e.g., ping.exe, net.exe, arp.exe, tracert.exe) with characteristics indicative of automation or scripting. These include high frequency of execution, iterative or patterned arguments targeting subnets, execution from a non-interactive or unusual parent process (e.g., wmiprvse.exe, svchost.exe), or execution by a service account outside of expected administrative scripts.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, with heightened monitoring on critical assets like Domain Controllers, application servers, bastion hosts, and administrator workstations.",
            "action": [
              "Create a detection rule for process creation events (Windows Event ID 4688) where the process is 'net.exe' and the command line contains 'view', '/domain', or 'group \\\"Domain Computers\\\"', and the parent process is not 'explorer.exe' or 'cmd.exe'. This indicates non-interactive enumeration.",
              "For each host, establish a 30-day baseline of the hourly execution count for 'ping.exe', 'net.exe', and 'arp.exe'. Alert if the execution count in any given hour exceeds three standard deviations from the host's historical average for that specific hour-of-day and day-of-week. Correlate with Zeek conn.log to confirm a fan-out of ICMP or other connection attempts.",
              "Apply a clustering algorithm (e.g., DBSCAN) to group hosts based on feature vectors of their command-line usage for native utilities (e.g., command frequency, argument patterns, time-of-day usage). Investigate hosts that are classified as noise or fall into very small, distinct clusters as potential anomalous activity."
            ]
          },
          {
            "description": "Execution of PowerShell (Event ID 4104) or WMI (Event ID 4688 for wmic.exe) containing commands or queries designed to enumerate remote systems. This includes testing connectivity to a range of hosts (e.g., Test-Connection), querying system information from multiple targets (e.g., Get-CimInstance with a list of computers), or resolving multiple hostnames (e.g., Resolve-DnsName), especially when initiated by a non-administrative user, a service account, or a web server process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, particularly those with PowerShell Remoting or WMI enabled for remote management, such as application servers, management servers (e.g., SCCM), Domain Controllers, and Exchange servers.",
            "action": [
              "Create a detection rule for PowerShell script block logs (Event ID 4104) that contain discovery-related cmdlets (e.g., 'Test-Connection', 'Get-CimInstance', 'Resolve-DnsName') where the target computer name argument contains a variable (e.g., '$computers'), a 'Get-Content' call, or a list of more than 10 comma-separated hostnames, indicating scripted enumeration.",
              "For 'powershell.exe' and 'wmic.exe' process execution events, calculate the Shannon entropy of the command-line arguments. Establish a baseline of typical entropy values for administrative scripts. Alert when a command-line's entropy score is an outlier (e.g., > 95th percentile), particularly for arguments following '-ComputerName' or '/node:', which may indicate an obfuscated or programmatically generated list of targets.",
              "Implement a time-series anomaly detection model (e.g., ARIMA, Prophet) to monitor the volume of outbound PowerShell Remoting (port 5985/5986) and WMI/RPC (port 135 and high ports) connections per host. A sudden, sharp spike in this activity from a host that is not a designated administrative server is a strong indicator of malicious discovery."
            ]
          },
          {
            "description": "A single source host generates a high volume of connection attempts to many unique internal destination IPs on a single port (horizontal scan) or to a single destination IP on many unique ports (vertical scan). This activity is often characterized by a high ratio of failed-to-successful connections (e.g., TCP Resets seen in Zeek conn_state 'REJ' or 'RSTO') or connections that do not complete a full handshake.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switch span/tap ports, internal network segment gateways, virtual network taps in the cloud, and data center distribution layer switches.",
            "action": [
              "Using Zeek conn.log, trigger an alert if a single source IP ('id.orig_h') generates connections with a 'conn_state' of 'REJ' or 'RSTO' to more than 50 unique internal destination IPs ('id.resp_h') on the same destination port ('id.resp_p') within a 1-minute window. Also monitor Zeek's notice.log for 'Scan::Address_Scan' or 'Scan::Port_Scan' notices.",
              "In 5-minute windows, calculate a 'scan score' for each internal source IP using the formula: $$ score = (count(distinct id.resp_h) * count(distinct id.resp_p)) / (count(total_connections) + 1) $$. Establish a baseline for this score across all hosts and alert when any host's score exceeds the 99th percentile of the enterprise-wide distribution.",
              "Train a one-class SVM (Support Vector Machine) on feature vectors derived from normal 5-minute host traffic windows in Zeek conn.log (e.g., connection count, destination IP entropy, destination port entropy, protocol mix, mean connection duration). Use the trained model to classify new traffic windows; traffic that the model classifies as an outlier indicates anomalous behavior consistent with network scanning."
            ]
          },
          {
            "description": "A 'fan-out' connection pattern where a source IP, within 15 minutes of a successful remote user logon (Windows Event ID 4624 with Logon Type 3 for network or 10 for RemoteInteractive), initiates connections to an abnormally high number of unique internal systems on common administrative or service ports (e.g., 135/RPC, 139/NetBIOS, 445/SMB, 3389/RDP).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for logon events), VPN Concentrators, Bastion Hosts, and internal network segment gateways (for correlated network traffic).",
            "action": [
              "Correlate successful remote logons (Windows Event ID 4624 with Logon Type 3 or 10) with subsequent network activity from the logon's source IP address (from Zeek conn.log). Alert if, within 10 minutes of the logon, the host initiates connections to more than 20 unique internal IP addresses on ports 135, 139, 445, or 3389.",
              "For each user account, build a historical profile of their 'post-login fan-out' behavior, measured as the number of unique internal systems they connect to within 15 minutes of an initial logon. Alert if a user's fan-out count for a new session exceeds four standard deviations from their personal historical average or the 98th percentile of all users.",
              "Model host-to-host communications as a directed graph where nodes are hosts and edges are connections. Upon a new remote logon, monitor for graph structure changes. Use a graph-based anomaly detection algorithm to score the structural change, flagging rapid, high-degree outbound edge creation from the source host's node as anomalous behavior indicative of discovery."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]