[
  {
    "information_requirement": "Is an adversary attempting to discover sensitive information on our corporate mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1420",
        "name": "File and Directory Discovery",
        "evidence": [
          {
            "description": "An application on a managed Android device exhibits a high volume of file access activity inconsistent with its established baseline. This is specifically defined as accessing over 100 unique file paths in external storage within a 5-minute window, where this rate exceeds the application's 99th percentile baseline, or the process accesses more than 10 files with extensions indicative of sensitive data (e.g., .kdbx, .pem, .gnucash).",
            "data_sources": [
              "MTD/EDR file access logs (fields: process_name, file_path, timestamp, operation_type)",
              "Android logcat (filtered for 'FileAccess' or 'Vold' tags)",
              "Zeek files.log (fields: tx_hosts, rx_hosts, conn_uids, source, filename)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/MTD/UEM management consoles aggregating endpoint telemetry from corporate-owned or managed Android devices. Specific focus on devices assigned to executives or users with privileged access. Centralized SIEM platform for log correlation and analysis.",
            "action": [
              "Implement a SIEM detection rule that triggers a high-severity alert when a process not present on the corporate application allow-list performs file read operations on more than 10 distinct file paths ending in sensitive extensions (.kdbx, .pem, .bak, .sql, .db, .mdf) within a 5-minute window. The rule must enrich the alert with device owner and compliance status from the MDM/UEM platform.",
              "For each managed application, create a scheduled job to ingest MTD/EDR file access logs and calculate the 99th percentile of unique file paths accessed per hour over a 30-day rolling window. Generate a medium-severity alert if an application's hourly file access count exceeds this dynamically calculated threshold. Additionally, calculate the Shannon entropy of the parent directory names accessed by a process in a 5-minute window; a score exceeding the application's historical 95th percentile entropy score should trigger a separate alert, indicating potential directory traversal or enumeration.",
              "Deploy an Isolation Forest anomaly detection model to analyze endpoint file access events in near-real-time. Engineer features for each 5-minute window per process, including: count of file reads, count of file writes, count of directory listings, ratio of directory listings to file reads, average file path depth, and Shannon entropy of file extensions accessed. Train the model on a labeled dataset of 'benign' application behavior. An anomaly score below a predetermined threshold (indicating a deviation from the norm) should automatically flag the process and device for tier-2 SOC investigation."
            ]
          },
          {
            "description": "A user grants a high-risk storage permission, such as `android.permission.READ_EXTERNAL_STORAGE` or `android.permission.MANAGE_EXTERNAL_STORAGE`, to an application under suspicious circumstances. These circumstances include the application not being on the corporate allow-list, having been installed from an untrusted source (sideloaded), or possessing a functional category (e.g., 'Calculator') that is incongruous with the need for broad file system access.",
            "data_sources": [
              "MDM application inventory logs (fields: device_id, package_name, permissions_granted, source)",
              "MTD security policy violation events (fields: device_id, policy_name, event_timestamp)",
              "Google Play Store API for application metadata",
              "MDM logs detailing application source"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/UEM platform, MTD management console, and the internal repository defining the corporate application allow-list. Centralized SIEM for correlation and alerting. Threat intelligence platform for enriching application package names with reputation data.",
            "action": [
              "Configure the MDM/UEM to send a high-priority alert to the SIEM whenever a permission state change to 'GRANTED' is logged for `android.permission.MANAGE_EXTERNAL_STORAGE`. Create a SIEM correlation rule that fires if the application's `package_name` is NOT in the 'approved_applications' reference set OR the application's `source` field is 'Sideloaded'. This alert should be assigned to the SOC queue for immediate review.",
              "On a daily basis, execute a query to aggregate MDM permission grant logs by application category. For each category (e.g., 'Productivity', 'Communication'), establish a baseline rate of storage permission grants per 1000 devices. Generate a medium-severity alert if any single application's grant rate spikes to more than three standard deviations above its category's 30-day moving average, suggesting a possible trojanized update or targeted campaign.",
              "Develop and periodically retrain a logistic regression classifier to produce a dynamic 'Application Risk Score' from 0 to 1. Features for the model should include: application source (one-hot encoded: Managed Play Store, Public Play Store, Sideloaded), developer reputation score (from TI feed), total number of requested permissions, and a binary flag for `MANAGE_EXTERNAL_STORAGE` request. An event where a storage permission is granted to an app with a predicted risk score > 0.8 should trigger an automated response, such as device quarantine via MDM API call."
            ]
          },
          {
            "description": "Following a precursor mobile security alert (e.g., 'Anomalous File Access' or 'High-Risk Permission Grant') on a device, the same device initiates outbound network connections resulting in a total data transfer (sum of `orig_bytes` and `resp_bytes`) exceeding 50MB within a 60-minute window. The activity is considered strong evidence of exfiltration if the destination FQDN or IP address has not been observed in connection logs for that user's devices in the preceding 30 days.",
            "data_sources": [
              "Zeek conn.log (fields: id.orig_h, id.resp_h, orig_bytes, resp_bytes, duration)",
              "Zeek dns.log (fields: id.orig_h, query, answers)",
              "VPN access logs",
              "MTD/EDR network flow logs (fields: source_ip, dest_ip, bytes_out, process_name)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors (e.g., Zeek) monitoring traffic from the corporate Wi-Fi SSID, VPN concentrator egress points, and CASB proxies. DNS resolver logs. All logs should be aggregated in a central SIEM for correlation.",
            "action": [
              "Create a stateful SIEM correlation rule that triggers when an alert with `tag=mobile_discovery` is generated for a specific `device_ip`. The rule should then monitor network logs for the next 60 minutes where `source_ip` matches `device_ip`. Generate a critical-severity alert if the `destination_ip` or resolved `dns_query` from this traffic matches any entry in a high-confidence threat intelligence feed of C2 servers or known exfiltration endpoints. The alert must contain details from both the initial and the correlated event.",
              "Upon a `tag=mobile_discovery` alert for a `device_ip`, initiate an automated query. First, establish a 30-day baseline of destination FQDNs from `Zeek dns.log` for that user. Second, query `Zeek conn.log` for all connections from the `device_ip` in the subsequent hour. Alert if any connection's destination FQDN is not in the user's historical baseline (a 'new' destination). Concurrently, sum the `orig_bytes` for all outbound connections in that hour and alert if the total volume exceeds the user's 98th percentile for hourly outbound data, calculated from a 30-day rolling window.",
              "For each user, maintain a time-series forecasting model (e.g., Prophet) trained on their historical hourly outbound data volume (sum of `orig_bytes` from `Zeek conn.log`). When a `mobile_discovery` precursor alert triggers, monitor the user's actual outbound data volume for the next hour. If the actual volume exceeds the model's forecasted upper confidence interval (`yhat_upper`), this indicates a statistically significant anomaly. This event should be treated as a strong indicator of data exfiltration and trigger a high-severity alert for immediate SOC analysis."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]