[
  {
    "information_requirement": "Is an adversary attempting to discover Wi--Fi network information on managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1422.002",
        "name": "Wi-Fi Discovery",
        "evidence": [
          {
            "description": "Evidence of this indicator is observed when a non-system, non-MDM application process on a managed mobile device makes an anomalously high number of calls to Wi-Fi configuration APIs within a short time window. Specific APIs include `WifiManager.getConfiguredNetworks()` on Android or `NEHotspotConfigurationManager.fetchConfigurations` on iOS. An anomalously high frequency is defined as a call count within a 5-minute window that exceeds a statistically derived baseline for the specific application.",
            "data_sources": [
              "Mobile Device Management (MDM) API call logs",
              "Mobile Endpoint Detection and Response (EDR) process activity logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS, Android), Mobile Device Management (MDM) Platform, Mobile EDR Platform",
            "action": [
              "Create and maintain an allow-list of application package names and their associated code-signing certificates authorized to query Wi-Fi configurations. Implement a SIEM rule to generate a high-severity alert whenever an application not on this allow-list calls sensitive Wi-Fi APIs, such as `getConfiguredNetworks` or `fetchConfigurations`.",
              "For each application across the mobile fleet, ingest at least 30 days of MDM/EDR API call logs to establish a baseline of call frequency per 5-minute window. Calculate the mean ($$\\mu$$) and standard deviation ($$\\sigma$$) of calls for each application. Implement a SIEM rule to generate a medium-severity alert if an application's call count in a 5-minute window exceeds $$ \\mu + 3\\sigma $$, or alternately, exceeds the 99th percentile of its historical activity.",
              "From MDM/EDR logs, engineer features for each API call event, including: call frequency in rolling time windows, the sequence of API calls made by the process, application permissions granted, application install source (e.g., App Store, sideloaded), and time-of-day. Train a supervised classifier (e.g., Random Forest, Gradient Boosting) to label sequences of API calls as 'benign' or 'malicious Wi-Fi discovery'. Deploy the trained model to score new activity in near real-time, generating an alert for high-probability malicious classifications."
            ]
          },
          {
            "description": "Evidence of this indicator is observed when a mobile device, immediately following a connection to a new Wi-Fi network, initiates connections to a large number of unique internal IP addresses or destination ports on the local subnet, excluding normal broadcast or multicast traffic. This scanning behavior is characterized by a single source host making more than 20 unique IP connections or connections to more than 15 unique ports within a 60-second interval.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek icmp.log",
              "DHCP Server Logs",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and guest Wi-Fi network segments, Network sensors (e.g., Zeek), DHCP servers",
            "action": [
              "Enable and tune Zeek's built-in scan detection script (`scan.zeek`). Ingest `notice.log` into the SIEM. Create a high-severity alert rule that fires on `Scan::Address_Scan` or `Scan::Port_Scan` notices originating from an IP address in the mobile device DHCP scope. Enrich the alert by correlating the source IP and timestamp with DHCP server logs to identify the device hostname and MAC address.",
              "Using `conn.log` and `icmp.log`, group connections by source IP (`id.orig_h`) into 60-second tumbling windows. For each window, calculate three metrics: 1) the count of distinct destination IPs (`id.resp_h`) on the local subnet, 2) the count of distinct ICMP echo requests sent, and 3) the Shannon entropy of the destination ports (`id.resp_p`). Establish a 30-day baseline for the 95th percentile of these metrics across the mobile device IP range. Generate a medium-severity alert when a single device's metrics exceed two of these three established statistical thresholds in the same window.",
              "From `conn.log`, create feature vectors for each source IP in 1-minute intervals. Features should include: total bytes sent/received, packet count, ratio of SYN packets to FIN/RST packets, count of unique destination IPs, count of unique destination ports, and destination port entropy. Use a density-based clustering algorithm (e.g., DBSCAN, HDBSCAN) to identify anomalous clusters of activity that are distinct from the dense cluster of normal network traffic. Generate an alert when a device's activity is classified as part of a sparse, anomalous cluster, indicating potential scanning behavior."
            ]
          },
          {
            "description": "Evidence of this indicator is observed when a non-system process on a managed mobile device reads a known Wi-Fi credential store and, within a short time window (e.g., 5 minutes), initiates an outbound network connection to a suspicious domain. Credential stores include `/data/misc/wifi/wpa_supplicant.conf` on Android and iOS Keychain items with the `kSecAttrService` attribute containing `com.apple.wifid`. A suspicious domain is one that is newly registered (<30 days), has low prevalence across the organization (<1% of devices), has a high-entropy name, or belongs to a high-risk category or ASN.",
            "data_sources": [
              "Mobile EDR file integrity monitoring logs",
              "Mobile EDR process or keychain access logs",
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Platform data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Network Egress Points (Firewall/Proxy), Internal DNS Resolvers, Mobile EDR Platform, Threat Intelligence Platform",
            "action": [
              "Deploy a Mobile EDR rule that generates a critical alert upon any read access to known Wi-Fi credential stores by a non-system/non-MDM process. Correlate this EDR alert in the SIEM with network logs (`dns.log`, `conn.log`) from the same device within a 5-minute window. Escalate the alert's severity if the device initiates a connection to an IP address or domain present on a threat intelligence feed of known malicious indicators.",
              "Upon an EDR alert for credential store access, query `dns.log` and `conn.log` for outbound connections from the device in the subsequent 5 minutes. For each resolved domain, calculate: 1) its organizational prevalence score $$ S_p = (\\text{count of unique devices querying domain in last 30 days}) / (\\text{total unique devices}) $$, 2) its age, and 3) the Shannon entropy of the domain label. Generate a high-severity alert if the device connects to a domain where $$ S_p < 0.01 $$, its age is < 30 days, or its entropy score is above a pre-defined threshold (e.g., > 3.5).",
              "Construct event sequences by correlating EDR and Zeek logs: [Process 'P' starts -> 'P' accesses credential store -> 'P' resolves domain 'D' -> 'P' initiates connection to IP 'I']. Engineer features for a sequence-aware model (e.g., LSTM, Transformer), including: process name hash, file path accessed, DNS query type, domain name entropy, domain age, destination ASN reputation, and total bytes transferred. Train this model to classify entire sequences as either 'benign' or 'credential theft and exfiltration'. Deploy the model to score real-time event sequences and generate alerts on high-confidence predictions of exfiltration."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]