[
  {
    "information_requirement": "Is an adversary attempting to gather detailed system and hardware information from our mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1426",
        "name": "System Information Discovery",
        "evidence": [
          {
            "description": "An adversary's attempt to discover system information on a mobile device, typically by making programmatic API calls (e.g., to Android's android.os.Build class [1]), is evidenced by the subsequent network exfiltration of this small data payload. This exfiltration manifests as one or more of the following network patterns: (A) A single HTTP/S connection where outbound data volume in `conn.log` is minimal (e.g., 100 bytes to 5 KB), the destination is a low-reputation or newly registered domain, and the URI in `http.log` contains a high-entropy string (Shannon entropy > 4.0). (B) A DNS query in `dns.log` for a high-entropy or algorithmically generated subdomain, followed by a small data transfer, indicating DNS tunneling of device details. (C) A direct-to-IP connection in `conn.log` (lacking a preceding DNS query for the destination IP) with a small, periodic outbound data payload. (D) A TLS session in `ssl.log` where the client's JA3 or JA3S fingerprint is rare across the device fleet or is associated with known malicious reconnaissance tools.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for corporate and guest Wi-Fi, VPN concentrators, enterprise DNS resolvers, and secure web gateways where mobile device traffic is inspected.",
            "action": [
              "Create a scheduled query to run every 15 minutes against network logs (Zeek dns.log, http.log, ssl.log) from the mobile device IP space for connections where: (1) the destination domain/IP is on an active C2 or malware threat intelligence list, OR (2) the JA3 hash in ssl.log is on a known malicious JA3 list, OR (3) the destination domain is on a Newly Registered Domain (NRD) list and the User-Agent in http.log is anomalous (e.g., matches a known fingerprinting tool, is blank, or has low complexity). Generate a high-severity alert for any match.",
              "For each mobile device, execute an hourly analysis to generate a risk score based on the following statistical deviations from the device's 30-day baseline: (1) +10 points if the Shannon entropy of a DNS query or URI string exceeds the 98th percentile for that device. (2) +15 points if the JA3 hash of an SSL/TLS session is used by less than 1% of the total mobile fleet (fleet-wide rarity). (3) +20 points if an outbound connection's payload size is between 100 bytes and 5 KB and the destination is a new, never-before-seen IP for that device. (4) +25 points for beaconing, identified when the standard deviation of inter-arrival times for connections to the same destination over one hour is less than 2.0 seconds. Aggregate the scores and generate a medium-severity alert if the total score for a device exceeds a threshold (e.g., 30) within a 15-minute window.",
              "Deploy and run the following machine learning models against network logs from the mobile device IP space: (1) A DGA detection model (e.g., LSTM-based) on all dns.log queries to score and flag algorithmically generated domains. (2) A malicious TLS fingerprint classifier (e.g., Random Forest) on JA3/JARM hashes from ssl.log to identify suspicious clients. (3) An anomaly detection model (e.g., Isolation Forest) on feature vectors from conn.log (e.g., orig_bytes, resp_bytes, duration, protocol, port) to identify unusual connection patterns. Correlate the outputs and create a high-severity incident when a single device triggers high scores from at least two of these models (e.g., a DGA-flagged domain and an anomalous connection pattern) for the same network event."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]