[
  {
    "information_requirement": "Is an adversary encrypting data on corporate mobile devices for impact? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1471",
        "name": "Data Encrypted for Impact",
        "evidence": [
          {
            "description": "A single mobile application process ID generates a rate of file write or rename operations on user-owned file types (e.g., .jpg, .png, .doc, .pdf, .mov) that exceeds a statistically significant threshold compared to its own historical baseline or the baseline of its application peer group within a 5-minute window.",
            "data_sources": [
              "MobileEDR.FileEvents",
              "MobileEDR.ProcessEvents",
              "MDM.ApplicationLogs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data directories on managed mobile devices, including Android standard directories (e.g., /storage/emulated/0/DCIM, /storage/emulated/0/Documents) and iOS App Sandbox container directories.",
            "action": [
              "Deploy a SIEM rule that triggers when a single process ID on a mobile device is associated with more than 20 'File Rename' events in 60 seconds, where the original file extension is in a target list (e.g., .jpg, .pdf, .mov) and the new file extension is identical across all events (e.g., all renamed to .crypted).",
              "For each unique mobile application name, calculate a 30-day rolling baseline of file write events per minute per device. Generate an alert if the event count for an application in a 1-minute window exceeds the 99th percentile of its own historical activity or the 95th percentile of all applications in the same MDM-defined category (e.g., 'Productivity').",
              "Train a time-series anomaly detection model (e.g., Prophet, LSTM) on the rate of file write/rename events per minute for each application, learning its typical I/O seasonality. Generate an alert when the observed I/O rate for an application exceeds the model's predicted upper confidence bound for three or more consecutive minutes."
            ]
          },
          {
            "description": "A process creates a new file (e.g., .txt, .html) whose filename matches known ransom note patterns or whose content includes a high density of keywords related to cryptocurrency payments and data recovery.",
            "data_sources": [
              "MobileEDR.FileEvents",
              "DLP.FileScanContent"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Root of user-accessible storage on mobile devices (e.g., /sdcard/, /storage/emulated/0/), directories containing recently modified user data, and application-specific data directories.",
            "action": [
              "Deploy a SIEM rule to search all 'File Creation' events for filenames matching the regex `/(readme|recover|decrypt|help|restore).*\\.(txt|html)$/i`. A match triggers a critical severity alert.",
              "Upon a filename match from the symbolic rule, enrich the alert by counting the number of unique directory paths where the same process created files with the same name within 5 minutes. If this 'fan-out' count is greater than 3, automatically escalate the incident priority to critical.",
              "Implement an analysis workflow where the content of newly created .txt and .html files is passed to a pre-trained text classification model (e.g., a fine-tuned BERT model). If the model classifies the content as 'Ransomware Note' with a confidence score > 0.95, trigger an automated response to quarantine the device via the MDM API."
            ]
          },
          {
            "description": "A process, within 10 minutes of generating a high-volume file I/O alert, initiates outbound network connections to an IP/domain on a 'Ransomware C2' threat intelligence feed, a newly registered domain (NRD), or a domain with a high entropy score characteristic of Domain Generation Algorithms (DGA).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "MobileEDR.NetworkEvents"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, and cloud-based secure web gateways (SWG) that inspect mobile device traffic.",
            "action": [
              "Join 'File I/O' alerts with `Zeek conn.log` and `MobileEDR.NetworkEvents` on the device IP/ID within a 5-minute window. Trigger a new alert if the destination IP or SNI from `Zeek ssl.log` matches any active indicator in a 'Ransomware C2' threat intelligence list.",
              "For any device with a preceding file encryption alert, analyze its subsequent DNS queries from `Zeek dns.log`. Calculate the Shannon entropy of the domain name (excluding TLD). If the score is > 3.5, or if the domain's WHOIS registration date is less than 30 days old, increment the device's risk score and generate a medium-severity alert.",
              "Train an Isolation Forest or Autoencoder model on a feature set from `Zeek conn.log` and `ssl.log` (e.g., duration, proto, resp_bytes, dest_port, JA3 hash) representing benign mobile traffic. In real-time, score all network connections from devices that have a pending file encryption alert. If a connection is flagged as an anomaly by the model, escalate the original alert."
            ]
          },
          {
            "description": "The process responsible for file encryption activity is identified as an application that is either unmanaged by the MDM, installed from an unofficial source (sideloaded), or has a combination of permissions that is statistically rare across the device fleet.",
            "data_sources": [
              "MDM.AppInventoryLogs",
              "MDM.AppPermissionLogs",
              "MDM.ComplianceStatusLogs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform's application inventory database and policy compliance logs.",
            "action": [
              "When a file encryption alert is generated, query the MDM `AppInventoryLogs` using the device ID and process name. If the `InstallationSource` attribute is 'Sideloaded' or 'Unmanaged', or if the `IsManaged` flag is false, automatically escalate the alert's severity.",
              "Periodically (e.g., daily), use `MDM.AppPermissionLogs` to compute the prevalence of every unique combination of granted permissions across all managed applications. When a file encryption alert occurs, look up the permission set of the responsible application. If its prevalence is below the 1st percentile (i.e., present on <1% of devices), add this finding as a high-confidence enrichment to the alert.",
              "Train a clustering model (e.g., K-Prototypes for mixed data types) on application metadata from the MDM, including categorical (permissions, source, developer) and numerical features. Identify small clusters as 'anomalous application groups'. If a process causing a file encryption alert belongs to an application in one of these anomalous clusters, automatically escalate the incident."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]