[
  {
    "information_requirement": "Is an adversary leveraging legitimate external web services for one-way command and control against corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1481.003",
        "name": "One-Way Communication",
        "evidence": [
          {
            "description": "A corporate mobile device exhibits C2-like network beaconing behavior from a non-browser application. Network traffic shows connections to a single web service domain with extremely low timing jitter (e.g., standard deviation of inter-arrival time is less than 5 seconds), consistently small outbound data payloads (e.g., 95th percentile of orig_bytes is less than 1KB), and a high outbound-to-inbound byte ratio (e.g., greater than 10:1). This pattern of automated, non-interactive communication is distinct from normal user browsing and can be correlated with background activity from a specific application identified in MDM logs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "MDM Application Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, network egress points (Internet gateways), and the corporate Mobile Device Management (MDM) platform.",
            "action": [
              "Correlate Zeek logs (dns.log, ssl.log) by IP address with MDM application network logs to identify the source process for suspicious connections. Generate a high-severity alert if the destination domain (from dns.log 'query' or ssl.log 'server_name') matches a threat intelligence feed of known one-way C2 endpoints AND the source application is not a standard web browser or known-good application.",
              "For each source mobile device IP, aggregate Zeek conn.log data in 1-hour windows, grouping by the tuple (source_ip, destination_server_name, destination_port). Calculate the standard deviation of inter-arrival time, the 95th percentile of outbound bytes ('orig_bytes'), and the ratio of total outbound to inbound bytes ('SUM(orig_bytes) / SUM(resp_bytes)'). Alert when a group shows a standard deviation < 5 seconds, 95th percentile 'orig_bytes' < 1024, byte ratio > 10, a single destination port, and a connection count > 10, as this multi-condition outlier indicates non-interactive beaconing.",
              "Train a time-series anomaly detection model (e.g., LSTM autoencoder) on a per-device basis using features aggregated from Zeek conn.log in 5-minute intervals. Features should include: connection count, total outbound bytes, total inbound bytes, outbound/inbound byte ratio, standard deviation of inter-arrival times, and entropy of destination ports. An alert is triggered when the model's reconstruction error for a time window exceeds a dynamically established threshold (e.g., 3 standard deviations above the rolling average error), signaling a behavioral departure from the device's normal network profile."
            ]
          },
          {
            "description": "A mobile device sends an HTTP/S request to a legitimate web service (e.g., a paste site, code repository) with multiple C2 characteristics. These include: a URI path with high Shannon entropy (> 3.5) or containing raw content keywords (e.g., '/raw/', '/blob/'), an unusual HTTP method for that site, an absent Referer header, a non-standard User-Agent, a TLS client signature (JA3 hash) inconsistent with standard mobile browsers, and a server response Content-Type (e.g., 'text/plain') mismatched with the site's typical interactive content (e.g., 'text/html').",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, and forward proxy servers that perform TLS inspection, providing visibility into HTTP headers and content for mobile device traffic.",
            "action": [
              "Using TLS-inspected Zeek http.log data, create a rule to flag requests from the mobile IP range to a watchlist of high-risk domains (e.g., 'pastebin.com', 'raw.githubusercontent.com') where the URI path contains '/raw/', '/blob/', or a regex for long encoded strings, AND the User-Agent does not match common mobile browsers (e.g., Chrome Mobile, Mobile Safari).",
              "For each mobile device, establish a baseline of normal HTTP/S activity per destination domain. Calculate the Shannon entropy of the 'uri' field and flag requests in the 99th percentile. Concurrently, track the frequency of User-Agent strings, HTTP methods, and JA3 hashes. Generate a high-risk score for a request that combines a high-entropy URI with a rare User-Agent (<1% frequency), a rare JA3 hash (<1% frequency for that user), an unusual HTTP method, and a missing Referer header. An alert is triggered when the score exceeds a predefined threshold.",
              "Train a supervised classification model (e.g., Random Forest) to produce a 'malicious C2 probability' score for each HTTP/S request from mobile devices. The model should be trained on labeled data using features derived from Zeek http.log and ssl.log, such as: URI length, URI Shannon entropy, number of query parameters, presence of raw content keywords, User-Agent string entropy, the specific JA3 and JA3S hash values, response MIME type, HTTP method, and a binary feature for the presence of a Referer header. Prioritize requests with the highest probability scores for analyst investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]