[
  {
    "information_requirement": "Has the adversary established external command and control (C2) channels on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1481.001",
        "name": "Dead Drop Resolver",
        "evidence": [
          {
            "description": "A network connection from a single mobile device source IP to a known public web service (e.g., pastebin.com, github.com, social media APIs) is followed within a 60-second window by a second, distinct outbound connection from the same source IP. The destination of this second connection is considered anomalous if it meets one of the following criteria: a) it is present on a threat intelligence feed, b) its domain popularity rank is in the bottom 5th percentile across the organization, or c) it has a high-risk ASN or reputation score.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi egress points, VPN concentrators handling mobile device traffic, MDM-managed device network segments, and network segments dedicated to guest or BYOD mobile devices.",
            "action": [
              "From Zeek conn.log, filter for traffic originating from mobile IP ranges to a watchlist of potential dead drop services. For each source IP, search for a subsequent outbound connection to a different destination within 60 seconds. Join the destination IP or domain (from dns.log) of the second connection with a threat intelligence feed of known malicious C2 infrastructure. A successful match generates a high-severity alert.",
              "For every two-step connection pattern identified (initial connection to a potential resolver followed by a second outbound connection), extract the destination domain of the second connection from Zeek dns.log. Using a 30-day baseline, calculate the access frequency for all domains. If the destination domain's popularity falls in the bottom 5th percentile, flag it as suspicious. Additionally, analyze the connection's outbound byte count (orig_bytes in conn.log) and flag if it exceeds the 95th percentile for that destination port. An alert is triggered if both low popularity and high byte count are observed.",
              "Apply a pre-trained Random Forest classification model to score the likelihood of a connection pair being a dead drop event. Construct a feature vector for each pair including: time delta between connections, bytes transferred in the second connection, destination domain popularity percentile, destination ASN, and the TLS Server Name Indication (SNI) from ssl.log. A prediction probability score exceeding a tuned threshold (e.g., 0.85) automatically generates a high-fidelity alert for analyst review."
            ]
          },
          {
            "description": "A mobile device connects to a legitimate content-hosting web service, and the content of the response body, such as from an unencrypted HTTP response or a captured file, contains an IP address or a Fully Qualified Domain Name (FQDN). The same mobile device subsequently initiates a connection to that extracted IP or FQDN within a 2-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with L7 visibility, DNS resolvers, web proxies serving mobile device traffic, and Mobile Device Management (MDM) platforms.",
            "action": [
              "Using Zeek files.log or unencrypted http.log traffic, parse response bodies from connections made by mobile devices for regex patterns matching IPv4 addresses and FQDNs. Correlate any extracted indicators against a threat intelligence feed of known malicious infrastructure. If a subsequent outbound connection from the same source IP to a matched indicator is observed in conn.log within a 2-minute window, generate a high-severity alert.",
              "For all FQDNs extracted from response bodies that are subsequently contacted, calculate the Shannon entropy of the hostname. A score greater than 3.5 is a primary flag suggesting a Domain Generation Algorithm (DGA). Separately, calculate the enterprise-wide access frequency for the full domain using a 30-day dns.log baseline. A domain in the bottom 1st percentile is a secondary flag. An alert is generated if a domain is flagged for both high entropy and low popularity.",
              "Ingest Zeek dns.log or http.log data into a time-series analysis platform. Aggregate request counts per hour from the mobile device IP range to known dead-drop resolver parent domains (e.g., github.com, pastebin.com). Apply a SARIMA model to forecast expected traffic volume, accounting for daily and weekly seasonality. An alert is triggered when the observed request volume exceeds the forecasted upper confidence interval (e.g., greater than 3 standard deviations above the mean) for a sustained period, indicating a potential coordinated campaign."
            ]
          },
          {
            "description": "A mobile device establishes a TLS connection where the client's TLS fingerprint (JA3 hash) is in the bottom 1% of rarity for the mobile fleet. This connection is followed within 60 seconds by a second outbound connection from the same device to a destination utilizing a self-signed or newly issued TLS certificate (e.g., certificate age less than 7 days).",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with deep packet inspection capabilities, TLS-terminating proxies, and VPN concentrators.",
            "action": [
              "From Zeek ssl.log, search for connections from mobile IP ranges where the server certificate validation_status is 'self-signed certificate in certificate chain' or another invalid status. Correlate the source IP with a prior connection within 60 seconds to a known dead-drop resolver domain. A match generates a medium-severity alert.",
              "Maintain a 30-day baseline of all JA3 hashes from mobile devices observed in Zeek ssl.log to establish popularity. For any new connection, if the client's JA3 hash is in the bottom 1% of observed frequency, flag the connection. In the same connection, calculate the server certificate's age from the 'not_valid_before' field. If the certificate age is less than 7 days, also flag it. An alert is generated if a connection has both a rare JA3 hash and a newly issued certificate.",
              "Use a clustering algorithm (e.g., DBSCAN) on TLS session metadata from Zeek ssl.log. Create a feature vector for each session from mobile devices, including its JA3 hash, JA3S hash, selected cipher suite, TLS version, and certificate validity period. The model will group legitimate traffic into large, dense clusters. Flag sessions that are marked as outliers or belong to small, sparse clusters as anomalous TLS sessions potentially indicative of C2 activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]