[
  {
    "information_requirement": "Is an adversary evading defenses by abusing accessibility services to perform actions on behalf of the user? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1516",
        "name": "Input Injection",
        "evidence": [
          {
            "description": "A temporal correlation exists where an MDM log event indicates an application was granted 'BIND_ACCESSIBILITY_SERVICE' permission on a mobile device, and within a subsequent 15-minute window, network logs for that same device show one or more of the following: (1) connections to domains, IPs, or with TLS fingerprints (JA3/JA3S) matching known mobile malware threat intelligence; (2) network connection patterns that are statistical outliers compared to the device's 30-day baseline, such as a high-entropy distribution of destination ports or low-variance inter-arrival times; (3) an unusually large data upload to a previously uncontacted destination.",
            "data_sources": [
              "MDM Logs",
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN terminators, Mobile Device Management (MDM) platform, and DNS resolvers used by mobile devices.",
            "action": [
              "Upon detecting an MDM event for 'BIND_ACCESSIBILITY_SERVICE' permission grant, retrieve the device identifier and its associated IP address from DHCP/VPN logs. For the subsequent 15-minute window, execute a query against Zeek logs (dns.log, ssl.log, conn.log) for that source IP. Match destination FQDNs, IPs, and JA3/JA3S hashes against a threat intelligence feed of known mobile malware command-and-control (C2) infrastructure. Additionally, inspect x509.log for non-standard certificate issuers or subjects associated with these connections. Generate a high-severity alert on any match.",
              "For the 15-minute window following the permission grant, calculate a feature set from the device's Zeek logs. First, calculate the Shannon entropy of destination ports in conn.log; alert if the score exceeds the 98th percentile of the device's 30-day historical port entropy baseline. Second, calculate the standard deviation of connection inter-arrival times to any single destination IP; alert if the value is below 1 second, indicating automated beaconing. Third, count the number of distinct DNS query types (e.g., A, AAAA, TXT) in dns.log and alert if the ratio of TXT queries to total queries exceeds the 99th percentile of the device's baseline.",
              "Develop and apply a one-class anomaly detection model (e.g., Isolation Forest) to network sessions originating from the device in the 15-minute window post-permission grant. Train the model on a baseline of the device's normal network behavior from the past 30 days of Zeek logs. Use features such as: session duration, total bytes sent/received, protocol, JA3/JA3S hash pair, SSL certificate issuer, destination port, DNS query length, and time-of-day. Flag any session scored as a high-confidence anomaly by the model for immediate analyst review."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary causing impact by programmatically interacting with sensitive applications (e.g., financial, messaging) to steal data or funds? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1516",
        "name": "Input Injection",
        "evidence": [
          {
            "description": "Evidence of impact exists when network traffic from a mobile device to a known financial, enterprise Single Sign-On (SSO), or sensitive cloud service FQDN exhibits characteristics inconsistent with typical user-driven interaction. These include: (1) use of TLS/HTTP parameters (e.g., JA3 hash, User-Agent string) that do not match a pre-defined whitelist for the legitimate mobile application; (2) highly periodic connection timing with low jitter or an outbound data volume for a single session that significantly exceeds the user's historical baseline for that specific service; (3) DNS query patterns indicative of tunneling, such as abnormally long TXT record queries.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek http.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments for corporate and guest Wi-Fi, cloud service provider network ranges, known financial service IP blocks, and internet gateways.",
            "action": [
              "Maintain a curated list of sensitive FQDNs (e.g., financial, SSO) and a corresponding whitelist of known-good JA3/JA3S hashes and HTTP User-Agent strings for their legitimate mobile applications. This whitelist should be generated from known-good traffic and manually reviewed. Continuously monitor Zeek ssl.log and http.log for connections to these FQDNs. Generate an alert if a connection's JA3/JA3S hash pair or User-Agent string does not appear in the established whitelist for that service.",
              "For each user-and-service pair (e.g., user 'JaneDoe' connecting to 'sso.corp.com'), establish a 30-day rolling baseline for session metrics from Zeek conn.log. Generate an alert if a new session's outbound data volume (orig_bytes) exceeds the 99.5th percentile of that specific baseline. Separately, analyze the time series of connection start times over a 1-hour window; an autocorrelation value greater than 0.8 at a non-zero lag indicates suspicious periodicity. Also, calculate the average length of DNS TXT record queries in dns.log per device and alert if a query's length exceeds 3 standard deviations above the device's daily average.",
              "Train a supervised binary classification model (e.g., Random Forest) to classify network sessions to sensitive services as 'benign' or 'automated/malicious'. Generate training data by labeling baseline traffic as 'benign' and using traffic from known mobile malware sandboxes or synthetically generated periodic traffic as 'malicious'. Features should include: session duration, orig_bytes, resp_bytes, protocol, JA3/JA3S hashes, HTTP method (GET/POST), URI length, and time-of-day as a categorical feature. A session classified as 'automated/malicious' with a confidence score greater than 0.9 should trigger a high-severity alert for immediate investigation."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]