[
  {
    "information_requirement": "Is an adversary using hooking frameworks to evade defenses on corporate mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1617",
        "name": "Hooking",
        "evidence": [
          {
            "description": "The presence of specific file paths, package names, or processes on a mobile device that are known indicators of rooting or hooking frameworks (e.g., Xposed, Magisk, Cydia Substrate). OR, a device repeatedly fails mobile attestation checks (e.g., SafetyNet, Knox Attestation) within a short time frame. OR, a device makes network connections to domains or IP addresses known to host repositories for hooking modules or root exploits.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "MDM Device Integrity Scan Logs",
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints: Corporate-managed mobile devices (iOS, Android). Network: DNS resolvers, web proxies, and VPN concentrators capturing mobile traffic. Servers: Mobile Device Management (MDM) log aggregation platform.",
            "action": [
              "Create a watchlist of known file paths, package names, and process names associated with mobile hooking and rooting frameworks (e.g., 'de.robv.android.xposed.installer', 'com.topjohnwu.magisk', 'eu.chainfire.supersu', 'io.va.exposed'). Query MDM Application Inventory Logs every hour for exact matches against this watchlist. Also, query Zeek http.log and dns.log for connections to domains known to host these frameworks or related modules. Generate a high-severity alert upon any match.",
              "For each managed mobile device, query MDM Device Integrity Scan Logs to count the number of failed integrity checks (e.g., SafetyNet, Knox Attestation) per 24-hour period. Calculate the 95th and 99th percentile for this count across all devices over a 30-day rolling window to establish a fleet-wide baseline. Generate a medium-severity alert for devices exceeding the 95th percentile and a high-severity alert for devices exceeding the 99th percentile, as this indicates a statistically significant deviation from normal behavior.",
              "Implement an anomaly detection model (e.g., Isolation Forest) using features from both MDM and network logs. Key features should include: from MDM logs, 'developer mode enabled' (binary), 'count of non-market applications installed' (integer), 'daily count of integrity check failures' (integer); and from Zeek logs, 'Shannon entropy of DNS queries per device', 'ratio of outbound to inbound bytes per device', and 'count of unique destination ports per device'. Train the model on a baseline of known-good device behavior over a 30-day period. Score all devices daily. Devices with anomaly scores in the top 1% should be flagged for investigation as potentially compromised."
            ]
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-10-01",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]