[
  {
    "information_requirement": "Is an adversary deleting files or wiping data on corporate mobile devices to evade detection or cause impact? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.002",
        "name": "File Deletion",
        "evidence": [
          {
            "description": "A log event from a Mobile Device Management (MDM) or Endpoint Detection and Response (EDR) solution records the granting of device administrator privileges to a mobile application whose package name or signing certificate hash is not present on an established corporate allowlist.",
            "data_sources": [
              "MDM.PrivilegeGrantEvents",
              "EDR.ApplicationInventoryLogs",
              "Internal.CorporateAppAllowlist"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS, Android), Mobile Device Management (MDM) Platform, Application Vetting System, Corporate App Store, Centralized Log Aggregator (SIEM)",
            "action": [
              "Create a SIEM rule to query MDM logs for all device administrator privilege grant events. For each event, join the application's package name and certificate hash with the corporate application allowlist. Generate a high-severity alert for any application not found on the allowlist.",
              "Ingest MDM privilege grant events into a time-series database. Calculate a 30-day rolling baseline (mean and standard deviation) of daily privilege grants across the entire mobile fleet. Generate a medium-severity alert if the number of grants in any 24-hour period exceeds the mean by more than 3 standard deviations.",
              "Train a Random Forest classification model using historical MDM/EDR data with features such as application category, number of requested permissions, app store reputation, user role, and time of day. Score new privilege grant events in real-time and flag any event with a predicted risk score above a defined threshold (e.g., > 0.8) for immediate analyst review."
            ]
          },
          {
            "description": "The count of file deletion events originating from a single process on a mobile device within a 5-minute window exceeds the 99th percentile of the historical baseline for that user or device type, excluding deletions associated with known application uninstallation or system cache clearing processes.",
            "data_sources": [
              "EDR.FileModificationEvents",
              "Android.Logcat",
              "Internal.SystemProcessAllowlist"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data partitions on corporate mobile devices, Application sandboxes on mobile devices, MDM/EDR management console, Centralized Log Aggregator (SIEM)",
            "action": [
              "Create a SIEM rule that monitors EDR file deletion events from mobile devices. Generate a high-severity alert if the initiating process name is found on a malware IOC list OR is not on an allowlist of legitimate uninstaller and system cache clearing processes.",
              "For each mobile device, ingest EDR file deletion events into a streaming analytics platform. Calculate a rolling 5-minute count of deletion events and establish a per-device/per-user baseline using the 99th percentile of these counts over a 30-day period. Generate a medium-severity alert when the current count exceeds this threshold.",
              "For each device, deploy a time-series anomaly detection model (e.g., ARIMA or LSTM) trained on at least 30 days of historical file deletion event counts. Generate an alert if the observed number of deletions significantly deviates from the model's predicted range, indicating a statistical anomaly."
            ]
          },
          {
            "description": "An EDR event indicates the deletion of one or more files with extensions from a 'critical' list (e.g., .pdf, .docx, .xlsx, .sqlite, .key) or from a 'sensitive' directory path (e.g., /Documents, /Download, /DCIM), where the initiating process is not on an allowlist of approved applications.",
            "data_sources": [
              "EDR.FileModificationEvents",
              "Internal.CorporateAppAllowlist"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Sensitive data storage locations on mobile devices, Endpoint devices of high-value targets (e.g., Executive and R&D department mobile devices), Centralized Log Aggregator (SIEM)",
            "action": [
              "Deploy a SIEM correlation rule that triggers an alert when an EDR file deletion event meets all the following criteria: a) the deleted file's path is in a monitored sensitive directory, b) the file extension is on a critical list, AND c) the initiating process is not on the corporate application allowlist.",
              "For alerts generated by the symbolic rule, automatically calculate the Shannon entropy of the initiating process name. Escalate the alert's priority to critical if the entropy score is high (e.g., > 3.5), suggesting a randomly generated or obfuscated process name.",
              "Develop a file access pattern baseline for each user by applying a clustering algorithm (e.g., DBSCAN) to historical EDR data, using features like process name, file types accessed, and time of day. If a file deletion event is identified as an outlier from the user's established activity clusters, flag it as anomalous for investigation."
            ]
          },
          {
            "description": "Network flow logs show an outbound data transfer from a mobile device's IP address exceeding the 95th percentile of the user's daily outbound traffic baseline, destined for a low-reputation or newly-seen IP/domain. This network event is followed within 15 minutes by EDR alerts for high-volume file deletions on the same device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "EDR.FileModificationEvents",
              "MDM.DHCPLeaseLogs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Our organization's internet gateway, Corporate-managed mobile devices, DNS resolvers, DHCP servers, Centralized Log Aggregator (SIEM)",
            "action": [
              "Create a stateful SIEM correlation rule that triggers a critical alert if: a) a Zeek conn.log event shows a connection from a mobile device IP to an external destination on a threat intelligence blocklist, AND b) within the next 15 minutes, an EDR alert for high-volume file deletion is generated for the same device. Use MDM.DHCPLeaseLogs to correlate the IP address to the specific device and user.",
              "For each mobile device user, ingest Zeek conn.log data to calculate a 30-day rolling baseline of total daily outbound bytes (orig_bytes). Generate a medium-severity alert if a device's total outbound bytes in a 24-hour period exceeds its baseline by more than 3 standard deviations. Enrich this alert with any subsequent file deletion events from the same device within a 1-hour window.",
              "Train a sequence analysis model, such as a Recurrent Neural Network (RNN), on event streams combining Zeek logs (conn.log, dns.log) and EDR file activity logs to learn normal sequences of user activity. Alert on the detection of a low-probability sequence, such as a large outbound data transfer to a newly seen domain followed by high-volume file deletions on the same device."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]