[
  {
    "information_requirement": "Is the adversary actively concealing a compromised (rooted/jailbroken) mobile device state from our detection mechanisms? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.003",
        "name": "Disguise Root/Jailbreak Indicators",
        "evidence": [
          {
            "description": "A conflict is observed for a single device where Mobile Device Management (MDM) logs show a remote attestation failure while Mobile Threat Defense (MTD) logs simultaneously report a compliant status, with both events occurring within a 5-minute window. [1][2]",
            "data_sources": [
              "MDM Remote Attestation Logs",
              "MTD Compliance Status Logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM or data lake containing Mobile Device Management (MDM) and Mobile Threat Defense (MTD) logs; Cloud Identity Provider (IdP) conditional access policy logs; Network sensors at internet egress points and VPN concentrators.",
            "action": [
              "Construct a real-time correlation rule in the SIEM to join MDM attestation logs with MTD compliance logs using a common device identifier (e.g., device_id, serial_number). Trigger a high-severity alert if a device produces events matching `mdm.attestation.result == 'failure'` AND `mtd.compliance.status == 'compliant'` where the event timestamps are within 300 seconds of each other. Automatically enrich the resulting alert with the device's associated network activity (source/destination IPs, ports, protocols, DNS queries) from Zeek conn.log and dns.log for the 60-minute period surrounding the correlated event.",
              "For each unique device identifier, establish a 30-day rolling baseline of hourly network behavior using Zeek conn.log. Profile the count of unique destination ports and the entropy of destination IP addresses ($$ H(IP_{dst}) $$). Calculate the 95th percentile for each of these hourly metrics. Generate a medium-severity alert when a device's hourly value for either metric exceeds its established 95th percentile threshold, especially if this anomaly occurs within 24 hours of a failed attestation event reported by the MDM.",
              "Ingest per-device, per-hour aggregates of Zeek dns.log data (e.g., query count, unique domains queried, query type distribution) into a time-series database. For each device, train an unsupervised anomaly detection model, such as a Seasonal-Hybrid ESD (Extreme Studentized Deviate) test, to learn its normal DNS activity patterns, accounting for daily and weekly seasonality. Flag any device whose DNS activity produces a statistically significant anomaly score from the model, escalating the alert priority if the anomaly coincides with an MDM attestation failure."
            ]
          },
          {
            "description": "A process is observed executing with root privileges (e.g., UID 0 on Android) on a mobile device, and its binary's SHA256 hash is unknown, meaning it does not appear on an internal allowlist of legitimate system binaries or a threat intelligence blocklist of known malicious tools. [3]",
            "data_sources": [
              "MTD Process Execution Logs",
              "Threat Intelligence Hash Feeds",
              "Zeek conn.log",
              "Zeek software.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MTD agent log repositories on mobile endpoints; Centralized SIEM or data lake; Threat Intelligence Platform for hash lookups; Network sensors monitoring traffic from mobile subnets.",
            "action": [
              "For every process execution event from MTD logs where the user context is root (e.g., `user.id == 0`), implement an automated workflow. This workflow will query both an internal allowlist of known-good file hashes and an external threat intelligence platform's hash blocklist using the `process.file.sha256` value. Trigger a high-severity alert if the hash is not found in either list, indicating an unknown and potentially malicious privileged process.",
              "Continuously ingest all MTD process execution logs. For each parent-child process relationship observed across the entire mobile fleet (e.g., `parent.process.name` -> `process.name`), calculate its frequency over a 30-day rolling window to generate a rarity score ($$ 1 / \\text{frequency} $$). Trigger a medium-severity alert when a root-privileged process is spawned by a parent process and their relationship's rarity score falls within the top 1% (i.e., least frequent 1%). Escalate the alert to high severity if the child process initiates any outbound network connection (tracked via Zeek conn.log) within five minutes of its execution.",
              "Develop a feature set for privileged process execution events using data from MTD logs (e.g., entropy of process name, count of command-line arguments, parent process name) and correlated network data from Zeek conn.log (e.g., destination port, bytes sent, connection state). Train a supervised classification model, such as a Random Forest or Gradient Boosting classifier, on a labeled dataset of benign and malicious privileged process events. Deploy this model to score new events in near-real-time, generating an alert for any process classified as 'malicious' with a confidence score greater than 0.80."
            ]
          },
          {
            "description": "A process command-line log, captured by an MTD agent, contains suspicious arguments indicating attempts to remount critical filesystems with write permissions (e.g., `mount -o rw,remount /system`) or to escalate privileges by modifying permissions on sensitive system files (e.g., `chmod 777 /system/bin/su`). [1]",
            "data_sources": [
              "MTD File System Integrity Logs",
              "MTD Process Command-line Logs",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log storage for MTD agents on mobile endpoints; Centralized SIEM for log correlation; Network sensors capable of file extraction (e.g., Zeek); Application sandboxing analysis platforms.",
            "action": [
              "Create and deploy a SIEM detection rule that uses a regular expression to scan the `process.command_line` field in MTD logs. The regex should identify commands related to filesystem remounting or permission changes, such as `/(mount\\s+-o\\s+.*rw|chmod\\s+(u\\+s|g\\+s|777|666))/i`. Upon a match, generate a high-severity alert. The alert should be automatically enriched by correlating the device IP and timestamp with Zeek conn.log and files.log to identify any preceding file downloads or subsequent C2 communication.",
              "For each unique application package name, establish a 30-day baseline of file system interaction using MTD file integrity logs. For each 24-hour window, calculate the Shannon entropy of the set of unique parent directory paths modified by the application ($$ H(\\text{paths}) $$). Trigger an alert if an application's daily path entropy score deviates by more than 3 standard deviations from its historical mean, which suggests it is writing to an abnormally diverse and potentially unauthorized set of locations.",
              "Represent application behavior as sequences of discrete events derived from MTD and Zeek logs (e.g., `[api_call:get_accounts, net_conn:port_443, file_mod:/data/data/app/config.xml, proc_exec:/system/bin/sh]`). Train a sequence-to-sequence (seq2seq) autoencoder with LSTM layers on millions of these sequences from known-benign applications. In production, use the trained model to process new event sequences from each application. If the model's reconstruction error for a given sequence exceeds a dynamically determined threshold (e.g., 99th percentile of reconstruction errors on a validation set), generate an alert, as this indicates a significant deviation from learned normal behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]