[
  {
    "information_requirement": "Is malware on a corporate mobile device attempting to detect if it is running in a sandbox or emulator? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1633",
        "name": "Virtualization-Sandbox Evasion",
        "evidence": [
          {
            "description": "An application process, not part of the base OS or a trusted pre-installed vendor suite, queries for two or more distinct system properties known to be associated with Android emulators (e.g., ro.hardware: goldfish, ro.hardware: ranchu, ro.kernel.qemu: 1, ro.product.brand: generic, ro.product.model: sdk) within the first 60 seconds of its initial execution.",
            "data_sources": [
              "Android Logcat",
              "MDM Application Inventory Logs",
              "MDM Process Activity Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Mobile Device Endpoints, Mobile Device Management (MDM) Platform, Centralized Log Aggregator/SIEM, Network Security Monitoring (NSM) sensors at internet gateways",
            "action": [
              "Create a SIEM rule that joins MDM process start logs with Android Logcat data. The rule should trigger when a process from an application not on a pre-approved publisher allowlist queries for two or more properties from a watchlist of known emulator artifacts (e.g., 'ro.hardware:goldfish', 'ro.kernel.qemu:1', 'ro.product.manufacturer:Genymotion') within 60 seconds of its first execution.",
              "For all third-party applications, ingest Logcat data to profile system property queries. Calculate the 99th percentile for the count of unique emulator-related properties queried by any single application within the first five minutes of execution across the mobile fleet. Generate an alert for any application exceeding this fleet-wide threshold. Additionally, calculate the Shannon entropy of queried property names for each process; an entropy score below a baseline threshold (e.g., < 1.5) suggests repetitive checking of a small set of properties and should also be flagged.",
              "Train a Random Forest classification model to predict 'evasive behavior'. Engineer features from MDM and Logcat data, including: count of suspicious property queries, entropy of property names, time delta between app installation and first query, application publisher reputation, and the set of requested permissions. A high-confidence 'evasive' prediction from the model should be correlated with subsequent network activity in Zeek conn.log, such as connections to known malicious IPs or unusual ports, to automatically escalate the incident priority."
            ]
          },
          {
            "description": "A newly installed application, within 60 seconds of its initial launch, requests and is granted permissions to access three or more sensors or data sources indicative of human interaction (e.g., accelerometer, gyroscope, light sensor, READ_CONTACTS, READ_CALL_LOG). This activity is followed by a period of network dormancy, defined as zero outbound connections or a single TCP/UDP session with less than 1KB of data transmitted, over the subsequent five minutes.",
            "data_sources": [
              "MDM Permission Grant Logs",
              "Android Logcat",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Mobile Device Endpoints, Mobile Device Management (MDM) Platform, Centralized Log Aggregator/SIEM, Network Security Monitoring (NSM) sensors at internet gateways",
            "action": [
              "Implement a SIEM correlation rule that alerts when MDM logs show an application is granted three or more permissions from a 'human interaction' watchlist (e.g., 'android.permission.READ_CONTACTS', 'android.permission.BODY_SENSORS') within 60 seconds of first launch, and this event is followed by either zero outbound connections or a single TCP/UDP session with an 'orig_bytes' value less than 1024 from the device's IP in Zeek conn.log over the subsequent five minutes.",
              "For each application category (e.g., 'Productivity', 'Games'), establish a baseline of normal API call sequences made during the first five minutes of runtime using Logcat data from trusted applications. For each new application, compare its initial API call sequence to the category baseline using a sequence comparison algorithm like Levenshtein distance. Alert on applications with a deviation score in the 98th percentile for their category. Additionally, monitor the entropy of sensor data streams (e.g., accelerometer) where available; an entropy value near zero for 30 seconds or more suggests static, non-human data typical of an emulator.",
              "Deploy a pre-trained LSTM Autoencoder model for time-series anomaly detection on sensor data streams (e.g., accelerometer, gyroscope) from mobile endpoints. Train the model on data from normal device usage to learn patterns of human interaction. Feed real-time sensor data from newly installed applications into the model. A high reconstruction error score, exceeding a statistically determined threshold and attributed to the specific application process, signifies anomalous, non-human sensor activity, indicating a probable emulator environment."
            ]
          },
          {
            "description": "An application process, within the first five minutes of its execution after installation, initiates DNS queries for three or more distinct public Network Time Protocol (NTP) or public IP geolocation service domains. This behavior is indicative of an attempt to verify the device's time and location to evade sandboxes that may provide incorrect or static values.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "MDM Application Installation Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Network Security Monitoring (NSM) sensors at internet gateways, Centralized Log Aggregator/SIEM, Mobile Device Management (MDM) Platform",
            "action": [
              "Create a SIEM rule that correlates MDM application installation logs with network data. The rule should alert when a process on a mobile device generates DNS queries for three or more unique domains from a watchlist of public time and geolocation services (e.g., 'pool.ntp.org', 'time.nist.gov', 'ip-api.com', 'ipinfo.io', 'ifconfig.me', 'ip.sb') within its first five minutes of execution, as seen in Zeek dns.log.",
              "Using Zeek dns.log, establish a 30-day rolling baseline for the count and frequency of queries to known time/geolocation domains per mobile device. In a 10-minute sliding window, alert if the count of such distinct domains queried by any single device exceeds three standard deviations above its own historical baseline, or if the frequency of queries to a single such domain spikes above its 99th percentile.",
              "Apply a DBSCAN clustering algorithm to five-minute windows of network traffic from the mobile device subnet. Engineer features from Zeek dns.log and conn.log, including: count of unique FQDNs queried, entropy of queried FQDNs, ratio of DNS queries to established TCP/UDP connections, destination ports (e.g., 53, 123, 80, 443), and JA3/JA3S hashes. Investigate clusters identified by DBSCAN as 'noise' (outliers) that exhibit a high count of DNS queries to time/geo services followed by minimal data transfer, as this profile is highly indicative of sandbox evasion reconnaissance."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]