[
  {
    "information_requirement": "Is an adversary manipulating data within critical business applications on corporate mobile devices to disrupt operations or decision-making? (TA0034 - Impact)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1641",
        "name": "Data Manipulation",
        "evidence": [
          {
            "description": "A mobile application reads clipboard data within 5 seconds of a corporate application (e.g., password manager, email client) writing to the clipboard, followed by network communication from the reading application to an uncategorized or suspicious domain.",
            "data_sources": [
              "Mobile EDR/MDM logs (capturing API calls, process activity, and clipboard access events)",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Corporate Wi-Fi and VPN network gateways, Cloud-hosted MDM/EDR platforms",
            "action": [
              "Join Mobile EDR logs on device ID and timestamp to identify clipboard read events occurring within 5 seconds of a clipboard write event. Filter for instances where the writing process is a known corporate application and the reading process is not. Correlate the package name or signing certificate of the reading application against a threat intelligence feed of known malicious mobile apps. Generate a high-severity alert on a match.",
              "For each mobile application, create a baseline of clipboard read frequency per 24-hour period over 30 days. Calculate the 99th percentile of reads for each app. Additionally, create a set of 'normal' source-app/destination-app pairs for clipboard interaction. Generate a medium-severity alert when an application's daily read count exceeds its 99th percentile or when a new, unseen source-app/destination-app clipboard interaction is observed.",
              "Using a time-series forecasting model (e.g., ARIMA) on Zeek conn.log data, predict the expected outbound data volume (`orig_bytes`) per device for each 1-minute interval. Monitor for anomalies where the actual data volume exceeds the predicted upper confidence bound by more than 3 standard deviations. If this network anomaly occurs within 60 seconds after a Mobile EDR log shows a non-standard application reading from the clipboard, classify the event as 'Suspicious Data Manipulation and Exfiltration' and generate a high-severity alert."
            ]
          },
          {
            "description": "A mobile application modifies a file or database (e.g., contacts.db, calendar.db, *.sqlite) outside of its own designated application data container, or performs high-frequency, small-write modifications to a sensitive file inconsistent with normal user activity.",
            "data_sources": [
              "Mobile EDR/MDM logs (capturing file system and database modifications)",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Application servers receiving mobile data, Application data containers on mobile devices",
            "action": [
              "Query Mobile EDR file access logs for write events where the acting process's application sandbox path does not match the parent directory of the target file path. Exclude known inter-app communication frameworks and OS processes. Any remaining event is a direct violation of sandboxing rules and should trigger a high-severity alert for unauthorized data manipulation.",
              "For critical data files (e.g., contacts.db), establish a baseline of write frequency and data-change magnitude (delta in file size) for each application permitted to write to the file. Calculate the 95th percentile for both metrics over a 30-day period. Generate a medium-severity alert if an application's write frequency or the change in file size exceeds its established percentile, suggesting abnormal modification activity like rapid data injection.",
              "Train a Random Forest classifier using features from Mobile EDR file-write events. Features should include: 'process_name', 'target_file_extension', 'write_frequency_per_minute', 'bytes_written', 'is_outside_sandbox' (boolean), and 'hour_of_day'. Label data as 'malicious' using attack simulation data and as 'benign' from a 30-day baseline of normal activity. Deploy the model to score new write events in real-time; a probability score > 0.85 for the 'malicious' class should trigger a medium-severity alert for analyst review."
            ]
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-10-01",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]