[
  {
    "information_requirement": "Is an adversary using our managed mobile devices to generate fraudulent or malicious outbound traffic? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1643",
        "name": "Generate Traffic from Victim",
        "evidence": [
          {
            "description": "A managed mobile device sends an SMS message where either: (1) the destination number matches a known fraudulent or premium-rate number from a threat intelligence feed, or (2) the sending application is not a standard messaging client and the daily SMS count for that device exceeds its 99th percentile historical baseline.",
            "data_sources": [
              "Carrier billing records",
              "Mobile Device Management (MDM) application inventory logs",
              "MDM application permission logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet, MDM servers, and Telecommunications provider billing systems",
            "action": [
              "Create a rule to compare the destination number of every outbound SMS message from carrier logs against an ingested threat intelligence list of fraudulent and premium-rate numbers. Trigger a high-severity alert upon a match, detailing the source device, user, destination number, and the originating application name from MDM data.",
              "For each Android device, use MDM logs to identify applications with the `SEND_SMS` permission that are not categorized as 'Messaging'. For each such application, calculate a 30-day rolling 99th percentile baseline for daily SMS volume using carrier logs. Generate a medium-severity alert if a device's daily SMS count from a non-messaging app exceeds this calculated baseline.",
              "Develop and deploy a supervised classification model (e.g., Random Forest) to score each outbound SMS event. Engineer features including: sending application category (from MDM), `SEND_SMS` permission status, time of day, destination country code, the device's historical SMS frequency, and whether the destination number is a new contact for that user. Train the model on labeled historical data (fraudulent/benign). Automatically generate a high-severity alert and initiate a device quarantine policy via MDM for any activity classified as 'fraudulent' with a model confidence score greater than 0.95."
            ]
          },
          {
            "description": "A managed mobile device exhibits a pattern of automated network activity, defined by the simultaneous occurrence of: (1) hourly DNS query or HTTP/S request volume exceeding the 95th percentile of the device's 30-day baseline; (2) DNS query Shannon entropy falling below the 5th percentile of the device's 30-day baseline, indicating low randomness; and (3) a ratio of total connections to total bytes transferred (e.g., count(conn.log) / sum(orig_bytes + resp_bytes)) exceeding the 95th percentile of the device's baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, DNS resolvers, and Internet web proxies",
            "action": [
              "Create a real-time rule to inspect the `query` field in `Zeek dns.log` and the `host` and `uri` fields in `Zeek http.log` from mobile IP ranges. Compare these values against ingested threat intelligence feeds for ad fraud, click fraud, and app-ranking manipulation. Trigger a medium-severity alert upon a match, including source IP, destination FQDN/URL, the `user_agent` string, and the matched threat feed.",
              "For each mobile device IP, execute an hourly query to calculate three metrics from Zeek logs over the past hour: 1) total connection count (`conn.log`), 2) Shannon entropy of DNS queries (`dns.log`), and 3) the ratio of connection count to total bytes transferred. Compare these metrics against the device's own 30-day rolling baseline for that specific hour-of-day. Trigger a medium-severity alert if the connection count or connection/byte ratio exceeds the 95th percentile AND the DNS query entropy falls below the 5th percentile.",
              "Implement an unsupervised anomaly detection model (e.g., Isolation Forest) on 5-minute aggregated data windows for each device IP. Engineer features from Zeek logs including: connection count, DNS query entropy, ratio of distinct destination IPs to total connections, distribution of destination ports (e.g., count of port 80, 443, other), average connection duration, and the count of unique `user_agent` strings. Train the model on at least 30 days of data to learn a baseline of normal behavior for each device. Deploy the model to score new data in near real-time, generating an alert when the anomaly score indicates a significant deviation from the established norm."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]