[
  {
    "information_requirement": "Is an adversary exploiting client application vulnerabilities to achieve code execution on managed mobile devices? (TA0041 - Execution)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1658",
        "name": "Exploitation for Client Execution",
        "evidence": [
          {
            "description": "A mobile application process (e.g., 'com.apple.mobilesafari', 'com.google.android.gm') spawns a shell process (e.g., '/bin/sh') or a command-line utility (e.g., 'curl', 'wget'), or it initiates a network connection to a known malicious C2 domain, a newly registered domain (NRD), a high-entropy domain, or a raw IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Mobile EDR/MDM process logs",
              "Mobile OS crash logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, Cloud-based mobile security gateways, Mobile Device Management (MDM) servers, Endpoint mobile devices",
            "action": [
              "Create a rule to monitor Zeek dns.log for requests originating from mobile device IP subnets. Alert on any request for a domain present on a threat intelligence feed of known malicious domains or a list of domains registered within the last 30 days. Correlate the source IP and timestamp with Zeek conn.log to verify a connection was established to the resolved IP.",
              "Using MDM/EDR process logs, establish a 30-day baseline of all parent-child process relationships for the mobile fleet. Calculate the frequency of each unique pair and alert on any new or rare pair (e.g., frequency in the bottom 1st percentile). Concurrently, for each DNS query in Zeek dns.log, calculate the Shannon entropy of the query name; alert on queries with an entropy score exceeding a threshold (e.g., 3.5) that are not on an allow-list.",
              "Train a classification model (e.g., Random Forest) to score network connections from mobile devices based on features from Zeek logs. Features should include: DNS query length, query entropy, TLD, number of subdomains (from dns.log), destination port, connection duration, total bytes sent/received, and connection state (from conn.log). Alert when a connection is classified as 'malicious' with a confidence score greater than 0.90."
            ]
          },
          {
            "description": "A mobile device reports a statistically significant increase in application or OS-level crashes (e.g., WebKit, SpringBoard) compared to its historical baseline and peer group (same device model/OS version). This crash anomaly is temporally correlated within a 60-minute window of the installation of a non-sanctioned application or configuration profile.",
            "data_sources": [
              "Mobile OS crash logs",
              "Mobile Device Management (MDM) application inventory logs",
              "Mobile Device Management (MDM) configuration profile logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) servers, Endpoint mobile devices, Corporate Wi-Fi network gateways",
            "action": [
              "Implement a continuous query to monitor MDM logs for any application installation or configuration profile update. Compare the application's bundle ID or profile's identifier against an explicit allow-list of sanctioned software. Generate a high-priority alert for any non-allow-listed installation and automatically enrich the alert with any crash logs from that device within the preceding 60 minutes.",
              "For each device cohort (grouped by device model and OS version), calculate a 30-day rolling baseline mean and standard deviation for the hourly crash rate from MDM crash logs. Generate an alert when a device's hourly crash count exceeds 3 standard deviations above the cohort's mean. Escalate the alert if, within 15 minutes of the crash spike, the device's outbound-to-inbound byte ratio in Zeek conn.log exceeds the 98th percentile of its own 30-day history.",
              "Deploy a time-series anomaly detection model (e.g., ARIMA or LSTM) to monitor the fleet-wide rate of critical crash types (e.g., 'WebKit Process Crash'). An anomalous spike across multiple devices signals a potential widespread exploit campaign. In parallel, use an unsupervised clustering algorithm (e.g., DBSCAN) on MDM application inventory data, using features like requested permissions, signing certificate authority, and app name string similarity to known apps, to identify outlier applications indicative of sideloading or trojanized versions."
            ]
          },
          {
            "description": "Peer-to-peer (P2P) traffic, specifically Apple Wireless Direct Link (AWDL) using IPv6 link-local addressing (fe80::/10), is observed in Zeek conn.log on a corporate wireless segment. This activity is followed within a 5-minute window by a system crash, the execution of an unauthorized process, or a network connection to an external, non-categorized IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Mobile OS crash logs",
              "Mobile EDR/MDM process logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, Endpoint mobile devices",
            "action": [
              "Create a high-severity alert rule to trigger on any observed connection in Zeek conn.log using an IPv6 link-local address (fe80::/10) on a corporate wireless network segment, as this indicates AWDL or similar P2P activity that is typically against policy. If a Zeek notice for 'AWDL_Known_Service' is generated, this should also trigger the alert. Correlate the device with MDM logs to confirm no legitimate, user-initiated AirDrop was recorded.",
              "In environments where some P2P traffic is permitted, establish a per-device 30-day baseline for P2P connection counts and data volume per hour from Zeek conn.log. Generate an alert if a device's hourly P2P traffic exceeds the 99th percentile of its historical behavior. Increase the alert's risk score if this anomaly occurs within 5 minutes of a system crash event reported in MDM logs for the same device.",
              "Utilize an unsupervised anomaly detection model, such as an Isolation Forest or Autoencoder, on intra-WLAN connection data from Zeek conn.log. Model normal device-to-device communication using features such as protocol, destination port, connection duration, byte transfer volume, and connection periodicity. Flag any connection with a high anomaly score, especially those involving non-standard ports or unusual data transfer patterns, as a potential zero-click exploit attempt."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-10-01",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]