[
  {
    "information_requirement": "Is an adversary leveraging legitimate remote access software for Command and Control on corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1663",
        "name": "Remote Access Software",
        "evidence": [
          {
            "description": "A network connection originating from a corporate mobile device's IP address matches an Indicator of Compromise (IoC) from a threat intelligence feed for unapproved remote access software (e.g., domain, IP, SSL/TLS certificate subject), and the source device's UEM/MDM profile confirms no sanctioned application is installed that would account for this traffic.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "UEM/MDM application inventory logs",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (Internet gateway, VPN concentrators), corporate DNS resolvers, forward web proxies (potentially Windows-based), and the Unified Endpoint Management (UEM/MDM) platform API.",
            "action": [
              "Continuously query network logs for connections where the destination matches a watchlist of unapproved remote access software IoCs. For Zeek, this involves checking `dns.log` (query field), `conn.log` (id.resp_h), and `ssl.log` (server_name, subject). Upon a match from a mobile device IP, automatically query the UEM/MDM platform API for the device's installed application list. Generate a high-severity alert if the application corresponding to the IoC is not on the device's approved software profile.",
              "For all network connections from the mobile device IP space, establish a 30-day rolling baseline of data volume (orig_bytes + resp_bytes) and connection duration per user and per destination service (e.g., TeamViewer, VNC). If a connection matches an unapproved remote access software IoC, generate a medium-severity alert if its data volume or duration exceeds the 95th percentile of that user's historical baseline for that service. Escalate to high-severity if it exceeds the 99th percentile, indicating unusually high activity.",
              "Train a supervised binary classification model (e.g., Gradient Boosting, Random Forest) on historical, labeled Zeek `conn.log` data. Features must include: protocol, destination port, duration, orig_bytes, resp_bytes, connection state, a binary flag for IoC match, and a binary flag indicating if an approved remote access tool is installed (via UEM/MDM enrichment). Deploy the model to score new connections from mobile devices in near-real-time. A classification of 'malicious-remote-access' with a high confidence score (e.g., >0.90) triggers an automated incident response action, such as device quarantine."
            ]
          },
          {
            "description": "A TCP connection from a mobile device is identified by a network sensor's dynamic protocol detection as remote access traffic (e.g., VNC, RDP, TeamViewer), but is using a non-standard destination port. The connection also exhibits behavioral anomalies, such as a duration and a packet-to-byte ratio that are statistical outliers compared to the device's normal network activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dpd.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs or SPAN ports on Wi-Fi access point uplinks, core network switches segmenting mobile device traffic, and network gateways.",
            "action": [
              "Create a SIEM rule to detect events where Zeek's `dpd.log` or `conn.log` identifies a remote access protocol in the 'service' or 'proto_name' field (e.g., 'vnc', 'rdp', 'teamviewer') but the `id.resp_p` (destination port) is not the IANA standard port for that service. Correlate this with Zeek's `notice.log` for the same connection UID, escalating priority if a 'Long_Connection' or 'Protocol_Mismatch' notice is present.",
              "For every TCP connection from a mobile device, calculate an 'interactivity ratio' as `(orig_pkts + resp_pkts) / (orig_bytes + resp_bytes)`. Maintain a per-device 30-day baseline for this ratio and for connection duration. Flag any connection where both its duration and its interactivity ratio exceed the 98th percentile of the device's own baseline. Additionally, calculate the Shannon entropy of destination ports contacted by each device over a rolling 1-hour window; a sharp increase in entropy (>2 standard deviations above baseline) should trigger a low-severity alert for reconnaissance activity.",
              "Deploy a time-series anomaly detection model (e.g., LSTM autoencoder) trained on a per-device basis. The model ingests 1-minute vectors of aggregated network telemetry for each mobile device (features: total bytes sent/received, packet count, number of unique destination IPs, average connection duration). An alert is generated when the model's reconstruction error for a device's current activity vector surpasses a dynamically adjusted threshold, indicating a significant behavioral deviation. Correlate this anomaly alert with the presence of a long-lived, high-interactivity connection to increase confidence."
            ]
          },
          {
            "description": "An unsolicited and successful inbound TCP connection is established from an external, non-RFC1918 IP address to a corporate mobile device. This event inherently violates a 'default-deny' inbound firewall policy for mobile endpoints. The connection may target a common remote access port or any other port not explicitly whitelisted for inbound traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek known_services.log",
              "Firewall accept/deny logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewall appliances, network sensors at the internet gateway, Wi-Fi controllers, and Mobile VPN concentrators.",
            "action": [
              "Implement a zero-tolerance, critical-priority alert that triggers on any log event (Firewall or Zeek `conn.log`) showing a successful connection (`conn_state` of 'SF' or 'RSTO') where the source IP (`id.orig_h`) is not within an RFC1918 or other internal address space, and the destination IP (`id.resp_h`) is within the designated mobile device DHCP range. This constitutes a direct policy violation and potential breach.",
              "On a daily basis, query Zeek's `known_services.log` to generate an inventory of all listening TCP/UDP ports observed on the mobile device fleet. For each port, calculate its prevalence (percentage of devices listening on that port). Generate a high-priority alert for any device found listening on a port that is statistically rare (e.g., present on <1% of the fleet) and is not on an approved services list. This identifies anomalous listening services that could be backdoors.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN or HDBSCAN) to the mobile device fleet. For each device, create a feature vector from its inbound connection profile over a 24-hour period, including: the set of listening ports (as a multi-hot encoded vector), the ratio of inbound to outbound connection attempts, and the number of unique external source IPs initiating connections. Devices classified as noise points (outliers) by the algorithm represent significant deviations from peer-group behavior and must be investigated for compromise."
            ]
          }
        ]
      }
    ],
    "version": "1.5",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]