[
  {
    "information_requirement": "Is an adversary accessing and exfiltrating sensitive application data from our managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1409",
        "name": "Stored Application Data",
        "evidence": [
          {
            "description": "A process on a managed mobile device performs unauthorized read or write access to another application's sandboxed storage directory, such as '/data/data/com.target.app/' on Android or '/var/mobile/Containers/Data/Application/<UUID>/' on iOS.",
            "data_sources": [
              "Mobile OS audit logs (e.g., Android logcat, iOS sysdiagnose)",
              "Mobile Device Management (MDM) security event logs",
              "Endpoint Detection and Response (EDR) for Mobile agent logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet; Application sandboxes and data containers on endpoints",
            "action": "1. (Symbolic) Using EDR/MDM logs, continuously monitor for processes that attempt to access file paths outside of their own package's data directory (e.g., a process from 'com.malicious.app' accessing '/data/data/com.corporate.app/databases/'). Alert on any access violation or if a process from a known-bad package name or hash attempts any cross-application data access. Additionally, scan for applications installed with insecure directory permissions (e.g., world-writable '777'). 2. (Statistical) For each managed application, establish a baseline of normal file access patterns over a 30-day period. Calculate the Shannon entropy of file paths accessed by a given process within a 5-minute window; a high entropy score (e.g., > 3.5) suggests directory traversal or scanning. Alert if a process accesses files in another application's directory at a rate exceeding 3 standard deviations from the established baseline for that user or device group. 3. (Machine Learning) Train a Random Forest classifier using features from OS audit logs (e.g., source process name, source parent process, target file path, access permissions requested, time of day, syscall invoked). Label data based on known-good inter-process communication (IPC) vs. known malicious cross-sandbox access. Deploy the model to classify new file access events in near-real-time and flag events classified as 'suspicious cross-sandbox access' with a confidence score > 0.9 for analyst review."
          },
          {
            "description": "An outbound network connection from a managed mobile device sends an anomalously large volume of data, especially to a low-reputation domain or non-standard port, following a period of high-privilege activity or cross-application data access.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways; VPN concentrators; Cloud Access Security Broker (CASB) egress points",
            "action": "1. (Symbolic) In your SIEM, join Zeek conn.log and dns.log on the 'uid' field. Alert if a 'src_ip' from the mobile device IP range connects to a 'dst_ip' or resolves a domain that matches a threat intelligence feed of known C2 or exfiltration endpoints. Example query: `source=zeek_conn OR source=zeek_dns | join uid [search source=zeek_dns] | where src_ip in mobile_ip_range AND (dst_ip in (ti_feed_ips) OR query in (ti_feed_domains))`. 2. (Statistical) For each mobile device IP, create a 30-day rolling baseline of outbound data volume (`orig_bytes` in conn.log). Alert when `orig_bytes` for a single connection exceeds the 99.5th percentile of the device's baseline. Enhance this by flagging connections to destination ports not in the top 10 most common ports for that device, or if the connection duration is unusually short for the volume of data sent. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., Prophet or LSTM) on total outbound data volume per device, aggregated into 5-minute intervals. The model should account for weekly and daily seasonality. Generate an alert when the observed data volume exceeds the model's forecasted upper confidence interval (`yhat_upper`), indicating a potential bulk data transfer inconsistent with normal user behavior."
          },
          {
            "description": "A corporate mobile application writes a file containing sensitive data patterns (e.g., API keys, credentials) or with a sensitive name (e.g., 'session.token') to an unprotected external storage location, such as an SD card or a world-readable directory.",
            "data_sources": [
              "Mobile EDR agent logs (file creation events)",
              "Mobile OS audit logs",
              "Mobile Data Loss Prevention (DLP) alerts"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External storage locations on managed mobile devices (e.g., /storage/emulated/0/, /sdcard/)",
            "action": "1. (Symbolic) Create a detection rule in your EDR/MDM to alert on any file creation event originating from a managed corporate application process where the target path is on external storage (e.g., starts with '/storage/emulated/0/') and the filename matches a regex for sensitive data, such as `.*(credential|password|secret|token|key|backup).*(db|json|xml|txt)`. 2. (Statistical) Profile the typical file types (extensions) and sizes written to external storage by each corporate application. Establish a baseline of normal activity. Alert when a file write event deviates significantly, for example, if an application that normally only writes `.log` files suddenly writes a 10MB `.zip` file, or if the count of files written in an hour exceeds the 98th percentile of the historical hourly count. 3. (Machine Learning) Where a mobile DLP or EDR agent provides file content, apply a pre-trained text classification model (e.g., a BERT-based model fine-tuned for PII/credential detection) to scan the content of files written to external storage. The model will classify the file content as 'Sensitive' or 'Non-Sensitive'. Flag any file created by a corporate app in an external location and classified as 'Sensitive' for immediate investigation."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]