[
  {
    "information_requirement": "Has an adversary successfully elevated privileges on a mobile device by exploiting a software vulnerability? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1404",
        "name": "Exploitation for Privilege Escalation",
        "evidence": [
          {
            "description": "A log event from an MDM/UEM platform indicates a device compliance status change, where a field such as 'isRooted' or 'isJailbroken' transitions from a value of 'false' to 'true', or a 'complianceState' field changes from 'compliant' to 'non-compliant' with a reason code related to a device integrity failure [1].",
            "data_sources": [
              "MDM/UEM compliance logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM management servers, cloud management console, managed mobile devices (corporate and BYOD), enterprise network gateways, VPN concentrators, and DNS resolvers.",
            "action": "1. (Symbolic Logic) Configure a real-time SIEM correlation rule to generate a critical alert immediately upon ingestion of an MDM/UEM log where the device's 'isRooted' or 'isJailbroken' field value changes to 'true'. 2. (Statistical Analysis) Upon alert, automatically query network connection logs (Zeek conn.log) for the affected device's IP address over the preceding 72 hours. For each connection, compare its attributes (destination port, destination ASN, connection duration) against a pre-computed baseline for that specific device. Flag any connection where an attribute exceeds the 98th percentile of its historical distribution (e.g., a connection to a port never before used by this device). 3. (Machine Learning) Score the device's recent network connections (Zeek conn.log) using a pre-trained anomaly detection model, such as an Isolation Forest, built on features like connection duration, bytes sent/received, protocol, and destination port rarity. A connection receiving a high anomaly score that occurs within 60 minutes of the root/jailbreak detection event strongly suggests it is linked to the compromise activity, such as C2 communication or exploit payload delivery."
          },
          {
            "description": "An MDM/UEM application inventory log or a Mobile Threat Protection (MTP) alert shows the installation or execution of an application on a managed device where the application's package name, signing certificate thumbprint, or file hash (e.g., SHA256) matches an entry on a threat intelligence feed for known mobile malware or exploitation tools.",
            "data_sources": [
              "MDM/UEM application inventory logs",
              "Mobile Threat Protection (MTP) agent logs",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices with MTP agents, MDM/UEM management console, integrated threat intelligence platforms, network egress points, and corporate Wi-Fi infrastructure.",
            "action": "1. (Symbolic Logic) Implement a continuous monitoring rule that cross-references all application installation events from MDM/MTP logs against a curated threat intelligence database of malicious mobile application hashes, package names, and signing certificates. Trigger a high-severity alert on any match. 2. (Statistical Analysis) For devices triggering the alert, analyze their DNS query history (Zeek dns.log) from the last 24 hours. Calculate the Shannon entropy for each requested domain name (qname). Flag any domain where the entropy score is in the top 5% (95th percentile) of all queries from the mobile device subnet, as this may indicate DGA-based C2. Additionally, monitor the ratio of NXDOMAIN responses to total queries for each device; a ratio exceeding two standard deviations above the device's moving average baseline indicates potential C2 beaconing. 3. (Machine Learning) Deploy a supervised classification model (e.g., Gradient Boosting) to analyze network sessions associated with application downloads from Zeek logs (http.log, ssl.log). Use features such as the User-Agent string, JA3/JA3S hashes, server certificate validity period, destination IP reputation, and file MIME type. A session classified as 'malicious' that precedes the installation of an unvetted application should be investigated as the potential exploit delivery vector."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]