[
  {
    "information_requirement": "Is an adversary collecting sensitive information from mobile device clipboards?",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1414",
        "name": "Clipboard Data",
        "evidence": [
          {
            "description": "An installed Android application, which is not registered as the default input method editor (IME) in its manifest, is observed making API calls to ClipboardManager.addPrimaryClipChangedListener.",
            "data_sources": [
              "Mobile Application Static Analysis Report",
              "Mobile Threat Defense (MTD) Logs",
              "Android Application Manifest (AndroidManifest.xml)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android devices, Corporate application vetting pipeline, Mobile Device Management (MDM) server",
            "action": "Symbolic: During application vetting, parse the AndroidManifest.xml to verify if the application registers as an IME. Concurrently, perform static code analysis on the APK to detect the use of the `addPrimaryClipChangedListener` method. Generate a high-severity alert if a non-IME application attempts to register a clipboard listener. Statistical: From MTD logs, aggregate all clipboard access events per application across all devices over a 30-day period. Calculate the mean and standard deviation of clipboard accesses for each application category (e.g., 'Productivity', 'Social'). Flag any application whose access frequency exceeds three standard deviations from its category's mean. Machine Learning: Develop a supervised classification model (e.g., Random Forest) to predict if an application is malicious, using features from static analysis including API calls (`addPrimaryClipChangedListener`), requested permissions, and the presence of obfuscated code. Train the model on a labeled dataset of known benign and malicious applications to classify newly submitted apps."
          },
          {
            "description": "An iOS application is observed making calls to UIPasteboard.general with a frequency or timing pattern inconsistent with normal user-driven copy-paste actions, such as programmatic access immediately upon the app entering the foreground.",
            "data_sources": [
              "Mobile Application Dynamic Analysis Report (Sandboxing)",
              "Mobile Device Management (MDM) Logs",
              "Mobile Threat Defense (MTD) Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed iOS devices, Corporate application vetting pipeline, Sandboxed analysis environment",
            "action": "Symbolic: Within a dynamic analysis sandbox, hook and log all calls to the UIPasteboard class. For managed devices running iOS 14+, query MDM logs for the literal notification string 'pasted from' to identify user-surfaced clipboard access events. Statistical: For each application, calculate the time delta between the 'applicationWillEnterForeground' event and the first subsequent UIPasteboard access event. Establish a baseline distribution of these time deltas and flag any application whose median time delta falls into the lowest 5th percentile. Machine Learning: Apply time-series anomaly detection (e.g., using an LSTM autoencoder) to the sequence of API calls made by each application during a sandboxed session. Train the model on sequences from known benign applications. An application that generates a sequence with a high reconstruction error, particularly a sequence involving rapid, repeated UIPasteboard access, should be flagged as anomalous."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary capturing credentials copied from password managers or other sensitive applications on mobile devices?",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1414",
        "name": "Clipboard Data",
        "evidence": [
          {
            "description": "An application, which is not an approved password manager or web browser, is observed accessing the clipboard within five seconds of an approved password manager application being backgrounded.",
            "data_sources": [
              "Mobile Threat Defense (MTD) Behavioral Logs",
              "Mobile Application Usage Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices with corporate-approved password managers installed",
            "action": "Symbolic: Define a list of approved password manager process names. Create a SIEM rule that triggers an alert when the following sequence is observed on a single device: 1) A process from the approved list is active, 2) the process is backgrounded, and 3) within 5 seconds, a different process not on the approved list accesses the clipboard. Statistical: For every instance of a non-password-manager app accessing the clipboard, find the last time a password manager was used on that device. Calculate the distribution of these time deltas across the organization. Flag any application whose median time delta is consistently below the 10th percentile of all observed deltas. Machine Learning: Train a sequence classification model using event logs containing application focus changes and clipboard access events. Label sequences as 'benign' (e.g., pasting into a browser) or 'malicious' (e.g., a known malicious app scraping a password). Use the trained model to classify new event sequences in real-time."
          },
          {
            "description": "Within two minutes of accessing the clipboard, an application initiates a network connection to a domain with a high-entropy name or a destination IP address associated with known malicious infrastructure.",
            "data_sources": [
              "Mobile Threat Defense (MTD) Logs",
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device endpoints, Corporate VPN concentrators, DNS resolvers, Network egress points",
            "action": "Symbolic: Correlate MTD clipboard access alerts with network logs using device IP and timestamp. Create a rule that triggers a high-severity alert if an application that accessed the clipboard within the last 2 minutes initiates a network connection to a domain or IP address present in a threat intelligence feed. Statistical: For every network connection following a clipboard access event, calculate the Shannon entropy of the queried domain name from Zeek dns.log. Flag any connection where the domain entropy exceeds a threshold of 3.5. Additionally, identify domains that are requested by fewer than 3 devices in 30 days and flag them for investigation. Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on features extracted from Zeek logs (conn.log, ssl.log, dns.log) for connections following clipboard access events. Features should include destination IP, port, protocol, JA3S hash, and domain entropy to identify clusters of anomalous exfiltration traffic."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]