[
  {
    "information_requirement": "Is an adversary enumerating local or adjacent networks from a managed mobile device? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1421",
        "name": "System Network Connections Discovery",
        "evidence": [
          {
            "description": "An application on a managed mobile device makes API calls to `WifiInfo`, `BluetoothAdapter`, or `TelephonyManager` at a frequency exceeding the 95th percentile for that application or its category, or outside of its normal operating context (e.g., a calculator app scanning for Bluetooth devices).",
            "data_sources": [
              "Mobile EDR logs of Android API calls (e.g., `WifiInfo`, `BluetoothAdapter`, `TelephonyManager`)",
              "Android Logcat output captured by MDM/EDR",
              "Application inventory and categorization data from MDM"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (Android/iOS)",
            "action": "For each managed device, continuously monitor API calls. 1) (Symbolic) Maintain an IOC list of package names and hashes of known malicious applications; trigger a high-severity alert if an application making discovery calls matches this list. 2) (Statistical) For each application, establish a 30-day rolling baseline of the hourly frequency of network discovery API calls. Trigger a medium-severity alert if the call count in a given hour exceeds the 95th percentile for that specific app, and a high-severity alert if it exceeds the 99th percentile. Compare an app's call rate to its peer group (e.g., other apps in the 'Productivity' category) and flag significant outliers. 3) (Machine Learning) Train an isolation forest model on features from API call events, including call frequency, time of day, application category, and application age. Use the model to score new API call events in real-time; events identified as anomalies indicate potentially malicious discovery activity not caught by static thresholds."
          },
          {
            "description": "A sequence of network discovery API calls from a single mobile device is followed within a 5-minute window by an outbound network connection to a domain that is either present on a threat intelligence feed, has a low reputation score, or was registered within the last 30 days.",
            "data_sources": [
              "Mobile EDR logs of Android API calls",
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Platform domain feeds",
              "Passive DNS records"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate wireless network and internet gateway",
            "action": "Correlate device-level API logs with network logs using device IP and timestamp. 1) (Symbolic) Create a SIEM rule that triggers when a device's network discovery API call event is followed within 5 minutes by a DNS query (Zeek dns.log) or connection (Zeek conn.log) to a destination domain/IP on a C2 threat intelligence list. 2) (Statistical) After a device performs discovery calls, monitor its DNS requests (Zeek dns.log). Calculate the Shannon entropy of the requested second-level domain strings in a 1-minute window; a value exceeding 3.5 suggests DGA activity. Also, track the prevalence of destination domains; a connection to a domain seen by fewer than 5 other devices enterprise-wide is highly suspicious. 3) (Machine Learning) Use a time-series forecasting model (e.g., ARIMA) to predict the expected volume and diversity of outbound network connections from a device based on its history. If, following discovery calls, the actual connection volume or number of unique destination IPs significantly exceeds the prediction, flag it as anomalous behavior indicative of data exfiltration or C2 channel establishment."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]