[
  {
    "information_requirement": "Is an adversary attempting to discover Wi-Fi network information on our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1422.002",
        "name": "Wi-Fi Discovery",
        "evidence": [
          {
            "description": "An application makes an abnormally high number of calls to Wi-Fi configuration APIs, such as `WifiManager.getConfiguredNetworks()` on Android or `NEHotspotConfigurationManager.fetchConfigurations` on iOS, within a short time frame (e.g., >10 calls in 1 minute).",
            "data_sources": [
              "Mobile Device Management (MDM) API call logs",
              "Mobile Endpoint Detection and Response (EDR) process activity logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS, Android), Mobile Device Management (MDM) Platform",
            "action": "Detection 1 (Symbolic): Create and maintain an allow-list of application hashes and names authorized to access Wi-Fi configuration APIs. Generate a high-severity alert for any application not on this list that attempts to call these APIs. Detection 2 (Statistical): For each application on each device, establish a baseline of API call frequency for Wi-Fi configuration retrieval over a 30-day rolling window. Generate a medium-severity alert if the call count in a 5-minute interval exceeds 3 standard deviations or the 99th percentile of the historical baseline. Detection 3 (Machine Learning): Train a decision tree classifier using features such as API call frequency, application category, application prevalence across the device fleet, and whether the API call is followed by a network connection to a newly observed domain within 60 seconds. The model will classify a sequence of events as 'benign' or 'suspicious Wi-Fi discovery'."
          },
          {
            "description": "A mobile device, within 5 minutes of connecting to a Wi-Fi network, initiates connections to more than 20 unique IP addresses or 10 unique ports on the local subnet (/24), excluding common broadcast and multicast addresses.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "DHCP Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and guest Wi-Fi network segments, Network sensors (e.g., Zeek), DHCP servers",
            "action": "Detection 1 (Symbolic): Monitor Zeek notice.log for 'Scan::Address_Scan' or 'Scan::Port_Scan' notice types. Correlate the source IP with DHCP logs to identify the mobile device's MAC address and hostname. Alert if the scan originates from a device within the corporate mobile device IP range. Detection 2 (Statistical): Using Zeek conn.log, calculate the Shannon entropy of destination ports and the count of unique destination IPs for each source IP within a 60-second window. Alert if a source IP's unique destination IP count on the local subnet exceeds a threshold (e.g., >20) and its port entropy is greater than the 95th percentile for all mobile devices. Detection 3 (Machine Learning): Use a time-series anomaly detection model (e.g., ARIMA or LSTM) on the rate of new connections per source IP, aggregated in 1-minute intervals. Train the model on at least 30 days of historical Zeek conn.log data. An alert is generated when the observed connection rate for a mobile device IP significantly deviates from the forecasted rate, indicating a sudden burst of activity characteristic of scanning."
          },
          {
            "description": "A process reads a known Wi-Fi credential store (e.g., `/data/misc/wifi/wpa_supplicant.conf` on rooted Android, iOS Keychain items with `kSecAttrService` as `com.apple.wifid.passwords`) and within 60 seconds initiates a network connection to a destination not previously associated with that application or device.",
            "data_sources": [
              "Mobile EDR file integrity monitoring logs",
              "Mobile EDR process or keychain access logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Network Egress Points (Firewall/Proxy), Internal DNS Resolvers",
            "action": "Detection 1 (Symbolic): From Mobile EDR logs, trigger an alert when a process hash or name matching a threat intelligence feed of known malware attempts to access a Wi-Fi credential store. Correlate this EDR alert with any outbound network connection (Zeek conn.log) from the same device within a 5-minute window to a non-categorized or known-bad destination IP. Detection 2 (Statistical): For any process that accesses a Wi-Fi credential store, analyze the destination domain of any subsequent network connection using Zeek dns.log. Calculate the domain's prevalence score based on the number of unique devices contacting it in the last 30 days. Alert if a connection is made to a domain in the bottom 1st percentile of prevalence (a 'rare' domain). Detection 3 (Machine Learning): Develop a sequence-based classifier (e.g., a Hidden Markov Model) that takes a series of events as input: [Process starts -> Process reads credential store -> Process initiates network connection to Domain X]. The model, trained on benign and simulated malicious sequences, will classify this event chain as malicious if it matches a learned attack pattern, such as a non-browser process reading credentials and immediately connecting to a domain with high entropy."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]