[
  {
    "information_requirement": "Is an adversary attempting to discover sensitive information on our corporate mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1420",
        "name": "File and Directory Discovery",
        "evidence": [
          {
            "description": "An application on a managed Android device accesses more than 100 unique file paths in external storage within a 5-minute window, or accesses file paths with a Shannon entropy score greater than 3.5, which deviates from its established 30-day baseline behavior by more than 3 standard deviations.",
            "data_sources": [
              "Mobile Threat Defense (MTD) file access logs",
              "Mobile Endpoint Detection and Response (EDR) telemetry",
              "Android OS logs (logcat)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android mobile devices",
            "action": "1. (Symbolic) Create a rule to alert when any non-whitelisted application accesses specific sensitive directory names such as '/sdcard/Download/', '/sdcard/Documents/', or '/sdcard/DCIM/'. 2. (Statistical) For each managed application, establish a 30-day baseline of file access counts and accessed path entropy. Alert when the number of unique files accessed in a 5-minute window exceeds the 99th percentile for that app, or when the Shannon entropy of accessed directory paths exceeds its baseline by 3 standard deviations. 3. (Machine Learning) Train a one-class SVM or Isolation Forest model on features from normal application behavior (e.g., file access frequency, path depth, directory name entropy). Use the model to classify new file access events in real-time as 'normal' or 'anomalous', with anomalies triggering an alert for analyst review."
          },
          {
            "description": "A user grants 'android.permission.READ_EXTERNAL_STORAGE' or 'android.permission.WRITE_EXTERNAL_STORAGE' to an application that is not on the corporate approved application list or whose Google Play Store category (e.g., 'Flashlight') does not align with the permission's function.",
            "data_sources": [
              "Mobile Device Management (MDM) application permission logs",
              "Mobile Threat Defense (MTD) security event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform, Mobile Threat Defense (MTD) console, corporate application whitelist repository",
            "action": "1. (Symbolic) Maintain a whitelist of approved applications and their required permissions. Generate a high-priority alert if a storage-related permission is granted to any application not on the whitelist, or if an app requests a permission not specified in its whitelist profile. 2. (Statistical) Track the grant rate for specific permissions across the device fleet. Use a percentile-based threshold (e.g., a daily grant rate for a single app exceeding the 98th percentile of all app permission grants) to detect a sudden, widespread campaign. 3. (Machine Learning) Use K-Means clustering on application metadata (app category, developer reputation, install base size) and requested permissions to identify clusters of high-risk applications. New applications falling into a high-risk cluster (e.g., a 'Calculator' app from an unknown developer requesting storage and network access) should trigger an alert."
          },
          {
            "description": "A mobile device transmits over 50MB of data to one or more new or rare external IP addresses within 30 minutes following an on-device alert for anomalous file access or a high-risk permission grant.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "MTD/EDR for Mobile network flow logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensor logs from corporate Wi-Fi access points, VPN concentrators, and cloud access security brokers (CASB)",
            "action": "1. (Symbolic) Upon a correlated file access or permission grant alert, query network logs for the device's IP. Immediately alert if the device communicates with any destination IP address or domain present on a threat intelligence feed of known C2 servers. 2. (Statistical) For a device with a preceding on-device alert, calculate the total outbound data volume (`orig_bytes` in Zeek conn.log) in the following 30-minute window. Generate an alert if this volume exceeds the 95th percentile of the user's 30-day rolling average and the destination is a new or rare external IP for that user. 3. (Machine Learning) Model each device's typical outbound network traffic volume using a time-series forecasting model like ARIMA. If, following an on-device alert, the actual traffic volume significantly deviates from the forecasted volume (i.e., the residual error is anomalously high), flag it as a potential exfiltration event."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]