[
  {
    "information_requirement": "Is an adversary attempting to discover the physical location of our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.001",
        "name": "Remote Device Management Services",
        "evidence": [
          {
            "description": "A successful authentication to an EMM/MDM console (e.g., Windows Event ID 4624) is observed with multiple concurrent anomalies. These include: 1) The source IP address is present on a threat intelligence feed. 2) The source IP's geolocation (country/ASN) is new for the user based on a 90-day lookback. 3) The login time falls outside the user's typical 5th-95th percentile of activity hours. 4) The TLS client fingerprint (JA3 hash) from Zeek ssl.log is new or rare for the user account.",
            "data_sources": [
              "EMM/MDM application logs",
              "Windows Event ID 4624",
              "RADIUS authentication logs",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "EMM/MDM web application servers, Authentication servers (e.g., Domain Controllers, RADIUS), Network egress points and web proxies, Administrative workstations and VDI environments",
            "action": "1. Symbolic Logic: Query for successful EMM/MDM logins (Windows Event ID 4624) where the source IP (from Zeek conn.log) matches a known malicious IP from a threat intelligence feed within the last 5 minutes. Generate a critical alert. 2. Statistical Analysis: For each administrative user, create a 90-day baseline profile from Zeek and authentication logs. The profile should include: a) a set of known source countries/ASNs, b) a distribution of login hours, c) a set of known user-agent strings, and d) a set of known JA3 hashes. Generate a medium-risk alert for any successful login (Windows Event ID 4624) that deviates in one of these dimensions (e.g., new country, login time outside 5th-95th percentile, new user-agent). Escalate to high-risk if two or more deviations occur for the same login event. 3. Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest or Autoencoder) on historical successful EMM/MDM administrative logins. Use features such as source ASN, source country (one-hot encoded), time of day and day of week (as cyclical features), user-agent string (using a hashing vectorizer), and JA3 hash. Score each new successful login in real-time; logins with an anomaly score in the top 1% should be flagged for immediate investigation as a potential compromised account."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary collecting location data from our managed mobile devices via remote management services? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.001",
        "name": "Remote Device Management Services",
        "evidence": [
          {
            "description": "An anomalous pattern of device location queries from a single administrative account is observed in EMM/MDM application logs. This is evidenced by: 1) The rate of location API calls from the account exceeds the 99th percentile for all admin users over a 1-hour window. 2) The account queries the location of a number of unique devices that exceeds its own 95th percentile baseline. 3) The timing between consecutive queries exhibits abnormally low entropy, suggesting scripted activity. [1]",
            "data_sources": [
              "EMM/MDM application logs",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "EMM/MDM web application servers, Authentication servers, Network egress points and web proxies, Cloud service access points (for iCloud/Google Find My)",
            "action": "1. Symbolic Logic: From EMM/MDM application logs or Zeek http.log, identify requests to specific device location API endpoints (e.g., POST /api/v2/devices/locate). Create a rule that triggers a high-priority alert if a single user account or source IP makes more than 50 such requests within a 1-hour period. If traffic is encrypted, use Zeek dns.log to monitor for an unusual volume of queries to the EMM/MDM FQDN correlated with a single source IP. 2. Statistical Analysis: Using EMM/MDM application logs, establish a per-user baseline for two metrics over a 30-day period: (a) the number of unique devices located per hour, and (b) the entropy of the time intervals between location requests. Generate a medium-risk alert if a user exceeds the 98th percentile for unique devices located in an hour compared to their peers. Generate a high-risk alert if the time-interval entropy for a user's session drops below a threshold (e.g., < 2.0), indicating highly repetitive, automated querying. 3. Machine Learning: Implement a time-series anomaly detection model (e.g., SARIMA or Prophet) on the minute-by-minute aggregate count of location API calls across the entire EMM/MDM platform. The model should account for daily and weekly seasonality. Configure the model to generate an alert when the observed count of lookups exceeds the model's predicted 99% confidence interval, which could indicate a large-scale, platform-wide collection effort by one or more compromised accounts."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]