[
  {
    "information_requirement": "Is an adversary using standard application protocols for command and control on our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1437",
        "name": "Application Layer Protocol",
        "evidence": [
          {
            "description": "A mobile device establishes connections to a single destination IP/domain at highly regular intervals, exhibiting a low coefficient of variation (<0.2) in inter-arrival times, with consistently small and uniform payload sizes (e.g., standard deviation < 100 bytes), indicative of automated C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi infrastructure, VPN concentrators",
            "action": "1. (Symbolic) Query Zeek conn.log and http.log for connections from the mobile device IP space to destination IPs or domains present on an ingested threat intelligence feed of known C2 servers. Generate an alert for any match. 2. (Statistical) For each mobile source IP, group connections by destination IP over a 24-hour window. Calculate the coefficient of variation (standard deviation / mean) for the time delta between connections and the standard deviation for both 'orig_bytes' and 'resp_bytes' fields from Zeek conn.log. Flag source-destination pairs where the time delta coefficient of variation is below 0.2 and the payload size standard deviation is below 100 bytes. A combination of these two conditions strongly suggests beaconing. 3. (ML) Apply a DBSCAN clustering algorithm to mobile device network traffic from Zeek conn.log. Use features such as destination port, connection frequency, coefficient of variation for inter-arrival times, and mean/standard deviation of payload sizes. Isolate and analyze small, dense clusters that represent anomalous, machine-like beaconing behavior, which will be distinct from the larger, more diffuse clusters representing normal, user-driven web browsing."
          },
          {
            "description": "DNS traffic from a mobile device exhibits tunneling characteristics, such as an abnormally high query rate (>100 queries/hour) to a single registered domain, FQDNs with high character entropy (>4.5) indicative of encoded data, or unusually large DNS response sizes (>512 bytes) in TXT or AAAA records.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, DNS forwarders, Network egress points",
            "action": "1. (Symbolic) Scan the 'query' field in Zeek dns.log for domains matching patterns from a threat intelligence feed of known DGA and DNS tunneling C2 providers. Generate an alert for any match originating from a mobile device IP. 2. (Statistical) For each mobile source IP, calculate the character entropy of the subdomain portion of the 'query' field in Zeek dns.log. Concurrently, calculate the length of the 'answers' field for TXT records. Establish a 30-day baseline to find the 99th percentile for both metrics. Generate an alert when a query from a mobile device exceeds both the entropy threshold (e.g., >4.5) and the 99th percentile for response size, indicating potential data exfiltration via DNS. 3. (ML) Train a Random Forest classifier using labeled DNS data. Engineer features from Zeek dns.log including: query length, subdomain entropy, ratio of numeric to alphabetic characters in the subdomain, query type distribution per source IP, and TXT record response size. Deploy the trained model to classify live DNS queries from mobile devices, flagging queries classified as 'DGA' or 'tunneling' with high confidence."
          },
          {
            "description": "An HTTP/S request from a mobile device presents a client signature, such as a User-Agent string or a JA3/JA3S TLS fingerprint pair, that is either known to be associated with malware or has a prevalence of less than 0.1% across the mobile device population over a 30-day baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Application Firewalls (WAFs), Reverse proxies, Internet gateways",
            "action": "1. (Symbolic) Maintain and ingest a threat intelligence list of User-Agent strings and JA3/JA3S hashes associated with known mobile malware and C2 frameworks. Scan Zeek http.log ('user_agent' field) and Zeek ssl.log ('ja3' and 'ja3s' fields) to generate an alert on any exact match from a mobile device. 2. (Statistical) For all mobile devices, create a frequency table of all observed User-Agent strings (from http.log) and JA3 hashes (from ssl.log) over the last 30 days. Calculate the prevalence of each signature. Generate an alert for any User-Agent or JA3 hash that has a prevalence of less than 0.1% or is observed on fewer than 3 unique devices, indicating a rare client that requires investigation. 3. (ML) Use an Isolation Forest anomaly detection model trained on benign mobile client traffic signatures. Extract features from Zeek logs such as User-Agent string length, token count within the User-Agent, and the categorical JA3 hash. The model will build a profile of normal clients. Score new connections in real-time and flag those with high anomaly scores, which represent significant deviations from the established baseline of legitimate mobile application clients."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]