[
  {
    "information_requirement": "Is an adversary attempting to discover the location of our subscribers by impersonating SS7 nodes? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "One or more SS7 Mobile Application Part (MAP) location-related query messages, such as Send Routing Information for SM (SRI-SM) or Provide Subscriber Information (PSI), are received by the Home Location Register (HLR) from an external Global Title (GT) not present on the established roaming partner whitelist.",
            "data_sources": [
              "SGW_map_transactions.log",
              "HLR_query_logs.csv",
              "roaming_partner_gt_whitelist.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network infrastructure, specifically the SS7 signaling plane interfaces (Signaling Gateways) and subscriber databases (HLR/HSS).",
            "action": "Symbolic: Using a SIEM, join SGW_map_transactions.log with the roaming_partner_gt_whitelist.csv on the source Global Title (GT). Alert on any transaction where the message type is a location query (e.g., SRI-SM, PSI) and the source GT is not found in the whitelist. Statistical: From SGW_map_transactions.log, for each non-whitelisted source GT, calculate the ratio of location queries to all other message types over a 24-hour period. Compare this ratio to a 30-day rolling baseline of legitimate partner traffic. Flag any GT whose location query ratio exceeds the 99th percentile of the legitimate baseline. Machine Learning: Query the output of the 'SS7_Transaction_Classifier' model. Investigate any event where the model's classification is 'suspicious' and the source GT is not on the roaming partner whitelist, particularly if the model's confidence score is above 0.90."
          },
          {
            "description": "A single external source Global Title (GT) issues a statistically anomalous volume of location queries against a high number of unique subscriber identifiers (MSISDNs) within a one-hour time window, indicating a scanning or enumeration attempt.",
            "data_sources": [
              "SGW_map_transactions.log",
              "HLR_query_logs.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network infrastructure, specifically the SS7 signaling plane interfaces (Signaling Gateways) and subscriber databases (HLR/HSS).",
            "action": "Symbolic: In HLR_query_logs.csv, create a rule to trigger a high-severity alert if a single source GT queries for more than 500 unique MSISDNs within a 1-hour window. This indicates a potential enumeration scan. Statistical: For each source GT in HLR_query_logs.csv, calculate the hourly count of unique MSISDNs queried. Compute a Z-score for this count against the GT's own 30-day rolling average and standard deviation. Alert if the Z-score $$ Z = (x - \\mu) / \\sigma $$ is greater than 3. Machine Learning: Query the output of the 'SS7_Scanning_Detection' clustering model (e.g., DBSCAN). Investigate any source GTs that are classified as outliers or part of a small, high-volume cluster, as these represent anomalous scanning behavior not matching typical roaming partner profiles."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary successfully collecting subscriber location data via SS7 network exploitation? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "Multiple sequential SS7 MAP location queries for a single subscriber identifier (MSISDN) are received from the same external, non-whitelisted, Global Title (GT) within a 15-minute time frame, indicating active tracking of an individual.",
            "data_sources": [
              "HLR_query_logs.csv",
              "SGW_map_transactions.log",
              "VLR_event_logs.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Subscriber location databases (HLR/HSS, VLR) and the signaling gateways (SGW) that route queries to them.",
            "action": "Symbolic: In HLR_query_logs.csv, group by MSISDN and source GT. Generate a 'Potential Subscriber Tracking' alert if the count of location queries from a single, non-whitelisted source GT for a single MSISDN exceeds 3 within a 15-minute window. Statistical: For each MSISDN, calculate the Shannon entropy of the source GTs making location queries over a 24-hour period using the formula $$ H(X) = -\\sum p(x_i) \\log_2 p(x_i) $$. A score near 0 indicates a single source is responsible for most queries. Flag MSISDNs in the bottom 5th percentile of entropy scores for review. Machine Learning: Query the 'SS7_Sequence_Analyzer' model's output. Investigate any MSISDN for which the model flags a sequence of events as an 'anomalous tracking pattern', such as repeated location queries with no subsequent call or messaging activity."
          },
          {
            "description": "A successful SS7 MAP response message, such as SRI-SM ACK, containing sensitive subscriber location information like the serving MSC/VLR address, is transmitted to an external Global Title (GT) that is not on the partner whitelist or has been previously flagged as suspicious.",
            "data_sources": [
              "HLR_query_logs.csv",
              "SGW_map_transactions.log",
              "roaming_partner_gt_whitelist.csv"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points of the core network's signaling plane, specifically the Signaling Gateways (SGWs) responsible for forwarding responses to external networks.",
            "action": "Symbolic: Correlate inbound location queries with their outbound responses in SGW_map_transactions.log. If an outbound response message is successful and its destination GT is not in the roaming_partner_gt_whitelist.csv, generate a 'Confirmed Location Data Exfiltration' critical alert. Statistical: For each external source GT, calculate the success rate of its location queries (successful responses / total queries) per hour. Alert if the success rate for a non-whitelisted GT spikes to over 90% and exceeds the 95th percentile of the typical success rate for legitimate roaming partners. Machine Learning: Query the 'SS7_Network_Graph' anomaly detection model. Investigate any non-whitelisted GT node that is flagged as a 'high-centrality collector' outlier, indicating a node with an anomalously high number of successful collection links from many distinct MSISDN nodes."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]