[
  {
    "information_requirement": "Has an adversary compromised a user's corporate account access by performing a SIM swap? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful user authentication to a corporate service occurs within 4 hours of the user's registered mobile device being marked as 'unreachable' or 'offline' by the MDM system. The authentication event exhibits at least two statistically significant anomalous characteristics, such as a source IP from a previously unseen country or Autonomous System Number (ASN), a user-agent string inconsistent with the user's device history, or a login time more than 3 standard deviations from the user's mean login hour.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Mobile Device Management (MDM) logs",
              "Azure AD Sign-in logs",
              "VPN logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Domain Controllers, ADFS), Cloud Identity Provider Platforms (Azure AD, Okta), VPN Concentrators, MDM Servers, Internet Gateways",
            "action": "1. (Symbolic) Create a SIEM rule that triggers when an MDM log indicates a device is offline and, within the next 4 hours, a successful authentication log (e.g., Windows Event ID 4624, Azure AD Sign-in) for the same user is observed from an IP address on a threat intelligence list of known anonymizing services (Tor, VPN, proxy). 2. (Statistical) For every successful login, enrich with source IP geolocation and ASN data from Zeek conn.log. Maintain a 90-day rolling baseline for each user's typical login hours, source countries, source ASNs, and user-agent strings. Calculate a risk score for each new login based on deviations from this baseline (e.g., +1 for login outside of 95th percentile of hours, +2 for new ASN, +3 for new country). An alert is generated when a user's login risk score exceeds a dynamically calculated threshold, such as the 98th percentile of all user risk scores for that day. 3. (ML) Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) trained on historical user authentication data features (time of day, day of week, source ASN, country, user-agent). This model will identify logins that are mathematically dissimilar from the user's established behavior cluster. A login flagged as an outlier by the model, especially when correlated with a recent MDM offline event for that user, should be treated as a high-priority alert for potential account takeover via SIM swap."
          }
        ]
      },
      {
        "technique_id": "T1566",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A user interacts with an email containing keywords related to mobile carriers or account security (e.g., 'SIM swap', 'port-out', 'T-Mobile alert'), clicks a link leading to a non-whitelisted domain, and a subsequent HTTP POST request from the user's machine to that domain is observed containing form data field names associated with PII (e.g., 'ssn', 'dob', 'securityPin', 'maidenName').",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Email gateway logs",
              "Web proxy logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate email gateway, Enterprise DNS resolvers, Web proxies/Internet gateways, Endpoint devices",
            "action": "1. (Symbolic) Implement a detection rule that scans email body and subject text for keyword combinations related to mobile carriers and security actions. For any emails matching these patterns, cross-reference all embedded URLs against a threat intelligence feed of known phishing domains. If a user clicks a malicious link, generate an immediate alert. 2. (Statistical) For all DNS queries to domains not on an enterprise allow-list, calculate the domain's Shannon entropy and its Levenshtein distance from the domains of known mobile carriers and financial institutions. A high entropy score (suggesting DGA) or a low distance score (suggesting typosquatting), especially for a domain with low global prevalence, should flag the traffic for inspection. 3. (ML) Train a supervised machine learning classifier (e.g., Random Forest) using features from email headers (e.g., 'dmarc'/'spf'/'dkim' results, originating mail server reputation), body content (e.g., TF-IDF of n-grams, presence of urgent language), and URL structure (e.g., domain age, path depth, number of subdomains). Use this model to assign a 'PII Phishing Probability' score to each incoming email. Emails exceeding a high probability threshold (e.g., > 0.90) that are also clicked by a user should trigger an alert and automatically place the user's account on a high-risk watchlist for heightened authentication monitoring."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]