[
  {
    "information_requirement": "Is an adversary attempting to disrupt mobile device communications through a Network Denial of Service attack? (TA0034 - Impact)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1464",
        "name": "Network Denial of Service",
        "evidence": [
          {
            "description": "Multiple (>3) MDM-enrolled mobile devices within a 50-meter radius simultaneously report a loss of Wi-Fi connectivity and an inability to detect any available SSIDs for a sustained period (>60 seconds), while network-side monitoring shows an abrupt cessation of traffic from their last known IP addresses without a corresponding TCP FIN or RST packet in Zeek connection logs.",
            "data_sources": [
              "Zeek conn.log",
              "MDM Wi-Fi Status Events",
              "MDM Geolocation Data",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points in sensitive areas (e.g., executive suites, R&D labs, data centers), mobile devices of key personnel, and geofenced event spaces (e.g., boardrooms, all-hands meeting areas).",
            "action": "Symbolic: 1. Correlate MDM Wi-Fi status events with MDM geolocation data in the SIEM. 2. Create a rule that triggers an alert if more than 3 devices within a 50-meter radius simultaneously report a 'disconnected' state and a visible SSID count of 0 for over 60 seconds. 3. As a secondary condition, query Zeek conn.log for the last known IP addresses of these devices and confirm the absence of 'F' (FIN) or 'R' (RST) in the 'history' field of their final connection records. Statistical: 1. For each device, ingest historical Received Signal Strength Indicator (RSSI) values from MDM logs to build a statistical profile. 2. Calculate a 30-day rolling mean and standard deviation of RSSI for each device within specific NAIs. 3. Generate an alert if a device's live RSSI drops more than 3 standard deviations below its personal baseline for that NAI. 4. Concurrently, calculate a collective NAI baseline for all devices and alert if the average RSSI for 5+ devices drops 2 standard deviations below the NAI's collective baseline. Machine Learning: 1. Create a time series dataset representing the count of Wi-Fi disconnect events per minute for each NAI. 2. Apply a time series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to this data to detect unusual spikes. 3. For any flagged spike, execute a density-based clustering algorithm (e.g., DBSCAN) on the reported latitude/longitude of the affected devices. 4. Escalate to a high-severity alert if the anomaly detection and geographic clustering both trigger, confirming a localized, mass-disconnection event."
          },
          {
            "description": "A significant number of MDM-enrolled devices (e.g., >10% of devices in an NAI) simultaneously report a 'No Service' cellular state or a Reference Signal Received Power (RSRP) drop below a critical threshold (e.g., -120 dBm) for over 2 minutes, in a location with a historically strong cellular coverage baseline (e.g., average RSRP > -95 dBm).",
            "data_sources": [
              "MDM Cellular Status Logs",
              "MDM Geolocation Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Geofenced perimeters of critical infrastructure (corporate headquarters, data centers), off-site meeting venues for executive events, and the real-time travel corridors of high-value personnel.",
            "action": "Symbolic: 1. Ingest MDM cellular status logs in real-time. 2. Create a rule that triggers a medium-severity alert if the count of unique devices reporting a 'No Service' status within a single NAI exceeds a dynamic threshold (e.g., 10% of devices in the NAI) or a hard limit (e.g., 5 devices) within a 1-minute sliding window. Statistical: 1. For each NAI, aggregate 'No Service' events into 5-minute buckets to create a time series. 2. Calculate the 99th percentile of this event rate based on 30 days of historical data. 3. Generate an alert if the current event rate exceeds this 99th percentile threshold. 4. As a separate check, track the median RSRP for all devices in the NAI and alert if it drops by more than 20 dBm in under 5 minutes. Machine Learning: 1. Build a training dataset with features such as time of day, day of week, device count in NAI, historical signal strength, carrier information, and a label indicating known outages (benign) vs. normal operation. 2. Train a classification model (e.g., Random Forest, Gradient Boosting) to predict the probability of a mass outage event being malicious. 3. In real-time, when a group of devices reports 'No Service', feed their features into the model. 4. Trigger a high-priority alert if the model outputs a high probability score for 'malicious' and the event has a sudden onset."
          },
          {
            "description": "An MDM-enrolled device simultaneously reports degraded GPS signal (horizontal accuracy > 100 meters or satellite count < 3) and a loss of all network connectivity (both Wi-Fi and Cellular 'No Service' state) for a duration exceeding 60 seconds, in a location where historical data shows typical GPS accuracy is better than 15 meters.",
            "data_sources": [
              "MDM Location/GPS Status Logs",
              "MDM Cellular Status Logs",
              "MDM Wi-Fi Status Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices used for asset tracking, fleet management, supply chain logistics routes, and by personnel operating in high-risk or sensitive environments where location integrity is critical.",
            "action": "Symbolic: 1. Create a cross-source correlation rule in the SIEM. 2. The rule should trigger if a single device's logs show a GPS status event (satellite count < 3 OR horizontal accuracy > 100m for >60s) AND, within the same 60-second window, a cellular status of 'No Service' AND a Wi-Fi status of 'disconnected' with a visible SSID count of 0. Statistical: 1. For each device, create a statistical profile of its median GPS horizontal accuracy per NAI. 2. Generate an alert if the live accuracy degrades by more than 5 standard deviations from its historical baseline for more than 2 minutes. 3. Separately, calculate the Shannon entropy of a device's reported latitude/longitude coordinates over a 10-minute sliding window; a sudden spike in entropy, indicating erratic and illogical location jumps, should trigger a related investigation for GPS spoofing. Machine Learning: 1. For each device, ingest a multivariate time series of GPS features (horizontal accuracy, vertical accuracy, satellite count, time-to-first-fix) into an anomaly detection model. 2. Use an unsupervised algorithm like Isolation Forest to score each time point for anomalousness. 3. Correlate high anomaly scores from the GPS model with anomaly scores from separate models monitoring cellular and Wi-Fi signal strength. 4. An event where anomalies are detected across all three signal types (GPS, cellular, Wi-Fi) for the same device at the same time should be flagged as a high-confidence multi-signal jamming event."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]