[
  {
    "information_requirement": "Has an adversary gained initial access to our mobile device fleet through a compromised hardware supply chain? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1474.002",
        "name": "Compromise Hardware Supply Chain",
        "evidence": [
          {
            "description": "A mobile device reports an unauthorized change in its boot-level security state, such as an unlocked bootloader or a failed secure boot integrity check, which does not correlate with an authorized IT maintenance window or developer profile.",
            "data_sources": [
              "MDM device attestation logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM platform servers, asset management database, and endpoint mobile devices.",
            "action": "1. (Symbolic) Query MDM logs for any device reporting a bootloader status of 'unlocked' or a secure boot check result of 'failed'. Cross-reference the device and timestamp with a change management database or authorized developer list to filter out legitimate activity. Any unattributed failure is a high-priority alert. 2. (Statistical) Establish a baseline rate of attestation failures per device model and OS version over a 30-day rolling window. Use a statistical process control (SPC) chart or calculate z-scores to detect a statistically significant increase in the failure rate for a specific device group, which may indicate a compromised batch. 3. (Machine Learning) Train a classification model (e.g., Random Forest) using features such as device model, OS version, user's role, tenure of the device, and time of day. The model will predict the probability that a given attestation failure is malicious. Alerts with a probability score above a predefined threshold (e.g., 0.85) should be escalated for immediate investigation."
          },
          {
            "description": "One or more devices within a new procurement batch report hardware or firmware identifiers (e.g., baseband version, build number, kernel version) that are inconsistent with manufacturer specifications or the majority of other devices in the same batch.",
            "data_sources": [
              "MDM device inventory logs",
              "Procurement records"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM platform and asset management database.",
            "action": "1. (Symbolic) Upon MDM enrollment of a new device batch, compare reported identifiers (baseband, build, kernel version) against a known-good list derived from manufacturer specifications and procurement orders. Flag any device with a non-matching identifier. 2. (Statistical) For each procurement batch, calculate the frequency distribution of all hardware and firmware identifiers. Any identifier that falls below a rarity threshold (e.g., present in less than 1% of the batch or is a singleton) is a high-confidence anomaly requiring investigation. 3. (Machine Learning) Apply a density-based clustering algorithm (e.g., DBSCAN) to the vector of hardware and firmware identifiers for all devices in a new batch. Devices identified as noise or outliers by the algorithm do not conform to the dominant hardware/firmware profile of the batch and should be physically inspected and isolated."
          },
          {
            "description": "Within the first hour after initial enrollment and before any user-initiated application installation, a new mobile device initiates network connections to destinations not on an established allow-list of legitimate manufacturer, OS, and corporate services.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM enrollment logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, and the MDM platform server.",
            "action": "1. (Symbolic) Correlate MDM enrollment logs with Zeek logs to isolate network traffic from new devices within the first 60 minutes. Compare all destination FQDNs (from Zeek dns.log) and IPs (from Zeek conn.log) against an explicit allow-list of known-good provisioning and OS update domains. Any connection to a destination not on the list generates an alert. 2. (Statistical) For all DNS queries from the device during this initial window, calculate the Shannon entropy of the queried domain names. A domain with an entropy score exceeding a high percentile threshold (e.g., 95th percentile of all corporate DNS queries) is a potential indicator of a Domain Generation Algorithm (DGA) and should be flagged. 3. (Machine Learning) Train a time-series autoencoder (e.g., LSTM-based) on the sequence of network events (e.g., destination port, protocol, data volume) from thousands of known-good device provisioning sessions. For a new device, feed its initial network activity sequence into the trained model. A high reconstruction error indicates a significant deviation from normal provisioning behavior, suggesting a pre-installed backdoor or malware."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]