[
  {
    "information_requirement": "Is an adversary encrypting data on corporate mobile devices for impact? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1471",
        "name": "Data Encrypted for Impact",
        "evidence": [
          {
            "description": "A mobile application process generates file modification or creation events for common user data file types (.jpg, .png, .doc, .pdf) at a rate exceeding 3 standard deviations above its own 30-day baseline or the 95th percentile of all non-system applications on the device within a 5-minute window.",
            "data_sources": [
              "Mobile EDR File System Telemetry",
              "MDM Application Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data directories on managed mobile devices (e.g., /storage/emulated/0/DCIM, /storage/emulated/0/Documents, iOS App Sandboxes).",
            "action": "1. (Symbolic) Continuously monitor file system events for rapid renaming of files to extensions commonly associated with ransomware (e.g., .crypted, .locked, .enc). Trigger a high-severity alert if a single process renames more than 10 files in one minute. 2. (Statistical) For each non-system application, establish a 30-day rolling baseline of file modification events per minute. Alert when an application's file modification count in a 1-minute window exceeds the 99th percentile for its own history or the 95th percentile of its application peer group (e.g., 'communication apps'). 3. (Machine Learning) Employ a time-series forecasting model (e.g., ARIMA) for each application's file I/O rate, trained on historical data. Generate an alert when the observed I/O rate significantly exceeds the forecasted value's confidence interval for a sustained period (e.g., > 3 minutes)."
          },
          {
            "description": "The creation of one or more files with filenames matching known ransom note patterns (e.g., 'recovery_instructions.txt', 'HOW_TO_DECRYPT.html') or containing keywords like 'ransom', 'decrypt', or 'bitcoin' within their content.",
            "data_sources": [
              "Mobile EDR File Creation Events",
              "MDM File Integrity Monitoring Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Root of user-accessible storage on mobile devices (e.g., /sdcard/, /storage/emulated/0/) and directories containing recently modified user data.",
            "action": "1. (Symbolic) Scan all file creation events in real-time. Use a regex list (`/(readme|recover|decrypt|help|instructions).*(txt|html)$/i`) to match filenames against known ransom note conventions. A match generates a critical alert. 2. (Statistical) For any process creating a file matching a note pattern, calculate the 'directory fan-out' by counting the number of unique directories the note is written to within 60 seconds. A fan-out value greater than 5 is highly anomalous and indicates widespread ransom note distribution. 3. (Machine Learning) Deploy a pre-trained text classification model (e.g., Naive Bayes) to scan the content of newly created .txt and .html files. If the model classifies a file as 'ransom_note' with a confidence score >0.90 based on keyword frequency ('bitcoin', 'payment', 'encrypt'), trigger an incident response workflow."
          },
          {
            "description": "A mobile application, within 5 minutes of exhibiting anomalous file I/O activity, initiates an outbound network connection to an IP address or domain that is either present on a threat intelligence feed, has been registered within the last 30 days, or is associated with a non-standard port.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile EDR Network Connection Events"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, and cloud-based secure web gateways that process mobile device traffic.",
            "action": "1. (Symbolic) Upon receiving a high-I/O alert for a device, query network logs (Zeek conn.log) for that device's IP. Cross-reference all destination IPs and domains (from Zeek dns.log) against threat intelligence feeds. A match on a C2 or malware feed is a critical finding. 2. (Statistical) For the suspicious device, analyze DNS queries in dns.log. Calculate the Shannon entropy of queried domain names in a 1-minute window; a score over 3.5 suggests DGA. Additionally, check the registration date of domains; connections to domains registered < 30 days ago should elevate the device's risk score. 3. (Machine Learning) Use a one-class SVM model trained on benign mobile network traffic features (destination port, domain reputation, bytes out, protocol). Feed connection events from the flagged device into the model. Connections identified as outliers, especially when correlated with high file I/O activity, strongly indicate C2 for key exfiltration or reporting."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]