[
  {
    "information_requirement": "Has the adversary established external command and control (C2) channels on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1481.001",
        "name": "Dead Drop Resolver",
        "evidence": [
          {
            "description": "A network connection from a mobile device to a known public web service (e.g., social media, content-hosting site) is followed within 60 seconds by a connection to a destination domain that is statistically rare or has a poor reputation score.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi egress points, VPN concentrators handling mobile device traffic, and network segments dedicated to guest or BYOD mobile devices.",
            "action": "From network logs, identify all connections from mobile device IP ranges to a predefined list of potential dead drop resolver services (e.g., pastebin.com, github.com, various social media APIs). For each initial connection, search for all subsequent outbound connections from the same source IP within a 60-second window. For each subsequent connection, apply a multi-faceted detection approach: 1. (Symbolic) Match the destination IP and domain against a threat intelligence feed of known C2 infrastructure. A direct match generates a high-severity alert. 2. (Statistical) Using a 30-day baseline from Zeek dns.log, calculate the enterprise-wide access frequency for the destination domain. Flag any connection where the destination domain's popularity is in the bottom 5th percentile. 3. (Machine Learning) Feed connection-pair features (time delta, bytes transferred, domain popularity rank, destination ASN, threat intel score) into a pre-trained Random Forest classifier. A prediction score above 0.85 indicates a likely dead drop resolver event and should be escalated for analyst investigation."
          },
          {
            "description": "A mobile device makes a DNS query for a legitimate content-hosting domain, and the TLS Server Name Indication (SNI) in the subsequent connection matches. The unencrypted HTTP response body or other inspected content contains an IP address or domain that is contacted by the same device within a 2-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with L7 visibility, DNS resolvers, and web proxies serving mobile device traffic.",
            "action": "From Zeek logs, correlate DNS requests (dns.log) with subsequent TLS handshakes (ssl.log) and HTTP requests (http.log) originating from mobile devices. For unencrypted traffic, extract all embedded IP addresses and domains from HTTP response bodies. Apply a multi-faceted detection approach to these extracted indicators: 1. (Symbolic) Match all extracted IPs and domains against a threat intelligence list of known malicious indicators. A match triggers an immediate alert. 2. (Statistical) Calculate the Shannon entropy for all extracted hostnames; flag any with a score over 3.5 as potential DGA. Separately, calculate the access frequency of each extracted domain across the enterprise and flag any in the bottom 1st percentile. 3. (Machine Learning) Employ a time-series anomaly detection model (e.g., ARIMA) on the request volume from the mobile fleet to known dead-drop resolver domains. A sudden spike in requests that significantly deviates from the established weekly/daily seasonal baseline should be flagged as a potential coordinated campaign."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]