[
  {
    "information_requirement": "Is an adversary leveraging legitimate external web services for one-way command and control against corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1481.003",
        "name": "One-Way Communication",
        "evidence": [
          {
            "description": "A corporate mobile device establishes connections to a known file-sharing, social media, or paste site with a periodicity (inter-arrival time) standard deviation below a defined threshold (e.g., < 5 seconds) and a data transfer size in the 95th percentile below 1KB. This pattern is inconsistent with interactive user browsing and suggests automated beaconing for C2 instructions.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators handling mobile device traffic, forward proxy servers, and network egress points (Internet gateways) where mobile device traffic is logged.",
            "action": "1. (Symbolic Logic) Continuously monitor Zeek dns.log and ssl.log for requests from mobile devices to domains and server names associated with known malicious C2 infrastructure hosted on legitimate services. Maintain and query against a threat intelligence list of these specific URIs, domains, and IPs. 2. (Statistical Method) For each mobile device IP, aggregate connection data from Zeek conn.log over a 24-hour window. Group by destination server name (from ssl.log `server_name`). Calculate the standard deviation of the inter-arrival time between connections and the 95th percentile of the outbound bytes (`orig_bytes`). Flag any device where the standard deviation of inter-arrival time to a single domain is less than 5 seconds and the 95th percentile of outbound bytes is less than 1KB, as this deviates significantly from normal, interactive browsing patterns. 3. (Machine Learning) Develop a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) for each device's outbound traffic volume and connection frequency to popular web services (e.g., GitHub, Twitter, Pastebin). Train the model on a baseline of normal user activity. An alert should be generated when the model detects a statistically significant anomaly, such as a sudden shift to a highly periodic, low-volume communication pattern, which is characteristic of one-way C2 beaconing."
          },
          {
            "description": "A mobile device makes an HTTP/S request to a legitimate web service (e.g., GitHub, Pastebin) where the URI path matches patterns for raw content access (e.g., contains '/raw/', '/blob/'), and the calculated Shannon entropy of the URI path or query parameters exceeds a baseline threshold (e.g., > 3.5), indicating randomness often used to hide C2 channels. The returned Content-Type is `text/plain` or `application/octet-stream` from a service that typically serves `text/html`.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, and forward proxy servers that perform TLS inspection, providing visibility into HTTP headers and content for mobile device traffic.",
            "action": "1. (Symbolic Logic) Using Zeek http.log, create a detection rule that searches for requests from the mobile device IP range to legitimate service domains (e.g., `pastebin.com`, `gist.github.com`) where the URI path contains known malicious patterns like `/raw/` or matches regular expressions derived from threat intelligence on C2 frameworks. 2. (Statistical Method) For each request from a mobile device in Zeek http.log, calculate the Shannon entropy of the URI path. Establish a baseline entropy score for common URIs accessed on popular services. Flag any URI with an entropy score exceeding the 99th percentile of the established baseline (e.g., a score > 3.5) as potentially algorithmically generated for C2. Correlate high-entropy URIs with non-standard `User-Agent` strings or a `text/plain` content-type response. 3. (Machine Learning) Implement a classification model (e.g., a Random Forest) trained on labeled data from Zeek http.log. Use features such as URI length, URI entropy, presence of raw content keywords, query parameter count, and `User-Agent` string anomalies. The model will classify each HTTP request from mobile devices as either 'benign' or 'potential C2', providing a risk score for analysts to prioritize investigations."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]