[
  {
    "information_requirement": "Is an adversary establishing command and control with a mobile device using a non-standard port? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1509",
        "name": "Non-Standard Port",
        "evidence": [
          {
            "description": "A connection from a mobile device subnet shows a protocol identified by dynamic analysis in Zeek's 'service' field (e.g., 'ssl') that is mismatched with the IANA standard port for that protocol on the 'id.resp_p' (destination port) field, such as 'ssl' on port 8080 or 'dns' on port 53535.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and guest Wi-Fi network segments, VPN termination points, Mobile Device Management (MDM) traffic inspection points, and Internet gateway proxies where mobile device traffic is visible.",
            "action": "1. (Symbolic) Ingest Zeek conn.log. Join with a threat intelligence feed of known C2 servers. Alert on any connection from a mobile device IP to a malicious destination IP where the destination port is non-standard for the identified service (e.g., not 443 for 'ssl'). 2. (Statistical) Create a baseline of all (service, port) tuples from Zeek conn.log over a 30-day period. Calculate the frequency of each tuple. Flag any connection from a mobile device subnet using a (service, port) tuple that falls in the bottom 5th percentile of frequency, indicating a statistically rare pairing. 3. (Machine Learning) Train a logistic regression classifier on historical conn.log data. Use features such as destination port, protocol, Zeek service, connection duration, total bytes, and a boolean indicating if the source is a mobile device. Labeled training data should include known-good traffic and examples of malicious C2. Use the trained model to score new connections for their likelihood of being malicious C2 based on anomalous port-protocol pairings and other features."
          },
          {
            "description": "A mobile device's network traffic shows a series of connections to the same external destination IP and non-standard port with a low variance in the time delta between connections (e.g., standard deviation < 5 seconds) and low variance in connection duration, characteristic of automated C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points for all corporate and guest networks, specifically monitoring subnets allocated to mobile devices via DHCP for Wi-Fi or VPN pools.",
            "action": "1. (Symbolic) For connections to non-standard ports, correlate the destination IP with the domain requested in Zeek dns.log. Alert if the domain is a known C2 domain from a threat feed or matches a pattern for Domain Generation Algorithms (DGA), such as high entropy. 2. (Statistical) For each source IP from a mobile subnet, group connections by destination IP and port. Calculate the time difference between consecutive connections in each group. A group with a standard deviation of time deltas less than 5 seconds and an average connection duration less than 10 seconds indicates beaconing. Further score this by calculating the entropy of destination ports per source IP; a very low entropy score indicates communication with few endpoints, strengthening the beaconing hypothesis. 3. (Machine Learning) Apply a time series forecasting model like ARIMA to the connection timestamps for each source-destination-port tuple. A model that predicts the next timestamp with an error of less than a few seconds indicates a highly predictable, machine-generated pattern. Score tuples based on their predictability and flag the most predictable ones on non-standard ports as likely C2 beaconing."
          },
          {
            "description": "An encrypted session (SSL/TLS) initiated from a mobile device to an external entity over a non-standard port utilizes a self-signed certificate or one with an anomalous issuer, and the JA3 hash is rare within the environment.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors with deep packet inspection capabilities at Internet gateways and VPN concentrators where mobile traffic is decrypted or inspected.",
            "action": "1. (Symbolic) Join Zeek ssl.log and conn.log on the connection UID. Create a rule to alert when a connection originates from a mobile device subnet, the destination port is not 443, and the 'validation_status' in ssl.log is 'self-signed certificate' or 'unable to get local issuer certificate'. Cross-reference the certificate issuer and subject against a list of known-malicious certificate authorities or subjects. 2. (Statistical) For all SSL/TLS connections, calculate the JA3 client hash. Maintain a baseline of the frequency of all JA3 hashes seen in the environment over the past 30 days. Alert on any SSL/TLS connection from a mobile device to a non-standard port where the JA3 hash is in the bottom 2nd percentile of rarity. 3. (Machine Learning) Use an unsupervised clustering algorithm (e.g., K-Means or DBSCAN) on features from ssl.log and conn.log. Features should include 'version', 'cipher', 'curve', 'duration', 'total_bytes', a numeric representation of 'validation_status', and the destination port. Identify small, dense clusters that represent abnormal SSL/TLS usage. A cluster characterized by mobile device sources, non-standard ports, and self-signed certificates is a high-fidelity indicator of malicious activity."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]