[
  {
    "information_requirement": "Is an adversary evading defenses by abusing accessibility services to perform actions on behalf of the user? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1516",
        "name": "Input Injection",
        "evidence": [
          {
            "description": "A mobile device establishes network connections to known malicious infrastructure or exhibits statistically anomalous network behavior within 5 minutes of a new application being granted 'BIND_ACCESSIBILITY_SERVICE' permission. The anomalous behavior is characterized by connections to multiple non-standard ports or traffic patterns inconsistent with the device's baseline.",
            "data_sources": [
              "MDM Logs",
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN terminators, Mobile Device Management (MDM) platform, and DNS resolvers used by mobile devices.",
            "action": "First, ingest and correlate MDM logs that record application permission changes with network logs (Zeek) from the device's assigned IP address, focusing on a 15-minute window following the grant of 'BIND_ACCESSIBILITY_SERVICE' permission. 1. (Symbolic) Query all destination IPs and domains from the device in the time window against a threat intelligence feed of known mobile malware command-and-control (C2) infrastructure. Generate an alert upon a match. 2. (Statistical) For each permission-grant event, calculate the number of distinct destination ports the device connects to in the subsequent 10 minutes. Compare this to a pre-computed 95th percentile baseline for post-install behavior across all devices. An event exceeding this threshold, particularly involving non-standard ports (>1024), indicates potential scanning or C2 and should be flagged. Additionally, calculate the entropy of the JA3 hash in Zeek ssl.log for the device's connections; a new, statistically rare JA3 hash appearing immediately after the permission grant is a strong indicator of a new malicious client. 3. (Machine Learning) Employ a time-series anomaly detection model (e.g., ARIMA) on the device's outbound data volume (orig_bytes from conn.log), aggregated in 1-minute intervals. A significant anomaly detected by the model within the analysis window that does not correlate with known legitimate app updates or user activity warrants immediate investigation for C2 heartbeat or initial data staging."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary causing impact by programmatically interacting with sensitive applications (e.g., financial, messaging) to steal data or funds? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1516",
        "name": "Input Injection",
        "evidence": [
          {
            "description": "A mobile device exhibits network traffic to financial or cloud service APIs characterized by highly periodic, fixed-interval connections (e.g., every 60 seconds) or data transfers (outbound bytes) that are statistically significant outliers compared to the user's historical baseline for that service, suggesting automated interaction rather than human-driven use.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments for corporate and guest Wi-Fi, cloud service provider network ranges, known financial service IP blocks, and internet gateways.",
            "action": "Continuously monitor and analyze network flows from mobile devices to domains categorized as financial, corporate SSO, or cloud services. 1. (Symbolic) Cross-reference all destination IP addresses and server names (from dns.log and ssl.log) against threat intelligence blocklists for known data exfiltration endpoints, mobile banking trojans, and financial fraud infrastructure. Also, inspect SSL certificates in ssl.log for matches to known malicious issuer CAs or self-signed certificates previously associated with malware. 2. (Statistical) For each user and destination service, establish a baseline profile of session data volume (orig_bytes from conn.log) including mean and standard deviation. Trigger an alert if a new session's outbound data volume exceeds 3 standard deviations from that user's historical mean for that specific service. Separately, apply a Fourier transform to the time series of connection start times for a given device-destination pair over a 24-hour period; a strong, single-frequency peak indicates automated, periodic beaconing characteristic of malware. 3. (Machine Learning) Use a supervised classification model (e.g., Random Forest) trained on labeled network flows to classify sessions as 'benign human interaction' or 'automated exfiltration'. Features for the model should include session duration, orig_bytes, resp_bytes, protocol, destination port, and inter-arrival time between connections to the same host. Apply the model in near-real-time to flag suspicious sessions for analyst review."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]