[
  {
    "information_requirement": "Is an adversary using non-standard or suspicious asymmetric cryptography for command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1521.002",
        "name": "Asymmetric Cryptography",
        "evidence": [
          {
            "description": "A TLS session from a mobile device exhibits suspicious certificate attributes, defined as: a self-signed certificate, a validity period in the bottom 5th percentile of all observed certificates (e.g., < 30 days), or a subject/issuer matching a known malicious indicator.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, VPN concentrators, MDM (Mobile Device Management) proxy servers, Cloud Access Security Brokers (CASB), Cellular network gateways (for corporate-liable devices backhauling traffic)",
            "action": "1) Symbolic Search: Continuously query Zeek ssl.log, matching the 'issuer' and 'subject' fields against a threat intelligence feed of malicious certificate authorities and C2 domains. Generate an alert for any match. 2) Statistical Analysis: For all TLS sessions in Zeek ssl.log, calculate the certificate validity duration ('not_valid_after' - 'not_valid_before'). Establish a rolling 30-day baseline of all durations. Flag any certificate with 'validation_status' containing 'self-signed' or a duration in the bottom 5th percentile. Correlate flagged certificates using the 'uid' field with Zeek conn.log to prioritize alerts for connections with high data volume ('orig_bytes' + 'resp_bytes') or long duration. 3) Machine Learning Classification: Train and apply a Random Forest classifier to predict malicious TLS sessions. Use features from Zeek ssl.log (certificate validity duration, validation_status, cipher, version) and conn.log (duration, orig_bytes, resp_bytes, service), along with the JA3 and JA3S hashes. The model's output probability score should be used to rank alerts for analyst review."
          },
          {
            "description": "Encrypted network connections from a mobile device to a single destination exhibit periodic 'heartbeat' behavior, defined by a standard deviation of inter-arrival times and connection sizes near zero, or the destination IP is a known C2 server.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, MDM (Mobile Device Management) proxy servers, Corporate Wi-Fi gateways, Cellular network gateways (for corporate-liable devices backhauling traffic)",
            "action": "1) Symbolic Search: Continuously query Zeek conn.log to match destination IPs ('id.resp_h') against a threat intelligence feed of known C2 servers. Generate a high-priority alert for any match originating from a mobile device IP range. 2) Statistical Analysis: Group Zeek conn.log records by source IP, destination IP, and destination port over a sliding 24-hour window. For each group with more than 10 connections, calculate the time deltas between consecutive connections and the total bytes transferred ('orig_bytes' + 'resp_bytes') for each connection. Compute the coefficient of variation (Standard Deviation / Mean) for both time deltas and byte counts. Flag groups with a coefficient of variation for both metrics in the bottom 1st percentile, as this indicates highly regular, machine-generated traffic. 3) Time Series Anomaly Detection: For each source-destination communication pair, create a multivariate time series of connection features (inter-arrival time, duration, total bytes). Train an LSTM autoencoder on a baseline of known benign traffic patterns. Apply the model to new traffic; a high reconstruction error indicates a significant deviation from the learned normal patterns, flagging a potential C2 beacon."
          },
          {
            "description": "Data with high Shannon entropy, suggesting encryption or randomization, is identified within DNS query names or HTTP User-Agent strings, where such data is anomalous compared to a statistical baseline.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Forward web proxies, Reverse proxies, Cloud Access Security Brokers (CASB)",
            "action": "1) Symbolic Search: In Zeek dns.log, match the 'query' field against a ruleset of known DGA patterns and a threat intelligence feed of malicious domains. In Zeek http.log, match the 'user_agent' field against a list of known malicious or non-standard user agents. 2) Statistical Analysis: For DNS queries, calculate the Shannon entropy of the longest subdomain in the 'query' field. For HTTP requests, calculate the Shannon entropy of the 'user_agent' string. Establish a rolling 30-day baseline for entropy values for each field. Flag any value exceeding the 99th percentile of its respective baseline. Further validate by performing a Chi-squared test on the character frequency distribution of the flagged string against the expected distribution for the protocol; a high chi-squared value strengthens the finding. 3) Unsupervised Anomaly Detection: Extract features from Zeek dns.log (query length, subdomain count, entropy, ratio of numeric characters) and http.log (user_agent length, entropy). Use a density-based clustering algorithm like DBSCAN to identify outliers. Points that the algorithm classifies as noise are rare events that do not conform to any cluster of normal traffic and should be investigated as potential C2 channels."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]