[
  {
    "information_requirement": "Is an adversary using a managed mobile device as a proxy to conceal their C2 communications or other malicious activity? (PIR) [1]",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1604",
        "name": "Proxy Through Victim",
        "evidence": [
          {
            "description": "A managed mobile device exhibits a statistically significant increase in total outbound data volume over a defined time window (e.g., 1 hour, 24 hours) compared to its historical baseline or its peer group's baseline, suggesting its use as a data relay.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, VPN gateways, and network egress points monitoring traffic from mobile device subnets.",
            "action": "1. (Symbolic) Create a high-severity alert if a single mobile device's total outbound data transfer, as measured by the sum of `orig_bytes` in Zeek conn.log, exceeds a hard threshold (e.g., 10 GB in 1 hour) that is considered implausible for legitimate mobile device use. 2. (Statistical) For each mobile device (`id.orig_h`), aggregate the sum of outbound bytes (`orig_bytes`) from Zeek conn.log over 1-hour and 24-hour windows. Establish a per-device baseline using a 30-day moving average and standard deviation. Alert when a device's outbound traffic exceeds 3 standard deviations from its own mean, or exceeds the 99th percentile of its assigned user group. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., Seasonal-ARIMA) for each device's outbound data volume (`orig_bytes`). Train the model on at least 90 days of historical data to learn patterns and seasonality. Generate an alert when the actual observed volume significantly deviates from the predicted volume's confidence interval."
          },
          {
            "description": "A mobile device resolves or connects to a statistically anomalous number of unique destination domains or IP addresses within a short time frame, and the set of destinations exhibits high entropy, which is uncharacteristic of normal user activity and may indicate its use as a proxy.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, network firewalls, and web proxies that log DNS queries and outbound connections from mobile devices.",
            "action": "1. (Symbolic) Maintain an allowlist of domains associated with benign, high-volume mobile activity (e.g., CDN, OS updates, major social media). From Zeek dns.log, alert on any device that queries a high number of unique domains (e.g., >100) not on this list within a 5-minute window. 2. (Statistical) For each mobile device (`id.orig_h`), count the number of unique second-level domains (SLDs) queried in Zeek dns.log (`query` field) over a 1-hour window. Calculate the Shannon entropy of the set of these SLDs. Alert if a device's unique domain count exceeds the 98th percentile of its peer group and its domain entropy score is also anomalously high (e.g., >2 standard deviations above its own baseline). 3. (Machine Learning) Use an Isolation Forest model trained on features derived from Zeek dns.log and conn.log for each device over a 1-hour window. Features should include: unique domain count, domain entropy, ratio of successful to failed DNS queries (`rcode` != 'NOERROR'), and ratio of successful to failed TCP connections (`conn_state` != 'SF'). Flag any device the model classifies as a significant outlier."
          },
          {
            "description": "A mobile device initiates network connections using destination ports or protocols that are either a) known to be associated with proxies or b) inconsistent with the device's established baseline behavior or its MDM/EMM application profile.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/EMM Application Inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow collectors at egress points, firewall logs, and (if available) MDM/EMM management platforms.",
            "action": "1. (Symbolic) Create a high-priority alert for any traffic from the mobile device subnet (`id.orig_h`) to common proxy-related destination ports, such as 1080 (SOCKS), 3128, 8080, or 8888, unless that traffic is to an approved internal service or is associated with an approved application from an MDM inventory. 2. (Statistical) For each device, establish a baseline of commonly used destination ports (`id.resp_p` in Zeek conn.log) over a 30-day period. In a 1-hour window, calculate the ratio of connections to 'rare' ports (ports not in the baseline) versus 'common' ports. Alert when this ratio exceeds the 95th percentile for the device's peer group. 3. (Machine Learning) Train a one-class SVM (Support Vector Machine) model on historical connection data (destination port, protocol, `orig_bytes`) for each device or device group to learn the profile of 'normal' traffic. Apply the model to live traffic; connections classified as anomalies, especially those involving non-standard ports, should be flagged for investigation."
          },
          {
            "description": "A mobile device maintains an anomalously high number of concurrent outbound connections or connections of unusual duration, which is characteristic of a device acting as a persistent relay or proxy.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow collectors (e.g., Zeek sensors) at key chokepoints like the Wi-Fi access controller or VPN concentrator.",
            "action": "1. (Symbolic) From Zeek conn.log, alert on any single TCP connection from a mobile device (`id.orig_h`) that has a `duration` greater than 24 hours, where the `conn_state` is 'SF' (Established), especially if the destination is not an established corporate service or known cloud provider. 2. (Statistical) In 5-minute intervals, for each device, calculate two metrics from Zeek conn.log: a) the count of concurrent outbound connections and b) the average `duration` of connections that terminated in that interval. Use a multivariate outlier detection method, like Mahalanobis distance, to find devices that are anomalous in both metrics simultaneously (high count, long duration) compared to their own 30-day historical profile. 3. (Machine Learning) Apply a density-based clustering algorithm like DBSCAN to the population of mobile devices. Use features calculated over a 24-hour period, such as 'average concurrent connections' and 'average connection duration'. Devices that are classified as noise points (i.e., not belonging to any cluster) are strong candidates for investigation."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]