[
  {
    "information_requirement": "Is the adversary concealing captured multimedia files on mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628.003",
        "name": "Conceal Multimedia Files",
        "evidence": [
          {
            "description": "The existence of a file named exactly '.nomedia' within a directory on an Android device's file system, particularly in directories created by non-system applications or in paths with high-entropy names.",
            "data_sources": [
              "Mobile EDR File System Auditing Logs",
              "Mobile MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of corporate-managed Android devices, specifically user-writable directories such as /storage/emulated/0/DCIM/, /storage/emulated/0/Pictures/, /storage/emulated/0/Download/, and application-specific data folders.",
            "action": "1. (Symbolic) Create a rule to alert on any file creation event where the filename is exactly '.nomedia' and the creating process is not on an approved list of system or user-installed media applications. 2. (Statistical) For each '.nomedia' file creation event, calculate the Shannon entropy of the parent directory's name. Alert if the entropy score exceeds a threshold (e.g., > 3.5), suggesting a randomly generated name, and the creating application was installed within the last 14 days. 3. (Machine Learning) Develop a classification model (e.g., Logistic Regression, Random Forest) trained on features such as application permissions, installation source, directory name entropy, and file creation time to predict if a '.nomedia' creation event is malicious. The model's output score can be used to prioritize alerts for analyst review."
          },
          {
            "description": "An anomalous outbound network transfer of files with multimedia MIME types (e.g., image/jpeg, video/mp4) from a mobile device to an external destination not previously associated with the user or device.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring traffic from mobile device subnets, including corporate Wi-Fi gateways, VPN concentrators, and Cloud Access Security Brokers (CASB).",
            "action": "1. (Symbolic) Ingest a threat intelligence feed of known malicious C2 domains and IPs. Query Zeek conn.log and dns.log to alert on any connection from a mobile device to a destination on this list that involves a multimedia file transfer (identified via MIME type in files.log or http.log). 2. (Statistical) For each mobile device, establish a 30-day rolling baseline of daily outbound data volume for multimedia files. Generate an alert when the total volume for a 24-hour period exceeds the 98th percentile of the device's historical baseline. Also, track the set of destination domains for these transfers and alert if a transfer occurs to a domain not seen in the last 60 days. 3. (Machine Learning) Use a time-series anomaly detection model (e.g., LSTM) on the byte count of outbound multimedia traffic per device to identify significant deviations from learned normal traffic patterns. Additionally, use a clustering algorithm (e.g., DBSCAN) on connection metadata (destination ASN, JA3/JA3S hash, data volume, protocol) to identify outlier connections that do not group with the device's typical network activity."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]