[
  {
    "information_requirement": "Is an adversary preventing the removal of malicious applications on our managed mobile devices? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629.001",
        "name": "Prevent Application Removal",
        "evidence": [
          {
            "description": "An application not on the corporate allow-list is granted 'Device Administrator' or 'Accessibility Service' permissions, and its package name exhibits characteristics associated with malware (e.g., high character entropy, imitation of a legitimate app name).",
            "data_sources": [
              "MDM/EMM Audit Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM Management Server, Managed mobile devices, Centralized Log Aggregator (SIEM)",
            "action": "1. (Symbolic) Continuously monitor MDM/EMM audit logs for events corresponding to 'Device Administrator' or 'Accessibility Service' permission grants. Compare the application package name against a curated allow-list of approved applications that require these permissions. Any grant to an application not on the list triggers an immediate alert. 2. (Statistical) For any newly granted application not on the allow-list, calculate the Shannon entropy of its package name. Flag applications with an entropy score exceeding the 95th percentile of the baseline established from legitimate applications in the environment. 3. (Machine Learning) Apply a random forest classification model trained on features like package name length, character entropy, and keyword presence to classify the likelihood of the application being malicious. High-confidence classifications are prioritized. Correlate the permission grant event time with network activity from the same device (using Zeek conn.log) within a 5-minute window to identify potential post-escalation C2 registration."
          },
          {
            "description": "A mobile device exhibits network traffic anomalies within minutes of a high-risk permission grant, such as connections to newly registered domains, use of non-standard ports for common protocols, or beaconing behavior characterized by periodic, small data transfers to a single destination.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Network Gateway, Internal DNS Resolvers, Egress Web Proxies",
            "action": "1. (Symbolic) For devices flagged with a suspicious permission grant, query Zeek dns.log for DNS requests made by the device within 30 minutes of the event. Alert on requests for domains that are not in a top 1 million list, have been registered within the last 30 days based on WHOIS data enrichment, or match known C2 threat intelligence feeds. 2. (Statistical) Using Zeek conn.log, analyze the device's network connections following the permission grant. Flag connections where key metrics like duration or byte counts exceed 3 standard deviations from the device's 30-day historical baseline. Using Zeek ssl.log, identify and alert on rare JA3 hashes associated with the connections. 3. (Machine Learning) Apply a time series anomaly detection model (e.g., Seasonal-Hybrid ESD) to the device's network traffic volume (bytes per minute) and connection count (connections per minute) from Zeek conn.log. An alert is generated if the model detects significant anomalies in the traffic pattern shortly after the high-risk permission grant, which could indicate C2 beaconing."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]