[
  {
    "information_requirement": "Is an adversary attempting to evade user detection on corporate-managed mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628.002",
        "name": "User Evasion",
        "evidence": [
          {
            "description": "A mobile application, whose category (e.g., 'Productivity', 'Finance', 'Utilities') does not justify motion sensor usage, is observed accessing the accelerometer or gyroscope via Mobile Threat Defense (MTD) logs. This sensor access event is immediately followed by a complete cessation of periodic, low-volume network beacons (e.g., under 1KB per connection) that were consistently observed in Zeek conn.log while the device was in an 'at rest' state. The behavior change is triggered by the device state transitioning from 'at rest' to 'in motion'.",
            "data_sources": [
              "Mobile Threat Defense (MTD) sensor access logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data collection points include: 1. Endpoints: Managed mobile devices running an MTD agent. 2. Network Egress: Corporate Wi-Fi access points, VPN concentrators, and network taps where Zeek sensors are deployed. 3. Infrastructure: Mobile Device Management (MDM) platform for application inventory and DNS servers logging queries.",
            "action": "1. Symbolic Logic: 1. Maintain an application allowlist for motion sensor access based on App Store category or business function (e.g., 'Fitness', 'Games', 'Augmented Reality'). 2. In a SIEM, create a correlation rule that triggers when an MTD log for a device reports an application accessing a motion sensor (e.g., event_code='SensorAccess', sensor_type='Accelerometer') AND the application is NOT on the allowlist. 3. As a condition, the rule must verify that in the 5 minutes prior to the event, Zeek conn.log shows at least one connection from the device's IP, and in the 5 minutes after the event, Zeek conn.log shows zero connections from the same application process or to the same destination IP/domain. 2. Statistical Analysis: 1. For each application on a monitored device, create two time-series over a 24-hour window from MTD and Zeek logs: a binary 'motion' series (1=in_motion, 0=at_rest) and a 'connections_per_minute' series. 2. Calculate the Pearson correlation coefficient between the two series. Generate a low-severity alert for applications not on the motion-access allowlist that exhibit a strong negative correlation (e.g., $$ r < -0.8 $$), indicating network activity consistently stops when the user is active. 3. To identify C2-like beaconing during 'at rest' periods, calculate the Shannon entropy of destination port numbers and the time delta between connections for each application. A combination of very low port entropy and a low standard deviation in time deltas (consistent timing) is characteristic of a heartbeat. Flag applications where the 'at rest' connection frequency is above the 95th percentile for all apps and this beaconing behavior is present. 3. Machine Learning: 1. For each application, use MTD logs to isolate Zeek conn.log and dns.log data generated only during 'at rest' periods. 2. Train an Isolation Forest model per-application on features engineered from this data, such as: count of connections, sum of outbound bytes, sum of inbound bytes, standard deviation of connection duration, and entropy of DNS query names. This model learns the unique 'normal background noise' for each app. 3. Continuously monitor MTD logs for 'at_rest' to 'in_motion' state changes. 4. Upon a state change, feed the feature vector representing network activity in the subsequent 60-second window into the corresponding application's trained model. If the model returns an anomaly score indicating the behavior (e.g., a sudden vector of all zeros representing no traffic) is a significant outlier from the learned 'at rest' profile, generate a high-confidence alert for evasive C2 activity."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]