[
  {
    "information_requirement": "Is an adversary attempting to steal credentials from mobile device keychains? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1634.001",
        "name": "Keychain",
        "evidence": [
          {
            "description": "A mobile device, identified by its IP address on a corporate network, exhibits network patterns indicative of a jailbroken state, such as communicating with known jailbreaking infrastructure or presenting anomalous TLS certificates, which are common prerequisites for direct keychain access.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, VPN termination points, DNS resolvers, and web proxies handling mobile device traffic.",
            "action": "1. (Symbolic) Query Zeek dns.log every 5 minutes for requests from mobile device IP ranges that match a threat intelligence list of domains/subdomains associated with jailbreaking tools (e.g., Cydia, Sileo, unc0ver). Generate a high-severity alert upon any match. 2. (Statistical) For each mobile device IP, use Zeek ssl.log to establish a 14-day rolling baseline of the `validation_status` field. Calculate the daily ratio of failures (e.g., 'self signed certificate in certificate chain') to total handshakes. Additionally, calculate the daily Shannon entropy of the `issuer` certificate field. Trigger a medium-severity alert if the failure ratio exceeds the 95th percentile or if the issuer entropy score drops by more than 50% from its baseline, suggesting pinning to a single rogue CA. 3. (Machine Learning) Deploy a time-series anomaly detection model (e.g., Prophet) on the hourly count of TLS validation failures per device. Concurrently, use a classification model (e.g., Logistic Regression) trained on features from Zeek ssl.log and dns.log (e.g., certificate validity period, SNI rarity, DNS query to TLD ratio) to score each connection's risk. An anomalous spike in failures combined with a high-risk classification score indicates a likely device compromise."
          },
          {
            "description": "A mobile device transmits an anomalously large volume of outbound data in a single session or over a short period to a destination IP address not previously associated with the device's normal activity profile, consistent with the exfiltration of a keychain database file.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, firewalls, and cloud access security brokers (CASBs) monitoring traffic from mobile device subnets.",
            "action": "1. (Symbolic) Continuously match destination IPs and server names from Zeek conn.log and ssl.log for connections originating from mobile devices against a threat intelligence feed of known C2 servers and data exfiltration endpoints. Generate a high-severity alert on any match. 2. (Statistical) Using Zeek conn.log, for each mobile device IP, maintain a 30-day rolling baseline of outbound bytes (`orig_bytes`) and connection duration. Calculate the 99th percentile for single-session outbound bytes. Trigger a medium-severity alert if a single connection's `orig_bytes` exceeds this threshold, especially if the destination IP has a low historical frequency (e.g., seen less than 3 times in 30 days for that device). 3. (Machine Learning) Train an autoencoder model on legitimate network connection patterns from Zeek conn.log for each mobile device. The feature vector should include `orig_bytes`, `resp_bytes`, `duration`, destination port, and a categorical representation of the destination IP's ASN. Feed live connection data into the model and calculate the reconstruction error. A high reconstruction error, indicating a deviation from the learned normal behavior, flags the connection as anomalous and a potential exfiltration event, especially if it follows a jailbreak detection alert."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]