[
  {
    "information_requirement": "Is an adversary deleting files or wiping data on corporate mobile devices to evade detection or cause impact? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.002",
        "name": "File Deletion",
        "evidence": [
          {
            "description": "An MDM or EDR log event indicates that a mobile application process has been granted device administrator privileges, and the application's package name or signing certificate hash is not on the corporate allowlist.",
            "data_sources": [
              "MDM privilege change logs",
              "EDR application inventory logs",
              "EDR process execution logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS, Android), Mobile Device Management (MDM) Platform, Application Vetting System, Corporate App Store",
            "action": "Implement a multi-layered detection strategy for unauthorized device administrator access. First (Symbolic Logic), query MDM logs for all events granting device administrator privileges; for each event, check the application's package name and signing certificate hash against a pre-defined allowlist and alert on any application not on the list. Second (Statistical), analyze the temporal pattern of administrator privilege grants across the device fleet, calculate a baseline rate of grants per day, and trigger an alert if the number of grants in a 24-hour period exceeds 3 standard deviations above the mean. Third (Machine Learning), train a classification model (e.g., Random Forest) on features from historical privilege grant events (app category, permissions, user role, time of day) to predict the risk score of new grant events in real-time, flagging events with a score above 0.8 for investigation."
          },
          {
            "description": "The count of file deletion events from a single process on a mobile device within a 5-minute window exceeds the 99th percentile of the historical baseline for that user or device type, excluding deletions associated with known application uninstallation or system cache clearing processes.",
            "data_sources": [
              "EDR file deletion events",
              "Android Logcat logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data partitions on corporate mobile devices, Application sandboxes on mobile devices, MDM/EDR management console",
            "action": "Detect anomalous file deletion volumes through a combination of methods. First (Symbolic Logic), create a SIEM rule that triggers when an EDR log shows a file deletion event where the initiating process name matches a known malicious process IOC list and is not a whitelisted system or uninstaller process. Second (Statistical), for each device, ingest EDR file deletion events, calculate a rolling 5-minute average and standard deviation of deletion counts, and generate an alert if the current count exceeds the mean by more than 4 standard deviations, excluding known maintenance processes. Third (Machine Learning), implement a time-series anomaly detection model (e.g., ARIMA) on the file deletion event stream for each device, trained on 30+ days of activity, to generate an alert if the actual number of deletions significantly deviates from the predicted range."
          },
          {
            "description": "An EDR event indicates the deletion of one or more files with extensions from a 'critical' list (e.g., .pdf, .docx, .xlsx, .sqlite, .key) or from a 'sensitive' directory path (e.g., /Documents, /Download, /DCIM), where the initiating process is not on an allowlist of approved applications.",
            "data_sources": [
              "EDR file deletion events",
              "Application inventory logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Sensitive data storage locations on mobile devices, Endpoint devices of high-value targets (e.g., Executive and R&D department mobile devices)",
            "action": "Monitor for targeted deletion of sensitive files. First (Symbolic Logic), create a SIEM rule to alert when an EDR file deletion event meets all of the following conditions: (1) file path is within a monitored sensitive directory, (2) file extension is on a critical list, AND (3) the initiating process is not on the 'approved applications' allowlist. Second (Statistical), for alerts generated by the symbolic rule, calculate the Shannon entropy of the initiating process name; if the score is above a threshold (e.g., 3.5), escalate the alert's priority. Third (Machine Learning), develop a file access pattern baseline for each user using a clustering algorithm (e.g., K-Means) on features like process name and file types accessed. If a deletion event is an outlier to the user's normal activity clusters (e.g., a game deleting documents), flag it as anomalous."
          },
          {
            "description": "Network flow logs show an outbound data transfer from a mobile device's IP address exceeding the 95th percentile of the user's daily outbound traffic baseline, destined for a low-reputation or newly-seen IP/domain. This network event is followed within 15 minutes by EDR alerts for high-volume file deletions on the same device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "EDR file deletion events",
              "MDM device-to-IP mapping logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Our organization's internet gateway, Corporate-managed mobile devices, DNS resolvers, DHCP servers",
            "action": "Correlate network and endpoint events to detect post-exfiltration data destruction. First (Symbolic Logic), create a stateful SIEM rule that triggers when a mobile device IP communicates with an IP on a threat intelligence blocklist, and if within 15 minutes an EDR log from the same device shows a file deletion event, generate a critical alert. Second (Statistical), for each device, baseline daily outbound data volume from Zeek conn.log; alert when a device's total `orig_bytes` exceeds its 30-day rolling average by >3 standard deviations and correlate with any file deletion alerts from the same device. Third (Machine Learning), use a sequence analysis model (e.g., RNN) trained on event sequences from network and EDR logs to identify and alert on the specific low-probability sequence of 'large outbound transfer to new domain' immediately followed by 'mass file delete'."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]