[
  {
    "information_requirement": "Is an adversary attempting to evade our mobile analysis or sandbox environments by performing system checks? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1633.001",
        "name": "System Checks",
        "evidence": [
          {
            "description": "A mobile application makes API calls to query specific system properties (e.g., 'ro.hardware', 'ro.product.model') or reads files (e.g., '/system/bin/qemu-props') associated with known emulator or sandbox environments. This activity occurs without subsequent application behavior that logically requires these properties, such as UI adjustments or feature enablement.",
            "data_sources": [
              "Mobile EDR API call logs",
              "Mobile EDR file access logs",
              "Mobile Application Vetting (MAV) sandbox logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application sandboxing environment, Corporate-managed mobile devices (Android & iOS), Mobile Device Management (MDM) platform",
            "action": "1. (Symbolic) In your SIEM, create a rule that triggers on Mobile EDR logs where an application process accesses a property or file path matching a watchlist of high-confidence emulator artifacts (e.g., property contains 'goldfish', 'ranchu', 'qemu', 'vbox'; file path is '/system/bin/qemu-props'). Enrich alerts with the application name and developer certificate information. 2. (Statistical) For each application's first 60 seconds of execution, calculate the count of unique system properties queried. Establish a baseline distribution of this count from all applications in your corporate app store. Generate an alert for any application whose query count exceeds the 98th percentile of the benign baseline, indicating an abnormally high level of environmental inspection. 3. (Machine Learning) Train a Random Forest classifier using labeled data from MAV sandbox runs. Engineer features including: a) a binary flag for each known emulator property queried, b) the total count of distinct properties queried, and c) the time-to-first-query. Deploy the model to assign an 'evasion probability' score to new applications during automated vetting."
          },
          {
            "description": "A mobile application queries for the list of available hardware sensors (e.g., accelerometer, gyroscope, light sensor) upon startup, but is not followed by a corresponding registration to listen for sensor data within a 60-second window. This suggests the query was for environment detection rather than legitimate functionality.",
            "data_sources": [
              "Mobile EDR API call logs",
              "MAV sandbox dynamic analysis logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Bring-Your-Own-Device (BYOD) fleet with security agents, Application sandboxing environment",
            "action": "1. (Symbolic) Construct a correlation rule in your SIEM that triggers when a process on a mobile device generates an API call event for 'SensorManager.getSensorList' (or equivalent) and is not followed by an event for 'registerListener' from the same process ID within 60 seconds. 2. (Statistical) Profile legitimate applications to establish a baseline ratio of 'sensor list' calls to 'sensor register' calls during initial execution. For each new application, query Mobile EDR logs to calculate this ratio. An unusually high ratio (e.g., > 10:1) or a ratio exceeding three standard deviations from the benign mean indicates potential evasion. 3. (Machine Learning) Use a clustering algorithm like DBSCAN on features representing sensor interaction patterns for each app (e.g., count of sensor list queries, count of sensor registrations, mean time between query and registration). Isolate and investigate clusters that exhibit a high query count and a low registration count, as these represent a distinct, anomalous behavior pattern."
          },
          {
            "description": "A mobile application queries for network interface details (e.g., MAC address, DHCP server), and this query is temporally correlated with a significant state change in the device's network traffic. The change manifests as a sudden cessation of diverse traffic or a pivot to using only encrypted DNS, indicating the application has altered its behavior after inspecting the network environment.",
            "data_sources": [
              "Mobile EDR API call logs",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for mobile devices (e.g., corporate Wi-Fi, VPN gateway), DNS resolvers, Corporate-managed mobile devices",
            "action": "1. (Symbolic) Create a SIEM correlation rule that links a Mobile EDR alert for a network interface query to network logs from the same device IP. If, within 3 minutes of the query, the device's outbound connections in Zeek conn.log (excluding traffic to whitelisted OS/MDM servers) cease for more than 10 minutes, generate an alert for evasive 'going dark' behavior. 2. (Statistical) For each mobile device IP, use a script to process Zeek conn.log and dns.log in 5-minute, non-overlapping windows. Calculate the Shannon entropy of destination IP addresses and of requested domains. Generate an alert if the entropy score for either metric drops by more than 80% from one window to the next, signaling a sudden collapse in traffic diversity. 3. (Machine Learning) Implement a time-series anomaly detection model. For each device, create a multivariate time series from Zeek logs with features like 'bytes_out', 'distinct_dest_ips', 'distinct_dest_ports', and 'connection_count' per minute. Train an LSTM autoencoder on a baseline of normal behavior. A sharp spike in the model's reconstruction error, especially one corresponding to a sudden drop in activity metrics, indicates a significant deviation from the norm worthy of investigation."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]