[
  {
    "information_requirement": "Is an adversary attempting to intercept credentials or access tokens by hijacking URI schemes on mobile devices? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1635.001",
        "name": "URI Hijacking",
        "evidence": [
          {
            "description": "An application with a low trust score (e.g., not from an official app store, low download count, recent release date) registers a URI scheme identical to a high-value, legitimate application (e.g., 'corp-sso://', 'msauth://', 'okta://'). This is observed as a duplicate entry for a single URI scheme in the aggregated application inventory, where one application is known/trusted and the other is not.",
            "data_sources": [
              "MDM Application Inventory Records",
              "MTD Application Scan Reports",
              "Threat Intelligence App Reputation Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile endpoints (iOS, Android), Mobile Device Management (MDM) Platform, Mobile Threat Defense (MTD) Console, Application Vetting and Signing Infrastructure",
            "action": "1. (Symbolic Logic): Ingest application inventory data from MDM/MTD into a SIEM. Maintain a curated allow-list of known applications and their legitimate, registered URI schemes (e.g., 'Okta Verify' -> 'okta://'). Create a detection rule that triggers an alert when an application not on the allow-list registers a URI scheme that is present on the allow-list, indicating a direct collision. 2. (Statistical Method): For each URI scheme, calculate the entropy of the package names or developer signatures associated with it across the fleet. A low entropy score for a popular URI (e.g., 'https://') is normal, but a sudden drop in entropy for a sensitive, corporate URI (e.g., 'corp-sso://') indicates a new, potentially malicious app has registered it on many devices, warranting an alert. 3. (Machine Learning): Develop a classification model (e.g., Random Forest) trained on historical application data. Features should include: application source (App Store, Sideloaded), developer reputation, permissions requested, age of the application, and whether its registered URIs collide with known sensitive schemes. The model will output a risk score from 0 to 1 for each new application installation. An alert is triggered for any application with a score above a predefined threshold (e.g., 0.85)."
          },
          {
            "description": "An unusual number of application 'chooser' dialogs are presented to the user for a single URI scheme, as reported by a Mobile Threat Defense agent. This indicates multiple applications are competing to handle the same URI request, a primary symptom of a hijacking attempt.",
            "data_sources": [
              "MTD Agent Event Logs",
              "Mobile OS-level security logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile endpoints (iOS, Android), Mobile Threat Defense (MTD) Platform",
            "action": "1. (Symbolic Logic): From MTD agent logs, create a rule to alert if an event ID corresponding to a 'user chooser dialog' is generated for any URI on a watchlist of sensitive, high-value schemes (e.g., 'msauth://', 'corp-sso://'). 2. (Statistical Method): For each user, establish a baseline of 'chooser dialog' events per day using a 30-day moving average. Alert if the daily count for a user exceeds 3 standard deviations above their personal baseline, indicating an unusual amount of application contention. 3. (Machine Learning): Use a time-series anomaly detection model (e.g., Seasonal-ARIMA) to monitor the fleet-wide count of 'chooser dialog' events per hour. An anomaly detected by the model, especially outside of business hours or following a new application deployment, would indicate a coordinated or widespread issue potentially related to a malicious app campaign and trigger an investigation."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]