[
  {
    "information_requirement": "Is an adversary attempting to remove their tools from a compromised mobile device to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.001",
        "name": "Uninstall Malicious Application",
        "evidence": [
          {
            "description": "A periodic network beacon from a mobile device, identified by a low variance in connection timing and data volume, ceases unexpectedly. The termination does not correspond to a recorded device shutdown or network disconnection event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring corporate mobile device traffic, such as corporate Wi-Fi access points, VPN concentrators, and the corporate DMZ.",
            "action": "1. (Symbolic) Ingest a threat intelligence feed of known C2 servers. Create a SIEM rule to alert whenever a connection from a mobile device IP address in Zeek conn.log or a query in Zeek dns.log matches an indicator from the feed. 2. (Statistical) For each source-destination pair involving a mobile device, calculate the mean and standard deviation of the inter-arrival time and bytes transferred over a rolling 24-hour window. Identify potential beacons where the coefficient of variation (stddev / mean) for inter-arrival time is below a low threshold (e.g., 0.2). Generate an alert if a connection series identified as a beacon stops and does not resume within a period equal to its mean inter-arrival time plus 5 standard deviations. 3. (Machine Learning) Train a time series forecasting model (e.g., ARIMA or Holt-Winters) on the connection history of statistically identified beacons. If an actual connection does not occur within the 99% prediction interval of the next expected beacon, classify the event as a 'C2 Cessation' anomaly. Correlate this anomaly with other device alerts to increase confidence."
          },
          {
            "description": "An application uninstall event is logged by the Mobile Device Management (MDM) platform for a managed device, but there is no corresponding authorized change request or help desk ticket within a predefined lookback period (e.g., 24-48 hours).",
            "data_sources": [
              "Windows Event Log (Application Log)",
              "MDM Platform Audit Logs",
              "IT Service Management (ITSM) System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized log aggregators; Windows Servers hosting the Mobile Device Management (MDM) platform; servers hosting the IT Service Management (ITSM) platform.",
            "action": "1. (Symbolic) Parse MDM logs for application uninstall events. For each event, execute an automated query against the ITSM system's API or database to check for a corresponding approved change ticket for the specific user/device and application within the last 48 hours. Generate a high-priority alert if no matching ticket is found. 2. (Statistical) For all unauthorized uninstalls identified via the symbolic method, calculate the daily uninstall rate per device. Use a moving average and standard deviation to establish a baseline for each device. Flag any device whose daily rate exceeds 3 standard deviations above its 30-day moving average. 3. (Machine learning) Train a classification model (e.g., Random Forest or Logistic Regression) on historical uninstall events. Features should include: application name entropy (rarity across the enterprise), time of day, day of week, and time since installation. Use the model to score new, unauthorized uninstalls; scores exceeding the 95th percentile are flagged as highly suspicious."
          },
          {
            "description": "A mobile device communicates with a known mobile rooting toolkit C2 server, and this event is followed within a short time window (e.g., less than 60 minutes) by the termination of a previously identified C2-like beacon from the same device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Platform Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS resolvers and network gateways used by the mobile device fleet.",
            "action": "1. (Symbolic) Create a SIEM correlation rule that triggers when a connection from a mobile device IP (in Zeek conn.log or dns.log) matches a threat intelligence indicator for mobile rooting toolkits. 2. (Statistical) Upon a 'Rooting Toolkit' alert for a device, automatically query the device's network history for the past 24 hours to find any active C2-like beacons (using the statistical method from the first evidence block). If a beacon's termination timestamp occurs within 60 minutes after the rooting toolkit communication, escalate the alert priority to critical. 3. (Machine Learning) Implement a sequence analysis model to track device event chains. An alert for 'Rooting Toolkit Communication' is the start of a sequence. If a 'C2 Cessation' alert (as defined in the first evidence block) for the same device is observed as the next event in the sequence within a 60-minute window, the model classifies this sequence as a high-confidence 'Malicious Uninstall' event and triggers an automated incident response action, such as device quarantine via MDM."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]