[
  {
    "information_requirement": "Is the adversary using Domain Generation Algorithms (DGAs) to establish command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637.001",
        "name": "Domain Generation Algorithms",
        "evidence": [
          {
            "description": "A single mobile device IP address generates a high volume of DNS requests for unique domains that result in a Non-Existent Domain (NXDOMAIN) response. These queried domains exhibit characteristics of algorithmic generation, such as a Shannon entropy score greater than 3.5 and a low linguistic sensibility. [1]",
            "data_sources": [
              "Zeek dns.log",
              "Windows DNS Server Analytic Event ID 260"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Wi-Fi access point logs, VPN concentrator logs, internal and external DNS server logs, Cloud Access Security Broker (CASB) traffic logs, Mobile Device Management (MDM) platform logs.",
            "action": "1. (Symbolic) Query all Zeek dns.log records and match the 'query' field against an up-to-date threat intelligence list of known DGA domains and patterns. Generate a high-severity alert upon a match originating from a mobile device IP. 2. (Statistical) In a 5-minute sliding window, group Zeek dns.log records by source IP ('id.orig_h'). For each group, calculate the count of unique queries where 'rcode_name' is 'NXDOMAIN' and the average Shannon entropy of the queried domains. Establish a baseline for both metrics across all mobile device subnets. Trigger an alert when a single IP exceeds the 99th percentile for the NXDOMAIN count and its average domain entropy exceeds 3.5. 3. (Machine Learning) For each unique domain in Zeek dns.log not present on a corporate allowlist, extract a feature vector including: domain length, Shannon entropy, 2-gram and 3-gram frequency, numeric character ratio, and vowel-to-consonant ratio. Use a pre-trained Random Forest or Gradient Boosting classifier to assign a DGA probability score. Escalate domains with a score > 0.90 that are also associated with a high NXDOMAIN rate from a single client IP for analyst review."
          },
          {
            "description": "A mobile device establishes a successful network connection via TCP or UDP to a destination IP address that was resolved from a domain registered within the last 72 hours. This domain has low prevalence, with fewer than five other devices in the organization connecting to it.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, internet gateway proxy logs, firewall logs, DNS resolver caches, Mobile Device Management (MDM) solution logs, WHOIS registration databases.",
            "action": "1. (Symbolic) Continuously enrich Zeek conn.log records by joining the destination IP ('id.resp_h') with a threat intelligence feed of known malicious C2 IP addresses. Generate an immediate, high-severity alert for any successful connection from a mobile device IP to a matched C2 IP. 2. (Statistical) Join Zeek dns.log records (where 'rcode_name' is 'NOERROR') with Zeek conn.log records on the resolved IP address. For each unique domain, perform a WHOIS lookup to get the creation date. Filter for connections to domains created within the last 3 days. For each of these young domains, count the number of unique source IPs ('id.orig_h') that connected to it. Alert on connections to young domains where this internal prevalence count is less than 5. 3. (Machine Learning) For each mobile device IP, create a daily time series of the count of connections to newly registered domains (e.g., created within the last 7 days). Apply a Seasonal Hybrid ESD (S-H-ESD) model to this time series to detect anomalous spikes in activity. A statistically significant spike indicates potential beaconing to a new C2 infrastructure and should be flagged for investigation."
          },
          {
            "description": "A mobile device is observed sending an unusually high volume of DNS queries or queries with abnormally large payload sizes (over 100 bytes) to a single, non-standard domain, indicative of DNS tunneling for C2 communications. [2]",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, DNS firewalls, Network Security Monitoring (NSM) sensors at network egress points.",
            "action": "1. (Symbolic) Create a rule to detect DNS queries where the 'query' field length exceeds 255 bytes or contains patterns indicative of Base64 encoding. Generate an alert for any match, as this is highly anomalous for standard DNS traffic. 2. (Statistical) For each source IP ('id.orig_h') and destination domain pair, calculate the total data volume (sum of 'query_length' + response size) and the number of queries over a 1-hour window. Establish a baseline for these metrics across mobile subnets. Alert when a device-domain pair exceeds the 99.5th percentile for either metric, especially if the destination domain also has high entropy or is newly registered. 3. (Machine Learning) Use an unsupervised learning model like K-Means clustering on features extracted from DNS traffic per source IP, such as query frequency, query length distribution, and response size distribution. Isolate clusters that represent outliers from normal DNS behavior. Investigate these outlier clusters, characterized by high-frequency, large-payload queries to a small set of domains, as strong candidates for DNS tunneling activity."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]