[
  {
    "information_requirement": "Has an adversary achieved persistence by modifying a client software binary on a mobile device? (PIR)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1645",
        "name": "Compromise Client Software Binary",
        "evidence": [
          {
            "description": "An explicit failure status is recorded in remote attestation logs for a managed mobile device. Specific fields indicating failure include Google SafetyNet's 'ctsProfileMatch: false' or 'basicIntegrity: false', or a comparable failure flag from a Samsung Knox Attestation log, suggesting the device's software integrity has been compromised. [1]",
            "data_sources": [
              "Mobile Device Management (MDM) logs",
              "Google SafetyNet Attestation API logs",
              "Samsung Knox Attestation logs",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet, Mobile Device Management (MDM) Platform, and Cloud-based attestation service endpoints",
            "action": "1. (Symbolic) Implement a SIEM detection rule to generate a high-severity alert for any log from an MDM or attestation service containing an explicit device integrity failure (e.g., `ctsProfileMatch: false` or `basicIntegrity: false`). 2. (Statistical) On a 6-hour rolling basis, calculate the rate of attestation failures as a percentage of total checks, segmented by OS version and device model. Generate a medium-severity alert if the failure rate for any segment exceeds the 99th percentile of its 30-day historical baseline, indicating a potential targeted or widespread issue. 3. (Machine Learning) Upon a device attestation failure, trigger a workflow to extract all associated network connection logs (Zeek conn.log) from the preceding 72 hours. Score each destination FQDN/IP using a pre-trained classification model that uses features such as domain entropy, SSL certificate issuer and age (from Zeek ssl.log), JA3/JA3S hash rarity, and threat intelligence reputation. Escalate the alert to critical if the device communicated with a destination having a model score greater than 0.9, indicating high confidence of maliciousness."
          },
          {
            "description": "Anomalous network traffic patterns are observed originating from a managed mobile device. This includes communication with known malicious infrastructure, use of algorithmically generated domain names, or significant deviations in data transfer volumes or protocol usage compared to an established baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN terminators, and Cloud Access Security Brokers (CASB)",
            "action": "1. (Symbolic) Continuously match destination IP addresses (`id.resp_h`) and server names (`server_name`) from Zeek conn.log and ssl.log against a high-fidelity threat intelligence feed of known C2 servers. Generate a high-severity alert on any match. 2. (Statistical) For all DNS queries in Zeek dns.log, calculate the Shannon entropy of the second-level domain in the 'query' field. Establish a baseline entropy distribution for all mobile devices. Generate a medium-severity alert for any device querying a domain with an entropy score above the 98th percentile of the baseline. Additionally, monitor the ratio of outbound to inbound bytes (`orig_bytes` / `resp_bytes`) in Zeek conn.log; alert if this ratio exceeds 10 for connections lasting more than 60 seconds, which can indicate data tunneling or exfiltration. 3. (Machine Learning) For each mobile device, train a one-class SVM or isolation forest model on a feature set derived from its typical network behavior over a 30-day period. Features should include daily outbound data volume, count of unique destination IPs, distribution of destination ports, and average connection duration. Run new daily activity against the model; an anomaly score indicating an outlier should generate a medium-severity alert for analyst review."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]