[
  {
    "information_requirement": "Is an adversary exfiltrating data from mobile devices over an established command and control channel? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1646",
        "name": "Exfiltration Over C2 Channel",
        "evidence": [
          {
            "description": "Outbound data volume from a mobile device to a single destination IP address exceeds a statistically-derived threshold (e.g., 99th percentile of bytes transferred) compared to its historical baseline, or the connection duration is anomalously long (e.g., > 3 standard deviations) for beacon-like traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network gateways for corporate Wi-Fi, VPN concentrators, Cloud Access Security Broker (CASB) egress points, Unified Endpoint Management (UEM) platforms",
            "action": "Symbolic: Query Zeek conn.log for connections where the destination IP (id.resp_h) matches a threat intelligence feed of known C2 servers. From this subset, filter for connections where the total outbound bytes (orig_bytes) exceeds a static threshold, such as 1MB, or where the connection state (conn_state) indicates a one-way data dump (e.g., 'S1', 'S2', 'S3'). Statistical: For each source mobile device IP, establish a 30-day rolling baseline of outbound bytes (orig_bytes) and connection duration per destination IP (id.resp_h). Calculate the 99th percentile for both metrics. Generate an alert when a new connection's orig_bytes or duration exceeds its respective percentile for that specific source-destination pair. Enrich alerts by cross-referencing the destination IP with Zeek dns.log to identify newly registered or algorithmically generated domains. Machine Learning: Implement a time series forecasting model (e.g., ARIMA or Prophet) on the aggregate daily outbound data volume per mobile device. Train the model on at least 90 days of historical data. Trigger an alert if the observed daily volume exceeds the model's predicted 95% confidence interval, indicating a statistically significant anomaly."
          },
          {
            "description": "The ratio of outbound HTTP POST/PUT requests to inbound GET requests for a given mobile device-to-server communication stream significantly increases from its baseline, and the average size of POST request bodies exceeds its historical mean by more than three standard deviations.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web proxies, DNS resolvers used by mobile devices, Network Security Group (NSG) flow logs for cloud-hosted mobile infrastructure",
            "action": "Symbolic: Using Zeek dns.log, identify mobile devices querying for domains matching known C2 patterns (e.g., high character entropy, dynamic DNS providers, newly registered domains). Correlate the source IP with Zeek http.log and flag any subsequent HTTP POST or PUT activity to those domains where the request body size (request_body_len) is greater than 500KB. Statistical: For each source mobile IP (id.orig_h) and destination host (host) pair in Zeek http.log, calculate a 30-day baseline ratio of 'method=GET' to 'method=POST' events and the baseline average and standard deviation of 'request_body_len' for POSTs. Alert when the daily POST count surpasses the GET count or when the average 'request_body_len' for a 24-hour period exceeds the baseline by more than 3 standard deviations. Machine Learning: Apply a clustering algorithm (e.g., DBSCAN) to features extracted from Zeek http.log sessions. Use features like request/response size ratio, request method distribution (e.g., %POSTs), user-agent string entropy, and periodicity of requests. Identify and investigate clusters of anomalous C2-like behavior that deviate from the main cluster of normal browsing activity."
          },
          {
            "description": "The Shannon entropy of captured network traffic payloads from a mobile device to a specific destination consistently measures above a defined threshold for normal application traffic (e.g., > 7.5), indicating the likely presence of encrypted or compressed data being exfiltrated.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices enrolled in Mobile Device Management (MDM), Network TAPs capturing traffic to/from mobile subnets, Virtual Private Cloud (VPC) traffic mirroring",
            "action": "Symbolic: Scan files extracted by Zeek (in files.log) from mobile device traffic. Correlate the file's connection UID (conn_uids) to the connection details in conn.log. Alert if the file's mime_type is an archive format (e.g., 'application/zip', 'application/x-rar-compressed') and the destination IP (id.resp_h) is not on an approved list of corporate file-sharing or cloud storage services. Statistical: For traffic flows from mobile devices over non-standard ports or to low-reputation IPs (identified via conn.log), sample the initial data packets of the payload. Calculate the Shannon entropy for these samples. Establish a baseline entropy score for known-good application traffic from the same device or device group. Alert when the calculated entropy for a flow exceeds a high-water mark (e.g., an entropy score > 7.5). Machine Learning: Train a classification model (e.g., Random Forest) to distinguish between 'benign' and 'potential exfiltration' traffic flows. Use features such as payload entropy, packet size distribution statistics (mean, std dev), inter-arrival time of packets, and connection duration. Use the trained model to classify live traffic flows and flag suspicious connections for analyst review."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]