[
  {
    "information_requirement": "Is an adversary manipulating transmitted data on mobile devices to cause an impact?",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1641.001",
        "name": "Transmitted Data Manipulation",
        "evidence": [
          {
            "description": "Evidence of clipboard content replacement is observed when an HTTP POST request from a mobile device sends a sensitive identifier, such as a cryptocurrency wallet address or IBAN, to a destination domain that is anomalous for that user, has a low reputation score, or was recently registered.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Platform Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and guest Wi-Fi network access points, VPN concentrators, Perimeter firewalls and web proxies",
            "action": "1. (Symbolic) Imperative: From DHCP/VPN logs, identify IP ranges for mobile devices. Monitor `Zeek http.log` for HTTP POST requests from these ranges. Using regular expressions, scan the POST body for patterns matching cryptocurrency addresses (e.g., BTC, ETH) or financial identifiers (e.g., IBANs). For each match, extract the destination `Host` header. Correlate with `Zeek dns.log` to get the resolved IP and `Zeek conn.log` to confirm the connection. Query a Threat Intelligence Platform for the domain's age, reputation, and threat categorization. Generate an alert if a sensitive pattern is sent to a domain that is flagged as malicious, has a reputation score below 50, was registered within the last 30 days, and is not on a pre-approved allowlist for financial transactions. 2. (Statistical) Imperative: For each user/device, build a historical baseline of destination domains to which they POST sensitive data. Monitor for transactions where sensitive data is sent to a statistically rare domain for that user (e.g., a domain not in the top 95th percentile of their most frequent destinations). Additionally, calculate the Shannon entropy of the data within the specific form field containing the sensitive pattern across multiple sessions. Generate an alert if the entropy for a new submission deviates more than 3 standard deviations from that user's established baseline for that specific field, suggesting a structural change in the submitted data (e.g., a different user's wallet address). 3. (Machine Learning) Imperative: Engineer a feature set for each sensitive data transaction, including source IP geolocation, User-Agent, destination domain reputation, domain age, ASN, Shannon entropy of the data payload, POST request size, and time-of-day features (e.g., hour, day of week). Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on labeled historical data (benign/malicious). Deploy the model to generate a real-time risk score for new transactions. Generate a high-priority alert for any transaction exceeding a dynamically tuned risk threshold (e.g., a score > 0.9) to flag potentially manipulated data submissions."
          },
          {
            "description": "A mobile device establishes a network connection to a destination domain that is either flagged by threat intelligence as malicious or is a statistical outlier for that device, characterized by factors such as domain age, TLS fingerprint, or infrequency of communication.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Threat Intelligence Platform Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, Internet gateway, Wi-Fi network sensors",
            "action": "1. (Symbolic) Imperative: Monitor `Zeek dns.log` for all DNS queries originating from mobile device IP ranges. For each query, enrich the domain with threat intelligence data (threat category, reputation). Correlate the DNS query with a connection in `Zeek conn.log` and the TLS certificate information in `Zeek ssl.log`. Generate an alert if a connection is made to a domain categorized as C2, malware, or phishing, or if the TLS certificate is self-signed and not part of an internal PKI. 2. (Statistical) Imperative: For each mobile device, create a 30-day rolling baseline of normally contacted domains and their query frequency. Calculate the rate of 'first-time seen' domains contacted by each device per hour. Additionally, baseline the JA3/JA3S TLS fingerprints from `Zeek ssl.log` for each device. Generate an alert when the 'new domain' rate exceeds the 98th percentile of the device's history, or when a new, rare JA3/JA3S hash is observed, indicating either unusual network destinations or a new client application making connections. 3. (Machine Learning) Imperative: Train an unsupervised anomaly detection model (e.g., Isolation Forest, One-Class SVM) on network connection features for each device. Features should include: domain TLD, DNS query type, connection duration, total bytes transferred (from `Zeek conn.log`), JA3 hash, and destination port. Use the trained model to score each new connection's deviation from the device's established 'pattern-of-life'. Generate an alert for connections identified as significant outliers by the model, as they may represent malicious background activity."
          },
          {
            "description": "An application on a managed mobile device registers a clipboard listener API without a clear, user-facing feature to justify it, particularly when the application also possesses internet communication permissions and is not from a trusted developer.",
            "data_sources": [
              "Mobile EDR application manifest data",
              "Mobile EDR API call monitoring logs",
              "MDM application inventory reports"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (corporate-owned or BYOD enrolled in MDM)",
            "action": "1. (Symbolic) Imperative: Using an MDM/EDR solution, periodically scan the application manifests of all installed apps on managed mobile devices for the use of clipboard listener APIs (e.g., `OnPrimaryClipChangedListener` on Android). Cross-reference this list against the application's declared permissions. Generate an alert for any non-system application that registers a clipboard listener and also requests `INTERNET` permissions, excluding applications on an approved list (e.g., known password managers, corporate apps). 2. (Statistical) Imperative: For each managed device, maintain a baseline of the number and type of applications that use clipboard listeners. Calculate the prevalence of clipboard listener usage within each application's App Store category (e.g., 'Finance', 'Social'). Generate an alert when a newly installed application uses a clipboard listener and belongs to a category where such usage is statistically rare (e.g., below the 10th percentile for that category), suggesting an unusual and potentially suspicious capability. 3. (Machine Learning) Imperative: Engineer a feature set for each installed application using data from MDM/EDR and app store scraping. Features should include: all requested permissions, sensitive API calls made, app store category, user rating distribution, number of downloads, and developer history. Train a classification model (e.g., Logistic Regression) to produce a 'Potentially Unwanted Application' (PUA) risk score. An application that uses a clipboard listener in combination with other risky features (e.g., requests accessibility services, performs dynamic code loading, has a poor developer reputation) will receive a high risk score, triggering an alert for analyst review and potential device quarantine."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]