[
  {
    "information_requirement": "Is an adversary using masqueraded applications or files on mobile devices to evade defenses? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1655",
        "name": "Masquerading",
        "evidence": [
          {
            "description": "A mobile application generates network traffic where the destination domain is on a threat intelligence list, has an unusually high entropy score, or where the traffic volume and protocol deviate significantly from an established baseline for that application category.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi Network Egress Points, VPN Concentrators, Mobile Device Management (MDM) Platforms",
            "action": "1. (Symbolic) Query Zeek dns.log and conn.log for connections from mobile device IP ranges to destinations matching a threat intelligence feed of known command-and-control (C2) servers or newly registered domains (NRDs). 2. (Statistical) For each mobile device, calculate the Shannon entropy of requested domain names in Zeek dns.log. Alert on domains exceeding a threshold (e.g., > 3.5), which indicates potential Domain Generation Algorithm (DGA) activity. Additionally, for known application user-agents in http.log, establish a baseline of normal destination ports and data volume (e.g., 95th percentile). Alert when a connection from an application (e.g. 'calculator') exceeds this data volume baseline to a non-standard port. 3. (Machine Learning) Train a time-series model (e.g., ARIMA) on the volume of outbound traffic per device. Use the model to perform anomaly detection and identify sudden spikes in data transmission inconsistent with prior behavior. Additionally, use an unsupervised clustering algorithm (e.g., K-Means) on features from Zeek conn.log (duration, protocol, service, orig_bytes, resp_bytes) to group connections into 'normal' and 'abnormal' clusters and investigate mobile device connections that fall into the 'abnormal' cluster."
          },
          {
            "description": "A mismatch is detected between a file's name extension and its true MIME type during a transfer to a mobile device, where the true type is an executable (e.g., 'application/vnd.android.package-archive') and the filename suggests a benign document (e.g., '.pdf').",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organizational Internet Gateway, Web Proxies, Email Gateways",
            "action": "1. (Symbolic) Create a SIEM rule to alert when Zeek files.log shows a file transfer to a mobile IP range where the `filename` ends in '.pdf', '.jpg', or '.docx' but the `mime_type` is 'application/vnd.android.package-archive'. Correlate with http.log to check the `User-Agent` to confirm the client is a mobile device. 2. (Statistical) For each user, calculate the ratio of mismatched file downloads (as defined above) to total file downloads over a rolling 30-day window. Alert on users whose ratio exceeds the 99th percentile for the organization, indicating they may be a specific target of a phishing campaign. 3. (Machine Learning) Develop a classification model (e.g., Logistic Regression) trained on features from Zeek files.log and http.log (MIME type, filename extension, source reputation, User-Agent, Referer header). The model will predict a 'masquerade_risk_score' for each file download. High scores trigger an alert for analyst review."
          },
          {
            "description": "A high rate of failed authentication attempts (Windows Event ID 4625) against internal enterprise resources originates from an IP address associated with a corporate mobile device via a VPN or guest network.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Authentication Servers, Domain Controllers, Internal File Servers",
            "action": "1. (Symbolic) Create a SIEM rule to trigger when an IP from the mobile device VPN address pool generates more than 10 failed logon events (Windows Event ID 4625) for a single user account across multiple internal hosts within a 5-minute window. 2. (Statistical) Establish a baseline for the average number of failed logons per hour from the mobile VPN IP range. Use a moving average to track this metric. Alert when the current rate exceeds 3 standard deviations above the moving average, indicating a potential brute-force or password spraying attack from a compromised mobile device. 3. (Machine Learning) Implement a user-and-entity behavior analytics (UEBA) solution. Train a model on normal user login patterns (source IP range, time of day, target systems, protocol). A login attempt from a mobile device IP at an anomalous time to an unusual server, especially if it fails, would be flagged by the model as a high-risk anomaly, even if it is a single event that would not trigger a rate-based rule."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]