[
  {
    "information_requirement": "Is an adversary using legitimate remote access software for Command and Control on our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1663",
        "name": "Remote Access Software",
        "evidence": [
          {
            "description": "A network connection from a corporate mobile device resolves a domain or connects to an IP address present on a threat intelligence feed for remote access software, and the application initiating the connection is not on an approved software list managed by the Mobile Device Management (MDM) platform.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Corporate DNS servers, Windows-based web proxies, VPN concentrators, Mobile Device Management (MDM) platform",
            "action": "1. (Symbolic Logic) Create and maintain a watchlist of domains, IP addresses, and SSL certificate subjects associated with unapproved remote access software. Create a SIEM rule that queries Zeek logs (dns.log for 'query', conn.log for 'id.resp_h', and ssl.log for 'server_name') for traffic from the mobile device IP range that matches the watchlist. Correlate device identifiers from network logs with MDM data to filter out alerts for devices with approved, business-justified remote access software. 2. (Statistical Method) For each connection that matches the watchlist, analyze its metadata in Zeek conn.log. Calculate the 95th and 98th percentiles for connection duration and total bytes transferred ('orig_bytes' + 'resp_bytes') across all mobile device traffic over a 30-day baseline. Generate a medium-severity alert if a watchlist-matched connection exceeds the 95th percentile and a high-severity alert if it exceeds the 98th percentile. 3. (Machine Learning) Train a supervised classification model (e.g., Random Forest) using labeled historical Zeek conn.log data. Features should include protocol, duration, orig_bytes, resp_bytes, conn_state, history, destination port, and a binary feature indicating if the destination is on the remote access watchlist. Deploy the model to classify new connections from mobile devices in near-real-time as 'benign' or 'suspicious-remote-access', triggering an alert on the latter."
          },
          {
            "description": "A long-lived TCP connection from a corporate mobile device uses a protocol dynamically identified by network sensors as remote access (e.g., VNC), but on a non-standard port. The session exhibits a high ratio of packets to bytes transferred, suggesting interactive keep-alives or keystrokes rather than bulk data transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Network segments hosting corporate mobile devices, Core network switches",
            "action": "1. (Symbolic Logic) Create a SIEM rule to search for Zeek conn.log entries where the 'service' field contains a remote access protocol (e.g., 'vnc', 'rdp') and the 'id.resp_p' field is not the standard IANA-assigned port for that service. Heighten alert priority if Zeek also generates a 'Protocol_Mismatch' notice in notice.log for the same session. 2. (Statistical Method) For each long-lived connection from a mobile device, calculate an interactivity score defined as the ratio of total packets ('orig_pkts' + 'resp_pkts') to total bytes ('orig_bytes' + 'resp_bytes'). Establish a baseline for this score across all mobile device traffic. Flag connections where this score exceeds the 95th percentile and the connection involves a non-standard port for a dynamically detected remote access protocol. Additionally, calculate the Shannon entropy of destination ports used by each mobile device over a rolling 24-hour window; a sharp increase in entropy can indicate scanning or tunneling behavior. 3. (Machine Learning) Deploy a time-series anomaly detection model (e.g., an LSTM-based autoencoder) trained on the time series of outgoing byte counts for each mobile device. An alert is generated when the model flags a significant anomaly (reconstruction error exceeds a dynamic threshold) that temporally correlates with the appearance of a long-duration connection on a non-standard port in Zeek conn.log."
          },
          {
            "description": "A successful and unsolicited inbound connection is established from an external IP address to a corporate mobile device on a port commonly used by remote access software (e.g., 5900/TCP, 5938/TCP), where corporate policy forbids such connections.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek known_services.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Demilitarized Zone (DMZ), Wi-Fi network segments, Firewall appliances",
            "action": "1. (Symbolic Logic) Implement a high-priority SIEM alert that triggers on any successful connection ('conn_state' of 'SF' or 'RSTO') in Zeek conn.log where the originating IP ('id.orig_h') is external (not RFC1918) and the destination IP ('id.resp_h') is in the designated mobile device IP range. Since policy should block all unsolicited inbound traffic to these devices, any such alert represents a critical firewall misconfiguration or bypass and requires immediate investigation. 2. (Statistical Method) On a daily basis, query Zeek known_services.log to identify all services observed listening on mobile devices. Calculate the prevalence (as a percentage of the total device fleet) for each listening port. Generate an alert for any device found listening on a port that is statistically rare (e.g., present on less than 1% of the mobile fleet) or is on a watchlist of high-risk ports. 3. (Machine Learning) Apply a density-based clustering algorithm (e.g., DBSCAN) to mobile devices using features derived from their network profiles, such as the set of listening ports, the ratio of inbound to outbound connections, and the geographic diversity of inbound connection sources. Devices identified as noise points (outliers) by the algorithm, particularly those with unique listening ports, should be automatically flagged for analyst review as potential peer group deviants."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]