[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to mobile devices via phishing? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1660",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A mobile device's User-Agent is observed in network traffic connecting to a domain that exhibits a combination of at least three high-risk characteristics: registration age under 30 days, character entropy greater than 3.5, a TLD uncommon for corporate traffic (e.g., .xyz, .top), or is a known typosquat of a legitimate domain. This activity is not associated with a known corporate application and may indicate a smishing attack.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log",
              "MDM network connection logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic logs from corporate Wi-Fi access points, VPN concentrators, and network egress points where mobile device traffic is routed. Logs from Mobile Device Management (MDM) platforms providing device context.",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Continuously monitor Zeek dns.log for requests to domains matching a high-confidence phishing domain threat intelligence feed. Generate a critical alert upon match. 2. (Statistical) For all DNS requests from mobile IP ranges, calculate domain character entropy, query WHOIS for registration age, and check the TLD against a rarity baseline established over 30 days. Create a risk score by adding points for entropy > 98th percentile, age < 30 days, and TLD rarity > 99th percentile. A cumulative score exceeding a defined threshold triggers an alert. Correlate with Zeek http.log to confirm the User-Agent is a mobile browser. 3. (Machine Learning) Utilize a pre-trained domain generation algorithm (DGA) detection model or a logistic regression classifier on DNS query data. Features should include domain length, entropy, n-gram frequency, TLD, and presence of dictionary words. A model output probability > 0.9 for a domain being malicious triggers an alert for analyst investigation."
          },
          {
            "description": "A mobile device makes a DNS request for a domain that has never been visited by any other device in the organization, followed by an HTTP/S connection. The domain itself is a statistical outlier based on character composition and lacks a corresponding TLS server name that matches any known enterprise service, suggesting a user scanned a malicious QR code (quishing).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "MDM application inventory logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring corporate and guest Wi-Fi networks. VPN concentrators logging traffic from remote mobile devices. MDM platforms that can provide an inventory of installed applications on managed devices to rule out legitimate traffic.",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Scan Zeek ssl.log for TLS certificates matching known-bad fingerprints from threat intelligence or containing suspicious issuer strings (e.g., 'Acme Co Phishing Kit'). Generate an alert on match. 2. (Statistical) Maintain a real-time set of all domains requested across the enterprise in the last 24 hours. For each new DNS request from a mobile device, check if the domain is 'globally rare' (seen for the first time). If it is, and it is also 'locally rare' (only requested by one user), flag it. Calculate the Jaccard similarity between the set of domains visited by the user in the last 5 minutes and their historical 30-day profile. A low similarity score (<0.2) for a session containing a 'globally rare' domain indicates a high-risk deviation. 3. (Machine Learning) Apply a one-class SVM (Support Vector Machine) model trained on each user's normal network activity profile (features: domains visited, protocols used, data volume). A new connection that falls outside the learned boundary is classified as an anomaly, potentially indicating a user was redirected to an unusual location via a QR code."
          },
          {
            "description": "A mobile device, identified by its User-Agent string, initiates an HTTP/S connection to a domain whose TLS certificate has a validity period of less than 90 days and was issued by a free Certificate Authority. This activity follows a DNS lookup for a domain known to be a URL shortener, and the resolved IP address has a low reputation score, suggesting a phishing link was clicked from an email or message.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, email security gateway logs, corporate VPN concentrators, and authentication logs from Single Sign-On (SSO) or ADFS servers that handle mobile user logins.",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Create a watchlist of popular URL shortener domains. For DNS requests to these domains from mobile devices, track the final resolved IP address in Zeek dns.log. Match this IP against a real-time threat intelligence feed of malicious C2 or phishing infrastructure. Generate a high-priority alert on a match. 2. (Statistical) From Zeek ssl.log for mobile traffic, profile TLS certificate attributes. Generate an alert if a connection uses a certificate where the validity duration is in the bottom 5th percentile (e.g., < 90 days) AND the issuer is a free CA (e.g., Let's Encrypt) AND the server_name impersonates a corporate brand or service. 3. (Machine Learning) Train a Random Forest classifier to predict malicious connections using features from Zeek logs (e.g., from ssl.log: certificate validity length, issuer, self-signed status; from dns.log: domain entropy, TLD; from conn.log: connection duration, bytes transferred). Correlate high-probability alerts from the model with subsequent successful authentication events (Windows Event ID 4624) from the same source IP to prioritize incidents involving potential credential compromise."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]