[
  {
    "information_requirement": "Is an adversary attempting to discover installed applications on our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1418",
        "name": "Software Discovery",
        "evidence": [
          {
            "description": "A command-line process is executed on a connected host to query the application package list of a mobile device using debugging tools like Android Debug Bridge (ADB).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer workstations and IT support machines with mobile device management tools installed.",
            "action": "Monitor for process creation events (Windows Event ID 4688) where the Process Name is `adb.exe`. Scrutinize the Command Line field for strings indicative of package enumeration, such as `shell pm list packages`. Establish a baseline for the frequency of these commands per user/host. Use statistical analysis to flag any execution by non-developer user accounts or a sudden increase in frequency (e.g., count > 95th percentile of daily activity) as a high-priority alert. Correlate the timestamp of this event with network activity from the associated mobile device."
          },
          {
            "description": "A mobile device exfiltrates a list of installed applications over the network, often characterized by an anomalous connection following on-device activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Wi-Fi network segments for mobile devices, and VPN concentrators.",
            "action": "For connections originating from mobile device IP ranges, analyze `Zeek conn.log` to identify connections with an unusually high ratio of outbound to inbound bytes (`orig_bytes` >> `resp_bytes`) to a new or rare external destination. In `Zeek http.log`, search for HTTP POST requests where the payload size is consistent with a text list (e.g., 1KB - 50KB) and the user-agent is either generic, missing, or has a low prevalence score. Cross-reference destination domains with `Zeek dns.log` to calculate domain age and query frequency, prioritizing connections to domains registered within the last 30 days. Calculate the Shannon entropy of URI parameters or POST bodies; a high entropy score may indicate encoded data exfiltration."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]