[
  {
    "information_requirement": "Is an adversary discovering our mobile device network configuration? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1422",
        "name": "System Network Configuration Discovery",
        "evidence": [
          {
            "description": "A non-system, non-carrier, or non-default SMS application on an Android device is observed requesting or using the 'READ_PRIVILEGED_PHONE_STATE' permission to access sensitive device and network identifiers (e.g., IMEI, IMSI).",
            "data_sources": [
              "Mobile Threat Defense (MTD) Application Scan Logs",
              "Mobile Device Management (MDM) Policy Compliance Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed Android mobile device fleet",
            "action": "Using an MDM/MTD solution, continuously audit the permissions of all installed applications on managed Android devices. Create a high-severity alert for any application, not whitelisted as a system, carrier, or default app, that requests the 'READ_PRIVILEGED_PHONE_STATE' permission. Correlate these alerts with network logs (Zeek conn.log) to check for new outbound connections from the flagged device to rare or uncategorized destinations immediately following the permission grant or app installation, which could indicate exfiltration of discovered identifiers."
          },
          {
            "description": "An application exhibits an anomalously high frequency of calls to network discovery APIs, such as 'java.net.NetworkInterface' on Android, that is inconsistent with its stated purpose and normal behavior.",
            "data_sources": [
              "Mobile EDR/MTD API Call Monitoring Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices of high-value targets (e.g., executives, system administrators)",
            "action": "For devices with endpoint instrumentation (MTD/EDR), establish a baseline of API call frequency for 'java.net.NetworkInterface' per application or application category. Use statistical methods to detect significant deviations; for example, flag any application where the call count in a 5-minute window exceeds the 99th percentile for that app. A triggered alert should automatically initiate scrutiny of the device's recent network traffic in Zeek conn.log for suspicious outbound connections."
          },
          {
            "description": "A mobile device establishes an outbound connection to a rare or suspicious destination shortly after a new application is installed or an existing one is updated, potentially exfiltrating discovered network configuration or device ID data.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's network egress points (e.g., internet gateway, VPN concentrators)",
            "action": "Continuously analyze Zeek dns.log to identify DNS requests for domains with high entropy scores or those not present in threat intelligence feeds or an established 'top 1 million' list. For each such DNS request originating from the mobile device IP space, calculate the rarity of the resolved destination IP across the entire organization over the past 30 days using Zeek conn.log. A connection from a mobile device to a destination IP seen by less than 1% of other hosts is a strong indicator of potential C2 communication and should be investigated."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]