[
  {
    "information_requirement": "Is the adversary capturing audio from mobile devices to collect sensitive information? (TA0035 - Collection)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1429",
        "name": "Audio Capture",
        "evidence": [
          {
            "description": "A mobile application activates the microphone without explicit user interaction, outside of its expected functionality, or while running in the background without a legitimate purpose.",
            "data_sources": [
              "MDM/MTD Application Activity Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Company-managed mobile devices and BYOD devices with corporate profiles",
            "action": "Monitor MDM/MTD logs for events corresponding to microphone activation (`RECORD_AUDIO` permission usage on Android, `AVAudioSession` on iOS). Correlate these activation events with the application's foreground/background state. Use statistical analysis to establish a baseline of normal microphone usage duration and frequency per application. Flag any microphone activations that occur while the app is in the background and not performing a legitimate background task (e.g., a voice call) or activations with durations exceeding 2 standard deviations from the norm. Cross-reference the timestamps of anomalous activations with network logs (Zeek conn.log) for concurrent, large, or encrypted outbound data flows to suspicious destinations."
          },
          {
            "description": "A third-party mobile application is identified with high-risk permissions related to audio capture, or its request for microphone access does not align with its stated purpose.",
            "data_sources": [
              "MDM/MTD Application Inventory Logs",
              "Mobile Application Static Analysis Reports"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate application stores and repositories, All managed mobile devices",
            "action": "Automate periodic scans of all applications on managed devices to inventory their permissions manifest. Generate a high-priority alert for any non-system, third-party application found requesting the `CAPTURE_AUDIO_OUTPUT` permission on Android. For all apps requesting `RECORD_AUDIO` (Android) or having the `NSMicrophoneUsageDescription` key (iOS), implement a risk scoring model. The model should assign higher scores to apps where the permission is not core to the app's function (e.g., a calculator app vs. a conferencing app), apps from untrusted developers, or apps not sourced from an official app store. Prioritize manual review for applications exceeding a defined risk threshold."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]