[
  {
    "information_requirement": "Is an adversary attempting to discover the location of our subscribers by impersonating SS7 nodes? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "An external, non-partner Global Title (GT) is sending location-related queries (e.g., Send Routing Information for SM - SRI-SM) to our Home Location Register (HLR).",
            "data_sources": [
              "Signaling Gateway (SGW) Transaction Logs",
              "Home Location Register (HLR) Query Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SS7 Signaling Gateways, Home Location Register (HLR)",
            "action": "Maintain a whitelist of all known, legitimate partner Global Titles. Monitor SGW and HLR transaction logs for incoming SS7 MAP messages, specifically location queries like SRI-SM or Provide Subscriber Information (PSI). Generate a high-priority alert for any such query originating from a source GT not present on the partner whitelist. Use descriptive statistics to identify GTs with an anomalously low ratio of other legitimate traffic types vs. location queries."
          },
          {
            "description": "A single source GT sends an unusually high volume of location queries for many distinct subscribers in a short period, indicating a broad discovery attempt.",
            "data_sources": [
              "Signaling Gateway (SGW) Transaction Logs",
              "Home Location Register (HLR) Query Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SS7 Signaling Gateways, Home Location Register (HLR)",
            "action": "For each source GT, calculate the rate of location queries per hour and the count of unique target subscribers (MSISDNs) queried. Establish a baseline for normal query rates and unique subscriber counts from legitimate partners. Use statistical methods (e.g., a Z-score greater than 3 or exceeding the 99th percentile) to detect significant deviations from this baseline. A single GT with a high query rate across a high number of unique MSISDNs is a strong indicator of a malicious scan."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary successfully collecting subscriber location data via SS7 network exploitation? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "A pattern of sequential location queries for the same subscriber (MSISDN) originates from an external GT over a short period, suggesting an attempt to track the target's movement.",
            "data_sources": [
              "Home Location Register (HLR) Query Logs",
              "Signaling Gateway (SGW) Transaction Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Home Location Register (HLR), Visitor Location Register (VLR)",
            "action": "For each unique target subscriber (MSISDN), perform a time-series analysis on incoming location queries. Identify instances where the same MSISDN is queried multiple times (e.g., > 3 times in an hour) from the same anomalous or non-whitelisted source GT. A repeating pattern of queries for a specific subscriber is a strong indicator of active tracking and collection."
          },
          {
            "description": "Successful location query responses (e.g., SRI-SM ACK containing the serving MSC/VLR address) are sent to a non-whitelisted or suspicious external GT.",
            "data_sources": [
              "Home Location Register (HLR) Query Logs",
              "Signaling Gateway (SGW) Transaction Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SS7 Signaling Gateways, Home Location Register (HLR)",
            "action": "In HLR or SGW logs, correlate incoming location queries with their corresponding outgoing responses. Filter for successful responses that contain subscriber location information (e.g., serving network node addresses). Create a high-severity alert if a successful response is sent to a GT that is not on the established partner whitelist or has been previously flagged by other detection actions. Calculate the ratio of successful to failed location queries for each external GT; a high success rate from a suspicious source indicates a successful collection campaign."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]