[
  {
    "information_requirement": "Is an adversary attempting to discover the physical location of our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.001",
        "name": "Remote Device Management Services",
        "evidence": [
          {
            "description": "Anomalous access to the Enterprise Mobility Management (EMM) or Mobile Device Management (MDM) console, characterized by unusual source IP, time of day, or user agent, indicating unauthorized device location lookups.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "EMM/MDM administration consoles and workstations, Internet egress points",
            "action": "For connections to EMM/MDM services identified in Zeek ssl.log (via Server Name Indication) and conn.log, correlate the source IP with admin workstation logins (Windows Event ID 4624). Establish a multi-faceted baseline for each admin account, including typical source IPs/geolocations, login times, and session frequencies. Use descriptive statistics to identify outliers, such as logins from a country with a 0% historical frequency for that user or login times exceeding 3 standard deviations from the user's mean. A high-risk score, derived from multiple simultaneous anomalies, suggests a compromised account is being used for unauthorized device discovery."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary collecting location data from our managed mobile devices via remote management services? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.001",
        "name": "Remote Device Management Services",
        "evidence": [
          {
            "description": "Repetitive, programmatic, or high-frequency access to device location features within EMM/MDM or consumer cloud management platforms, suggesting systematic collection of location data over time. [1]",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "EMM/MDM administration consoles and workstations, Internet egress points",
            "action": "Analyze Zeek conn.log data for sessions connecting to EMM/MDM and cloud location services (e.g., icloud.com, google.com/android/find). Model the distribution of session counts per source IP over a rolling 24-hour window. An IP address exhibiting a session count in the 99th percentile or higher may indicate automated, programmatic collection activity. Further scrutinize these high-frequency connections by correlating the source IP with known admin accounts (via Windows Event ID 4624) and their historical access patterns to differentiate legitimate administrative scripts from malicious collection activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]