[
  {
    "information_requirement": "Is an adversary attempting to disrupt mobile device communications through a Network Denial of Service attack? (TA0034 - Impact)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1464",
        "name": "Network Denial of Service",
        "evidence": [
          {
            "description": "A mobile device or a group of mobile devices in a specific location suddenly lose Wi-Fi connectivity, while other devices on the same network may remain unaffected, or the affected devices are unable to see any available Wi-Fi networks.",
            "data_sources": [
              "Zeek conn.log",
              "Mobile OS/MDM Wi-Fi Logs",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points and the mobile devices of key personnel connected to them.",
            "action": "Monitor Mobile OS/MDM logs for Wi-Fi state changes, specifically disconnect events. Correlate these events in time with Zeek conn.log data to identify a sudden halt in traffic from a device's IP that is not preceded by a graceful disconnect (TCP FIN/RST). Establish a baseline for device Wi-Fi signal strength (RSSI) and connection duration per access point. Use a moving average and standard deviation to detect anomalous, sharp drops in signal strength or connection times that fall below the 5th percentile. An alert should be triggered if a device disconnects and is unable to detect any SSIDs, especially if this behavior is clustered to a specific physical area."
          },
          {
            "description": "A group of mobile devices within a specific geographic area simultaneously and unexpectedly lose cellular service (both voice and data) in a location known to have strong, reliable coverage.",
            "data_sources": [
              "Mobile OS/MDM Telephony Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Geofenced areas of operational importance, such as the corporate campus, off-site meeting venues, and the travel routes of key personnel.",
            "action": "Continuously collect cellular signal strength (RSSI) and connection status (e.g., LTE, 5G, No Service) from all MDM-enrolled devices. For each NAI, create a time series model of the aggregate signal strength from all devices within it. Identify anomalies by looking for sudden, collective drops in signal strength that affect a statistically significant percentage (e.g., >30%) of devices in the NAI simultaneously. Calculate the rate of 'No Service' events per NAI per hour; an alert should be triggered if this rate exceeds 3 standard deviations above the established baseline."
          },
          {
            "description": "A mobile device or cluster of devices reports a sudden loss of GPS signal or provides highly erratic and inaccurate location data, often coinciding with the loss of other radio signals like cellular or Wi-Fi.",
            "data_sources": [
              "Mobile OS/MDM Location Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices of high-value targets or personnel operating in sensitive locations.",
            "action": "Ingest GPS status data from MDM agents, including number of satellites in view and location precision metrics. Establish a baseline for these metrics in various key NAIs. Detect anomalies by identifying when the number of satellites drops to zero or the location precision degrades by an order of magnitude for a device or group of devices. Correlate GPS loss events with cellular or Wi-Fi loss events occurring on the same device within a short time window (e.g., 2 minutes). A high-confidence alert is generated when a device reports a simultaneous loss of GPS and cellular connectivity in an area with historically good coverage for both."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]