[
  {
    "information_requirement": "Has a corporate mobile application been compromised through its supply chain? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1474",
        "name": "Supply Chain Compromise",
        "evidence": [
          {
            "description": "A company-managed mobile application initiates network connections to anomalous or previously unseen destinations, particularly after an application update.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network egress points and DNS servers",
            "action": "For each managed mobile application, establish a baseline of normal network behavior, including common destination domains/IPs, ports, and protocols. Monitor Zeek dns.log for DNS queries originating from the mobile device subnet to domains not present in the established baseline. Calculate the Shannon entropy of requested subdomains to identify potential DGA activity. Concurrently, analyze Zeek ssl.log for connections from these devices using self-signed, expired, or unusual certificates (e.g., rare issuer). Alert when a device running a recently updated application communicates with a new domain that also has a high entropy score or an anomalous SSL certificate."
          },
          {
            "description": "A developer workstation, part of the mobile app build pipeline, exhibits signs of compromise, such as executing unusual processes or communicating with suspicious external hosts.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application development virtual machines and physical build servers",
            "action": "On developer workstations, monitor for process creation events (Windows Event ID 4688) involving unexpected command-line utilities (e.g., `curl.exe`, `bitsadmin.exe`) or scripting engines (e.g., PowerShell) with suspicious arguments like 'DownloadFile' or '-enc'. Correlate the timestamps of these process creations with network connection logs (Zeek conn.log) from the same host. Establish a baseline of normal developer toolchain network destinations (e.g., corporate code repositories, known package managers). Alert when an anomalous process is followed by a connection to an IP address or domain outside this baseline, especially if the destination has a low reputation score or was registered within the last 30 days."
          },
          {
            "description": "A significant statistical change in a mobile application's network traffic volume or pattern occurs immediately following an enterprise-wide application update.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network gateways monitoring mobile device subnets",
            "action": "Ingest application update deployment times from a Mobile Device Management (MDM) system. For a given application, create a pre-update baseline of its network profile over a 7-day period, calculating metrics like the average number of connections per hour, total bytes transferred, and the number of unique destination domains per device. After an update is deployed, track the same metrics for the new version. Use a statistical method, such as comparing the 95th percentile of the new version's activity against the pre-update baseline, to detect significant anomalies. A statistically significant increase (e.g., >3 standard deviations) in any metric, particularly unique domains contacted, should trigger an investigation."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]