[
  {
    "information_requirement": "Has an adversary compromised our mobile software supply chain to gain initial access? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1474.003",
        "name": "Compromise Software Supply Chain",
        "evidence": [
          {
            "description": "A previously approved mobile application, following an update, exhibits a changed digital signature, requests new high-risk permissions not justified by its functionality, or establishes network connections to known malicious or suspicious domains.",
            "data_sources": [
              "Mobile Device Management (MDM) Application Inventory Logs",
              "Mobile Threat Defense (MTD) Alert Logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and public mobile application stores, managed mobile devices, and network gateways processing mobile traffic.",
            "action": "For each managed mobile application, establish and maintain a baseline of its digital signature, version, and requested permissions using MDM logs. Upon detection of an application update event, automatically compare the new signature and permission set against the stored baseline. If a signature mismatch or the addition of a new, high-risk permission (e.g., 'read contacts', 'access fine location') is detected, flag the device and application for investigation. Correlate the application update time with network logs (Zeek conn.log, dns.log) from the affected device. Calculate the Shannon entropy of newly requested domain names; a high entropy score may indicate Domain Generation Algorithm (DGA) activity. Concurrently, check all new domains and IP addresses against threat intelligence feeds. An alert is generated if a signature or permission anomaly is combined with connections to low-reputation or high-entropy domains, indicating a likely supply chain compromise."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]