[
  {
    "information_requirement": "Is an adversary intercepting sensitive information, such as one-time passwords, from mobile device notifications?",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1517",
        "name": "Access Notifications",
        "evidence": [
          {
            "description": "An application installed on a mobile device has been granted notification listener permissions (`BIND_NOTIFICATION_LISTENER_SERVICE`) and is not on an approved application allowlist.",
            "data_sources": [
              "MDM/MTD Application Permission Logs",
              "MDM/MTD Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS, Android)",
            "action": "Periodically query the MDM/MTD platform to get a list of all installed applications and their granted permissions for the entire mobile fleet. Create and maintain an allowlist of applications that are approved to have notification access (e.g., OS components, legitimate messaging apps). Use set difference operations to identify applications with notification access that are not on the allowlist. Any resulting application should be flagged for immediate investigation."
          },
          {
            "description": "An application with notification access permissions is observed making network connections to a known malicious, newly registered, or otherwise suspicious domain, potentially for exfiltrating intercepted credentials.",
            "data_sources": [
              "MDM/MTD Application Permission Logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring mobile device traffic",
            "action": "Correlate MDM/MTD logs identifying applications with notification access against network logs (Zeek conn.log). For each device, identify applications with this permission. Filter network logs for traffic originating from these devices' IP addresses. Enrich destination IPs/domains with threat intelligence. Calculate the entropy of requested domain names (from Zeek dns.log) for traffic associated with these apps; an entropy score significantly deviating from the application's baseline could indicate domain generation algorithms (DGA). Flag any connections from a notification-access-enabled app to a suspicious domain or any traffic exhibiting DGA-like patterns."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary collecting and exfiltrating data from mobile device notifications?",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1517",
        "name": "Access Notifications",
        "evidence": [
          {
            "description": "A user reports not receiving an expected notification (e.g., a multi-factor authentication code, message preview) which was confirmed to have been sent to the device, suggesting it was intercepted and dismissed by malicious software for collection purposes.",
            "data_sources": [
              "User-reported incidents (Help Desk tickets)",
              "MDM/MTD device logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Bring-Your-Own-Device (BYOD) fleet enrolled in MDM",
            "action": "Upon a user report of a missing sensitive notification, create a time-bound query. Correlate the timestamp of the expected notification with device logs from the MDM/MTD. Search for anomalous application activity, crashes, or new installations within a +/- 15-minute window. Review network logs (Zeek conn.log) from the user's device IP for any unusual outbound connections or data spikes immediately following the time the notification was expected. This requires integrating help desk ticketing systems with security monitoring workflows to trigger automated log searches."
          },
          {
            "description": "An abnormal volume of outbound network traffic is observed from an application that has been granted notification listener permissions, especially outside of normal user interaction.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/MTD Application Permission Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring mobile device traffic",
            "action": "For applications identified by MDM/MTD with notification access, establish a baseline of their network behavior using Zeek conn.log. Profile the average and standard deviation of data volume (orig_bytes, resp_bytes) sent per hour. Monitor for significant deviations from this baseline, such as a data transfer volume exceeding three standard deviations from the mean, which could indicate bulk exfiltration of collected notification data. Correlate high-volume transfers with non-business hours to increase confidence in the finding."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]