[
  {
    "information_requirement": "Is an adversary using a non-standard or custom encrypted channel for command and control on our managed mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1521",
        "name": "Encrypted Channel",
        "evidence": [
          {
            "description": "Mobile device network traffic exhibits characteristics of non-standard encryption or communicates with unusual endpoints over encrypted channels, deviating from baseline application behavior.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Mobile EDR/MDM Network Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways and VPN termination points.",
            "action": "From network data (Zeek logs, Mobile EDR/MDM logs) sourced from Wi-Fi gateways and VPN endpoints, establish a baseline of typical encrypted communication for corporate mobile devices. For each device, profile common TLS/SSL certificate attributes (issuer, subject) and JA3/JA3S hashes found in Zeek ssl.log. Use descriptive statistics to identify the most frequent values associated with legitimate business applications. Actively hunt for outliers, such as a high prevalence of self-signed certificates, certificates with nonsensical subject names, or JA3/JA3S hashes that do not match any known legitimate application in the environment. For identified suspicious connections, analyze connection metadata in Zeek conn.log to assess patterns (e.g., long-lived connections with regular 'heartbeat' traffic, high data volume to low-reputation IPs). A combination of an anomalous JA3 hash, a self-signed certificate, and traffic to a newly registered domain would strongly indicate a malicious encrypted channel."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]