[
  {
    "information_requirement": "Is an adversary using SSL Pinning to conceal Command and Control communications on our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1521.003",
        "name": "SSL Pinning",
        "evidence": [
          {
            "description": "A mobile application consistently generates TLS connection errors or resets when its traffic is routed through a network security proxy capable of TLS inspection, but the same application communicates successfully when not being inspected. This indicates the application is rejecting the proxy's dynamically generated certificate.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with TLS inspection enabled, Corporate Wi-Fi segments for managed mobile devices",
            "action": "Monitor Zeek ssl.log for connections originating from mobile device IP address ranges where the 'validation_status' field indicates a certificate validation failure. Correlate these events with Zeek conn.log records using the connection UID to confirm the connection state is 'REJ' or 'RSTO'. Baseline the rate of these errors per application (identified by the 'server_name' in ssl.log). A statistically significant increase in the error rate for a specific application when under inspection, compared to its non-inspected baseline, strongly suggests the use of SSL pinning."
          },
          {
            "description": "A mobile application successfully establishes a TLS connection using a self-signed certificate or a certificate issued by an untrusted or unusual Certificate Authority (CA). The application's ability to trust this certificate without it being in the device's standard trust store is evidence of certificate or public key pinning.",
            "data_sources": [
              "Zeek x509.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors at internet gateways, Mobile device management (MDM) platform for application inventory",
            "action": "From Zeek x509.log, build a frequency table of all certificate issuers ('certificate.issuer'). Identify issuers that are anomalous or have a very low occurrence rate across the enterprise. For any connection identified in Zeek ssl.log from a mobile device that uses a certificate from one of these rare issuers or a self-signed certificate (where 'certificate.issuer' equals 'certificate.subject'), flag it for review. Cross-reference the 'server_name' from the ssl.log with threat intelligence feeds. A successful connection ('conn.history' does not end in 'r' or 'f') using an anomalous certificate is a high-confidence indicator of pinning for a potentially malicious C2 channel."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]