[
  {
    "information_requirement": "Is an adversary collecting and archiving sensitive data on corporate mobile devices prior to exfiltration? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1532",
        "name": "Archive Collected Data",
        "evidence": [
          {
            "description": "Creation of large or unusually placed archive files (e.g., .zip, .rar, .7z) on the mobile device's local storage, suggesting data is being staged for exfiltration.",
            "data_sources": [
              "Mobile Threat Defense (MTD) File System Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User-accessible and application-sandboxed storage on mobile devices, particularly those belonging to executives, developers, and system administrators.",
            "action": "Monitor file system events on managed mobile devices for the creation of common archive file types (.zip, .7z, .tar, .gz). Establish a baseline for normal file creation size per device. Use descriptive statistics to flag the creation of archive files that exceed a size threshold (e.g., > 95th percentile of all files created in the last 30 days) or are created in atypical directories. Correlate these file creation events with subsequent, large outbound network flows from the same device IP address in Zeek conn.log."
          },
          {
            "description": "Sustained, anomalous resource consumption (CPU, Disk I/O) not associated with foreground user activity, which could indicate a background process is compressing a large volume of data.",
            "data_sources": [
              "Mobile OS Performance Metrics",
              "MTD Performance Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile device CPUs and storage controllers.",
            "action": "Continuously monitor CPU and disk I/O metrics from mobile endpoints. For each device, establish a baseline of resource usage, differentiating between when the screen is on (user active) and off (background tasks). Use a moving average to identify sustained periods of high resource utilization (e.g., CPU > 75% for > 60 seconds) while the device is idle. Investigate the parent process responsible for the high utilization to determine legitimacy."
          },
          {
            "description": "A non-standard application, such as a game or utility, makes API calls to native compression or encryption libraries, which is suspicious behavior outside its expected function.",
            "data_sources": [
              "MTD API Call Monitoring Logs",
              "Application Sandboxing Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile OS API frameworks (e.g., Android's java.util.zip, iOS's Compression.framework).",
            "action": "Using an MTD solution with API monitoring capabilities, profile applications' use of compression and encryption APIs. Create an allowlist of known-good applications (e.g., file managers, backup utilities) expected to use these functions. Generate an alert when any application not on the allowlist invokes these APIs, especially if that application also has permissions to access sensitive data stores like contacts, photos, or messages."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]