[
  {
    "information_requirement": "Is an adversary using foreground services to establish persistence on a corporate mobile device? (TA0028 - Persistence)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1541",
        "name": "Foreground Persistence",
        "evidence": [
          {
            "description": "A mobile application is identified as using the `startForeground()` API call, which is a prerequisite for this persistence technique, often declared by the `FOREGROUND_SERVICE` permission in the application manifest.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Android Logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (Android)",
            "action": "From Mobile Device Management (MDM) application inventory data, generate a list of all installed applications and the permissions they hold. Scan application manifests for the `FOREGROUND_SERVICE` permission. For applications with this permission, establish a baseline of normal foreground activity. Flag new applications or existing applications that begin using foreground services unexpectedly, especially if they are not from a reputable app store or have other high-risk permissions."
          },
          {
            "description": "A mobile device exhibits continuous, long-running network connections to external endpoints, even during non-business hours, suggesting a malicious app is maintaining a connection via a foreground service for command and control or data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments for mobile devices",
            "action": "Analyze Zeek conn.log for connections originating from mobile device IP ranges. For each device, calculate the duration and total data volume of connections. Flag devices with connections that persist for unusually long periods (e.g., greater than 8 hours) or transfer significant data during non-business hours (e.g., 10 PM - 6 AM). Use a percentile-based approach (e.g., flag connections with durations in the 99th percentile) to identify outliers. Correlate with Zeek dns.log to check if these connections are to rare or newly seen domains."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary evading background process restrictions on mobile devices to access sensors? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1541",
        "name": "Foreground Persistence",
        "evidence": [
          {
            "description": "A mobile device is beaconing to an external host at highly regular intervals, which could indicate a malicious application exfiltrating sensor data (e.g., microphone, location) gathered via a persistent foreground service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points",
            "action": "From Zeek conn.log, filter for traffic from mobile device IP subnets. For each source IP, analyze the timing of outbound connections to the same destination. Calculate the standard deviation of the inter-arrival time between connections; a very low standard deviation suggests automated beaconing. Examine the user agent field in Zeek http.log for these connections to identify the source application, if possible. Flag device-destination pairs with beaconing behavior and non-standard user agents."
          },
          {
            "description": "A mobile application known to be using a foreground service is generating network traffic with a high data-to-connection ratio, potentially indicating exfiltration of large sensor data like audio or video.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (Android)",
            "action": "Correlate the list of applications using foreground services (from MDM logs) with network traffic from the devices they are installed on (from Zeek conn.log). For each of these applications' network flows, calculate the ratio of bytes sent (`orig_bytes`) to the number of connections. Establish a baseline for normal application behavior. A sudden or sustained increase in this ratio for a specific application may indicate the exfiltration of large sensor data."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]