[
  {
    "information_requirement": "Is an adversary using scheduled tasks for persistence on mobile devices? (PIR)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1603",
        "name": "Scheduled Task/Job",
        "evidence": [
          {
            "description": "A mobile device exhibits highly periodic, automated network beaconing, suggesting a recurring background task established for persistence.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN gateways, Network egress points.",
            "action": "For IP addresses associated with mobile devices, analyze Zeek conn.log to extract destination IP, port, and timestamp for all outbound connections. Group connections by device and destination, then calculate the time deltas between sequential connections. Use statistical methods to identify connections with consistently low variance in their time deltas (low jitter), which is indicative of a scheduled beacon. Cross-reference destination domains from Zeek dns.log against threat intelligence feeds. A high frequency of low-jitter connections to a low-reputation or newly registered domain is a strong indicator of a malicious persistent task."
          },
          {
            "description": "A background task, likely initiated by a scheduler, communicates using non-standard protocols or ports inconsistent with the parent application's expected function.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Mobile device fleet.",
            "action": "Filter Zeek conn.log for traffic originating from the mobile device IP space. Establish a baseline of common destination ports (e.g., 80, 443, 53) used by legitimate applications across the fleet. Monitor for and alert on connections to unusual ports or the use of common ports for unexpected protocols. Calculate the percentage of traffic per device using non-standard ports and use a percentile-based approach (e.g., flag devices in the 99th percentile) to identify statistical outliers requiring further investigation."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary using a scheduled task to execute malicious code on mobile devices? (PIR)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1603",
        "name": "Scheduled Task/Job",
        "evidence": [
          {
            "description": "Following a suspected time-based trigger (e.g., top of the hour), a mobile device attempts to download a secondary payload or executable file.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points.",
            "action": "Monitor Zeek http.log and files.log for executable file downloads (e.g., MIME types 'application/vnd.android.package-archive' for .apk, 'application/octet-stream') to mobile devices. Correlate the download timestamp with connection logs (Zeek conn.log) to see if the connection was initiated at a regular, predictable time (e.g., within the first minute of an hour). Analyze the source of the download; flag downloads from uncategorized or low-reputation domains. Calculate the Shannon entropy of the downloaded filename; high entropy may suggest a randomly generated payload name used to evade signature-based detection."
          },
          {
            "description": "A process, initiated by a scheduled task, results in DNS queries for known malicious C2 infrastructure or uses DNS tunneling for communication.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Network egress points.",
            "action": "Analyze Zeek dns.log records for queries originating from mobile devices. Compare all queried domains against threat intelligence feeds for known C2 domains. To detect potential DNS tunneling, establish a baseline for DNS query volume and record type distribution (A, AAAA, CNAME, TXT) per device. Alert on significant deviations, such as an anomalously high volume of TXT queries to a single domain or subdomains with high character entropy. Flag devices whose DNS traffic exceeds 3 standard deviations from the established baseline."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]