[
  {
    "information_requirement": "Is the adversary attempting to impair or disable security defenses on our mobile devices?",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629",
        "name": "Impair Defenses",
        "evidence": [
          {
            "description": "A mobile security agent (e.g., MDM/MTD client) unexpectedly stops communicating with its management server, suggesting the agent process was terminated or disabled on the device.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway and Wi-Fi network infrastructure",
            "action": "For each managed mobile device, identify the expected periodic beacon traffic to its MDM/MTD management server in Zeek conn.log based on destination IP, port, and protocol. Establish a baseline for the beaconing interval for each device using a moving average over a 7-day window. Monitor for a statistically significant absence of this traffic, such as a device failing to check in for a period exceeding 3 standard deviations from its average interval. An alert should be generated for any device that stops beaconing without a corresponding 'unenrolled' or 'deactivated' status in the management console."
          },
          {
            "description": "A mobile device downloads an application from a suspicious source or one known to contain capabilities for impairing defenses. [1]",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway and Wi-Fi network infrastructure",
            "action": "Continuously monitor Zeek dns.log and http.log for connections originating from the mobile device IP space to domains/IPs on threat intelligence feeds or those categorized as unapproved, third-party app stores. Calculate the Shannon entropy score for requested subdomains in dns.log to detect potential Domain Generation Algorithms (DGA), where a high entropy score $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$ indicates randomness. For files identified in Zeek files.log (e.g., .apk, .ipa), automatically query the file hash against threat intelligence APIs. An alert should be triggered upon a download from a known malicious source or a high-reputation threat match on a downloaded file's hash."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]