[
  {
    "information_requirement": "Has an adversary established persistence on a mobile device by hijacking its execution flow? (TA0028 - Persistence)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1625",
        "name": "Hijack Execution Flow",
        "evidence": [
          {
            "description": "A mobile device fails a remote attestation check, indicating that its bootloader, operating system kernel, or system application integrity has been compromised. This is a strong sign that a core component has been modified to hijack execution flow.",
            "data_sources": [
              "Mobile Device Management (MDM) attestation logs",
              "Mobile Threat Defense (MTD) integrity scan logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/MTD management console, Managed mobile endpoints",
            "action": "Continuously monitor for all device attestation and integrity scan failures from the MDM/MTD platform. Establish a baseline of successful checks. Any failure should generate a high-priority alert for immediate investigation. Track the rate of attestation failures across the device fleet; a sudden increase in the failure rate, especially if concentrated by device model or OS version, can indicate a widespread campaign. Calculate a moving average of the failure rate and alert when the current rate exceeds three standard deviations from the norm."
          },
          {
            "description": "A core system process on a mobile device initiates network connections to an unusual or known-malicious destination, or communicates using an unexpected protocol or port. This could indicate the process's normal execution flow has been hijacked to include malicious communication.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateway, VPN concentrators for mobile devices",
            "action": "For network traffic originating from mobile devices, baseline the typical network behavior (destination IPs, domains, ports, protocols) of core OS processes (e.g., processes associated with OS updates, time synchronization). Correlate Zeek conn.log data with threat intelligence feeds to flag any connections to known malicious IPs. Analyze Zeek dns.log queries from these processes; use entropy scoring to identify potential Domain Generation Algorithms (DGAs), as a high entropy score is anomalous for system processes. An alert should be triggered when a system process communicates with a destination outside its established baseline, uses a non-standard port, or exhibits a high DNS query entropy score."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]