[
  {
    "information_requirement": "Is an adversary executing unauthorized commands or scripts on mobile devices via a Unix shell?",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1623.001",
        "name": "Unix Shell",
        "evidence": [
          {
            "description": "A non-standard mobile application, not part of the base OS or an approved administrative toolset, initiates a Unix shell process (e.g., sh, bash). This is anomalous as most user-facing applications do not require direct shell access to function.",
            "data_sources": [
              "Mobile device process execution logs",
              "Mobile Device Management (MDM) application inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS, Android)",
            "action": "From mobile EDR/MTD process logs, establish a baseline of parent processes that legitimately spawn shells. Create a detection rule to alert on any deviation from this baseline, particularly when the parent process is a third-party application. Enrich alerts by correlating the parent application's signature with the MDM application inventory to determine if the application is sanctioned."
          },
          {
            "description": "A shell process is executed with suspicious command-line arguments, such as those used to download and execute remote scripts ('living off the land' binaries) or obfuscated commands.",
            "data_sources": [
              "Mobile device process execution logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for mobile device traffic (e.g., VPN, corporate Wi-Fi)",
            "action": "Continuously monitor command-line arguments for shell processes on mobile endpoints. Use regular expressions to detect high-risk patterns like 'curl ... | sh', 'wget ... | bash', or 'bash -c'. Calculate the Shannon entropy for all command lines; flag commands with entropy scores exceeding the 98th percentile of the historical baseline as potentially obfuscated. For any flagged process, pivot to Zeek conn.log using the device IP and timestamp to inspect the associated network connections for suspicious remote hosts or anomalous data transfer volumes."
          },
          {
            "description": "A process invokes a superuser binary (e.g., 'su') to escalate privileges to root. This is a strong indicator of a compromised, jailbroken, or rooted device being actively exploited.",
            "data_sources": [
              "Mobile device process execution logs",
              "MDM device compliance logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Asset inventory of all managed mobile devices",
            "action": "Create a high-severity alert for any process execution event where the executable name is 'su' or a known variant. This action should be considered malicious until proven otherwise. Immediately cross-reference the device in the MDM platform to check its compliance status (e.g., rooted/jailbroken status). If a non-compliant device is detected executing 'su', trigger an automated response to isolate the device from the network."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]