[
  {
    "information_requirement": "Is an adversary abusing elevation control mechanisms to escalate privileges on mobile devices? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1626",
        "name": "Abuse Elevation Control Mechanism",
        "evidence": [
          {
            "description": "A mobile application is granted administrative privileges, where the application is either not on an approved allowlist for such privileges or is statistically rare across the device fleet.",
            "data_sources": [
              "MDM/EMM Audit Logs",
              "Mobile OS System Logs",
              "Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM log aggregation platform, Corporate Application Store inventory database, Managed mobile device fleet",
            "action": "1. (Symbolic) For every privilege grant event from MDM/EMM logs, compare the application name and package ID against a curated allowlist of applications authorized for administrative rights (e.g., MDM client, security agents). Trigger a high-severity alert if the application is not on the list. 2. (Statistical) Maintain a fleet-wide inventory of all installed applications and calculate the installation prevalence (count of devices with the app / total devices). For any application granted administrative rights, check its prevalence score. An application in the bottom 5th percentile of prevalence receiving these rights should generate a medium-severity alert for investigation. 3. (Machine Learning) Train a logistic regression classifier on historical privilege grant events. Use features such as application category, developer reputation, number of other permissions requested, app prevalence, and time since first seen in the environment. Use the model to score each new grant event with a probability of being malicious. Events with a score greater than 0.85 should be escalated for immediate review."
          },
          {
            "description": "A mobile device initiates network connections to suspicious destinations or exhibits anomalous traffic patterns within a 5-minute window following an application privilege escalation event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM/EMM Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches and routers with traffic mirroring to Zeek sensors, DNS resolvers forwarding logs to SIEM, MDM/EMM log aggregation platform",
            "action": "1. (Symbolic) Correlate the timestamp of a privilege grant from MDM logs with network logs (Zeek conn.log, dns.log) from the device's IP address. In the 5 minutes following the event, search for connections to IPs or domains on threat intelligence feeds, or to domains registered within the last 30 days (Newly Registered Domains). A match triggers a high-severity alert. 2. (Statistical) For the same 5-minute window, calculate the Shannon entropy of all requested domain names in Zeek dns.log. An entropy score greater than 4.0 indicates potential DGA and should be alerted. Additionally, monitor the volume of outbound data (bytes_out in Zeek conn.log) and alert if it exceeds the 99th percentile of the device's historical 5-minute window baseline. 3. (Machine Learning) Deploy a time-series anomaly detection model (e.g., LSTM autoencoder) trained on each device's historical network behavior (e.g., connection count, data volume, protocol mix per minute). Feed the network data from the 5-minute window post-privilege-grant into the model. An event flagged by the model as a significant anomaly should be escalated for analyst investigation."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]