[
  {
    "information_requirement": "Is the adversary using Domain Generation Algorithms (DGAs) to establish command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637.001",
        "name": "Domain Generation Algorithms",
        "evidence": [
          {
            "description": "A mobile device is observed making DNS requests to a high volume of algorithmically generated-looking, non-existent domains (NXDOMAINs). The requested domains exhibit high entropy, a low ratio of vowels to consonants, and do not appear in a dictionary of known legitimate domains.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, DNS resolvers, VPN concentrators used by mobile devices",
            "action": "Analyze Zeek dns.log for queries originating from mobile device IP ranges. For each queried domain, calculate its Shannon entropy score and the n-gram frequency of its character sequences. Compare these metrics against a baseline of legitimate domains queried on the network. Flag domains that have an entropy score in the top 95th percentile and a low n-gram score (indicating randomness). Correlate these flagged domains with DNS responses; a high rate of NXDOMAIN responses for domains from a single source IP is a strong signal of DGA activity."
          },
          {
            "description": "A mobile device successfully resolves and communicates with a domain that was registered very recently (e.g., within the last 24-72 hours) and is not associated with a known service like a Content Delivery Network (CDN).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, Internet gateway proxy logs, Network egress points",
            "action": "From Zeek dns.log, extract all successfully resolved domains (rcode is 'NOERROR'). For each unique domain, perform a WHOIS lookup to determine its creation date. Create a statistical model to identify outliers, flagging any domain created within the last 72 hours. Correlate these newly registered domains with connection logs (Zeek conn.log) to see if any mobile devices established a connection. A successful connection to a newly registered, non-categorized domain is highly suspicious and warrants investigation."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]