[
  {
    "information_requirement": "Is an adversary removing indicators of compromise from mobile devices to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630",
        "name": "Indicator Removal on Host",
        "evidence": [
          {
            "description": "An application invokes an API call (e.g., Android's clearApplicationUserData or iOS's FileManager.removeItem) to clear its own cache/data or that of another application, where the action is not user-initiated and deviates from normal application behavior.",
            "data_sources": [
              "MDM Application Activity Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); Corporate Wi-Fi access points; VPN concentrators",
            "action": "1. (Symbolic) In the SIEM, create a rule to alert when a Mobile EDR/MTP log shows a data-clearing API call from an application whose package name or hash is on a known-malicious IOC list. 2. (Statistical) For each application, use a scheduled query to calculate the daily frequency of data-clearing events. Generate an alert if the frequency for an app exceeds the 99th percentile of its own 30-day historical baseline or the baseline of its application category (e.g., 'Social Media'). 3. (Machine Learning) Ingest mobile EDR logs and Zeek conn.log data into a machine learning platform. Use a Random Forest classifier trained on features like app age, app category, user-initiation flag, and preceding network activity (e.g., volume of data transferred) to predict if a data-clearing event is malicious. A high probability score should trigger an automated investigation workflow."
          },
          {
            "description": "An application triggers an anomalous volume of file deletion events, or deletes files outside its designated sandboxed storage area, specifically targeting user data directories (e.g., DCIM, Downloads) or system log locations.",
            "data_sources": [
              "MDM File Integrity Monitoring Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); MDM/UEM servers; Network file transfer monitoring points",
            "action": "1. (Symbolic) Deploy a file integrity monitoring rule via MDM/EDR to alert immediately if any application not on an approved list (e.g., OS processes, system utilities) attempts to delete files from critical directories like /var/logs on iOS or user data folders like DCIM on Android. 2. (Statistical) In the SIEM, run an hourly query to establish a baseline for the number and total size of files deleted by each application. Alert if an application's deletion activity exceeds 3 standard deviations from the device's norm. Concurrently, calculate the entropy of file extensions being deleted by an app; a sudden increase in entropy may indicate indiscriminate deletion. 3. (Machine Learning) Use a DBSCAN clustering model on EDR file-event data, using features like file deletion count, total size deleted, and target directory path. Isolate and investigate outlier clusters representing anomalous deletion behavior. Correlate these clusters with a time-series analysis of outbound network traffic from Zeek conn.log to identify potential data exfiltration followed by cleanup."
          },
          {
            "description": "An application is uninstalled from a device within a statistically short time period (e.g., minutes to hours) after its initial installation, especially if the uninstallation is not logged as a user-initiated action by the MDM/EDR agent.",
            "data_sources": [
              "MDM Application Inventory Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); MDM/UEM servers; DNS servers",
            "action": "1. (Symbolic) Create a SIEM rule to alert when an MDM log shows an application uninstallation event where the application's package name matches a threat intelligence list of 'fly-by' malware. 2. (Statistical) Write a query to calculate the median lifetime (install time to uninstall time) of all applications across the environment. Flag any application whose lifetime falls below the 5th percentile (e.g., less than 1 hour). Enhance this by analyzing Zeek dns.log data for the device during the app's lifetime; a high ratio of NXDOMAIN responses or connections to domains registered within the last 7 days is a strong corroborating indicator. 3. (Machine Learning) Train a Logistic Regression model to score the risk of each uninstallation event. Use features such as application lifetime, install source (App Store vs. sideloaded), number of network connections made (from Zeek conn.log), number of unique DNS queries (from Zeek dns.log), and the 'user-initiated' flag from the EDR log. A high-risk score triggers an incident for analyst review of all associated device activity."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]