[
  {
    "information_requirement": "Is an adversary exfiltrating data from our mobile devices over unencrypted, non-C2 protocols?",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1639.001",
        "name": "Exfiltration Over Unencrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "Anomalous DNS query patterns from a mobile device, such as unusually long query strings, high query volume to a single domain, or high entropy in subdomains, suggesting data exfiltration via DNS tunneling.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for corporate Wi-Fi and mobile VPNs.",
            "action": "Analyze Zeek dns.log. Calculate the length and character entropy of the 'query' field for all DNS A, AAAA, and TXT requests. Flag queries exceeding the 99th percentile for length or having a Shannon entropy score greater than 4.5, as this indicates non-standard, likely encoded, hostnames. Group requests by source IP and parent domain, and alert on source IPs whose request frequency to a single domain is a statistical outlier (e.g., > 3 standard deviations above the mean frequency for that device or its peer group). Investigate alerts for newly seen or rare domains."
          },
          {
            "description": "Large or high-frequency HTTP POST/PUT requests from a mobile device to an unknown or non-business-related domain, potentially containing encoded data in the request body.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and web proxies serving mobile devices.",
            "action": "From Zeek http.log, filter for outbound POST and PUT requests originating from the mobile device IP address space. Establish a baseline of 'post_body_len' per user/device. Alert on requests with a size exceeding the 95th percentile for that user or the general mobile device population. For any alerted event, calculate the entropy of the 'post_body'; a high score suggests encoded or compressed data, not typical web form content. Correlate destination IPs from conn.log with threat intelligence feeds and domain reputation services to identify malicious endpoints."
          },
          {
            "description": "Any FTP connection from a mobile device to an external, non-sanctioned server, especially those involving file uploads (STOR command).",
            "data_sources": [
              "Zeek ftp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for corporate Wi-Fi and mobile VPNs.",
            "action": "Continuously monitor Zeek conn.log for any traffic on port 21/TCP originating from the mobile device IP address range and destined for an external IP address. Since unencrypted FTP is a legacy protocol and its use from a mobile device is highly irregular, any such connection should trigger an immediate, high-priority alert for investigation. If Zeek ftp.log is enabled, specifically create a rule to alert on any 'STOR' (store file) command usage, capturing the source IP, destination IP, and file name/size for incident response."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]