[
  {
    "information_requirement": "Has an adversary successfully collected contact list data from corporate mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1636.003",
        "name": "Contact List",
        "evidence": [
          {
            "description": "A mobile application is granted permissions to access the device's contact list, where the application's core function does not justify this level of access.",
            "data_sources": [
              "Mobile Device Management (MDM) application inventory logs",
              "Mobile Threat Defense (MTD) permission audit logs",
              "Application vetting service reports"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS and Android)",
            "action": "Continuously monitor MDM/MTD logs for permission grant events related to contact list access ('android.permission.READ_CONTACTS' for Android, 'NSContactsUsageDescription' for iOS). For each grant event, compare the application against a pre-defined baseline of expected permissions for its category (e.g., productivity, navigation, social media). Calculate an anomaly score based on the deviation from this baseline. Flag applications with high anomaly scores, especially those with low installation counts across the enterprise or from untrusted developers, for manual review."
          },
          {
            "description": "An application with legitimate contact list permissions accesses the contact data with unusually high frequency, at anomalous times, or immediately before a significant network data transmission.",
            "data_sources": [
              "MTD OS API call monitoring logs",
              "Mobile VPN or MTD network flow logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Mobile VPN concentrators",
            "action": "For each application with contact list access, ingest API call logs or MTD usage data into a time-series database. Establish a baseline for each application's contact access frequency and data volume during normal business hours. Use statistical methods, such as calculating the 95th percentile of access counts per hour, to identify outliers. Generate an alert when an application's access frequency exceeds this percentile, especially outside of normal hours. Correlate these access spikes with subsequent network egress traffic from the same device to identify potential exfiltration events."
          },
          {
            "description": "An unvetted or sideloaded application, not sourced from an official corporate or public app store, is installed on a device and possesses permissions to access the contact list.",
            "data_sources": [
              "MDM application inventory logs",
              "MDM device integrity attestation logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS and Android)",
            "action": "Periodically query the MDM platform to generate a complete inventory of installed applications on all managed devices. For each application, enrich the data with its source (e.g., Apple App Store, Google Play Store, Unknown/Sideloaded). Simultaneously, query for device integrity status to flag any rooted or jailbroken devices. Create a high-risk list by filtering for applications where the source is 'Unknown/Sideloaded' AND the application has been granted contact list access permissions. Prioritize this list for immediate investigation, starting with devices that also fail integrity checks."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]