[
  {
    "information_requirement": "Is an adversary attempting to elevate privileges by injecting code into a higher-privileged process on a mobile device? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1631.001",
        "name": "Ptrace System Calls",
        "evidence": [
          {
            "description": "A non-debugger or non-system utility application is observed making ptrace system calls, especially targeting a process with higher privileges (e.g., a system service or an application running as root).",
            "data_sources": [
              "Android audit.log",
              "Mobile EDR logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Kernel-level system call interface on managed mobile endpoints",
            "action": "Continuously monitor Android audit logs (or mobile EDR equivalent) for syscall=ptrace. For each event, identify the source process (subject) and target process (object). Maintain a baseline of legitimate applications that use ptrace (e.g., debuggers, RASP tools). Alert on any non-baselined application attempting to ptrace another process, assigning a higher severity score if the target process has elevated privileges (e.g., runs as 'system' or 'root' user)."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to evade defenses by executing malicious code within the context of a legitimate mobile application process? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1631.001",
        "name": "Ptrace System Calls",
        "evidence": [
          {
            "description": "A legitimate application process (e.g., a calculator, simple game) exhibits anomalous network behavior (e.g., connections to C2 servers, unusual DNS lookups) after being targeted by a ptrace system call, indicating its process space is being used to mask malicious activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Android audit.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network egress points monitoring mobile device traffic",
            "action": "Establish a network behavior baseline for common applications on managed mobile devices using Zeek logs. For each application, profile metrics like connection frequency, data volume (bytes_in/out), destination port prevalence, and the entropy of requested domains (from dns.log). Concurrently, monitor for ptrace events on the device (from Android audit.log). If a ptrace event is observed targeting a specific process, correlate the timestamp with the network logs. A significant statistical deviation from the process's established network baseline (e.g., new destination IPs, sudden spike in DNS queries to rare domains, connection to a non-standard port) following a ptrace event should trigger a high-priority alert for potential process injection."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]