[
  {
    "information_requirement": "Is an adversary attempting to subvert trust controls on our mobile devices to execute untrusted code or intercept communications? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1632",
        "name": "Subvert Trust Controls",
        "evidence": [
          {
            "description": "A new, unexpected, or non-standard Certificate Authority (CA) certificate is installed on a mobile device, particularly one not on the organization's approved list.",
            "data_sources": [
              "MDM logs detailing installed certificates",
              "Zeek x509.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices, Mobile Device Management (MDM) server, Network egress points/Internet Gateway",
            "action": "Maintain an inventory of approved CA certificates for corporate mobile devices. Periodically query MDM for the list of installed certificates on each device and compare against the approved list. For any newly installed, unapproved certificate, create an alert. Concurrently, monitor network logs (Zeek x509.log) for certificates not present in the baseline inventory of common and approved CAs. Correlate device-level alerts with network observations of traffic being signed by the anomalous CA (Zeek ssl.log) to prioritize investigation."
          },
          {
            "description": "The 'Install from Unknown Sources' or 'Install unknown apps' permission is enabled for an application on an Android device, which is not part of a standard device configuration.",
            "data_sources": [
              "MDM logs reporting on device setting configurations",
              "Mobile endpoint security agent logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed Android devices, Mobile Device Management (MDM) server",
            "action": "Establish a baseline configuration for all corporate Android devices where 'Install unknown apps' permissions are disabled by default. Use MDM to continuously monitor for any deviation from this baseline. Generate a high-priority alert for any device where this setting is enabled, especially if the change was not part of an authorized administrative action. Use descriptive statistics to track the prevalence of this setting change across the fleet to identify widespread campaigns versus isolated incidents."
          },
          {
            "description": "An unexpected or unauthorized configuration profile is installed on an iOS device. The profile may have a suspicious name, be unsigned, or grant excessive permissions.",
            "data_sources": [
              "MDM logs detailing installed configuration profiles",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed iOS devices, Mobile Device Management (MDM) server, Network egress points/Internet Gateway",
            "action": "Maintain a strict inventory of all approved configuration profiles deployed via MDM. Set up an MDM policy to alert on any manually installed or non-approved profile. Monitor network traffic (Zeek http.log) for downloads of '.mobileconfig' files from non-corporate domains. Calculate the entropy of the hostnames serving these files; high-entropy or newly-seen domains should increase the alert's risk score. Correlate network download events with MDM alerts for profile installation on the same device within a short time window to confirm a successful subversion attempt."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]