[
  {
    "information_requirement": "Is the adversary actively concealing a compromised (rooted/jailbroken) mobile device state from our detection mechanisms? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.003",
        "name": "Disguise Root/Jailbreak Indicators",
        "evidence": [
          {
            "description": "A mobile device fails a remote attestation check (e.g., Google SafetyNet, Apple DeviceCheck) while concurrently passing basic on-device root/jailbreak checks, indicating a sophisticated evasion attempt.",
            "data_sources": [
              "Windows Application Event Log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) server, Network egress points monitoring mobile device traffic",
            "action": "Monitor the Windows Application Event Log on the MDM server for specific event IDs corresponding to a failed device attestation check. Upon detection, correlate the device ID with its IP address from DHCP or MDM logs. Pivot to Zeek logs to analyze the network traffic for that IP address around the time of the failure. Calculate the Shannon entropy of DNS queries in dns.log originating from the device over a 5-minute window; a score significantly higher than the device's historical baseline suggests algorithmic domain generation (DGA). Correlate this with connections to low-reputation or newly registered domains to flag a likely compromised device."
          },
          {
            "description": "A process on a mobile device is observed executing with root privileges, but its name or hash does not match any known rooting utilities or legitimate system processes, suggesting it has been renamed to avoid detection.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint security agent on mobile devices, Network choke points",
            "action": "This evidence is primarily host-based and not directly observable via Windows Event IDs. However, the network effects can be monitored. Using network traffic from a mobile device fleet, establish a baseline of normal communication patterns (protocols, ports, destination ASNs) for standard applications. Continuously monitor Zeek conn.log for mobile devices exhibiting network behavior that deviates from this baseline, such as using non-standard ports for common protocols (e.g., port 8443 for what appears to be TLS) or communicating with IP addresses outside of expected ranges. While not direct proof of a renamed process, such network anomalies on a device that is not flagged by basic root detection are highly suspicious and warrant further host-level investigation."
          },
          {
            "description": "An application installed on a mobile device unexpectedly modifies file permissions on system directories or attempts to remount the system partition as writable, which are hallmark behaviors of rooting mechanisms trying to establish persistence while evading detection.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring traffic to and from mobile devices, Application sandboxing environment",
            "action": "While direct file system monitoring is outside the scope of the specified data sources, related network activity can be an indicator. Monitor Zeek files.log for unexpected executable file transfers (MIME type 'application/x-dosexec', 'application/x-elf', etc.) to mobile devices, especially from untrusted sources. For each transferred file, analyze the subsequent network traffic from the recipient device in conn.log. A file download followed immediately by beaconing activity or connections to known malicious infrastructure is a strong indicator of a payload being dropped by an application attempting to escalate privileges after evading initial root detection."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]