[
  {
    "information_requirement": "Is an adversary intercepting network traffic from our organization's mobile devices?",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1638",
        "name": "Adversary-in-the-Middle",
        "evidence": [
          {
            "description": "A mobile device on the corporate network is communicating with external hosts using an invalid or self-signed SSL/TLS certificate, which could indicate traffic interception by a rogue Wi-Fi access point or malicious proxy.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments and network egress points",
            "action": "Monitor Zeek ssl.log for connections originating from mobile device IP ranges where the 'validation_status' field indicates an error (e.g., 'self signed certificate in certificate chain', 'unable to get local issuer certificate'). For each such event, cross-reference the certificate UID in Zeek x509.log to inspect the issuer details. Establish a baseline of common validation errors. Use descriptive statistics to alert on a sudden increase in the count of certificate validation errors from a specific network segment or device, which may indicate a newly deployed rogue access point."
          },
          {
            "description": "Network traffic from a managed mobile device is being tunneled to an unknown or non-standard external endpoint, suggesting a malicious or non-compliant VPN profile is redirecting all device traffic.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and VPN concentrators",
            "action": "Maintain a list of sanctioned corporate VPN endpoint IP addresses. Analyze Zeek conn.log for long-lived connections from mobile device IP ranges using common tunneling protocols (e.g., UDP/500, UDP/4500 for IKE/IPsec). Compare the destination IP of these connections against the sanctioned list. Use a stacking algorithm to identify destination IPs that are rare or unique to a small set of mobile devices. A high volume of data sent from a mobile device to a non-sanctioned, tunnel-like destination IP is a strong indicator of a malicious VPN profile."
          },
          {
            "description": "A mobile device is observed making suspicious DNS requests or HTTP connections to known malicious or file-sharing domains immediately following legitimate application activity, potentially indicating data exfiltration by a malicious application performing an 'Adversary-in-the-Disk' attack.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers and web proxies",
            "action": "For each mobile device IP, analyze the time series of DNS queries (Zeek dns.log) and HTTP requests (Zeek http.log). Search for a pattern where a request to a legitimate corporate or cloud service is followed within a short time window (e.g., under 2 minutes) by a DNS query for a domain with high entropy or a low reputation score. Further correlate this with HTTP POST requests to the suspicious domain. Calculate the percentile of request frequency for all destination domains; requests to domains in the 99th percentile (i.e., very rare) that are not part of an established baseline should be flagged for investigation."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]