[
  {
    "information_requirement": "Is an adversary stealing application access tokens from our mobile devices to gain unauthorized credential access?",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1635",
        "name": "Steal Application Access Token",
        "evidence": [
          {
            "description": "An OAuth authorization code or access token is redirected to an unauthorized or suspicious callback URI after a user grants consent.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring corporate Wi-Fi and VPN traffic from mobile devices.",
            "action": "Monitor Zeek http.log for requests to known OAuth providers (e.g., login.microsoftonline.com, accounts.google.com). For flows involving 'response_type=code' or 'response_type=token', extract the 'redirect_uri' parameter. Maintain a baseline allowlist of approved application callback URIs. Generate an alert for any 'redirect_uri' not on the allowlist. Correlate the source IP with known mobile device IP ranges. Use entropy scoring on the domain name of the redirect URI to flag algorithmically generated or suspicious domains. Analyze Zeek dns.log for requests to these non-allowlisted domains, checking for low TTLs or recent registration dates as further evidence of maliciousness."
          },
          {
            "description": "A mobile device, after interacting with a phishing link, establishes a network connection to a suspicious domain that attempts to initiate an OAuth flow.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User's mobile device (observed via network traffic), Corporate web proxy.",
            "action": "Correlate web proxy or Zeek http.log data showing a user clicking a link from an email or messaging app with subsequent network connections in Zeek conn.log from the same source IP. Establish a baseline of common application domains for the organization. If, following a link click, the device initiates a connection to a rare or never-before-seen domain (identified by comparing against the baseline using a statistical measure like being in the bottom 5th percentile of domain frequency), and that connection involves OAuth-related keywords in the URI (from http.log), flag for investigation. This multi-condition event (link click -> new domain connection -> OAuth indicators) suggests a potential URI hijacking attempt."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]