[
  {
    "information_requirement": "Is an adversary exfiltrating data from mobile devices over an established command and control channel? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1646",
        "name": "Exfiltration Over C2 Channel",
        "evidence": [
          {
            "description": "A mobile device's communication with a known or suspected C2 server shows a significant and anomalous increase in outbound data volume compared to its established baseline of 'heartbeat' traffic.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network gateways for corporate Wi-Fi, VPN concentrators used by mobile devices",
            "action": "For each connection involving a mobile device, use Zeek conn.log to establish a baseline of outbound data volume (orig_bytes) per session and over time (e.g., daily total) for each destination IP. Use statistical methods like calculating the 99th percentile of historical data volume for C2-like traffic. Generate an alert when a new connection's outbound data volume from a mobile device exceeds this percentile, or when the total daily volume to a specific destination deviates more than 3 standard deviations from its historical average."
          },
          {
            "description": "The communication pattern between a mobile device and a suspected C2 server deviates from its normal 'heartbeat' activity, such as changing from periodic small GET requests to sustained POST requests.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web proxies, DNS resolvers used by mobile devices",
            "action": "Monitor Zeek http.log for connections from mobile devices to low-reputation or newly observed domains. For each source-destination pair, track the ratio of HTTP methods (e.g., GET vs. POST). Create a baseline for this ratio. Generate an alert if the ratio inverts (e.g., POSTs become more frequent than GETs) or if the average size of POST request bodies from a mobile device to a single destination increases significantly beyond its historical norm."
          },
          {
            "description": "Payloads within the C2 communication channel from a mobile device exhibit high entropy, suggesting the presence of encrypted or compressed data inconsistent with normal C2 beacons.",
            "data_sources": [
              "Zeek logs (with payload capture enabled)",
              "Mobile device application logs (via MDM)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices enrolled in Mobile Device Management (MDM), Network TAPs capturing traffic to/from mobile subnets",
            "action": "For traffic identified as potential C2 from mobile devices (e.g., to non-categorized domains, using non-standard ports), analyze the data payloads. Calculate the Shannon entropy of the payload content. Establish a baseline entropy score for known-good mobile application traffic and typical C2 beaconing. A payload's entropy score significantly exceeding this baseline indicates likely obfuscated or encrypted data being prepared for exfiltration."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]