[
  {
    "information_requirement": "Is an adversary manipulating data on mobile devices to cause an impact?",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1641.001",
        "name": "Transmitted Data Manipulation",
        "evidence": [
          {
            "description": "Data sent from a mobile device over the network is altered in-transit, such as a copied cryptocurrency wallet address being replaced with an adversary-controlled address before being submitted in a web form. This manipulation occurs between the user's action and the data's transmission over the network.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway and corporate Wi-Fi network sensors",
            "action": "Filter Zeek http.log for POST requests originating from IP ranges assigned to mobile devices. Parse form data fields and apply regular expressions to detect common sensitive formats like cryptocurrency wallet addresses or financial account numbers. For each detected pattern, correlate with Zeek conn.log to identify the destination IP and associated domain from dns.log. Establish a baseline of legitimate destination domains for this type of data (e.g., known financial institutions, company portals). Generate an alert when sensitive data patterns are transmitted to domains that are not on the established baseline, have low reputation scores, or were recently registered. Use statistical methods to monitor the character distribution (entropy) of specific form fields over time; significant deviations from an established user or application baseline may indicate manipulation."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]