[
  {
    "information_requirement": "Is an adversary using our managed mobile devices to generate fraudulent or malicious outbound traffic? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1643",
        "name": "Generate Traffic from Victim",
        "evidence": [
          {
            "description": "A mobile application, which is not a standard messaging app, is sending an unusually high volume of SMS messages, potentially to premium-rate numbers.",
            "data_sources": [
              "Carrier billing records",
              "Mobile Device Management (MDM) application inventory logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet",
            "action": "Correlate MDM application inventory data with carrier billing records. For each device, establish a baseline of normal SMS activity (volume, recipient types). Use statistical analysis to flag devices with SMS volume exceeding the 95th percentile of their historical baseline or the fleet's baseline. Specifically identify SMS sent to known premium-rate number blocks. Cross-reference the applications on flagged devices, looking for apps with `SEND_SMS` permissions that are not core messaging apps (e.g., games, utilities). A high-risk score can be assigned to devices exhibiting both anomalous SMS volume and the presence of suspicious apps with this permission."
          },
          {
            "description": "A mobile device is generating an unusually high volume of repetitive, non-interactive web traffic to specific domains, such as app stores or ad-ranking sites, inconsistent with normal user behavior.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways",
            "action": "For each mobile device IP, analyze Zeek logs to profile web traffic. Calculate the entropy of requested domain names (from dns.log) and user agents (from http.log) over rolling time windows (e.g., 1 hour); a low entropy score suggests repetitive, automated activity. Monitor the ratio of connections (from conn.log) to total data transferred; a high number of connections with low data transfer per connection can indicate non-interactive 'clicking'. Establish a baseline for daily/hourly request volume per device. Use a moving average to detect sustained spikes in traffic volume that exceed 3 standard deviations from the norm. Flag devices that exhibit a combination of low domain entropy, high request volume, and traffic directed towards known ad networks or app store-related domains."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]