[
  {
    "information_requirement": "Is an adversary executing arbitrary code on corporate mobile devices by exploiting client application vulnerabilities? (TA0041 - Execution)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1658",
        "name": "Exploitation for Client Execution",
        "evidence": [
          {
            "description": "A mobile device's messaging or browser application initiates an unusual network connection or spawns an unexpected child process following user interaction with a link or file delivered via SMS/MMS/iMessage, indicative of a one-click or zero-click exploit.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile EDR/MDM process logs",
              "Mobile OS crash logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, Mobile Device Management (MDM) servers, Endpoint mobile devices",
            "action": "Monitor Zeek dns.log for requests from mobile devices to newly registered domains (NRDs) or domains with a high entropy score. Correlate these DNS requests with subsequent outbound connections in conn.log to non-standard ports or known malicious IP addresses. On endpoints with EDR/MDM, establish a baseline of normal process relationships (e.g., parent-child processes) for common applications like browsers and messaging clients. Alert on deviations, such as Safari spawning a shell process (/bin/sh). Use statistical analysis to identify devices exhibiting an anomalous increase in outbound connections or data transfer volume immediately following a DNS lookup to a suspicious domain."
          },
          {
            "description": "A mobile device experiences a sudden, unexplained system crash or reboot, potentially followed by the installation of an unauthorized application or configuration profile, consistent with a buffer overflow exploit delivered via a peer-to-peer protocol like AirDrop.",
            "data_sources": [
              "Mobile OS crash logs",
              "Mobile Device Management (MDM) application inventory logs",
              "Mobile Device Management (MDM) configuration profile logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) servers, Endpoint mobile devices, Corporate Wi-Fi network gateways",
            "action": "Ingest and analyze mobile OS crash logs from MDM. Create a time-series visualization of crash events per OS version and device model to identify anomalous spikes that could indicate a targeted exploit campaign. Following a crash alert, trigger an automated MDM policy to query the device's application and profile inventory. Compare the new inventory against the last known-good snapshot to identify unauthorized additions. Use frequency analysis on installed application names across the fleet; an app name that is statistically rare or unique to a single device post-crash is highly suspicious. Monitor Zeek conn.log for any subsequent beaconing activity from the crashed device to unusual external IP addresses, which would indicate successful C2 establishment."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]