[
  {
    "information_requirement": "Has an adversary gained initial access by pushing a malicious update to a previously benign mobile application? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1661",
        "name": "Application Versioning",
        "evidence": [
          {
            "description": "A mobile application, shortly after an update, initiates network connections to known malicious, newly registered, or high-entropy domains not previously associated with the application's baseline behavior.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Mobile EDR/MDM Network Flow Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi Networks, VPN Concentrators, Managed Mobile Devices",
            "action": "For each managed mobile device, correlate application update events (from MDM/EDR logs) with subsequent network activity within a 24-hour window (from Zeek logs). For each application, establish a baseline of domains contacted and ports used over a 30-day period. After an update, check for connections to domains that are newly registered (less than 30 days old based on WHOIS data), have high character entropy scores in their names (indicative of DGA), or are present on a threat intelligence feed. Use statistical measures to flag outliers; for example, alert if a new connection's destination port falls outside the 95th percentile of historically used ports for that application."
          },
          {
            "description": "An application update prompts for or is granted new, sensitive permissions (e.g., access to contacts, microphone, SMS) that are inconsistent with the application's core functionality or category.",
            "data_sources": [
              "Mobile EDR/MDM Application Logs",
              "Mobile OS permission logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Mobile Devices",
            "action": "Maintain an inventory of applications and their granted permissions across all managed devices using MDM/EDR. Upon an application update event, perform a diff between the new permission set and the previous version's. Assign a risk score to each permission (e.g., 'Read SMS' = 10, 'Access Contacts' = 9, 'Access Network State' = 1). Flag applications where the total risk score increases by a significant threshold (e.g., > 10 points) or where a new high-risk permission is requested that is statistically anomalous for its application category (e.g., a calculator app asking for microphone access)."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary evading defenses by hiding malicious code within a legitimate application update? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1661",
        "name": "Application Versioning",
        "evidence": [
          {
            "description": "An application update is signed with a different developer certificate than previous versions, or the signing certificate is newly issued and has no established reputation.",
            "data_sources": [
              "Mobile EDR/MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Mobile Devices",
            "action": "Using MDM/EDR, maintain a historical record of the code signing certificate's subject and thumbprint for each application version installed on managed devices. After an application update, compare the new certificate's thumbprint with the historical record for that specific app. Generate an alert for any change in the signing certificate. Additionally, analyze the 'valid from' date of the new certificate; if the certificate is less than 60 days old, elevate the priority of the alert as this indicates a lack of established trust."
          },
          {
            "description": "A newly updated application exhibits a significant change in its network traffic patterns, such as a large increase in data egress or communication over non-standard ports.",
            "data_sources": [
              "Zeek conn.log",
              "Mobile EDR/MDM Network Flow Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Network Gateways, Managed Mobile Devices",
            "action": "For each application on managed devices, establish a rolling 14-day baseline of network behavior, including average daily data sent/received and common destination ports. After an application update, monitor its network traffic for the next 72 hours. Trigger an alert if the total data egress for that application exceeds 3 standard deviations from its established baseline or if it communicates on a port not seen in its baseline history. This helps detect unexpected data exfiltration or C2 communication hidden in a seemingly legitimate update."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]