[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to mobile devices via phishing? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1660",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A user receives an SMS message (smishing) containing a suspicious link, often with a sense of urgency, pointing to a domain not typically associated with the purported sender or a newly registered domain.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate VPN concentrators and network egress points serving mobile device traffic.",
            "action": "Monitor Zeek dns.log for DNS requests originating from mobile device IP ranges to newly registered domains (NRDs) or domains with high entropy scores. Correlate these DNS requests with Zeek http.log to filter for User-Agent strings indicating a mobile browser (e.g., 'Android', 'iPhone'). Establish a baseline of typical domains visited by mobile users and use descriptive statistics to flag outliers that deviate significantly (e.g., domains falling outside the 95th percentile of frequency). An alert should be triggered when a mobile device requests a high-risk domain (NRD, high entropy, statistical outlier) that is not on an established corporate allowlist."
          },
          {
            "description": "A user's mobile device makes a network connection to a malicious or suspicious URL immediately following an action that would not be logged on an endpoint, such as scanning a QR code (quishing).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points and VPN concentrators used by mobile devices.",
            "action": "Analyze Zeek dns.log for queries from mobile device IP ranges to domains with poor reputation, domains impersonating corporate brands (typosquatting), or domains with high entropy scores. Since the trigger (QR code scan) is not directly observable in network logs, the focus is on the anomalous nature of the destination. Calculate the entropy of all requested domain names from the mobile IP space; trigger an alert if a device requests a domain with an entropy score above a statistically determined threshold (e.g., > 3.5) and the domain is not on a pre-approved list. This may indicate a connection to a machine-generated malicious domain."
          },
          {
            "description": "A mobile device's mail client or web browser initiates a connection to a known malicious domain, a domain with a suspicious SSL/TLS certificate, or a URL shortener that redirects to a malicious site, as a result of a user clicking a link in a phishing email.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, email gateways, and corporate VPN concentrators.",
            "action": "Filter Zeek http.log for requests with mobile User-Agent strings. Cross-reference requested domains from the corresponding Zeek dns.log against threat intelligence feeds. For connections using TLS, analyze Zeek ssl.log to identify certificates with suspicious attributes such as very short validity periods (e.g., < 90 days), issuance from a free certificate authority for a domain impersonating a corporate brand, or a mismatch between the certificate's common name and the requested domain. A risk score can be assigned based on these attributes (e.g., +1 for short validity, +2 for free CA on a lookalike domain). An alert is triggered if the cumulative score for a single connection exceeds a defined threshold."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]