[
  {
    "information_requirement": "Is an adversary leveraging virtualization solutions on corporate mobile devices to conduct malicious activities? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1670",
        "name": "Virtualization Solution",
        "evidence": [
          {
            "description": "An unapproved virtualization or container application is installed and running on a managed mobile device.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Android Logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android mobile device fleet",
            "action": "Maintain a curated list of package names for known Android virtualization and container applications (e.g., io.va.exposed, com.lbe.parallel.intl, com.dual.space.pro). Periodically query Mobile Device Management (MDM) application inventory logs across all managed devices. Compare the list of installed applications against the curated list of virtualization apps and the organization's official application allowlist. Generate an alert for any device containing a non-allowlisted virtualization application."
          },
          {
            "description": "Network traffic originating from a mobile device exhibits patterns inconsistent with the foreground application, suggesting a background or virtualized process is generating the traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM Application Usage Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi and VPN gateways",
            "action": "Correlate MDM application usage logs (identifying the foreground app) with network logs (Zeek conn.log, dns.log) using the device IP address and timestamp as a pivot point. For each device, establish a baseline profile of typical network destinations (domains, IPs) associated with commonly used foreground applications. Hunt for anomalies where a device's network traffic does not match the expected profile of the active application. Calculate the Shannon entropy of requested subdomains per hour for each device; a sudden, high-entropy spike that cannot be attributed to a known application may indicate virtualized malicious activity attempting to hide its network connections."
          },
          {
            "description": "A mobile device is making network connections to domains or IPs associated with the download or use of known malicious virtualization solutions.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points",
            "action": "Ingest threat intelligence feeds that specify domains and URIs known to host or support malicious virtualization applications. Create a watchlist of these indicators. Continuously monitor Zeek dns.log and http.log data for any queries or requests to items on the watchlist. An alert on a match should be enriched with device information (if available) and user context to assess the severity of the potential compromise."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]