[
  {
    "information_requirement": "Is the adversary impairing defenses to evade detection? (TA0005 - Defense Evasion)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562",
        "name": "Impair Defenses",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) is logged where the new process's file hash matches a curated threat intelligence feed of known defense impairment tools or malware.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, User Endpoints, Security Infrastructure Servers (e.g., EDR/SIEM management consoles)",
            "action": [
              "Symbolic (IOC Match): Ingest a high-confidence threat intelligence feed of file hashes for known defense impairment tools (e.g., PCHunter, GMER) and malware. Create a detection rule to query all process creation events (Windows Event ID 4688) and generate a high-severity alert on any match between the logged process hash and the IOC list.",
              "Statistical (Prevalence Analysis): For each new executable hash observed via Event ID 4688, calculate its prevalence across the enterprise (i.e., the percentage of hosts it has been seen on). Flag executables that are extremely rare (e.g., observed on < 0.1% of endpoints) but have a high execution count on a single host, as this may indicate a targeted tool not present in threat intelligence.",
              "Machine Learning (Classification): Utilize a pre-trained machine learning classifier that uses static file features (e.g., PE header information, section entropy, imported functions) to predict if a previously unseen executable is malicious. Ingest all new executables observed in the environment, score them, and investigate those with a high probability of being malicious, prioritizing those executed by non-system accounts."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) contains command-line arguments designed to terminate, disable, or misconfigure security services (e.g., 'windefend'), firewall rules ('netsh advfirewall'), or logging policies ('auditpol').",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User Endpoints, Application Servers, Windows-based Firewalls",
            "action": [
              "Symbolic (Regex Matching): Monitor command-line arguments in process creation events (Windows Event ID 4688) for regular expressions matching known defense evasion commands. Examples include `sc.exe config <service> start= disabled`, `taskkill.exe /f /im <av_process>.exe`, `netsh.exe advfirewall set`, `auditpol.exe /clear`, and `reg.exe delete HKLM\\SYSTEM\\CurrentControlSet\\Services\\...`.",
              "Statistical (Frequency & Entropy Analysis): For each user and host, establish a baseline of normal command-line utility usage for tools like `sc.exe`, `netsh.exe`, and `auditpol.exe`. Alert if a user's execution frequency for these utilities exceeds a statistical threshold (e.g., 3 standard deviations above their personal mean). Additionally, calculate the Shannon entropy of command-line strings; unusually high entropy can indicate obfuscated or encoded commands.",
              "Machine Learning (Sequence Classification): Employ a sequence-based classifier (e.g., an LSTM or Transformer model) trained on a large dataset of benign and malicious command-line arguments. The model learns the syntax and structure of legitimate commands. Feed all observed command-line executions into the model to classify them as benign, suspicious, or malicious, flagging those with high malicious scores for analyst review."
            ]
          },
          {
            "description": "The Windows Security or System event log is cleared, indicated by the presence of Windows Event ID 1102, or the execution of 'wevtutil.exe cl' (via Event ID 4688), or 'Clear-EventLog' (via PowerShell Event ID 4104).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1102",
              "Windows PowerShell Operational Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Hosts, especially Domain Controllers and critical servers where logs are paramount.",
            "action": [
              "Symbolic (High-Fidelity Alert): Create a high-priority, non-suppressible alert that triggers immediately upon the detection of Windows Event ID 1102 ('The audit log was cleared'). Create additional high-priority alerts for any process creation (Event ID 4688) of `wevtutil.exe` with `cl` or `clear-log` arguments, or any PowerShell script block log (Event ID 4104) containing `Clear-EventLog`.",
              "Statistical (Rarity Analysis): While any log clearing is suspicious, contextualize the event by tracking the historical frequency of `wevtutil.exe` or `Clear-EventLog` usage by user and role. An execution by a non-administrator account or by an administrator who has never performed the action before represents a high-confidence anomaly. Calculate and alert on the rarity of the action for the specific user and host.",
              "Machine Learning (Behavioral Chaining): Use a graph-based or sequence analysis model to identify event chains. A log clearing event is significantly more malicious if it is preceded by other suspicious activities (e.g., downloading a file with curl, executing a PowerShell script from a suspicious location) on the same host within a short time window (e.g., 10 minutes). The model should score event chains, and a chain culminating in a log clear event (Event ID 1102 or equivalent) should receive the highest possible risk score."
            ]
          },
          {
            "description": "A statistically significant and sudden cessation of logs from a host or a specific critical service (e.g., AV, EDR, Sysmon) without a corresponding scheduled maintenance event, while the host remains active on the network.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 7036",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log Aggregation/SIEM Infrastructure, Network Egress Points, All log-generating hosts",
            "action": [
              "Symbolic (Heartbeat Rule): Configure a 'heartbeat' rule in the SIEM for every critical host and log source. The rule checks for the presence of logs within a defined time interval (e.g., 15 minutes). If no logs are received from a source within that interval and there is no open maintenance ticket for that host, generate a critical alert for a 'silent host'.",
              "Statistical (Volume-based Anomaly Detection): For each log source, create a time series of its log volume (e.g., events per minute). Establish a baseline model of expected volume, accounting for time-of-day and day-of-week patterns. Alert if the current log volume drops below a statistically significant threshold (e.g., below the 5th percentile of the historical distribution for that time period) for a sustained duration.",
              "Machine Learning (Time Series Forecasting): Employ a time series forecasting model (e.g., ARIMA or Prophet) to predict the expected log volume for each source in the next time interval. Generate an anomaly score based on the delta between the predicted and actual volume. If the score exceeds a dynamic threshold, correlate the finding by querying network flow logs (Zeek conn.log) to determine if the host is still communicating. A host that is silent from a logging perspective but active on the network is a high-priority indicator."
            ]
          },
          {
            "description": "A correlated sequence of events on a single host where a suspicious process creation is followed by the termination of a security service, a registry modification to disable a security tool, or the clearing of event logs within a short time window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7036",
              "Windows Event ID 1102",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Servers, Domain Controllers",
            "action": [
              "Symbolic (Correlation Rule): Create a stateful correlation rule that triggers when the following sequence occurs on the same host within a 5-minute window: 1) A process is created (Event ID 4688) from a low-reputation directory (e.g., %TEMP%) followed by 2) A security service stopping (Event ID 7036), the audit log being cleared (Event ID 1102), or a registry key for a security service being modified (Event ID 4657).",
              "Statistical (Conditional Probability): Continuously calculate the conditional probability of a defense impairment event (Service Stop, Log Clear, Security Registry Modify) given a preceding suspicious process creation, e.g., `P(EventID 1102 | ParentProcess = wscript.exe)`. If this probability for a specific parent-child relationship or host spikes significantly above the global baseline for the entire organization, flag it as a statistical anomaly.",
              "Machine Learning (Sequence Anomaly Detection): Train a sequence-aware model, such as a Hidden Markov Model (HMM), on event log data from all hosts to learn normal sequences of system events. Feed real-time event streams from each host into the model, which assigns a probability score to the observed sequence. A low-probability sequence, such as `[SuspiciousDownload -> ProcessCreateFromTemp -> ServiceStop]`, will be flagged as a high-confidence anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]