[
  {
    "information_requirement": "Has the adversary exfiltrated data using legitimate external web services? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567",
        "name": "Exfiltration Over Web Service",
        "evidence": [
          {
            "description": "An outbound network connection's destination IP address, FQDN, or URL is present on a threat intelligence feed of known malicious indicators related to data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway Firewalls, DNS Resolvers, Web Proxies, Network Security Monitoring Sensors",
            "action": [
              "Symbolic: Continuously correlate destination IPs from Zeek conn.log (`id.resp_h`), requested domains from Zeek dns.log (`query`), and host headers/SNI from Zeek http.log (`host`) and ssl.log (`server_name`) against a cyber threat intelligence feed. Generate a high-priority alert for any match.",
              "Statistical: For newly observed domains not present in CTI feeds, calculate a prevalence score by dividing the number of distinct internal hosts connecting to the domain by the total number of active internal hosts within a 24-hour window. Flag any domain with a prevalence below a low threshold (e.g., <1%) for analyst review as potentially targeted.",
              "Machine Learning: Utilize a pre-trained domain generation algorithm (DGA) detection model to classify requested domains from Zeek dns.log. Additionally, use a domain reputation model that scores domains based on features like age, registrar, IP geolocation, and ASN. Flag any domain classified as DGA or with a reputation score below a 'suspicious' threshold."
            ]
          },
          {
            "description": "An outbound HTTP/S request is observed with a User-Agent string or URI pattern associated with non-interactive data transfer tools (e.g., curl, wget, python-requests), and this network activity is correlated to a script or command-line process on the source host.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (Workstations and Servers), Application Servers, DMZ Web Servers, API Gateways",
            "action": [
              "Symbolic: Apply regular expressions to the `user_agent` field in Zeek http.log to detect non-browser tools (e.g., `^curl/`, `^Wget/`, `^python-requests`). Upon a match, pivot to host logs by correlating the connection's source IP and timestamp with Windows Event ID 4688 to identify the responsible process. Alert if the parent process is non-interactive (e.g., `cmd.exe`, `powershell.exe`).",
              "Statistical: Calculate the rarity of each `user_agent` string observed in Zeek http.log across the enterprise over a 30-day rolling window. Generate an alert for User-Agents that appear on a small number of distinct hosts (e.g., <0.5% of the endpoint population), indicating non-standard software usage.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) to distinguish between browser and non-browser User-Agents using features such as string length, token count, and keyword presence ('Mozilla', 'Chrome'). Flag traffic from any User-Agent classified as 'non-browser' that originates from a standard user workstation for investigation."
            ]
          },
          {
            "description": "An outbound web connection shows a data transfer volume where sent bytes significantly exceed received bytes, or where the total volume of an HTTP POST/PUT request is statistically anomalous for the specific host, user, or destination.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Core Network Switches, Servers hosting sensitive data, Database Servers",
            "action": [
              "Symbolic: Create a rule to alert when a single connection's outbound bytes (`orig_bytes` in Zeek conn.log) is greater than 20 times the inbound bytes (`resp_bytes`) AND the total outbound bytes exceeds a static threshold (e.g., 50 MB). This rule targets highly asymmetric data flows.",
              "Statistical: For each host-destination pair, establish a baseline of the 98th percentile for both the ratio of `orig_bytes`/`resp_bytes` (where `resp_bytes` > 0) and the `request_body_len` in HTTP POSTs over a 30-day period. Generate an alert when any new connection exceeds these established statistical thresholds.",
              "Machine Learning: For each host, implement a time-series forecasting model (e.g., SARIMA, Prophet) to predict the expected total outbound data volume per hour, accounting for weekly seasonality. Flag any host whose actual data volume significantly exceeds the model's predicted upper confidence bound."
            ]
          },
          {
            "description": "An outbound connection to an external web service on TCP port 80 or 443 is initiated by a process that is not an approved web browser or updater, particularly if the process is unsigned, runs from an unusual path, or is non-interactive.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, File Servers, User Workstations, Critical System Servers, Developer Machines",
            "action": [
              "Symbolic: Correlate network connection events (Windows Event ID 5156) with process creation events (Windows Event ID 4688) by joining on `Process ID`. Alert if a process `Image` name (from Event 4688) not on an allowlist of approved web-facing applications initiates an outbound connection to a remote address on port 80/443 (from Event 5156).",
              "Statistical: For each process name, profile its typical network behavior by calculating the mean and standard deviation of outbound bytes per hour and the number of distinct destinations. Alert when a process's network activity for a given hour deviates from its historical baseline by more than 3 standard deviations.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means or DBSCAN) on process execution data, using features like process name, parent process name, command-line arguments, and network connection count. Establish clusters of normal behavior and flag any new process activity that is classified as an outlier or belongs to a new, small cluster."
            ]
          },
          {
            "description": "A host establishes outbound web connections to a single external destination with machine-like regularity (consistent time intervals), at unusual hours, or with a sudden, sustained increase in frequency, suggesting automated C2 communication.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal network segments, VPN Concentrators, Remote Access Servers, IoT/OT Network Segments",
            "action": [
              "Symbolic: From Zeek conn.log, group connections by source IP, destination IP, and destination port. For each group, check for a sustained series of connections (e.g., >10 connections) where the time delta between each connection is highly regular (e.g., every 300 seconds +/- 5 seconds). Alert on such periodic behavior.",
              "Statistical: For each source-destination pair, calculate the time deltas between consecutive connection timestamps (`ts` in Zeek conn.log). Compute the standard deviation of these deltas over a rolling 1-hour window. A standard deviation near zero (e.g., < 5 seconds) indicates strong periodicity. Also, profile the typical hourly connection count for each host and alert on significant volume during historically inactive periods (e.g., 1 AM - 5 AM local time).",
              "Machine Learning: Apply a time-series anomaly detection model, such as a Long Short-Term Memory (LSTM) autoencoder, to the stream of connection events for each host. The model learns the normal rhythm of network activity (time of day, frequency, duration) and flags any sequence of events with a high reconstruction error, indicating a deviation from learned normal patterns."
            ]
          },
          {
            "description": "The data payload of an outbound HTTP POST request or a file upload has a calculated Shannon entropy value that is statistically higher than the baseline for typical content (e.g., text, images) sent to that destination, suggesting the data is compressed or encrypted for exfiltration.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Web Application Firewalls (WAFs), Servers permitted to upload files to external sites, Managed File Transfer Systems",
            "action": [
              "Symbolic: Create a rule that flags any file upload identified in Zeek files.log with a common archive extension (e.g., .zip, .rar, .7z, .tar.gz) being sent to a non-corporate, uncategorized, or personal cloud storage web service domain. Maintain an allowlist of approved business file-sharing partners.",
              "Statistical: Using Zeek http.log and files.log, calculate the Shannon entropy of data in HTTP POST request bodies and transferred files. For each destination domain, establish a 30-day rolling baseline of the 99th percentile for entropy. Alert when a new transfer's entropy exceeds this established per-destination threshold.",
              "Machine Learning: Train a file content classifier using features like byte frequency distribution, n-gram frequency, and entropy. For traffic to web services that normally handle structured text (e.g., paste sites, API endpoints), flag any transfer that the model classifies as 'archive', 'encrypted blob', or 'executable', suggesting data is being hidden in an unexpected format."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]