[
  {
    "information_requirement": "Is an adversary collecting and staging data for exfiltration using custom archiving methods? [1]",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1560.003",
        "name": "Archive via Custom Method",
        "evidence": [
          {
            "description": "A process is created (e.g., powershell.exe, python.exe, certutil.exe) where the command-line arguments have a calculated Shannon entropy value exceeding the 95th percentile of the historical baseline for that specific process name, or the process hash matches known custom archivers from threat intelligence.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstation and server endpoints, especially developer workstations, administrator consoles, Domain Controllers, and file servers.",
            "action": [
              "Symbolic Logic: For each process creation event (Windows Event ID 4688), compare the process executable's hash against a threat intelligence feed of known custom archivers. Also, use regular expressions to match command-line patterns indicative of obfuscation, such as `powershell -e`, `-enc`, or long Base64 strings.",
              "Statistical Method: For each process creation, calculate the Shannon entropy of the command-line arguments string. Maintain a 30-day rolling baseline of entropy values for each unique process name (e.g., `powershell.exe`). Generate an alert if the entropy for a new event exceeds the 95th percentile for that process's baseline, indicating potential obfuscation or custom scripting.",
              "Machine Learning: Employ a pre-trained classification model (e.g., Random Forest, Gradient Boosting) that uses features such as command-line entropy, argument length, parent process name, and the presence of special characters to score the event's likelihood of being malicious. An alert is generated for events exceeding a predetermined confidence score."
            ]
          },
          {
            "description": "A single process, not associated with approved backup or archiving software, reads more than 100 unique files from sensitive directories within a 5-minute window and subsequently writes to a single new file in a common staging location (e.g., C:\\Users\\Public, %TEMP%).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, database servers, user profile directories (e.g., Documents, Desktop), and common staging directories (e.g., %TEMP%, %APPDATA%, C:\\Users\\Public) on endpoints and servers.",
            "action": [
              "Symbolic Logic: Correlate process creation (Windows Event ID 4688) with file access (Windows Event ID 4663), which requires SACL auditing on target directories. Alert if a process whose path is not on an organizational allowlist of backup/archiving tools reads from >100 distinct file paths in sensitive directories and then writes to a single file in a staging directory within a 5-minute timeframe.",
              "Statistical Method: For each process over a 10-minute window, calculate the ratio of unique files read to files written. Establish a baseline for this ratio for common processes (e.g., `explorer.exe`, `svchost.exe`). Alert if a process exhibits a ratio that deviates by more than 3 standard deviations from its own historical baseline or its peer group's baseline.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on aggregated process session features, including file read count, file write count, unique directories accessed, and process path. Investigate clusters of activity that do not group with known, legitimate processes, as these represent anomalous process behavior."
            ]
          },
          {
            "description": "An outbound network flow over a non-standard port, not associated with a known encrypted protocol (e.g., TLS, SSH), exhibits a sustained payload byte entropy greater than 7.5 bits/byte, occurring within 10 minutes of a high-volume file access or process anomaly alert on the source host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek file_analysis"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, such as border firewalls and routers, where network sensors (e.g., Zeek) are deployed.",
            "action": [
              "Symbolic Logic: Create a correlation rule that triggers when a host, previously flagged for anomalous file access or high-entropy process creation, initiates an outbound connection in `Zeek conn.log` on a non-standard port (e.g., not 80, 443, 22, 3389) with a payload size (`orig_bytes`) greater than 10MB.",
              "Statistical Method: Using a Zeek script or post-processing of packet captures, calculate the byte entropy for connection payloads identified in `Zeek file_analysis`. Alert when the entropy of a flow's payload is above the 98th percentile for its destination port, excluding known encrypted protocols. This indicates data that is compressed or encrypted, but not via standard means.",
              "Machine Learning: Train a time-series anomaly detection model (e.g., LSTM Autoencoder) on per-host network flow features from `Zeek conn.log` (e.g., bytes out, duration, packets out, protocol). Alert when the model reports a high reconstruction error, indicating a significant deviation from the host's normal network behavior profile, especially when correlated with high payload entropy."
            ]
          },
          {
            "description": "A common office or browser process (e.g., WINWORD.EXE, CHROME.EXE) spawns a child process (e.g., powershell.exe, cmd.exe, wscript.exe) that is statistically rare for that parent-child relationship across the enterprise, and the child process subsequently reads from multiple files.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All end-user workstations and servers running common business applications (e.g., Microsoft Office, Adobe Reader, web browsers).",
            "action": [
              "Symbolic Logic: Maintain and alert on a static list of explicitly forbidden parent-child process relationships (e.g., `Acrobat.exe` spawning `cmd.exe`, `OUTLOOK.EXE` spawning `powershell.exe`).",
              "Statistical Method: From Windows Event ID 4688 data, build a frequency table of all parent-child process pairs observed across the enterprise over a 30-day period. For each parent process, calculate the probability of each child process. Alert when a parent spawns a child process that falls in the bottom 1st percentile of frequency for that specific parent, indicating a rare and suspicious event.",
              "Machine Learning: Model all observed process chains as a directed graph. Apply a community detection algorithm to identify normal clusters of activity (e.g., the 'Office Suite' cluster, the 'Developer Tools' cluster). Flag any new process chain that forms a bridge between two otherwise separate communities (e.g., a Microsoft Office process spawning a system administration tool) as a high-risk anomaly requiring investigation."
            ]
          },
          {
            "description": "A file larger than the 95th percentile of typical file sizes is created in a common staging directory (e.g., %TEMP%, Recycle Bin) by a process not on a backup/installer allowlist, and is followed within 5 minutes by an outbound network connection from the same host with a total volume (`orig_bytes`) larger than its 95th percentile.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Common staging directories (e.g., C:\\Windows\\Tasks, %TEMP%, C:\\Perflogs, Recycle Bin) on endpoints/servers, and network egress points.",
            "action": [
              "Symbolic Logic: Alert when a file creation event (Windows Event ID 4663) for a file >50MB in a staging directory (e.g., `%TEMP%`) by a process not in `['backup.exe', 'msiexec.exe', 'patch.exe']` is followed within 5 minutes by a `Zeek conn.log` entry from the same host with `orig_bytes` > 50MB to an external IP.",
              "Statistical Method: Calculate the 95th percentile for file sizes created in staging directories and the 95th percentile for outbound flow sizes (`orig_bytes`) per host. Alert when a file creation event and a subsequent network flow from the same host both exceed these respective statistical thresholds within a short time window (e.g., 10 minutes).",
              "Machine Learning: Implement a sequence analysis model (e.g., Hidden Markov Model) trained on sequences of events per host (e.g., process_create -> file_create -> network_connection). Flag improbable sequences, such as a large file write in a temp directory followed immediately by a large data egress to a new destination IP, as highly suspicious."
            ]
          },
          {
            "description": "Following a process or file access anomaly, an outbound network connection from the source host exhibits a data volume (`orig_bytes`) that is more than 4 standard deviations above its 30-day baseline, and the destination is a newly observed domain or an IP with a low reputation score.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, enterprise DNS servers, and threat intelligence feeds.",
            "action": [
              "Symbolic Logic: Correlate `Zeek conn.log` with `dns.log` and threat intelligence. Alert on any outbound connection where the destination IP is on a blocklist, or the FQDN resolved in the corresponding DNS query was first registered within the last 30 days, or has a reputation score below a set threshold.",
              "Statistical Method: For each host, maintain a 30-day rolling baseline (mean and standard deviation) of outbound `orig_bytes` per connection from `Zeek conn.log`. Alert if a new connection's `orig_bytes` exceeds 4 standard deviations above the mean. Augment the alert's risk score if the destination IP is in the bottom 5th percentile of all destination IPs contacted by that host.",
              "Machine Learning: For each host, use a one-class SVM (Support Vector Machine) trained on normal `Zeek conn.log` features (duration, `orig_bytes`, protocol, destination port) to define its unique 'normal' outbound profile. Classify new connections in real-time and alert on any connection that the model identifies as an outlier."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]