[
  {
    "information_requirement": "Is the adversary attempting to destroy data or disrupt availability by wiping disk content? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1561.001",
        "name": "Disk Content Wipe",
        "evidence": [
          {
            "description": "A process is created whose SHA256 hash or file name matches a known wiper malware signature in a threat intelligence database.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, particularly mission-critical systems like Domain Controllers and database servers.",
            "action": [
              "Symbolic: Continuously correlate the SHA256 hash from process creation events (Windows Event ID 4688, Sysmon Event ID 1) against a threat intelligence feed of known wiper malware hashes. Alert on any match.",
              "Statistical: Analyze file creation events (Sysmon Event ID 11) for file names matching known wiper patterns using regular expressions (e.g., `wiper.exe`, `destroy.exe`). Calculate the frequency of matches per host and alert if the rate exceeds the 99th percentile of the host's historical 30-day baseline.",
              "Machine Learning: Using process creation and file creation events, extract static features (e.g., PE header information, imported functions, string entropy) and dynamic features (e.g., parent process, command line arguments) for newly observed executables. Feed these features into a pre-trained machine learning classifier (e.g., Gradient Boosting, Random Forest) to score the executable's likelihood of being wiper malware. Alert on any file with a high-confidence malicious score (e.g., > 0.90)."
            ]
          },
          {
            "description": "Legitimate system utilities (e.g., cipher.exe, vssadmin.exe, wbadmin.exe, format.com) are executed with command-line arguments and in sequences indicative of destructive disk wiping activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows servers and workstations, especially those with administrative privileges.",
            "action": [
              "Symbolic: Create a detection rule that triggers on specific command-line invocations such as `cipher.exe /w:`, `vssadmin.exe delete shadows /all /quiet`, `wbadmin delete catalog -quiet`, or `sdelete.exe -z`. Also, create a rule that alerts when these commands are observed in a sequence on the same host within a 5-minute window using process creation logs (Sysmon Event ID 1, Windows Event ID 4688).",
              "Statistical: For each host, profile the execution frequency and command-line argument patterns of utilities like `cipher.exe`, `sdelete.exe`, `wbadmin.exe`, and `format.com`. Alert when the execution count for any of these utilities on a single host exceeds 3 standard deviations above its 30-day rolling average, or when a rare combination of arguments is used (e.g., `cipher.exe` with `/w:` on a server).",
              "Machine Learning: Train a sequence analysis model (e.g., a Recurrent Neural Network or Hidden Markov Model) on benign administrative command sequences from process creation logs. Feed real-time command-line execution data into the model and alert when a sequence has a low probability of being benign (e.g., below a 5th percentile threshold), indicating a deviation from normal administrative behavior and potential destructive intent."
            ]
          },
          {
            "description": "A process not on an established allow-list of system or backup utilities directly reads from or writes to a physical drive object (e.g., `\\\\.\\PhysicalDriveN` or `\\\\.\\C:`), bypassing the file system.",
            "data_sources": [
              "Sysmon Event ID 9",
              "Windows Event ID 4656",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers hosting sensitive data, Domain Controllers, and virtualization hosts.",
            "action": [
              "Symbolic: Maintain an explicit allow-list of legitimate process image paths (e.g., `C:\\Program Files\\Backup\\agent.exe`, `C:\\Windows\\System32\\chkdsk.exe`) and corresponding user accounts authorized to perform raw disk access. Monitor RawAccessRead events (Sysmon Event ID 9) and alert on any process performing this action that is not on the allow-list.",
              "Statistical: For each RawAccessRead event (Sysmon Event ID 9), calculate the Shannon entropy of the process name. Alert if a process not on the allow-list performs this action and has a character entropy score greater than $$ 3.5 $$, suggesting a randomly generated name. Additionally, track the prevalence of processes performing raw access; alert if a process seen on less than 1% of endpoints performs this action.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) using features from the process performing raw access (Sysmon Event ID 9), such as parent process name, user context, process path entropy, and whether the executable is signed. Use the model to classify each raw access event as either 'benign administrative task' or 'suspicious wiper activity' and alert on high-confidence 'suspicious' classifications."
            ]
          },
          {
            "description": "A single process generates a volume of file deletion or file overwrite events that is statistically anomalous for the host or user, particularly involving files with low extension entropy.",
            "data_sources": [
              "Sysmon Event ID 23",
              "Sysmon Event ID 11",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, user workstations, and code repositories.",
            "action": [
              "Symbolic: Create a rule that alerts when a non-system or non-patching process deletes more than 10 files with critical extensions (e.g., .dll, .exe, .sys) from protected directories like `C:\\Windows\\System32` within a 1-minute window, using file delete events (Sysmon Event ID 23, Windows Event ID 4663).",
              "Statistical: For each host, establish a per-process baseline of file deletion events (Sysmon Event ID 23) per minute. Alert when a single process generates a count of deletions exceeding the 99.9th percentile of the host's historical activity. As a secondary condition, calculate the entropy of the file extensions being deleted; an entropy score approaching $$ 0 $$ suggests indiscriminate wiping of a single file type.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) on the stream of file I/O events (creations from Sysmon 11, deletions from Sysmon 23) per host. The model will learn the normal volume and velocity of file operations. Alert when the observed activity significantly deviates from the model's forecast (e.g., a spike in deletions that exceeds the 99% prediction interval), indicating a potential mass-wiping event."
            ]
          },
          {
            "description": "A single host exhibits fan-out behavior, initiating an anomalously high number of new SMB connections to administrative shares (e.g., C$, ADMIN$) on other unique hosts across the network.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb_files.log",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic at core switches, Endpoint and server SMB logs.",
            "action": [
              "Symbolic: Using network connection logs (Zeek conn.log) and share access logs (Windows Event ID 5145), create a rule that alerts when a single source IP establishes SMB connections (TCP port 445) to administrative shares (`\\\\*\\C$`, `\\\\*\\ADMIN$`) on more than 20 unique destination hosts within a 5-minute window.",
              "Statistical: For each host, create a 30-day rolling baseline of the number of unique destination hosts it connects to via SMB (port 445) in a 5-minute sliding window. Alert if the current count exceeds 4 standard deviations from the host's historical mean, indicating anomalous fan-out behavior suggestive of worm-like propagation.",
              "Machine Learning: Model the SMB communication network as a directed graph where hosts are nodes and connections are edges. Use a community detection algorithm (e.g., Louvain Modularity) to establish baseline communication patterns. Alert when a node (host) suddenly creates a high number of edges to nodes outside of its typical community cluster, or if its 'PageRank' or 'betweenness centrality' score rapidly increases, indicating it is becoming a propagation hub."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]