[
  {
    "information_requirement": "Is the adversary using dynamic resolution for Command and Control? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1568",
        "name": "Dynamic Resolution",
        "evidence": [
          {
            "description": "An internal host (`id.orig_h`) initiates a DNS query (`query`) or network connection (`id.resp_h`) to a destination present on a high-confidence threat intelligence feed of known DGA or fast-flux C2 indicators.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways, internal DNS resolvers, and integrated Threat Intelligence Platforms",
            "action": [
              "Create a detection rule that performs a real-time lookup of every domain in the `query` field of Zeek dns.log and every destination IP in the `id.resp_h` field of Zeek conn.log against a threat intelligence feed of known DGA and fast-flux C2 indicators. Generate a critical alert for any match.",
              "Calculate the daily count of unique internal hosts querying domains from a DGA threat feed. Alert if this count exceeds a statistically significant threshold (e.g., 3 standard deviations above the 90-day moving average), indicating a potential widespread campaign launch.",
              "Develop and deploy a classification model (e.g., Logistic Regression) trained on features extracted from known DGA domains (from threat intel) and legitimate domains. Use this model to score all newly observed domains in real-time to proactively identify potential DGA activity not yet on threat feeds."
            ]
          },
          {
            "description": "A DNS response (Zeek dns.log) for a single domain (`query`) contains an unusually high count of IP addresses in the `answers` field or an unusually low Time-To-Live (TTL) value in the `TTLs` field, which are characteristics of fast-flux DNS.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Recursive DNS servers, Egress network gateways",
            "action": [
              "Create a detection rule that flags any DNS response in Zeek dns.log where a TTL value in the `TTLs` array is less than 300 seconds AND the number of unique IPs in the `answers` array is greater than 5. Tune these static thresholds based on observed network behavior.",
              "For each domain name, calculate the 30-day rolling average and standard deviation for its TTL and the number of answers in its DNS responses. Generate an alert when a new response for a domain has a TTL or answer count that is more than 3 standard deviations from its historical mean.",
              "Use time-series analysis on the set of IP addresses returned for each domain over time. Apply a clustering algorithm (e.g., DBSCAN) on the resolved IP addresses based on their ASN and geolocation to identify domains whose IPs are abnormally diverse and geographically dispersed, a characteristic of sophisticated fast-flux networks."
            ]
          },
          {
            "description": "An internal host (`id.orig_h`) establishes a TLS connection (Zeek ssl.log) to a known public DNS over HTTPS (DoH) resolver (`server_name`), followed by periodic, low-volume network connections (Zeek conn.log) to an external IP address, indicative of C2 beaconing via an encrypted channel.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways/firewalls, Endpoint devices, Web proxies",
            "action": [
              "Maintain a list of known public DoH resolver IPs and SNI values (e.g., 'dns.google', 'cloudflare-dns.com'). Create a rule to alert on any TLS connection from an internal host to one of these resolvers if DoH is against corporate policy, or to flag the host for heightened monitoring.",
              "For hosts flagged for DoH usage, analyze their subsequent outbound connections in Zeek conn.log. Calculate the inter-arrival time (time between connections) and data volume for all connections. Flag connections where the standard deviation of inter-arrival time is very low (indicating regular intervals) and the data volume is consistently small, which are statistical properties of C2 beaconing.",
              "Apply time-series analysis to the sequence of outbound connection events for a host following a DoH session. Use a forecasting model (e.g., ARIMA) to predict the timing and size of the next connection. A high-confidence prediction of a periodic, small connection indicates a strong beaconing signal."
            ]
          },
          {
            "description": "A DNS query (Zeek dns.log) from an internal host contains a domain name (`query`) that exhibits statistical properties of algorithmic generation, such as high Shannon entropy, a non-standard character set, or a low n-gram frequency score when compared to a dictionary of legitimate domains (T1568.002).",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Egress network gateways/firewalls",
            "action": [
              "Create a rule to count NXDOMAIN responses per source host over a 5-minute window. Alert if a single host generates more than 100 NXDOMAIN responses, indicating potential DGA activity.",
              "For each domain in the Zeek dns.log `query` field, calculate its Shannon entropy score. Establish a baseline of entropy scores for legitimate domains on the network. Generate an alert for any domain whose entropy score exceeds the 99th percentile of the established baseline.",
              "Train a machine learning classification model (e.g., Random Forest) using features like domain length, entropy, vowel-to-consonant ratio, and n-gram model probability scores. Apply the trained model to all newly observed domains to classify them as DGA or legitimate."
            ]
          },
          {
            "description": "An internal host (`id.orig_h`) rapidly resolves the same domain name (`query`) to many different IP addresses (`answers`) in a short time frame, which is indicative of client-side fast-flux DNS (T1568.001).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Internal DNS resolvers",
            "action": [
              "Create a rule that triggers when a single source host (Zeek dns.log `id.orig_h`) resolves a single domain name (`query`) to more than 10 unique IP addresses (`answers`) within a 5-minute window.",
              "Group DNS logs by source host and queried domain over a 1-hour window. For each group, calculate the entropy of the set of resolved IP addresses. Flag host-domain pairs where the IP set entropy is in the top 1% for the environment, indicating high IP churn.",
              "Model host-domain-IP relationships as a tripartite graph. Apply community detection or centrality algorithms to identify hosts that act as hubs connecting to an unusually large and diverse set of IPs for a single domain name, which is anomalous compared to normal browsing behavior."
            ]
          },
          {
            "description": "An internal host makes an outbound connection to an unusual IP address immediately after visiting a common, legitimate web service (e.g., social media, code repositories), suggesting a C2 IP was derived from content on the legitimate site via DNS Calculation (T1568.003).",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways/firewalls, Web proxies, Endpoint devices",
            "action": [
              "Maintain a list of legitimate services known to be abused for DNS Calculation (e.g., GitHub, Reddit, Pastebin). Create a rule to alert when a host visits one of these services (`host` or `server_name`) and, within 5 seconds, initiates a connection to an IP address not associated with that service's known IP blocks.",
              "For each source host, calculate the time delta between an HTTP/S request to a potentially abused service (from Zeek http.log/ssl.log) and any subsequent non-HTTP/S connection (from Zeek conn.log). Flag instances where this delta is consistently low (e.g., < 5 seconds) and periodic, indicating a potential scripted C2 mechanism.",
              "Use sequence analysis to model typical user browsing patterns (e.g., sequence of sites visited, protocols used). Flag user sessions that contain the sequence [Visit Abused Service -> Initiate non-standard outbound connection] as a rare and suspicious event chain."
            ]
          },
          {
            "description": "A statistically significant increase in DNS queries (Zeek dns.log) for newly registered domains (NRDs) or domains with very low global prevalence, which are often used for ephemeral C2 infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Egress network gateways, Threat Intelligence Platforms, Passive DNS databases",
            "action": [
              "Enrich Zeek dns.log with domain registration date information from a WHOIS or passive DNS provider. Create a rule to alert on any DNS query for a domain registered within the last 7 days.",
              "Establish a 30-day rolling baseline of the query volume for NRDs (domains registered < 30 days ago). Use statistical process control to alert when the hourly NRD query count exceeds 3 standard deviations above the mean, indicating an anomalous spike.",
              "Develop a reputation scoring model for domains using features such as registration age, query prevalence (e.g., via a passive DNS service), ASN reputation, and entropy. Classify domains with low reputation scores as high-risk and investigate associated connection activity in Zeek conn.log."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]