[
  {
    "information_requirement": "(PIR) Has the adversary exfiltrated sensitive data using cloud storage services?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567.002",
        "name": "Exfiltration to Cloud Storage",
        "evidence": [
          {
            "description": "A TCP/UDP network connection from an internal host to a domain or IP address that is present on a threat intelligence list of known malicious infrastructure or is an unsanctioned cloud storage provider not approved for corporate use.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway / Egress Points, Enterprise DNS Resolvers",
            "action": [
              "Symbolic: Continuously join destination IP addresses from Zeek conn.log and Server Name Indication (SNI) from Zeek ssl.log against an allow-list of sanctioned cloud providers and a deny-list from CTI feeds. Generate an alert for any connection to a cloud provider not on the allow-list or any destination matching the deny-list.",
              "Statistical: Calculate the frequency of connections to all cloud storage provider domains across the enterprise over a 30-day window. Identify domains in the bottom 1st percentile of connection frequency or domains that have not been seen in the last 90 days and flag them for review as potentially unsanctioned or new adversary infrastructure.",
              "Machine Learning: Develop and deploy a Random Forest classification model trained on features from Zeek conn.log and ssl.log (e.g., SNI, JA3/JA3S hash, destination ASN, connection duration, sent/received bytes). Use a labeled dataset of benign (sanctioned) and malicious (CTI-flagged) connections. Use the model to score and alert on new connections to cloud storage domains that are classified as malicious with high confidence."
            ]
          },
          {
            "description": "The execution of a command-line utility with syntax known for uploading data to cloud storage services, such as 'rclone copy', 'aws s3 cp', or 'curl --upload-file'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Production Servers, Domain Controllers",
            "action": [
              "Symbolic: On endpoint command line logs (Windows Event ID 4688, PowerShell Event ID 4104), apply regular expression matching to detect known exfiltration tool syntax, such as 'rclone copy', 'aws s3 cp', 'az storage blob upload', 'curl -T', or PowerShell's 'Write-S3Object' cmdlet.",
              "Statistical: For each command line execution event, calculate the Shannon entropy of the full command-line string. Establish a per-process name (e.g., 'powershell.exe', 'cmd.exe') baseline entropy score. Generate an alert when a command's entropy exceeds 3 standard deviations from its process-specific baseline, which can indicate obfuscated scripts or embedded credentials.",
              "Machine Learning: Implement a one-class SVM model using TF-IDF vectors generated from command-line strings (Windows Event ID 4688, PowerShell Event ID 4104). Train the model on a baseline of known-good command lines from the environment. Use the model to classify new command lines as outliers, indicating potentially novel or obfuscated exfiltration activity."
            ]
          },
          {
            "description": "The creation of a large compressed file (e.g., .zip, .rar, .7z) on a host, immediately followed by a high-volume data upload from that same host to a cloud storage provider within a 15-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Asset Subnets, File Servers, User Workstations",
            "action": [
              "Symbolic: Create a stateful rule that triggers when a process creation event (Windows Event ID 4688) for an archiving utility (e.g., 7z.exe, WinRAR.exe, zip.exe) is followed within 15 minutes by an outbound network connection (Zeek conn.log) from the same host to a cloud provider IP with sent bytes ('orig_bytes') greater than 100MB.",
              "Statistical: For each host, track the time delta between file archiving process events and subsequent large upload events (>100MB) to cloud providers. Calculate the 95th percentile for this time delta across the organization. Alert on any host where this sequence occurs with a time delta significantly shorter than the organizational baseline, especially if the upload size is also in the top 5% for that host.",
              "Machine Learning: Utilize a sequence analysis model (e.g., a Hidden Markov Model or LSTM) trained on event logs (Windows Event ID 4688, Zeek conn.log). The model should learn normal sequences of process execution and network activity. Flag event sequences that have a low probability under the model, such as '7z.exe execution -> outbound connection to rare cloud provider with >100MB upload' within a short time window."
            ]
          },
          {
            "description": "An internal host exhibits an anomalously large data upload volume or a highly asymmetric network traffic ratio (bytes sent >> bytes received) when communicating with a known cloud storage provider domain.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway / Egress Points",
            "action": [
              "Symbolic: Create a rule to alert on any single connection to a known cloud storage provider domain where the total bytes sent ('orig_bytes' in Zeek conn.log) exceeds a hard threshold, such as 1 GB, and the connection duration is less than one hour.",
              "Statistical: For each source IP, calculate a 30-day rolling baseline of total daily bytes sent ('orig_bytes') to cloud storage destinations. Alert when a host's daily upload volume exceeds the 99th percentile of its historical baseline. Additionally, for each connection, calculate the ratio of sent bytes to received bytes ('resp_bytes'). Alert if this ratio exceeds 100 and the total sent bytes exceeds 50MB.",
              "Machine Learning: Implement a time-series forecasting model (e.g., SARIMA) for each host to predict the expected hourly data upload volume to cloud storage providers. Generate an alert when the actual observed upload volume exceeds the upper bound of the model's 99% confidence interval for two consecutive intervals, indicating a significant deviation from normal behavior."
            ]
          },
          {
            "description": "A data upload to a cloud storage service is initiated by a non-interactive process, a system account (e.g., NT AUTHORITY\\SYSTEM), or an application not typically associated with user-driven file sharing (e.g., a web server process like w3wp.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Production Servers, Application Servers",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) with logon events (Windows Event ID 4624) and network logs (Zeek conn.log). Generate a high-severity alert if a process running under a system account (e.g., 'NT AUTHORITY\\SYSTEM') or within a non-interactive logon session (e.g., Logon Type 3, 4, 5) initiates a connection to a known cloud storage provider.",
              "Statistical: Build a frequency table of (process_name, user_name, destination_cloud_domain) tuples observed across the environment over a 30-day period. Alert on the first occurrence of a new tuple, or on tuples that are statistically rare (e.g., occurring less than 5 times in 30 days), such as 'sqlserver.exe' under 'NETWORK SERVICE' connecting to 'onedrive.live.com'.",
              "Machine Learning: Apply a density-based clustering algorithm (e.g., DBSCAN) to a feature set from correlated logs, including: process name, parent process name, username, logon type (from Event ID 4624), destination ASN, and data volume sent. Treat data points that do not belong to any cluster (identified as noise/outliers) as anomalies for investigation, as they represent activity that does not conform to established patterns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]