[
  {
    "information_requirement": "Has the adversary established a data exfiltration channel using webhooks?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567.004",
        "name": "Exfiltration Over Webhook",
        "evidence": [
          {
            "description": "An outbound HTTP POST request is observed from an internal host to a destination host, URI, or IP address that matches an entry on a threat intelligence feed of known malicious webhook endpoints.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., proxies, firewalls), DNS resolvers, Cloud Access Security Broker (CASB) logs",
            "action": [
              "Symbolic: Ingest threat intelligence feeds for malicious domains, URLs, and IP addresses associated with webhook abuse. Create a watch list. Join Zeek http.log records on the `uid` field with Zeek conn.log records. Alert when the `host` field from http.log, `uri` field from http.log, or `id.resp_h` field from conn.log matches an entry in the watch list.",
              "Statistical: For domains associated with legitimate webhook services (e.g., discord.com, hooks.slack.com), calculate the Shannon entropy of the URI path for all observed POST requests to establish a baseline distribution. A URI path with an entropy score in the top percentile (e.g., > 95th percentile) may indicate a randomly generated, adversary-controlled endpoint and should be flagged for review.",
              "Machine Learning: Train a logistic regression classifier on features extracted from HTTP POST requests, including URI length, URI entropy, destination domain, User-Agent string, and presence of keywords like 'api' or 'webhook'. Use a labeled dataset of known-benign and known-malicious webhook traffic to classify new requests. Flag requests classified as malicious with a probability score greater than 0.8 for immediate investigation."
            ]
          },
          {
            "description": "A process creation event is observed for a command-line utility (e.g., curl.exe, powershell.exe, bitsadmin.exe) with arguments that specify an HTTP POST method and an outbound URL, often including a file or piped data as the payload.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, servers (especially web and application servers), development environments, and CI/CD pipeline runners",
            "action": [
              "Symbolic: From Windows Event ID 4688 logs, create a rule to detect process creations for `curl.exe`, `wget.exe`, `bitsadmin.exe`, and `powershell.exe`. Use regular expressions on the command-line arguments to find patterns indicative of webhook usage, such as `-X POST`, `--data`, `Invoke-RestMethod -Method Post`, and URLs containing 'discord.com/api/webhooks' or 'hooks.slack.com'. Generate an alert on any match.",
              "Statistical: For each host, establish a baseline of normal command-line argument patterns for common utilities like `curl.exe` and `powershell.exe`. Calculate the frequency of argument n-grams (e.g., bi-grams, tri-grams). An execution involving a statistically rare n-gram (e.g., a frequency below the 1st percentile) such as `Invoke-RestMethod` followed by `-InFile` on a system where this is not standard practice, should be flagged as anomalous.",
              "Machine Learning: For each host or host group, train a One-Class Support Vector Machine (SVM) model on benign command-line invocations from Windows Event ID 4688. Feed new process creation events into the model. The model will identify command lines that deviate significantly from the learned 'normal' behavior, flagging them as outliers for investigation without relying on predefined signatures."
            ]
          },
          {
            "description": "An outbound HTTP POST request to a webhook service domain is observed with a payload Content-Type header indicating data archival (e.g., `application/zip`) or a body containing high-entropy data, suggesting encoding or encryption, and a size that is anomalous for the source host.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Data Loss Prevention (DLP) systems, servers hosting sensitive data (e.g., databases, file shares)",
            "action": [
              "Symbolic: From Zeek http.log, filter for all POST requests. Create a watch list of suspicious `Content-Type` headers such as `application/zip`, `application/x-rar-compressed`, `application/x-7z-compressed`, and `application/octet-stream`. Alert on any request that has a matching content type and is also directed to a known webhook provider domain (e.g., `discord.com`, `slack.com`).",
              "Statistical: For all outbound HTTP POST requests where the body is available, calculate the Shannon entropy of the first 4096 bytes. Establish a baseline entropy distribution for typical traffic. Flag any request with an entropy score exceeding a high threshold (e.g., a value > 7.5 for 8-bit bytes, indicative of compressed or encrypted data) for further analysis.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., ARIMA or LSTM) on the volume of data transferred via POST requests, segmented by `Content-Type` and source host. A sudden, anomalous spike in the data volume for a `Content-Type` like `application/octet-stream` from a specific host would indicate a potential large-scale exfiltration event that breaks from its established baseline."
            ]
          },
          {
            "description": "A specific internal host shows a statistically significant increase in the count, total data volume, or average size of outbound HTTP POST requests to external webhook or collaboration service domains when compared to its own 30-day rolling baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal host subnets, Virtual Private Network (VPN) concentrators, and servers with direct internet access",
            "action": [
              "Symbolic: Define a rule that alerts if any single host's count of POST requests to known webhook domains exceeds its 24-hour rolling average by 300% within a one-hour window. This threshold should be tuned based on an initial analysis of network traffic patterns.",
              "Statistical: For each source IP address, create a 30-day rolling profile of the daily volume (sum of `orig_bytes` from Zeek conn.log for POSTs) and count of outbound POST requests. Use the Interquartile Range (IQR) method to detect daily outliers. Flag any day where a host's POST request count or volume exceeds $$ Q3 + 1.5 \\times IQR $$ of its baseline.",
              "Machine Learning: Implement a time-series forecasting model (e.g., Prophet) for each host's outbound POST request volume to webhook domains. The model will learn seasonality (e.g., time of day, day of week) and predict the expected volume for the next hour. If the actual observed volume significantly exceeds the model's prediction interval (the `yhat_upper` value), generate an anomaly alert."
            ]
          },
          {
            "description": "A sequence of events is observed on a single host within a 10-minute window: 1) process creation for an archiving utility (e.g., 7z.exe, tar.exe), followed by 2) an outbound HTTP POST request to a domain that is rarely visited by other hosts in the organization.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Staging servers, developer workstations, CI/CD pipeline runners, and any host with both sensitive data access and direct internet connectivity",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when a Windows Event ID 4688 for an archiving tool (`7z.exe`, `rar.exe`, `tar.exe`, `zip.exe`) is logged from a host, and is followed within 5 minutes by the same host initiating an HTTP POST request (from Zeek http.log) to any external destination. Alert on this sequence for manual review.",
              "Statistical: Maintain a 30-day rolling list of all domains resolved by internal hosts from Zeek dns.log. Calculate the prevalence for each domain, defined as the number of unique internal hosts that query it. Enhance the symbolic rule by assigning a high risk score if the destination domain of the subsequent POST request falls in the bottom 5th percentile of prevalence, indicating it is an uncommon destination for the organization.",
              "Machine Learning: Use a sequence analysis model, such as a Hidden Markov Model (HMM), to detect anomalous state transitions. Train the model on event sequences from hosts (e.g., process creations, file modifications, network connections). An alert is generated when the model observes a high-probability transition from a 'Data Staging' state (archive process creation) to an 'Exfiltration' state (outbound POST to a low-prevalence domain), as this learned sequence would be highly anomalous compared to benign activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]