[
  {
    "information_requirement": "Has the adversary attempted to evade defenses by disabling or modifying the system firewall? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.004",
        "name": "Disable or Modify System Firewall",
        "evidence": [
          {
            "description": "A process with a file hash matching a known malicious indicator executes, and this event is temporally correlated with subsequent firewall modification activity (e.g., command line, registry, or service changes) on the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Windows Event ID 4657",
              "Windows Event ID 7036",
              "Windows Event ID 7040"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Domain Controllers, Virtualization Hosts (Hypervisors)",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process creation event (Windows Event ID 4688) with a file hash on a threat intelligence blocklist is followed within 5 minutes on the same host by a firewall modification command (e.g., `netsh`), a firewall registry key modification (Event ID 4657), or a firewall service stop (Event ID 7036).",
              "Statistical: For any process matching a malicious hash, analyze the parent-child process relationship. Calculate the rarity of this relationship across the environment using a historical baseline. A rare pairing, such as `services.exe` spawning a process with a malicious hash that then modifies the firewall, significantly increases the alert's priority.",
              "Machine Learning: Utilize a pre-trained classification model (e.g., Gradient Boosting) that uses process metadata (file hash, parent process name, command line arguments) and subsequent host events (registry/service changes) as features to predict the likelihood of a firewall evasion attempt. A high probability score from the model triggers an automated host quarantine action."
            ]
          },
          {
            "description": "The command line of a newly created process contains specific strings or patterns associated with disabling or modifying the system firewall using native utilities like `netsh.exe`, PowerShell cmdlets, or `esxcli`.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Domain Controllers, Virtualization Hosts (Hypervisors)",
            "action": [
              "Symbolic: Create a detection rule that searches process command lines (Windows Event ID 4688) and PowerShell script block logs (Event ID 4104) for regular expressions matching firewall modification commands, such as `netsh advfirewall set .* state off`, `Set-NetFirewallProfile -Enabled False`, `New-NetFirewallRule -Action Allow`, or `esxcli network firewall set --enabled false`.",
              "Statistical: For each host and user, establish a baseline of normal administrative command usage frequency. Monitor for statistically significant deviations (e.g., >3 standard deviations from the mean) in the rate of firewall modification commands. Additionally, calculate the entropy of command-line arguments for `netsh.exe` or `Set-NetFirewallProfile`; a sudden spike in argument complexity is anomalous.",
              "Machine Learning: Train a sequence-based model, such as a Long Short-Term Memory (LSTM) network, on historical command-line activity per user and host. Flag any command sequence containing a firewall modification command that the model identifies as having a low probability (i.e., is anomalous) for that specific user/host context."
            ]
          },
          {
            "description": "A modification is detected in a Windows Registry key under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy`, or the Windows Defender Firewall service (mpssvc) is stopped (Event ID 7036) or its start-up type is changed to disabled (Event ID 7040).",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 7040",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User Workstations, Critical Application Servers",
            "action": [
              "Symbolic: Alert on any modification event (Windows Event ID 4657) to registry keys under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\`. Also, alert on any event where the `mpssvc` service enters a 'Stopped' state (Event ID 7036) or its start type is changed (Event ID 7040), unless the event is correlated with an approved change request ticket.",
              "Statistical: Profile the frequency of registry modifications and service state changes per host. Use a Z-score to detect an anomalous spike in the number of `HKLM\\...\\FirewallPolicy` modifications on a host within a short time window (e.g., 5 minutes). A score greater than 3.0 warrants investigation.",
              "Machine Learning: Use an anomaly detection model, such as an Isolation Forest, trained on vectors of host event data (registry changes, service changes, process creations). Feed event sequences into the model to identify outliers. An event sequence scored as a significant outlier that involves firewall registry keys or services should be flagged as highly suspicious."
            ]
          },
          {
            "description": "A host-based firewall modification event (e.g., command execution, registry change) is temporally correlated with a subsequent network connection from that same host on a port that is statistically uncommon for that host or its network segment.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Windows Event ID 4657",
              "Windows Event ID 7036",
              "Windows Event ID 7040",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, Internal Network Segments, Host-based firewalls",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a firewall modification event (e.g., `netsh` command in Event ID 4688) is observed on a host, and within the next 5 minutes, a new outbound connection (Zeek conn.log) is seen from that host's IP on a port listed on a watchlist of high-risk or known C2 ports (e.g., 4444, 6667, 1337).",
              "Statistical: For each host, create a baseline of common destination ports from Zeek conn.log. Following a detected firewall modification event on a host, monitor its subsequent outbound connections. If a connection is made to a destination port that falls outside the 99th percentile of common ports for that host, flag the event sequence as suspicious.",
              "Machine Learning: Use a time-series cross-correlation model to analyze two event streams: 1) host-based firewall modification events and 2) network connection events. The model should identify instances where a firewall modification event is a statistically significant leading indicator of a subsequent anomalous network connection, raising an alert for the linked events."
            ]
          },
          {
            "description": "A host exhibits a sudden and sustained increase in the count of unique listening ports or the count of successful inbound connections from unique source IPs, deviating from its established network baseline and suggesting a firewall has been disabled or misconfigured.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, DMZ Network Segment, Server Farm Network Segment",
            "action": [
              "Symbolic: Create a rule that triggers when a successful inbound connection (`conn_state`='SF' in Zeek conn.log) is observed to a host on a destination port that is not on a pre-approved allow-list for that host or its network segment. This requires maintaining an inventory of expected open ports for critical assets.",
              "Statistical: For each host, compute a 30-day moving average and standard deviation for the hourly count of unique listening ports and unique inbound source IPs seen in Zeek conn.log. Generate an alert if either metric exceeds 3 standard deviations above its moving average for a sustained period (e.g., 1 hour).",
              "Machine Learning: Apply a clustering algorithm, such as DBSCAN, to hosts based on their network traffic profiles (vectors of features like port entropy, connection count, protocol mix). A host that suddenly migrates from a 'stable server' cluster to an 'anomalous high-traffic' cluster or is newly classified as a noise point should be investigated for a potential firewall state change."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]