[
  {
    "information_requirement": "Has an adversary disabled or modified cloud logging capabilities to evade detection?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.008",
        "name": "Disable or Modify Cloud Logs",
        "evidence": [
          {
            "description": "A network connection to a cloud provider's management API endpoint from a source IP address listed on a threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed",
              "Cloud Provider IP Ranges"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway and network egress points",
            "action": [
              "Create a correlation rule that joins Zeek conn.log records with a threat intelligence feed of known malicious IPs. Generate an alert if a source IP from the feed is observed connecting to a destination IP within the published IP ranges for AWS, Azure, or GCP management API endpoints.",
              "For all connections to cloud API endpoints, calculate a 30-day baseline for source country and Autonomous System Number (ASN) frequency. Generate an alert for any connection originating from a country or ASN that falls in the bottom 5th percentile of frequency for that specific API endpoint, indicating a rare origin.",
              "Train a classification model, such as a Random Forest, on enriched Zeek conn.log data. Use features including source ASN, geographic location, time of day, connection duration, and threat intelligence reputation to predict the probability that a connection to a cloud API endpoint is malicious. Generate an alert on connections with a high probability score."
            ]
          },
          {
            "description": "An HTTP request or TLS session containing API call strings related to disabling or modifying logs (e.g., 'DeleteTrail', 'StopLogging', 'UpdateSink', 'diagnostic-settings/delete') directed at a known cloud provider management endpoint.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, forward proxies, and cloud access security brokers (CASB)",
            "action": [
              "Create a detection rule that uses regular expressions to search Zeek http.log 'uri' fields and Zeek ssl.log 'server_name' fields for API call names related to disabling logs (e.g., /(DeleteTrail|StopLogging|UpdateTrail|diagnostic-settings.delete|projects.sinks.update)/i). Generate a high-severity alert on any match.",
              "For each user role, calculate a baseline frequency for all observed cloud API calls. Calculate the Shannon entropy of API call sequences within user sessions. Flag any session that includes a rare log-modification API call and has an unusually low entropy score, suggesting a scripted, non-interactive sequence.",
              "Develop a sequence-based anomaly detection model, such as an LSTM Autoencoder, trained on normal sequences of API calls for each user role. Feed real-time API call sequences into the model and generate an alert if the reconstruction error is high, indicating a deviation from normal behavior like an adversary inserting a 'DeleteTrail' call into a standard workflow."
            ]
          },
          {
            "description": "A sustained drop in the volume of incoming logs from a specific cloud data source (e.g., AWS CloudTrail) that significantly deviates from the established historical baseline for that time of day and is not correlated with a scheduled maintenance window.",
            "data_sources": [
              "AWS CloudWatch Metrics",
              "Azure Monitor Metrics",
              "GCP Cloud Monitoring",
              "SIEM internal performance logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM/Log aggregation platform and Cloud provider monitoring dashboards (e.g., AWS CloudWatch)",
            "action": [
              "Create a 'heartbeat' rule that expects at least one log from each critical cloud source (e.g., AWS CloudTrail, Azure Activity Logs) every 15 minutes. If no log is received within the time window and it is outside a known maintenance period, trigger an alert for a potential log stoppage.",
              "For each cloud log source, calculate a 30-day rolling average and standard deviation of log volume per hour. Generate an alert if the current hour's volume drops more than 3 standard deviations below the average for that specific hour and day of the week for a sustained period (e.g., 3 consecutive 15-minute intervals).",
              "Implement a time series forecasting model, such as ARIMA or Prophet, for each cloud log source's data volume. Configure the model to predict the expected log volume and a confidence interval for the next hour. Generate an alert if the actual observed volume falls significantly below the model's predicted confidence interval."
            ]
          },
          {
            "description": "A process creation event on an endpoint executing a cloud CLI command with arguments for disabling or modifying logging (e.g., 'aws cloudtrail stop-logging'), especially when executed by a non-administrative user or on a non-administrative workstation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Active Directory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrator workstations, developer endpoints, and CI/CD servers",
            "action": [
              "Create a correlation rule that triggers when a Windows Event ID 4688 event shows a process (e.g., aws.exe, az.cmd, gcloud.cmd) with a command line containing keywords like 'delete-trail', 'stop-logging', or 'sinks.delete'. Enrich the event with user group membership from Active Directory and generate a high-severity alert if the user is not in a pre-defined 'Cloud Administrators' group.",
              "Profile the command-line arguments used with cloud CLI tools for each user. Calculate the rarity of each command and argument pair based on historical data. Flag for review any user executing a command that is in the bottom 5th percentile of frequency for their user role (e.g., a user in the 'Marketing' group executing 'az monitor diagnostic-settings delete').",
              "Implement a peer group analysis model by clustering users based on their command-line activity vectors (e.g., using TF-IDF on commands and arguments). Flag a user as an outlier if they execute a log-modification command that is common for a different cluster (e.g., 'Cloud SREs') but highly anomalous for their own cluster (e.g., 'Sales Engineers')."
            ]
          },
          {
            "description": "A confirmed cloud log modification alert for a specific user or host, immediately followed by other high-risk activity originating from the same entity within a 60-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "SIEM Alerts"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM alert database and high-value asset endpoints",
            "action": [
              "Create a meta-alert rule in the SIEM. If an alert for 'Cloud Log Tampering' fires for a specific user or host, automatically increase the risk score of all subsequent alerts from that same entity by 50 points for the next 24 hours. A cumulative score exceeding a predefined threshold should trigger an incident.",
              "Upon detecting a log modification event, initiate a focused statistical analysis on the associated user and host. Compare their network traffic volume (sum of bytes_out in Zeek conn.log) and process creation count (count of Windows Event ID 4688) in the hour after the event to their historical hourly baseline. An increase exceeding the 99th percentile indicates likely malicious follow-on activity.",
              "Implement a graph-based analysis model where nodes represent assets (users, hosts) and edges represent activities (logins, API calls). When a 'log tampering' edge is added to the graph, instruct the model to re-evaluate the risk of all connected nodes and predict the most likely next-hop in an attack path (e.g., 'IAM Role Creation' or 'Data Exfiltration to S3') to direct proactive threat hunting."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]