[
  {
    "information_requirement": "Is the adversary attempting to impact system availability by wiping disk structures?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1561.002",
        "name": "Disk Structure Wipe",
        "evidence": [
          {
            "description": "A process is created or a service is installed where the executable's file hash or name is present on a threat intelligence feed of known disk-wiping malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Application Servers, Domain Controllers, File Servers, User Workstations",
            "action": [
              "Symbolic: Create a SIEM rule to alert on process creation (Windows Event ID 4688) or service installation (Windows Event ID 7045) where the associated process name or file hash matches a threat intelligence feed of known wiper malware signatures (e.g., Shamoon, StoneDrill, NotPetya).",
              "Statistical: For each host, establish a baseline of normal process and service names. Calculate the enterprise-wide rarity of each new process or service name using frequency analysis. Alert on executions or installations that are statistically rare (e.g., seen on <0.1% of endpoints) and have names containing high-risk keywords such as 'wipe', 'disk', 'erase', or 'mbr'.",
              "Machine Learning: Train a classification model (e.g., Random Forest, Gradient Boosting) on process execution events, using features such as process name entropy, command-line argument structure, parent process, and user context to classify new processes as benign or potential wiper. Use this model to score and generate alerts on high-probability wiper activity."
            ]
          },
          {
            "description": "A process not on a predefined allowlist attempts to acquire write access to a raw physical disk object, such as `\\\\.\\PhysicalDrive0`.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Boot sectors of critical servers (especially Domain Controllers, Hypervisors) and executive workstations, System partitions",
            "action": [
              "Symbolic: Enable SACLs on physical disk objects and create a SIEM alert for any process not on a strict allowlist (e.g., chkdsk.exe, specific backup agents) that requests write access (e.g., Access Mask containing WRITE_DAC, WRITE_OWNER, or GenericAll) to an object named `\\\\.\\PhysicalDrive*`. This is logged in Windows Event ID 4656 or 4663.",
              "Statistical: Establish a baseline of which processes normally access raw disk objects. Calculate the Z-score for the frequency of access attempts by any given process on a per-host basis. Alert if a process's access frequency exceeds a high threshold (e.g., Z-score > 3) or if a process never before seen accessing these objects appears.",
              "Machine Learning: Develop an anomaly detection model (e.g., Isolation Forest) using features from Windows Event ID 4663/4656, including process name, user account, access mask, and object name. The model learns the normal pattern of raw disk access and flags any significant deviation as a high-risk anomaly indicative of a potential wiper."
            ]
          },
          {
            "description": "A command containing keywords indicative of formatting or erasing a file system (e.g., 'format', 'erase') is executed on a network device.",
            "data_sources": [
              "Network Device AAA Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core Routers, Core Switches, Firewalls, SAN Fabric Switches",
            "action": [
              "Symbolic: Create a high-severity alert for any AAA log entry containing exact command strings such as 'format flash:', 'erase startup-config', or 'write erase'. Correlate this with the executing user account and alert if the user is not in a predefined 'Senior Network Administrators' group.",
              "Statistical: For each network administrator, establish a baseline of command usage frequency and command entropy per session. Alert if a statistically rare and destructive command (e.g., 'format') appears, or if the Shannon entropy of commands run in a session drops significantly, indicating repetitive, potentially automated destructive actions.",
              "Machine Learning: Use a sequence-based anomaly detection model, such as a Long Short-Term Memory (LSTM) network, to analyze the sequence of commands executed by administrators. Flag sequences that deviate from normal administrative workflows, such as a login followed directly by a 'format' command without preceding diagnostic steps (e.g., 'show version', 'show running-config')."
            ]
          },
          {
            "description": "A new service is created for an unsigned kernel-mode driver, and the service name or image path is not on an established allowlist.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 6008",
              "Windows Event ID 5038",
              "Windows Event ID 7000"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Hypervisors, Database Servers, Tier 0 assets",
            "action": [
              "Symbolic: Create an alert when a new service is created (Windows Event ID 7045) for a kernel-mode driver (`ServiceType=0x1`) AND a corresponding Windows Event ID 5038 indicates the driver's image file is unsigned AND the service name is not on an established allowlist of known-good drivers.",
              "Statistical: Calculate the Shannon entropy of the 'Image Path' and 'Service Name' fields for all new driver installations (Windows Event ID 7045). Flag installations whose entropy scores fall in the top or bottom 5th percentile of the historical distribution, indicating algorithmically generated or overly generic names, respectively.",
              "Machine Learning: Use time-series analysis to correlate a spike in unsigned driver installations (Windows Event ID 7045 combined with 5038) with a subsequent increase in unexpected shutdowns (Windows Event ID 6008) across the enterprise to identify a coordinated attack campaign."
            ]
          },
          {
            "description": "A process not on a predefined allowlist modifies or deletes critical boot-related files (e.g., bootmgr, BCD, winload.exe) in system-critical directories.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System partitions (e.g., C:\\Boot), Windows\\System32 directories on all endpoints and servers, Boot Configuration Data stores",
            "action": [
              "Symbolic: Configure File System Object Auditing on critical boot files (e.g., C:\\Boot\\BCD, C:\\Windows\\System32\\winload.exe) and create a SIEM rule to trigger an alert on any DELETE or WRITE_DATA access (Windows Event ID 4663) by any process not on a strict allowlist (e.g., TrustedInstaller.exe, bcdboot.exe).",
              "Statistical: Monitor the rate of modifications (Windows Event ID 4663) to files in critical system directories (e.g., C:\\Boot\\*). Use a sliding window to calculate the moving average and standard deviation of these events per host. Alert if the rate exceeds a dynamic threshold (e.g., >3 standard deviations above the baseline).",
              "Machine Learning: Use graph-based analysis where processes and files are nodes. An attack would manifest as a new or rare process node creating multiple edges (file modifications) to critical file nodes in a short time. Use a community detection algorithm to spot these anomalous subgraphs, especially if they appear across multiple hosts simultaneously."
            ]
          },
          {
            "description": "A single host, following a successful remote login, initiates an anomalous number of outbound SMB or RPC connections to other hosts, consistent with worm-like propagation.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs from Domain Controllers, Network traffic at key network chokepoints, Endpoint process and network logs from server VLANs",
            "action": [
              "Symbolic: Alert when a single source IP generates >10 logon failures (Windows Event ID 4625) across >5 unique hosts within 5 minutes, followed by a successful logon (Windows Event ID 4624), immediately followed by the transfer of a new executable file via SMB (Zeek smb_files.log) or remote process creation (Windows Event ID 4688).",
              "Statistical: For each host, profile the normal fan-out of SMB/RPC connections using Zeek conn.log. A host that suddenly begins connecting to hundreds of other hosts on port 445, exceeding the 99th percentile of its typical hourly unique destination count, is a strong indicator of worm-like propagation.",
              "Machine Learning: Use a Hidden Markov Model (HMM) to identify state transitions. Train the model to recognize the shift from a 'Normal Operations' state (low failed logins, low remote execution) to a 'Wiper Propagation' state (high failed logins, high remote execution, high SMB traffic volume) based on time-series data from network and host logs."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]