[
  {
    "information_requirement": "Is the adversary obtaining capabilities to support their operation?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588",
        "name": "Obtain Capabilities",
        "evidence": [
          {
            "description": "An internal host establishes an outbound network connection where the remote IP address, requested domain, or transferred file hash matches a high-confidence threat intelligence feed of known malware distribution points, exploit kit C2s, or adversarial tool repositories.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, egress firewalls, corporate DNS resolvers, and web proxies",
            "action": [
              "Create and maintain a watch list of malicious indicators (IPs, domains, file hashes) from validated threat intelligence feeds. Continuously join network connection logs (Zeek conn.log), DNS query logs (Zeek dns.log), and file transfer logs (Zeek files.log) against this watch list. Generate a high-priority alert for any observed match.",
              "For all downloaded files identified in Zeek files.log, calculate the Shannon entropy of the filename. Flag filenames with entropy scores in the 99th percentile, as this indicates potential DGA or obfuscation. Separately, establish a baseline of file MIME types downloaded across the enterprise and alert if a user downloads a file with a statistically rare MIME type (e.g., 'application/x-dosexec') that is in the bottom 5% of all observed types.",
              "Develop and apply a time-series forecasting model (e.g., ARIMA or Prophet) for the volume of data transferred from each internal host to external destinations. Generate an anomaly alert for any host where the daily data transfer volume spikes more than three standard deviations above the forecasted value, especially if the destination is a low-reputation IP address or a newly observed domain."
            ]
          },
          {
            "description": "A process is created on a host where the executable's file hash, process name, command-line arguments, or parent-child relationship matches signatures for known adversarial tools (e.g., Cobalt Strike, Metasploit) or Malware-as-a-Service (MaaS) families.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, user workstations, and application servers",
            "action": [
              "Scan all process creation events (Windows Event ID 4688, Sysmon Event ID 1) for command-line arguments matching regular expressions for known malicious tool usage (e.g., `powershell -enc`, `certutil -urlcache`). Additionally, match the process image hash (from Sysmon) against a threat intelligence feed of known malicious tool hashes. Alert on any matches.",
              "For each common parent process (e.g., `winword.exe`, `powershell.exe`, `outlook.exe`), build an enterprise-wide baseline of all child processes it normally creates. Calculate the frequency of each parent-child process relationship. Generate an alert for statistically rare pairings (e.g., `outlook.exe` spawning `cmd.exe`) that fall below a 1% prevalence threshold.",
              "Train a random forest or gradient boosting classifier on process creation events using features such as command-line length, entropy of the command-line, parent process name, process path, and the hash of the executable. Use the trained model to classify new process events in real-time as benign or suspicious, flagging those with a high probability score of being malicious for analyst review."
            ]
          },
          {
            "description": "An SSL/TLS certificate observed in network traffic exhibits multiple suspicious characteristics simultaneously, such as a very recent issuance date, a self-signed issuer, a subject common name that mimics a legitimate service (typosquatting), or a serial number known to be associated with a C2 framework's default configuration.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, encrypted traffic inspection points (e.g., SSL/TLS offloading proxies), internal Certificate Authorities, and DNS resolvers",
            "action": [
              "Query Zeek x509.log and ssl.log for certificates where the issuer string, subject, or serial number matches known C2 framework defaults (e.g., Cobalt Strike's default certificates). Correlate JA3/JA3S hashes from ssl.log against threat intelligence feeds for malicious infrastructure and alert on any match.",
              "For all observed external certificates in x509.log, calculate the Damerau-Levenshtein distance between the certificate's subject common name and a list of your organization's high-value domains. Flag certificates with a small edit distance (e.g., 1 or 2) but an unrecognized issuer. Additionally, alert on non-standard certificates (not from known CAs like Let's Encrypt) with an unusually short validity period (e.g., less than 30 days), as these are in the lower percentile of certificate lifetimes.",
              "Use a clustering algorithm (e.g., DBSCAN) on features extracted from x509.log, such as certificate validity duration, public key algorithm, key length, and subject/issuer attributes. Isolate and investigate anomalous clusters of certificates that deviate from the established norms of legitimate traffic, as these may represent an adversary's campaign-specific certificate generation TTP."
            ]
          },
          {
            "description": "A correlated sequence of events occurs on a single host within a short time window: 1) Download of an executable file from an external IP. 2) Creation of a new process from a user-writable directory (e.g., %PUBLIC%, %APPDATA%\\Local\\Temp), where the process name corresponds to the downloaded file. 3) The new process initiates periodic, low-volume outbound network connections (beaconing).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, public-facing web servers, and egress points to the internet",
            "action": [
              "Create a SIEM correlation rule that triggers when, for the same hostname within a 5-minute window: a) a file with MIME type 'application/x-dosexec' is logged in Zeek files.log from an external source, b) a process creation event (Sysmon Event ID 1) occurs with a path in a temporary or download directory, and c) the new ProcessGUID from that event makes an outbound connection in Zeek conn.log to a non-corporate IP space.",
              "For all outbound connections from non-browser processes, calculate the standard deviation of the inter-arrival time ('jitter') and the byte size for each source-destination pair over a rolling 24-hour period. Flag potential C2 beaconing by identifying connections with a low standard deviation in both metrics (e.g., below the 10th percentile), indicating periodic and uniformly sized callbacks.",
              "Implement a sequence analysis model, such as a Hidden Markov Model (HMM), trained on labeled benign and malicious event sequences (file download -> process execution -> network connection). Feed real-time, correlated event streams (e.g., from Zeek and Sysmon) into the model to calculate the probability that an observed sequence matches a known malicious TTP. Alert when this probability crosses a predefined confidence threshold."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]