[
  {
    "information_requirement": "Is an adversary acquiring or configuring serverless infrastructure for operational use against our organization? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.007",
        "name": "Serverless",
        "evidence": [
          {
            "description": "An internal host establishes a network connection with a serverless domain (e.g., *.workers.dev, *.lambda-url.*.on.aws, *.run.app) or IP address present on a high-confidence threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, Network Egress Points",
            "action": [
              "Ingest high-confidence threat intelligence feeds identifying malicious serverless domains and IPs into a watchlist. Create a real-time rule that joins Zeek conn.log (id.resp_h) and dns.log (query, answers) against this watchlist. Generate a high-priority alert for any match.",
              "For each internal host, profile the number of distinct serverless domains contacted per hour. Calculate a 30-day baseline of this metric. Alert if a host contacts a number of new or unique serverless domains that exceeds the 99th percentile of its own baseline or the organizational baseline.",
              "Deploy a pre-trained classification model (e.g., Random Forest) that uses lexical features of a domain (e.g., entropy, length, n-grams, character distribution) to score the probability of a queried serverless domain being malicious. Escalate domains with a score above a defined threshold (e.g., > 0.85) for analyst investigation."
            ]
          },
          {
            "description": "Execution of a cloud command-line interface (CLI) tool (e.g., aws.exe, gcloud.cmd, wrangler.exe, az.cmd) with parameters indicative of deploying or modifying a serverless function, where the execution originates from a non-standard host or by a non-privileged user account.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer Workstations, CI/CD Pipeline Servers, Administrator Endpoints, Endpoint Process and Authentication Logs",
            "action": [
              "Monitor Windows Event ID 4688 for process creations of cloud CLIs. Alert if the command line contains keywords like 'deploy', 'publish', 'create-function', 'update-function-code' combined with arguments that enable public/unauthenticated access (e.g., '--allow-unauthenticated'), and the process is initiated by a user (correlated via Windows Event ID 4624) not in a predefined 'Cloud Administrators' or 'Developers' Active Directory group.",
              "For each execution of a cloud CLI, calculate the Shannon entropy of the command-line arguments string. Establish a baseline entropy score for legitimate deployment commands within the organization. Alert when a command's entropy deviates by more than 3 standard deviations from the mean, which may indicate obfuscated or randomized script content.",
              "Implement a time-series anomaly detection model (e.g., Seasonal-ARIMA) to monitor the frequency of cloud CLI executions per host and per user. Flag any host or user that exhibits a sudden spike in CLI usage that is anomalous compared to its own historical data, especially outside of standard business hours or on systems not designated for development."
            ]
          },
          {
            "description": "A user authentication to a serverless platform's management console or API from a statistically anomalous source (e.g., rare geolocation, new ISP) is followed by the creation of a serverless function and subsequent network traffic to that function's new endpoint within a short time window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, Endpoint Process Logs, Network Egress Points, DNS Resolvers",
            "action": [
              "Create a correlation rule to detect a sequence where a user login (Windows Event ID 4624) from a non-corporate IP is followed by access to a cloud management console domain (e.g., 'console.aws.amazon.com', 'console.cloud.google.com') identified in Zeek dns.log, and then the execution of a cloud CLI deployment command (Windows Event ID 4688), all within a 15-minute window.",
              "For each user account, build a baseline of typical source IP geolocation (country, ASN) and time-of-day for cloud console access. Use a modified Z-score on the rarity of the geolocation/ASN combination to detect logins from statistically improbable locations. A high score (e.g., > 3.5) indicates a potential account compromise and should be escalated.",
              "Employ a sequence analysis model (e.g., Hidden Markov Model) trained on legitimate administrative activity sequences (login -> console access -> CLI usage -> logout). Use the model to score new sequences of events and detect anomalous state transitions, such as an unusual login event followed by a function deployment event and then immediate outbound connections to a newly created serverless URL, as a high-probability malicious sequence."
            ]
          },
          {
            "description": "An internal host initiates highly periodic, low-volume outbound network connections to a single, non-categorized or newly observed serverless endpoint, characteristic of command-and-control beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstation Subnets, Server Subnets, Internet Gateway, Critical Asset Subnets, DNS Resolvers",
            "action": [
              "Alert when an internal host makes a connection to a serverless endpoint (e.g., '*.workers.dev', '*.run.app') where the DNS query is for a domain not previously seen in the last 30 days across the enterprise, and the connection is not over a standard web port (80/443).",
              "For each source-destination pair involving a serverless endpoint, calculate the standard deviation of the inter-arrival time between connections and the standard deviation of the bytes sent ('orig_bytes' in Zeek conn.log) over a 24-hour window. Flag connections where both metrics are exceptionally low (e.g., in the bottom 5th percentile organization-wide) as potential machine-generated, periodic beaconing.",
              "Apply a Fast Fourier Transform (FFT) to the time series of connection events for each host communicating with a serverless endpoint. A resulting frequency spectrum with a single, strong peak indicates highly periodic behavior. Use a clustering algorithm (e.g., DBSCAN) on features like connection frequency (from FFT), data volume variance, and destination domain prevalence to group and identify outlier hosts exhibiting this beaconing behavior."
            ]
          },
          {
            "description": "A data transfer from an internal host to a serverless endpoint exhibits a statistically significant deviation in volume, frequency, or pattern from an established baseline of legitimate cloud service usage for that host or user group.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data Center Egress Points, Servers Hosting Sensitive Data, Internet Gateway, User Workstation Subnets",
            "action": [
              "Create a rule to alert on any HTTP POST or PUT request to a serverless endpoint URL where the request body size ('bytes' in http.log) exceeds a static threshold (e.g., 100MB) and originates from a host not on a pre-defined list of systems authorized for large cloud uploads.",
              "For each internal host, establish a historical baseline (e.g., 30-day rolling average and standard deviation) of total daily data volume uploaded ('orig_bytes' in conn.log) to serverless endpoints. Alert if a host's daily upload volume exceeds 3 standard deviations from its average, or if a single connection's size exceeds the 99th percentile of all its past connections.",
              "Train a one-class SVM (Support Vector Machine) or an autoencoder on a feature set from legitimate traffic to serverless endpoints (e.g., request/response sizes, session duration, user agent, MIME type from http.log). Use the trained model to score all new connections and flag those identified as anomalies, which could represent data exfiltration or non-standard C2 communications."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]