[
  {
    "information_requirement": "Is the adversary acquiring or staging digital certificates for future operations?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588.004",
        "name": "Digital Certificates",
        "evidence": [
          {
            "description": "An observed SSL/TLS certificate's attributes (e.g., thumbprint, serial number, subject) exactly match an entry in a threat intelligence feed of known-malicious certificates.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, Forward Web Proxies, Threat Intelligence Platform",
            "action": [
              "Create a SIEM rule to generate a high-severity alert when an observed certificate thumbprint from Zeek ssl.log matches a list of known-malicious thumbprints from an ingested Cyber Threat Intelligence (CTI) feed.",
              "For any CTI-matched certificate, analyze the associated connection in Zeek conn.log. Calculate the entropy of the Server Name Indication (SNI) field; a value in the 95th percentile or higher for the environment suggests potential DGA. Additionally, calculate the ratio of inbound to outbound bytes; a high ratio is anomalous and may indicate data staging.",
              "Feed features from CTI-matched events (e.g., CTI source reputation, connection duration, total bytes, protocol, SNI entropy, destination port) into a pre-trained supervised classification model (e.g., XGBoost, Logistic Regression) that distinguishes true positive from false positive CTI alerts. Automatically escalate events with a model confidence score above 0.9 for immediate analyst review."
            ]
          },
          {
            "description": "An SSL/TLS certificate is observed where the Subject Common Name (CN) or a Subject Alternative Name (SAN) is a suspected typosquat or homoglyph of the organization's domain, or is for a dynamic DNS hostname and issued by a free Certificate Authority (CA).",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, Forward Web Proxies, Internal DNS Resolvers",
            "action": [
              "Create a SIEM rule that triggers when a certificate's issuer in Zeek ssl.log is on a watchlist of free CAs (e.g., Let's Encrypt, ZeroSSL) AND the certificate's CN or SAN matches a regular expression for common dynamic DNS providers (e.g., '.*\\\\.duckdns\\\\.org', '.*\\\\.no-ip\\\\.com').",
              "For all externally-facing certificates observed in Zeek ssl.log, calculate the Levenshtein distance between the certificate's domain (from the CN/SAN) and a master list of the organization's official domains. Flag any certificate for a domain with a distance between 1 and 3 for manual review as a potential typosquat.",
              "Train a recurrent neural network (RNN) or other character-level NLP model on a large dataset of benign and malicious (e.g., DGA, phishing) domain names. Feed all new CNs and SANs from Zeek ssl.log into the model. Use the model's output score to classify the likelihood of the domain being malicious and alert on scores exceeding a predefined confidence threshold."
            ]
          },
          {
            "description": "Anomalous SSL/TLS certificate characteristics are observed, such as an unusually short validity period (e.g., under 90 days), issuance by a rarely seen Certificate Authority, or a certificate issued for a domain with a very recent registration date.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, Threat Intelligence Platforms, SIEM/Data Analytics Platform",
            "action": [
              "Create a SIEM rule that enriches domains from Zeek ssl.log with WHOIS registration data. Alert when a certificate from a free CA is used for a domain whose registration date is less than 7 days old.",
              "Maintain a rolling 30-day baseline of all certificate issuers and their frequency. Alert on any certificate issued by a CA that falls into the bottom 5th percentile of frequency. Similarly, create a baseline for certificate validity periods and alert on any certificate with a validity period in the bottom 10th percentile (e.g., less than 30 days).",
              "Employ an unsupervised anomaly detection model (e.g., Isolation Forest) on a feature set derived from Zeek x509.log and WHOIS enrichment. Use features such as `validity_period_days`, `domain_age_days`, `number_of_sans`, `public_key_length`, and `is_free_ca`. The model will score each certificate's anomalousness, with high scores indicating potential adversary infrastructure."
            ]
          },
          {
            "description": "An unusual increase in the volume of self-signed certificates for external communications, or a spike in certificate validation errors (e.g., expired, revoked, name mismatch) on endpoints or servers.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Windows Event ID CAPI2 11",
              "Windows Event ID CAPI2 21",
              "Windows Event ID CAPI2 30",
              "Windows Event ID CAPI2 41",
              "Windows Event ID CAPI2 53"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, Internal Server Segments, Domain Controllers, All Windows Endpoints and Servers",
            "action": [
              "From Zeek ssl.log, create a high-severity alert for any TLS connection to a public IP address where the `validation_status` is 'selfsigned'. Correlate this network event with Windows CAPI2 Event ID 53 (Successful addition of a root certificate) on the source host within a 5-minute window.",
              "For each distinct validation error type in Zeek ssl.log (e.g., 'certificate_expired', 'bad_certificate_hash') and CAPI2 logs, establish a baseline of daily occurrences per host and globally. Alert when the count for any error type exceeds its 99th percentile, indicating an abnormal spike.",
              "Implement a time series anomaly detection model (e.g., SARIMA, Prophet) on the aggregate volume of certificate validation errors observed at the network edge (Zeek ssl.log) and across the endpoint fleet (CAPI2 logs). The model will learn normal daily and weekly patterns. Generate an alert when the observed error count deviates significantly from the predicted pattern."
            ]
          },
          {
            "description": "A single suspicious SSL/TLS certificate is reused across multiple unrelated IP addresses, or multiple distinct suspicious certificates (e.g., from free CAs, for young domains) are observed resolving to a single IP address.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, SIEM/Data Analytics Platform, Graph Database Platform",
            "action": [
              "Create a SIEM rule that tracks certificate thumbprints from Zeek x509.log. If a single, non-CDN thumbprint is seen being served by more than five distinct destination IP addresses over a 7-day period, generate an alert for potential adversary infrastructure reuse.",
              "For every destination IP address seen in Zeek conn.log, count the number of unique certificate subjects (ssl.log subject field) it serves over a 24-hour window. Establish a baseline for this count across all servers. Alert on any IP address where the unique subject count exceeds the 99th percentile, which could indicate a malicious server hosting many unrelated sites.",
              "Construct a graph where nodes are IP addresses, Certificate Thumbprints, and Subjects. Create edges representing observed relationships ('IP serves Thumbprint', 'Thumbprint has Subject'). Apply a community detection algorithm (e.g., Louvain Modularity) to find clusters of related infrastructure. Score each resulting community based on the proportion of nodes with suspicious attributes (e.g., free issuer, recent domain registration, high subject entropy) to prioritize investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]