[
  {
    "information_requirement": "Is the adversary developing resources by acquiring or creating email accounts for use in targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.002",
        "name": "Email Accounts",
        "evidence": [
          {
            "description": "An inbound email contains a sender address, domain, link, or attachment hash that matches an entry on a high-confidence threat intelligence feed of known malicious indicators.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek http.log",
              "Zeek files.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Web Proxy, DNS Resolver, Network Egress Points",
            "action": [
              "Symbolic (IOC Match): Continuously correlate sender addresses, domains, and source IPs from Zeek smtp.log, URLs from Zeek http.log, and file hashes from Zeek files.log against a threat intelligence feed of known malicious indicators. Generate a high-priority alert on any match.",
              "Statistical: For all inbound emails, calculate the percentile rank of the sender's domain reputation score provided by a CTI feed. Flag emails from domains in the bottom 5th percentile for review, especially if the email contains a URL or attachment, as this indicates a statistically rare and potentially risky sender.",
              "Machine Learning (Classification): Train a classification model (e.g., Random Forest) on features extracted from email metadata (sender, headers), linked URLs (domain age, reputation), and attachment properties (file type, entropy). Use the model to predict the probability of an email being malicious. Emails exceeding a high probability threshold (e.g., > 0.9) are flagged for automated quarantine or analyst review."
            ]
          },
          {
            "description": "An inbound email (Zeek smtp.log) or internal DNS query (Zeek dns.log) involves a domain that has a Levenshtein distance of 1 or 2 from the organization's or a trusted partner's domain, indicating potential typosquatting.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Email Gateway",
            "action": [
              "Symbolic (IOC Match): Generate a list of potential typosquatted and combosquatted domains targeting the organization using a permutation tool. Continuously monitor Zeek dns.log and Zeek smtp.log for any communication with these domains and generate a high-priority alert on any match.",
              "Statistical: For all newly observed sender domains (smtp.log) and resolved domains (dns.log), calculate the Levenshtein distance to a curated list of legitimate company and partner domains. Flag any non-allowlisted domain with a distance of 1 or 2 for review. Concurrently, calculate the Shannon entropy of the character distribution for all requested FQDNs; flag domains with entropy scores exceeding 3 standard deviations above the population mean, as this indicates potential DGA or other algorithmic generation.",
              "Machine Learning (Classification): Develop and deploy a pre-trained or custom-trained NLP classification model to analyze domain names for linguistic anomalies. The model should be trained to recognize patterns such as omitted letters, added characters, homoglyphs, or combosquatting structures (e.g., 'company-support.com'). Classify all newly observed domains as 'legitimate' or 'suspicious' and submit suspicious domains for analyst review."
            ]
          },
          {
            "description": "A domain registered within the last 30 days sends a volume of emails to internal recipients that exceeds the 95th percentile for new domains, and targets more than one user identified as an executive or in a sensitive role.",
            "data_sources": [
              "Zeek smtp.log",
              "WHOIS Lookup Data",
              "HR Information System"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, External Threat Intelligence Platforms, Identity and Access Management System",
            "action": [
              "Symbolic (IOC Match): For every inbound email in Zeek smtp.log, perform a WHOIS lookup on the sender domain. If the domain's creation date is within the last 30 days and the domain is not on a pre-approved allowlist, flag the email for further analysis.",
              "Statistical: Establish a 90-day rolling baseline of known sender domains. For any sender domain not present in the baseline (a 'new' domain), track the number of unique internal recipients. Calculate the 95th percentile for the number of recipients targeted by a new domain over a 24-hour period. If a new domain exceeds this threshold, especially if the recipients are tagged as high-value targets, generate an alert for a potential targeted campaign.",
              "Machine Learning (Time-Series Anomaly Detection): Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) to monitor the volume of email from all new domains (domains not seen in the last 90 days). The model should identify sudden spikes in email traffic from a single new domain that deviate significantly from the established pattern of new domain communication. Such spikes are indicative of a coordinated campaign and should trigger an alert."
            ]
          },
          {
            "description": "An internal host, particularly a server, initiates outbound connections to more than 5 unique domains associated with disposable email services within a 10-minute window.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Proxy, DNS Resolver, Network Egress Points, Server Subnets",
            "action": [
              "Symbolic (IOC Match): Maintain a curated blocklist of domains and IP addresses associated with free and disposable email providers. Continuously monitor Zeek dns.log and conn.log for any outbound connection attempts to these indicators from servers or restricted subnets where such activity is forbidden by policy. Block the connection and generate a high-priority alert on any match.",
              "Statistical: For each internal host, establish a baseline for the number of unique suspected email provider domains accessed per hour. Use a sliding window (e.g., 10 minutes) and alert if a host connects to a number of unique domains exceeding 3 standard deviations from its own baseline, or a hard threshold (e.g., >5 unique domains), to detect outlier behavior indicative of automated account creation or testing.",
              "Machine Learning (Clustering): Employ a clustering algorithm (e.g., DBSCAN) on network connection metadata from Zeek conn.log (e.g., connection duration, bytes sent/received, destination port, JA3/JA3S hash). The objective is to group connections into behavioral clusters like 'normal web browsing' or 'API traffic'. Monitor for the emergence of new, distinct clusters characterized by short, repetitive, low-volume connections to multiple unrelated domains, a pattern consistent with automated scripts used for account creation."
            ]
          },
          {
            "description": "A successful authentication event (Windows Event ID 4624) is associated with a source IP address (from Zeek conn.log) that is either on a known anonymizer list or represents a geographic location that would require travel at an impossible speed from the user's previous login location.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "GeoIP Database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., ADFS), VPN Concentrators, Cloud Identity Provider Logs",
            "action": [
              "Symbolic (IOC Match): Correlate the source IP address from successful login events (Windows Event ID 4624) against a continuously updated threat intelligence feed of known malicious IPs, Tor exit nodes, and public anonymizing VPN services. Generate a high-priority alert and initiate an automated response (e.g., session termination, MFA prompt) for any login from a matching IP.",
              "Statistical: For each user account, maintain a historical record of login geolocations and timestamps. Upon each new successful login, calculate the great-circle distance and time difference from the previous login. If the implied velocity exceeds a physically impossible threshold (e.g., 1000 km/h), flag the event as 'impossible travel'. Additionally, maintain a baseline of common source ASNs for each user and flag any login from an ASN that accounts for less than 1% of the user's historical logins.",
              "Machine Learning (Behavioral Anomaly Detection): For each user, train a behavioral anomaly detection model (e.g., One-Class SVM or an autoencoder) on a feature set including time-of-day, day-of-week, source IP geolocation, ASN, and user agent string. The model learns the user's 'normal' login behavior profile. Score each new login against this model; logins classified as anomalies (e.g., high reconstruction error or outside the learned boundary) are flagged as high-risk and escalated for immediate review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]