[
  {
    "information_requirement": "Is the adversary developing resources by compromising DNS servers for use in operations?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.002",
        "name": "DNS Server",
        "evidence": [
          {
            "description": "A DNS query resolves to an IP address on a threat intelligence feed, or an administrative connection is made to a DNS server from an IP address on a threat intelligence feed.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal recursive DNS servers, External-facing authoritative DNS servers, Network egress points, DNS server management consoles",
            "action": [
              "Query Zeek dns.log for responses where the 'answers' field contains an IP address present on a high-confidence malicious IP threat feed. Separately, query Zeek conn.log for connections to DNS servers on management ports (e.g., 22, 3389, 5985, 5986) where the originating IP 'id.orig_h' is on the same threat feed. Alert on any match.",
              "For each domain, establish a baseline of its resolved IPs and their corresponding ASNs. Calculate the historical rarity of each IP-domain-ASN combination. Generate a risk score for DNS resolutions where the IP belongs to a new or rare ASN for that domain (<1st percentile of observation frequency). Aggregate risk scores by internal client IP to identify hosts communicating with multiple high-risk domains.",
              "Deploy a time-series anomaly detection model (e.g., Seasonal-ARIMA) monitoring the volume of DNS resolutions to IPs flagged as 'suspicious' by a reputation provider. A statistically significant spike in volume that deviates from the forecasted seasonal pattern indicates a potential campaign and should trigger an alert."
            ]
          },
          {
            "description": "A DNS zone transfer request (AXFR or IXFR) is initiated from a source IP not on a pre-approved allowlist of secondary DNS servers or administrative hosts.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal recursive DNS servers, External-facing authoritative DNS servers",
            "action": [
              "Create a rule to monitor Zeek dns.log for records where 'qtype_name' is 'AXFR' or 'IXFR'. Compare the source IP ('id.orig_h') of each request against a maintained allowlist of authorized IPs. Generate a high-severity alert for any request from an unauthorized source IP.",
              "Establish a baseline of source IPs that perform AXFR/IXFR requests and their hourly request frequency. An IP not present in the historical baseline making a request is an immediate high-confidence alert. For authorized IPs, a request count in a one-hour window exceeding the 99.5th percentile of their historical hourly activity indicates potential misuse and should be investigated.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) using features such as source IP/ASN, time of day, day of week, and target DNS server, with historical data labeled as 'authorized' or 'unauthorized'. Deploy the model to classify new zone transfer attempts in near real-time, flagging any classified as 'unauthorized'."
            ]
          },
          {
            "description": "The primary DNS service process ('dns.exe' on Windows) spawns an anomalous child process, such as a command shell or scripting engine.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Server infrastructure (both authoritative and recursive), Domain Controller servers (if running DNS role)",
            "action": [
              "Create a detection rule for Windows Event ID 4688 or Sysmon Event ID 1 on all DNS servers. Trigger a high-severity alert if the ParentProcessName is 'dns.exe' and the ProcessName is a known shell or script interpreter (e.g., 'cmd.exe', 'powershell.exe', 'pwsh.exe', 'rundll32.exe', 'cscript.exe', 'wscript.exe').",
              "Profile the parent-child process relationships on DNS servers over a 30-day period. Calculate the frequency of each unique relationship. A new parent-child relationship involving 'dns.exe' as the parent that has never been seen before (frequency of zero) is a high-confidence anomaly and should generate an alert.",
              "Train an unsupervised learning model (e.g., Isolation Forest) on a baseline of normal process execution events (Sysmon Event ID 1) from DNS servers. Use features like parent process, process name, command line arguments, and user context. The model will identify and alert on any process creation event that it scores as a significant outlier."
            ]
          },
          {
            "description": "A successful administrative login to a DNS server occurs from a source IP address that is geographically anomalous or exhibits other rare characteristics for that specific user account.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Server infrastructure, Domain Controllers, VPN concentrators, Network egress points",
            "action": [
              "Correlate successful administrative logins (Windows Event ID 4624, Logon Type 3 or 10) on DNS servers with source IP geolocation data. Alert if the source country is on a deny-list of nations from which administrative access is forbidden.",
              "For each administrative user, create a historical baseline of source IPs, ASNs, and countries from login events. Calculate the frequency of each attribute. A successful login where the source country has not been seen for that user in the last 90 days, or where the ASN is in the bottom 5th percentile of frequency for that user, should trigger a medium-severity alert.",
              "Implement a user-and-entity behavior analytics (UEBA) approach using a clustering algorithm (e.g., DBSCAN) on login event features (time of day, source IP/ASN/country, protocol used). Logins that do not fall into an established 'normal' cluster for a given user are flagged as anomalous and require investigation."
            ]
          },
          {
            "description": "DNS responses for a monitored set of critical external domains resolve to an IP address outside of the domain's historically observed IP space or ASNs, and this is observed across multiple internal clients.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internal recursive DNS servers, Endpoint devices",
            "action": [
              "Maintain a dynamic allowlist of known-good IP ranges and ASNs for critical external domains (e.g., Office 365, company SSO provider). Query Zeek dns.log for any DNS response for these domains that resolves to an IP or ASN not on the allowlist. Alert on any match.",
              "For each critical domain, calculate the Shannon entropy of the set of resolved IP addresses ('answers' field in Zeek dns.log) across all clients over a rolling 5-minute window. A sudden drop in entropy (e.g., > 3 standard deviations below the historical mean for that domain and time of day) indicates a potential hijack to a single malicious IP. Alert on this condition.",
              "Use a time-series forecasting model (e.g., Prophet) to predict the daily count of unique IP addresses resolved for a critical domain. An actual count that falls far outside the model's prediction interval (e.g., a massive increase or decrease) suggests an anomaly like hijacking or domain shadowing and should be flagged for review."
            ]
          },
          {
            "description": "An internal client queries a domain that is either algorithmically generated (DGA) or newly registered (NRD), and which resolves to an IP address with a poor reputation.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Endpoint devices, Internal recursive DNS servers",
            "action": [
              "Enrich Zeek dns.log data with domain registration date (WHOIS) and IP reputation data. Create a rule that alerts when a query is made for a domain where (domain_age < 30 days OR domain_is_dga_flagged = true) AND ip_reputation_category = 'malicious'.",
              "Calculate the Shannon entropy for all queried domain names in Zeek dns.log. Domains with an entropy score above a dynamically calculated threshold (e.g., the 99.7th percentile of all queries in the past hour) are flagged as potentially DGA. If such a domain also resolves to an IP in an ASN from which the organization has never received traffic, generate an alert.",
              "Train a deep learning model, such as a Long Short-Term Memory (LSTM) network, to classify domain names as benign or DGA based on their character sequences. Apply this model to all DNS queries. Domains classified as DGA that also resolve to an IP associated with a high number of other DGA domains (discovered via clustering) should generate a high-priority alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]