[
  {
    "information_requirement": "Has an adversary established communication with compromised external infrastructure for C2, staging, or other operational purposes?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584",
        "name": "Compromise Infrastructure",
        "evidence": [
          {
            "description": "An internal host initiates a network connection to an external IP address, domain, or URL identified as malicious or suspicious by a high-confidence threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways, proxy servers, internal DNS resolvers, and all endpoint devices.",
            "action": [
              "Create and maintain an aggregated watchlist of malicious indicators (IPs, domains, URLs) from all available threat intelligence feeds. Ingest network connection logs (Zeek conn.log, dns.log, http.log; Windows Event ID 5156) and generate a high-severity alert for any connection from an internal host to a destination on the watchlist.",
              "For each source-destination pair, establish a baseline of connection frequency. Calculate a Z-score for the frequency of connections to destinations flagged by threat intelligence. Alert if a host's connection frequency to a flagged destination exceeds a Z-score of 3, indicating an unusual level of interaction with a known-bad entity.",
              "Train a supervised classification model (e.g., Random Forest) using labeled historical data. Features should include connection properties (destination port, protocol, data volume), indicator properties (threat type, confidence score from TI feed), and source host properties (server vs. workstation). Use the trained model to predict the probability that a new connection to a threat intelligence-flagged destination is malicious, and alert on probabilities exceeding 0.90."
            ]
          },
          {
            "description": "A TLS connection from an internal host uses a certificate whose attributes (SHA-1 hash, serial number, subject, or issuer) match a known malicious certificate from a threat intelligence feed.",
            "data_sources": [
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with TLS inspection capabilities, web proxies, and endpoint EDR sensors capable of inspecting TLS traffic.",
            "action": [
              "Maintain a watchlist of malicious certificate attributes (SHA-1 hashes, serial numbers) from threat intelligence feeds. Continuously scan the 'sha1' and 'serial' fields in Zeek ssl.log records. Generate an alert for any connection that uses a certificate matching an entry on the watchlist.",
              "For all observed certificates in Zeek ssl.log, calculate the enterprise-wide prevalence of the 'issuer' and 'subject' fields. Develop a risk score for each connection based on the inverse prevalence (rarity) of these fields. Alert on connections where the risk score exceeds the 99th percentile of all connections observed in a 24-hour period, highlighting unusually rare certificates.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to certificate features extracted from Zeek ssl.log, including validity period length, key algorithm, key length, and entropy of subject and issuer strings. Manually investigate samples from clusters identified as anomalies (noise points) to discover previously unknown malicious infrastructure."
            ]
          },
          {
            "description": "An outbound network connection exhibits anomalous protocol or fingerprint characteristics, such as an application protocol on a non-standard port, a JA3/JA3S hash matching a known threat, or HTTP headers characteristic of a C2 framework.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways, internal network taps, and endpoint devices.",
            "action": [
              "Deploy a ruleset to detect signature-based anomalies: (1) in Zeek conn.log, flag connections where 'service' is 'ssl' and 'id.resp_p' is not 443; (2) in Zeek ssl.log, flag connections where 'ja3' or 'ja3s' hash matches a public or internal list of C2 fingerprints; (3) in Zeek http.log, flag connections where the 'user_agent' or 'server' header matches known C2 tool signatures. Alert on any match.",
              "For each service (e.g., 'ssl', 'http'), calculate the enterprise-wide distribution of destination ports. Use a percentile-based threshold to alert on connections to ports that fall outside the top 99% most common ports for that service, identifying statistically rare port usage.",
              "Train a time-series forecasting model (e.g., Prophet) on the hourly count of connections using non-standard ports for common services (e.g., TLS not on 443). The model will learn normal daily and weekly patterns. Alert when the observed count significantly exceeds the forecasted upper confidence interval, indicating a potential widespread campaign using non-standard ports."
            ]
          },
          {
            "description": "An internal host resolves a domain that is either algorithmically generated (DGA), newly registered (NRD), or has other suspicious DNS attributes like an unusually low TTL.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, DNS forwarders to external resolvers, and network egress points.",
            "action": [
              "Correlate the 'query' field from Zeek dns.log against a continuously updated list of known DGA and NRD domains. Generate an alert if a query for a listed domain is made and is followed by a successful outbound connection to the resolved IP address in Zeek conn.log.",
              "For each domain resolved in Zeek dns.log, calculate the Shannon entropy of the second-level domain. Establish a baseline distribution of entropy scores for legitimate traffic. Alert on any domain query where the entropy score exceeds the 99.5th percentile of the baseline, indicating a high probability of being algorithmically generated.",
              "Train a binary classification model (e.g., Logistic Regression or a simple Neural Network) using features derived from DNS queries: domain length, entropy, n-gram frequency, number of numeric characters, and vowel-to-consonant ratio. Use a labeled dataset of known good and DGA domains for training. Classify all new domains in real-time and alert on those classified as 'DGA' with a confidence score above 0.95."
            ]
          },
          {
            "description": "A sequence of connections from an internal host to a single external destination exhibits characteristics of C2 beaconing, such as highly periodic timing (low jitter), consistent small packet sizes, or anomalous data volumes.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, core network switches monitoring server-to-internet traffic, and endpoint devices.",
            "action": [
              "Implement a stateful rule that tracks source-destination pairs. If a host connects to the same external IP and port with a time interval that is consistent (+/- a small tolerance) for more than 5 consecutive connections and the payload size is under 2KB, generate a beaconing alert.",
              "For each source-destination IP pair in Zeek conn.log, calculate the time delta between consecutive connections over a 1-hour window. Compute the standard deviation of these time deltas. A standard deviation near zero indicates periodicity. Alert if the standard deviation is below the 2nd percentile for all communicating pairs, indicating highly regular, machine-like communication.",
              "Apply a Fast Fourier Transform (FFT) to the time series of connection events for each internal host. A strong peak in the frequency domain of the FFT output indicates a dominant periodic signal. Alert on hosts that exhibit a strong periodic signal corresponding to common beaconing intervals (e.g., 5s, 30s, 1min, 5min)."
            ]
          },
          {
            "description": "An internal host initiates an unusually high number of connections to unique external destinations over a short period, exceeding its established baseline and indicating potential scanning or command distribution.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, servers with direct outbound internet access (e.g., in a DMZ), and cloud virtual machines.",
            "action": [
              "Implement a hard threshold rule to alert if any single internal host connects to more than 200 unique external IP addresses on the same destination port within a 10-minute window, excluding common ports like 80 and 443.",
              "For each internal host, establish a 14-day rolling baseline of the mean and standard deviation for the count of unique destination IPs contacted per hour. Generate a high-severity alert if the current hourly count for a host exceeds its historical mean by more than 4 standard deviations (Z-score > 4).",
              "Use a change point detection algorithm (e.g., Bayesian Change Point or PELT) on the time series of unique destination IP counts per minute for each host. This algorithm can detect abrupt shifts in the statistical properties of the time series. Alert whenever a statistically significant positive change point is detected, indicating a sudden increase in fan-out activity."
            ]
          },
          {
            "description": "A file is transferred to or from a public file-sharing service (e.g., Pastebin, GitHub) from a sensitive internal host, or the file transferred has a suspicious MIME type or filename extension (e.g., .exe, .ps1, .zip).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical assets (Domain Controllers, database servers, code repositories), endpoints of privileged users, and network egress points with file inspection capabilities.",
            "action": [
              "Maintain a watchlist of domains for public file-sharing and code repository sites. Create a rule that alerts when a connection is made to a watched domain from a host within a critical server subnet. Additionally, alert if Zeek files.log shows a transfer to/from these domains with a MIME type of 'application/x-dosexec', 'application/zip', or a filename ending in '.ps1', '.bat', or '.sh'.",
              "Establish a baseline of file types transferred to/from file-sharing sites for different user groups or departments. For each new file transfer, compare its MIME type to the historical distribution for that user's group. Alert if the MIME type is in the bottom 5% of rarity for that group (e.g., an HR user transferring an executable), indicating a peer group anomaly.",
              "Train a one-class SVM model using features from 'normal' file transfers to approved sites. Features should include source subnet, user agent, time of day, data volume, and file MIME type. Use the trained model to identify and alert on outlier connections that deviate significantly from the established normal profile."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]