[
  {
    "information_requirement": "Is the adversary gathering our organization's credentials? (TA0043 - Reconnaissance)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1589.001",
        "name": "Credentials",
        "evidence": [
          {
            "description": "Evidence of credential phishing is observed when an inbound email or web traffic contains an indicator of compromise (IOC), such as a URL, IP address, domain, or file hash, that is present on a high-confidence threat intelligence feed specifically tracking credential harvesting campaigns.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Web Proxy, Network Egress Points, DNS Resolvers",
            "action": [
              "Continuously query Zeek logs (http.log for 'host' and 'uri', dns.log for 'query', smtp.log for URLs in body) against a threat intelligence feed of known credential phishing IOCs. Generate a high-severity alert for any match.",
              "For URLs in http.log and smtp.log not on an IOC list, parse the domain and path. Calculate the character entropy of the URL path and the age of the domain (via passive DNS or WHOIS lookups). Create a risk score by adding weights for high entropy (e.g., >95th percentile of trailing 30-day baseline) and new domains (e.g., <30 days old). Alert on URLs exceeding a defined risk score threshold.",
              "Train a logistic regression classifier on a labeled dataset of phishing and benign URLs using lexical features (URL length, number of special characters, presence of sensitive keywords like 'login' or 'account', character entropy). Apply the trained model to all new, uncategorized URLs observed in http.log and smtp.log. Alert on URLs classified as phishing with a probability score above 0.9."
            ]
          },
          {
            "description": "A suspected credential phishing campaign is identified when an email with a similar subject, sender, or content is delivered to an anomalously high number of recipients (e.g., >20) in a compressed timeframe (e.g., <1 hour).",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Internal Mail Servers, DNS Resolvers",
            "action": [
              "Create a correlation rule that triggers when >20 unique internal recipients (from smtp.log 'to' field) receive an email from the same external sender IP (from smtp.log 'id.orig_h') within a 1-hour window. The rule should also require subject lines to have a Jaro-Winkler similarity score >0.8.",
              "For each unique URL found in smtp.log, count the number of distinct recipients over a 5-minute sliding window. Establish a 30-day baseline for this 'URL-to-recipient velocity' metric. Alert when the count for any URL exceeds the 99th percentile of its historical baseline.",
              "Ingest email metadata from smtp.log (sender, subject, link domains) into an unsupervised clustering model like DBSCAN. Use TF-IDF for subject lines and structural features for URLs as input vectors. Monitor the size and formation rate of new clusters. Apply a time series anomaly detection model (e.g., Seasonal-Hybrid-ESD) to the volume of messages within each cluster to detect sudden spikes indicative of a coordinated campaign."
            ]
          },
          {
            "description": "Password spraying activity is suspected when a single source IP address generates a high volume of authentication failures (e.g., >10 failed logins) across multiple distinct user accounts on an external-facing authentication service within a short period (e.g., <1 hour).",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Authentication Servers (e.g., ADFS, VPN, OWA), Active Directory Domain Controllers",
            "action": [
              "Correlate Zeek conn.log and Windows Event ID 4625 logs. Create a rule to alert when a single source IP ('id.orig_h') is associated with authentication failures for more than 10 distinct target usernames ('TargetUserName') on a single destination server within a 1-hour window. Exclude known corporate and partner IP ranges.",
              "For each source IP, calculate the ratio of unique successful accounts (Event ID 4624) to unique failed accounts (Event ID 4625) in a 1-hour window. Establish a baseline for this ratio across all source IPs. Alert when an IP has a ratio that falls below the 1st percentile and the total failure count exceeds 20.",
              "Develop a time series forecasting model (e.g., Prophet) for the volume of failed authentications (Event ID 4625) per source Autonomous System Number (ASN), enriched from Zeek conn.log IPs. The model should account for daily and weekly seasonality. Generate an alert when the observed failure count exceeds the model's predicted upper confidence interval, indicating an anomalous spike."
            ]
          },
          {
            "description": "Username enumeration is suspected when an external source IP generates a high rate of authentication failures where the specific failure reason is 'user name does not exist' (Windows Event ID 4625, Status/Sub-status 0xc0000064) against a single login endpoint.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Application Servers, Authentication APIs",
            "action": [
              "Create a rule that alerts when a single source IP, correlated between Zeek conn.log and Windows logs, is responsible for more than 50 occurrences of Windows Event ID 4625 with Sub-Status Code '0xc0000064' (user name does not exist) within a 10-minute window against a single host.",
              "For each source IP targeting an authentication service, calculate the ratio of 'user name does not exist' failures (Event ID 4625, Sub-Status 0xc0000064) to 'bad password' failures (Event ID 4625, Sub-Status 0xc000006d). Establish a baseline for this ratio. Alert when the ratio for a source IP exceeds the 98th percentile of the baseline, indicating a disproportionate number of invalid username attempts.",
              "Train a supervised classification model (e.g., Gradient Boosting) to distinguish between benign traffic, password spraying, and username enumeration. Use session-based features from Zeek and Windows logs, such as: count of unique usernames per source IP, ratio of failure types (0xc0000064 vs 0xc000006d), inter-request timing statistics (mean, stddev), and user-agent consistency. Apply the model to 5-minute windows of authentication activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]