[
  {
    "information_requirement": "Has the adversary acquired exploits for use against our enterprise? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588.005",
        "name": "Exploits",
        "evidence": [
          {
            "description": "An internal host, not part of a pre-defined security research group, establishes a successful TCP connection or resolves a DNS query for a domain/IP categorized by threat intelligence as related to exploit repositories, hacking forums, or exploit kit C2 servers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, DNS resolvers, Web proxies",
            "action": [
              "Join Zeek conn.log (id.resp_h) and Zeek dns.log (answers) with a threat intelligence feed of known exploit-related domains and IP addresses. Generate an alert for any match where the source IP (id.orig_h) is not within the IP range of authorized security research teams.",
              "For all DNS queries in Zeek dns.log, calculate the rarity of each second-level domain (SLD) across the enterprise over a 30-day window. Profile hosts and create an alert when a host queries a domain in the 99.9th percentile of rarity, especially if the domain has a low TTL value or was registered within the last 90 days.",
              "Train a Random Forest classifier using labeled historical data. Features should include: from Zeek conn.log, connection duration, orig_bytes, resp_bytes, proto, destination port; from Zeek dns.log, query length, query entropy, TLD, and ASN reputation of the resolved IP. Apply the model to new outbound connections from non-research hosts to generate a probability score for exploit acquisition activity."
            ]
          },
          {
            "description": "A file is transferred over HTTP/FTP/SMB, identified in Zeek files.log or http.log, with a filename matching patterns for exploit Proof-of-Concepts (e.g., CVE-2025-XXXX.py) or a MIME type of 'application/x-python-code' or 'application/x-perl', where the destination host is not part of an authorized security or development group.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies, Network taps at egress points, Endpoint devices, File servers",
            "action": [
              "Monitor Zeek files.log for file transfers where the 'filename' field matches the regex '(?i)(cve-[0-9]{4,}-[0-9]{4,}|poc|exploit)\\.(py|rb|pl|ps1|sh|exe)' or where the 'md5'/'sha1' hash matches a known exploit hash list. Correlate the destination host (id.resp_h) with Active Directory data to verify the user/host is not in a security group. If not, generate an alert.",
              "For each host, establish a baseline of downloaded file MIME types and source domains over a 30-day period using Zeek files.log and http.log. Alert when a host downloads a file with a MIME type that is statistically rare for both the host and its peer group (e.g., department), such as a developer downloading an executable from a non-corporate domain for the first time.",
              "Develop a per-host LSTM autoencoder trained on sequences of file download events (features: time delta since last download, MIME type, file size, source ASN). Feed real-time download events into the model. An unusually high reconstruction error indicates a deviation from the host's normal download behavior, potentially signaling the acquisition of unusual tools like exploits."
            ]
          },
          {
            "description": "A statistically significant increase in inbound connection attempts from a large number of unique external source IPs is observed in Zeek conn.log. These connections target a specific destination port across multiple internal hosts and are predominantly rejected or unanswered (e.g., conn_state of 'S0', 'REJ'). This activity coincides with the public disclosure of a vulnerability for the service on that port.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External-facing firewalls, Demilitarized Zone (DMZ) network segments, Internet gateway",
            "action": [
              "Create a correlation rule: SELECT COUNT(DISTINCT id.orig_h), id.resp_p FROM 'zeek_conn_log' WHERE direction='inbound' AND id.resp_p IN (watchlist_ports) GROUP BY id.resp_p HAVING COUNT(DISTINCT id.orig_h) > 50 AND COUNT(DISTINCT id.resp_h) > 10 WITHIN 1 hour. The 'watchlist_ports' list should be dynamically populated based on threat intelligence for new CVEs.",
              "For each inbound port on external-facing assets, maintain a 30-day rolling baseline of the hourly count of unique source IPs. Generate an alert when the current hour's count exceeds the 99.5th percentile of its historical distribution. Prioritize alerts for ports on the CVE watchlist.",
              "For each critical external port, train an ARIMA model on the time series of unique source IPs per minute. The model will forecast the expected traffic volume and its confidence interval for the next minute. An alert is triggered if the observed volume breaches the upper bound of the confidence interval for a sustained period (e.g., 3 consecutive minutes)."
            ]
          },
          {
            "description": "An auditable sequence of events occurs on a single host within a 2-hour timeframe: 1) DNS query and HTTP connection to a known vulnerability disclosure site. 2) DNS query and HTTP connection to a public code repository. 3) A script file (e.g., .py, .ps1) is downloaded. 4) A new process is created executing an interpreter (e.g., python.exe) with the downloaded script as an argument. The host is not part of a security research group.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Developer environments, Web proxies, DNS Servers",
            "action": [
              "Implement a stateful correlation rule that tracks a host's activity. Trigger an alert if the following sequence is observed for a non-research host within a 2-hour window: (1) Zeek dns.log query for domain in 'vuln_db_list', (2) Zeek dns.log query for domain in 'repo_list', (3) Zeek files.log entry with mime_type like 'application/x-python', (4) Sysmon Event ID 1 with 'Image' being 'python.exe' or 'powershell.exe' and 'CommandLine' containing the filename from step 3.",
              "Assign weights to specific user actions: visiting a rare domain (+5), downloading a script file (+10), executing a script with high-entropy command-line arguments (+15). Sum these scores for each user over a rolling 1-hour window. Establish a baseline for user scores and alert when a user's score exceeds 3 standard deviations above their personal baseline or 2 standard deviations above their peer group's baseline.",
              "Train a Hidden Markov Model (HMM) on sequences of events (DNS query, HTTP request, file download, process create) from benign user sessions to learn normal transition probabilities between states. Apply the trained model to live event streams for each user. A sequence of events that results in a very low log-likelihood score from the model is flagged as anomalous and potentially indicative of exploit acquisition."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]