[
  {
    "information_requirement": "Is the adversary developing resources using Artificial Intelligence to support future operations?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588.007",
        "name": "Artificial Intelligence",
        "evidence": [
          {
            "description": "An internal host communicates with a network indicator (IP, domain) or receives an email from a sender identified by a threat intelligence source as part of a campaign leveraging AI-generated content.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek smtp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Email Gateway, DNS Resolvers",
            "action": [
              "Continuously match destination IPs (Zeek conn.log), DNS queries (Zeek dns.log), and sender domains (Zeek smtp.log) against a threat intelligence feed curated for indicators from known AI-driven campaigns. Generate an alert upon any match.",
              "For all domains queried in Zeek dns.log, calculate the domain age. Track the daily count of connections to domains younger than 30 days and alert if this count exceeds the 95th percentile of the daily count over a 90-day baseline.",
              "Deploy a classification model trained on email headers and body content to score incoming emails for the likelihood of being AI-generated phishing. Investigate any email with a score exceeding a predefined confidence threshold (e.g., > 0.85)."
            ]
          },
          {
            "description": "A script executed on a host or transferred over the network contains structural patterns, function names, or comments characteristic of AI code generation tools (e.g., 'Generated by Copilot').",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Development Environments",
            "action": [
              "Deploy and monitor YARA rules designed to detect artifacts of AI code generators (e.g., 'Generated by...', specific code library imports, unique variable naming schemes) in scripts captured via Windows Event ID 4104 and Zeek files.log. Alert on any match.",
              "For each script block from Windows Event ID 4104, calculate the abstract syntax tree (AST) complexity and comment-to-code ratio. Flag scripts where these metrics simultaneously exceed the 98th percentile of an established baseline for legitimate scripts.",
              "Utilize a pre-trained NLP transformer model, fine-tuned on a labeled dataset of human vs. AI-generated malicious code, to classify script content from Windows Event ID 4104. Flag scripts classified with a high probability of being AI-generated."
            ]
          },
          {
            "description": "An internal host resolves or connects to a domain whose name exhibits algorithmically generated characteristics (e.g., high character entropy, unusual dictionary word combinations) and has a short lifespan or low reputation.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Resolvers, Web Proxy, Internet Gateway",
            "action": [
              "Maintain a watchlist of suspicious Top-Level Domains (TLDs) (e.g., .xyz, .top, .live). Alert when a DNS query (Zeek dns.log) is made for a domain on this TLD list that was also registered within the last 30 days.",
              "For every new domain observed in Zeek dns.log, calculate the character-level Shannon entropy of the second-level domain name. Flag any domain whose entropy score falls in the top 5% (random-looking) or bottom 5% (highly repetitive) of the baseline distribution for legitimate domains.",
              "Implement a time-series anomaly detection model (e.g., ARIMA or Prophet) on the volume of DNS queries per domain. Identify and investigate 'flash-in-the-pan' domains that receive a sudden burst of queries and then disappear, a pattern consistent with automated malicious infrastructure."
            ]
          },
          {
            "description": "A script is executed on a host with multiple layers of obfuscation, characterized by high entropy, polymorphic structures, or encoding techniques not typical of legitimate administrative scripts.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Critical Servers",
            "action": [
              "Scan PowerShell script blocks (Windows Event ID 4104) for common obfuscation keywords and patterns (e.g., '-encodedcommand', 'IEX', 'FromBase64String', 'invoke-expression'). Flag scripts containing a high frequency or multiple layers of such indicators.",
              "Calculate the Gzip compression ratio and character frequency distribution for all script blocks from Windows Event ID 4104. Flag any script whose compression ratio falls below the 5th percentile of the baseline for legitimate scripts, as this indicates high entropy and potential packing or obfuscation.",
              "Train a gradient boosting classifier (e.g., XGBoost) on features extracted from script content (e.g., string lengths, API call frequencies, entropy). Use the trained model to score all script executions and flag high-scoring events as potentially malicious obfuscation for analyst review."
            ]
          },
          {
            "description": "A single process on a host initiates a rapid succession of file creation events for scripts or binaries, where the filenames appear algorithmically generated (e.g., high entropy or non-standard naming).",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Development Servers, User Workstations, Build Systems",
            "action": [
              "Create a rule that triggers when a single process (Sysmon Event ID 1) creates more than 10 script or executable files (.exe, .ps1, .py) within a 5-minute window, as tracked by Sysmon Event ID 11. Alert for investigation.",
              "For each host, track the rate of file creation events (Sysmon Event ID 11) where the filename has high entropy (> 3.5 bits/character). Alert if the current rate for a single host exceeds 3 standard deviations above its 30-day moving average.",
              "Use a clustering algorithm (e.g., DBSCAN) on file system (Sysmon Event ID 11) and process events (Sysmon Event ID 1), grouped by host and time window. Identify and investigate dense clusters of activity involving high-entropy filenames originating from a suspicious or non-standard parent process (e.g., winword.exe)."
            ]
          },
          {
            "description": "An internal host exhibits automated, non-human browsing behavior, characterized by a high request rate to diverse public information sources (e.g., search engines, code repositories, paste sites) with programmatically generated or unusual query parameters.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Web Proxy, User Subnets",
            "action": [
              "Alert when a non-browser user-agent (e.g., Python-urllib, curl, wget) is observed in Zeek http.log making more than 100 requests to known search engines, code repositories, or paste sites from a single source IP within a one-hour window.",
              "For each source IP, calculate the Shannon entropy of URI query parameters (from Zeek http.log) and the Server Name Indication (from Zeek ssl.log). Flag hosts where the average entropy for a 10-minute window exceeds the 99th percentile of their historical 30-day baseline.",
              "Develop a time-series model to analyze the distribution of inter-request timings for each source IP. Use the model to detect machine-like, periodic request intervals that deviate significantly from learned normal human browsing patterns, flagging such sessions for review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]