[
  {
    "information_requirement": "Is the adversary leveraging newly acquired or fingerprinted infrastructure for command and control against our network? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583",
        "name": "Acquire Infrastructure",
        "evidence": [
          {
            "description": "A network connection from an internal host to an external destination (IP address, domain) or involving an SSL/TLS certificate hash has a direct match in a high-confidence threat intelligence feed tracking adversary infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Threat Intelligence C2 Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise network egress points (Firewalls, Proxies), Internal DNS resolvers and forwarders, VPN concentrators, Cloud IaaS/PaaS VPC egress gateways",
            "action": [
              "(Symbolic) Continuously match destination IPs from Zeek conn.log, resolved domains from Zeek dns.log, and certificate SHA1 hashes from Zeek ssl.log against a curated list of known malicious infrastructure IOCs. Generate a high-priority alert upon any match.",
              "(Statistical) For any matched IOC, calculate the frequency of connections from distinct internal source IPs over a 24-hour period. If the count of distinct internal hosts connecting to the IOC exceeds the 95th percentile of connections to all other external destinations, escalate the alert priority to indicate widespread activity.",
              "(ML) Use a pre-trained classification model (e.g., logistic regression) to assign a risk score to every outbound connection based on features like IP reputation, domain age, ASN, and certificate attributes from enriched log data. Connections exceeding a predefined risk threshold (e.g., > 0.85) are flagged for investigation, even without a direct IOC match."
            ]
          },
          {
            "description": "An outbound SSL/TLS session uses a JA3 or JA3S hash that matches a known malicious C2 framework, or it uses a self-signed certificate whose subject or issuer fields contain default values from known adversary tools.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Threat Intelligence JA3/C2 Certificate Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise network egress points, SSL/TLS inspection appliances, Demilitarized Zone (DMZ) servers, Application delivery controllers (ADCs)",
            "action": [
              "(Symbolic) Maintain and query a watchlist of known malicious JA3/JA3S hashes and default C2 certificate attributes (e.g., common names like 'localhost', organizational units like 'Acme Corp') against Zeek ssl.log and x509.log records. Generate an alert upon any match.",
              "(Statistical) For all outbound SSL/TLS connections, calculate the population entropy of JA3 hashes observed per hour. A sudden decrease in entropy or a spike in the frequency of a previously rare JA3 hash indicates potential C2 channel homogenization. Flag any JA3 hash whose hourly count exceeds 3 standard deviations from its 30-day moving average.",
              "(ML) Use an unsupervised clustering algorithm (e.g., DBSCAN) on SSL/TLS session features (JA3 hash, certificate validity period, issuer, cipher suite, destination port). Isolate and analyze clusters of traffic that do not group with known-good application traffic to identify anomalous C2-like communication patterns."
            ]
          },
          {
            "description": "One or more internal hosts initiate connections to an external domain registered within the last 30 days, where the connection volume or number of unique internal clients exceeds the 99th percentile of traffic to other newly registered domains (NRDs).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Passive DNS and WHOIS Data Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers and forwarders, Enterprise network egress points, External domain registration data providers",
            "action": [
              "(Symbolic) Enrich Zeek dns.log records with domain registration dates from an integrated WHOIS or NRD intelligence feed. Create a rule to flag all connections to domains registered within the last 30 days that also use WHOIS privacy services or are hosted on ASNs known for malicious activity.",
              "(Statistical) For the subset of domains identified as NRDs (registered < 30 days ago), establish a baseline and calculate the 99th percentile for the number of unique internal clients connecting and total bytes transferred per day. Alert on any NRD that exceeds these thresholds, indicating anomalous flocking behavior.",
              "(ML) Develop a time series forecast model (e.g., ARIMA or Prophet) for the daily count of new NRDs being accessed across the enterprise. Generate an alert if the observed count significantly exceeds the forecasted count's upper confidence interval, indicating a potential coordinated campaign leveraging new infrastructure."
            ]
          },
          {
            "description": "An outbound network connection, initiated by a non-browser process on an endpoint, communicates with an external IP address and exhibits a periodic 'heartbeat' pattern (low standard deviation in inter-arrival time and data volume) or uses a non-standard port for common protocols.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations and servers), Network egress points and flow collectors, Cloud provider network boundaries (e.g., VPC Flow Logs)",
            "action": [
              "(Symbolic) On endpoints, correlate Windows Event ID 5156 (network connection) with its parent process ID and command line from Windows Event ID 4688 (process creation). Alert if a non-browser process (e.g., powershell.exe, wscript.exe, or a binary running from a temporary user directory) initiates an outbound connection to an IP not on an allowlist.",
              "(Statistical) For each source-destination IP pair in Zeek conn.log, analyze the inter-arrival time and byte size of connections within a 1-hour window. Calculate the standard deviation for both metrics. A standard deviation near zero for both time and size indicates a highly regular, beaconing-like pattern. Flag connections where both values are below the 5th percentile for all external connections.",
              "(ML) Train an autoencoder neural network on features from known-good network traffic sessions (e.g., process name, destination port, ASN, connection duration, bytes transferred). Apply this model to all new outbound connections; connections with a high reconstruction error are flagged as anomalous and potentially indicative of C2 activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]