[
  {
    "information_requirement": "Is an adversary performing external network reconnaissance to map our organization's network topology?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.004",
        "name": "Network Topology",
        "evidence": [
          {
            "description": "A single external source IP, present on one or more threat intelligence feeds, initiates a high volume of connection attempts to the organization's network.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek intel.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, Internet gateways, Cloud provider network flow logs (e.g., AWS VPC Flow Logs), Threat Intelligence Platform integration points.",
            "action": [
              "Correlate the originator IP ('id.orig_h') in Zeek conn.log against ingested threat intelligence feeds (e.g., known scanners, TOR exit nodes). Generate a high-priority alert for any match found in Zeek intel.log. Maintain an allowlist of trusted partner IPs and known benign scanners to suppress false positives.",
              "For each source IP, establish a baseline of connection attempts per hour over a 30-day period. Calculate the hourly mean and standard deviation. Generate a medium-priority alert if a source IP's connection count in a given hour exceeds 3 standard deviations above its historical mean, especially if the IP is on a lower-confidence watchlist.",
              "Train a classification model (e.g., Logistic Regression, Gradient Boosting) using features such as IP reputation score, ASN, country of origin, connection frequency, and historical connection patterns. The model should output a 'scanner probability' score for each source IP. Trigger an alert when this score surpasses a dynamically tuned threshold, indicating a high likelihood of reconnaissance activity."
            ]
          },
          {
            "description": "Network traffic from a single external source contains signatures of reconnaissance tools, identified by specific User-Agent strings in HTTP/S traffic or anomalous TCP flag combinations (e.g., NULL, FIN, Xmas scans).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External-facing web servers, Application load balancers, DMZ, Web Application Firewalls (WAFs), Intrusion Detection/Prevention Systems (IDS/IPS).",
            "action": [
              "Create a detection rule that uses regular expressions to match the 'user_agent' field in Zeek http.log against a list of known scanner tool strings (e.g., 'Nmap', 'ZMap', 'Masscan', 'Nikto'). Additionally, create a rule to detect connections in Zeek conn.log where TCP control flags are set to unusual combinations, such as FIN/PSH/URG ('Xmas scan'), no flags set ('NULL scan'), or only FIN set ('FIN scan').",
              "For all inbound HTTP requests, calculate the Shannon entropy of the User-Agent string. Establish a baseline entropy range for legitimate user traffic (e.g., common browsers). Flag as anomalous any User-Agent string with an entropy score falling in the bottom 5th percentile (often indicating simple, non-random tool strings) or top 5th percentile (often indicating randomized strings used for evasion).",
              "Implement a time-series anomaly detection model (e.g., ARIMA or Prophet) on the frequency of specific scan-related TCP flag combinations (NULL, FIN, Xmas) observed per minute. The model will forecast expected counts based on historical data. Generate an alert when the observed count of these scan types significantly deviates from the forecasted range, indicating a potential coordinated scanning event."
            ]
          },
          {
            "description": "An external source IP initiates connections to a statistically anomalous number of distinct destination hosts (horizontal scan) or distinct destination ports (vertical scan) within a defined time window.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ subnets, Public IP address ranges, Edge routers, Cloud security groups and network ACLs.",
            "action": [
              "Implement two threshold-based rules: 1) Horizontal Scan: Alert if a single source IP ('id.orig_h') attempts connections to more than 100 unique destination IPs ('id.resp_h') in a 1-minute window. 2) Vertical Scan: Alert if a single source IP attempts connections to more than 50 unique destination ports ('id.resp_p') on a single destination IP in a 1-minute window. Tune thresholds based on network size and baseline traffic.",
              "For each 5-minute window, calculate two metrics for each source IP: the count of distinct destination IPs and the count of distinct destination ports. Compare these counts against a dynamically calculated 99th percentile baseline for all external traffic. Any source IP exceeding this percentile for either metric is flagged as a potential scanner.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to group source IPs based on features extracted from Zeek conn.log over a 10-minute window, such as `count(distinct id.resp_h)`, `count(distinct id.resp_p)`, and `sum(duration)`. The model will automatically identify clusters of anomalous behavior corresponding to horizontal and vertical scanners, which can be labeled and used for alerting without pre-defined thresholds."
            ]
          },
          {
            "description": "An external source, previously unseen or rarely seen, initiates low-and-slow connection attempts (infrequent, long-duration) targeting sensitive or non-standard ports (e.g., 3389, 22, 161, 5900).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, Remote access gateways, Servers hosting sensitive applications, Management interfaces of network appliances, Domain Controllers.",
            "action": [
              "Create a high-sensitivity watchlist of critical or non-public ports (e.g., 3389, 22, 5985, 161). Generate an immediate high-priority alert for any connection attempt from an external IP address to a port on this list.",
              "For each source IP, maintain a state table of its connection attempts. Calculate the inter-arrival time (time between successive connections) to any host in your network. Flag source IPs whose average inter-arrival time is anomalously high (e.g., exceeds the 95th percentile of all source IPs) and whose total connection count is low, which is characteristic of 'low and slow' scanning.",
              "For each high-value port, apply a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) to the hourly count of unique source IPs attempting connections. This approach is designed to detect subtle, long-term increases in reconnaissance activity against critical assets that would be missed by volume-based or short-window detection methods."
            ]
          },
          {
            "description": "An external source IP sends connection attempts sequentially to destination IPs within a contiguous range (e.g., 192.0.2.1, 192.0.2.2, 192.0.2.3) to enumerate live hosts.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek icmp.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's allocated CIDR blocks, Edge router logs, Network Address Translation (NAT) logs.",
            "action": [
              "Create a stateful rule that tracks destination IPs contacted by a single source IP. If the source IP contacts more than 10 destination IPs where the final octet is sequential (e.g., .1, .2, .3...) within a 1-minute window, generate an alert for a network sweep.",
              "For each source IP over a 10-minute window, calculate the ratio of failed or rejected connection states (e.g., 'REJ', 'RSTO', 'RSTR') to total connection attempts ('conn_state' in Zeek conn.log). Flag source IPs where this ratio exceeds 90%, as this indicates the source is probing for live hosts rather than engaging in legitimate communication.",
              "Model the sequence of destination IPs contacted by a source IP as a state transition process. Use a first-order Markov Chain to calculate the transition probability between successively contacted IPs. A high probability of transitioning to an adjacent IP (e.g., from `x.y.z.N` to `x.y.z.N+1`) is highly anomalous for normal traffic and strongly indicates a sequential network sweep. An alert is triggered when this transition probability exceeds a learned threshold."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]