[
  {
    "information_requirement": "Is the adversary conducting reconnaissance using spearphishing via voice? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1598.004",
        "name": "Spearphishing Voice",
        "evidence": [
          {
            "description": "An internal host resolves or connects to an external domain/IP address that is present on a threat intelligence feed specifically tracking vishing or callback phishing infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, Web proxies",
            "action": [
              "Continuously match all destination IPs from Zeek conn.log, queried domains from Zeek dns.log, and host headers from Zeek http.log against a curated threat intelligence list of known vishing indicators. Generate a high-severity alert upon any match.",
              "For domains not on a threat list, calculate the domain's registration age using WHOIS data. Simultaneously, calculate the historical prevalence (unique host count) of the domain within the last 90 days. Flag connections to domains that are both younger than 30 days and have been visited by fewer than 0.1% of internal hosts. Additionally, calculate the Shannon entropy of the subdomain portion of the hostname; a score greater than 3.5 suggests algorithmic generation and should increase the alert's priority.",
              "Deploy a pre-trained classification model (e.g., Random Forest, Gradient Boosting) that ingests DNS and HTTP request features to produce a 'maliciousness' score. Key features should include: domain registration age, TLD, subdomain entropy, character frequency distribution, query/response size, and presence of keywords like 'support', 'login', 'verify', 'mfa'. A probability score exceeding a predefined threshold (e.g., 0.90) triggers an alert for analyst investigation."
            ]
          },
          {
            "description": "A remote administration tool (e.g., AnyDesk, TeamViewer, ScreenConnect) is installed or executed on an endpoint, and the tool is not on the organization's approved software list or the user is not part of an authorized group (e.g., IT support).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 11707",
              "Windows Event ID 4697",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All user workstations, Virtual Desktop Infrastructure (VDI) instances, and servers not designated for IT administration.",
            "action": [
              "Maintain an allow-list of approved remote administration tool process names, file hashes, and signing certificates. Create a SIEM rule to alert on any process creation (Windows Event ID 4688), software installation (Windows Event ID 11707), or service installation (Windows Event ID 7045, 4697) involving a remote administration tool not on this list.",
              "Establish a baseline of legitimate remote administration tool usage, mapping tools to user roles (e.g., 'Help Desk', 'System Administrator'). For any execution of a remote admin tool, flag it as anomalous if the user's role does not match the tool's authorized user group. Additionally, flag any first-time execution of any remote admin tool on a given host or by a given user for review.",
              "Train a time-series anomaly detection model (e.g., an LSTM autoencoder) on event logs detailing remote administration tool usage (process starts, network connections). The model learns the normal cadence and context (time of day, day of week, source/destination IPs) of legitimate usage per user or user group. An execution sequence that the model flags as having a high reconstruction error (i.e., it deviates significantly from learned patterns) should be alerted on as a potential unauthorized use."
            ]
          },
          {
            "description": "A user endpoint downloads a disk image or archive file (e.g., ISO, VHD, ZIP) from the internet, and within a short time window (e.g., 5 minutes), a process is executed from a path corresponding to a mounted image or a temporary extraction location.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, User workstations, Email gateway",
            "action": [
              "Create a stateful detection rule that triggers when a file download of a container type (MIME type 'application/x-iso9660-image', 'application/zip', etc. in Zeek files.log) is observed for a specific host IP. The rule then monitors for a subsequent process creation (Windows Event ID 4688) on the same host within 5 minutes where the process image path points to a mounted drive letter or a common archive extraction path (e.g., C:\\Users\\<user>\\AppData\\Local\\Temp\\...) and the process is a script interpreter (powershell.exe, wscript.exe) or mshta.exe.",
              "For each user, profile the frequency of downloading specific MIME types from external sources (Zeek files.log). Calculate the rarity of each download using percentile ranking. Generate a low-severity alert when a user downloads a file type (e.g., 'application/x-iso9660-image') that falls into the bottom 5th percentile of file types they typically download. Correlate this with the reputation of the source IP/domain to increase the alert's severity.",
              "Use a trained sequence analysis model (e.g., a Hidden Markov Model or RNN) to detect the specific chain of events: [External Download of ISO/ZIP via Zeek files.log] -> [File Creation of LNK/Script in Temp Path via Windows Event ID 4663] -> [Process Execution of Script Interpreter from Temp Path via Windows Event ID 4688]. Train the model on labeled benign and malicious event sequences. An observed sequence on an endpoint that the model classifies as malicious with high confidence should generate a high-severity alert."
            ]
          },
          {
            "description": "A successful remote authentication (e.g., VPN, RDP, Cloud SSO) for a user account occurs from a source IP with anomalous geographic or network properties (e.g., new country, rare ASN), especially if preceded by web traffic to a newly registered or low-reputation domain from that user's workstation.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "VPN Authentication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, Domain Controllers, Cloud IAM services",
            "action": [
              "Correlate web browsing logs (Zeek http.log) that show a visit to a domain on a phishing threat feed with a subsequent successful remote logon (Windows Event ID 4624 with Logon Type 10 for RDP or Logon Type 3 for network/VPN) for the same user account within a 15-minute window. This direct temporal correlation is a strong indicator of credential compromise and use.",
              "For each user account, build a historical baseline of successful remote login attributes (source country, source ASN, time of day, day of week) over a 30-day rolling window. Assign a risk score to new logins based on deviations: +3 for new country, +2 for new ASN, +1 for login outside of typical hours. If a login's cumulative score exceeds a statistically derived threshold (e.g., the 98th percentile of all historical login scores), flag it for investigation.",
              "Employ a UEBA system or a custom peer-group analysis model (e.g., k-means clustering) to group users based on their roles and access patterns. The model establishes a behavioral baseline for each user and their peer group. An alert is generated when a user's remote login behavior (e.g., geographic location, login velocity, accessed resources post-login) significantly deviates from both their own historical patterns and the established norm of their peer group."
            ]
          },
          {
            "description": "A non-administrative process, such as a web browser (chrome.exe) or Microsoft Office application (winword.exe), spawns a child process that is a script interpreter (powershell.exe, wscript.exe, mshta.exe), and this child process subsequently initiates an external network connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Terminal servers",
            "action": [
              "Create a detection rule that triggers on a process creation event (Windows Event ID 4688) where the ParentProcessName is a browser (e.g., chrome.exe, msedge.exe) or Office application (e.g., winword.exe, excel.exe) and the ProcessName is a script interpreter (e.g., powershell.exe, wscript.exe, cscript.exe, mshta.exe). Enrich this alert if the child process ID is later seen making an outbound connection (Windows Event ID 5156 or Zeek conn.log).",
              "For all script interpreter processes, analyze their command-line arguments (requires command-line logging for Event ID 4688). Calculate the Shannon entropy and length of the command line. Establish a baseline for these metrics across the environment. Flag any execution where the command-line entropy exceeds 4.5 or the length exceeds the 99th percentile of all observed command lines for that process, as this indicates likely obfuscation or a fileless payload.",
              "Train a classification model (e.g., a deep neural network) to identify malicious script content based on its Abstract Syntax Tree (AST) or tokenized representation. Extract the script block or command-line argument from process creation events (Event ID 4688), feed it into the model, and alert on any script classified as malicious with high confidence. This can detect novel or heavily obfuscated malicious scripts that evade signature-based methods."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]