[
  {
    "information_requirement": "Is the adversary conducting reconnaissance by leveraging information from public scan databases?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.005",
        "name": "Scan Databases",
        "evidence": [
          {
            "description": "Multiple inbound connection attempts from a source IP address listed on a public threat intelligence feed of known internet-wide scanners (e.g., Shodan, Censys) or general malicious actors.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter network devices, including internet-facing firewalls, web servers, and VPN concentrators.",
            "action": [
              "Symbolic: Join the source IP field (`id.orig_h`) from Zeek `conn.log` against a threat intelligence list of known internet scanners. Generate an alert for any matched IP address that initiates a connection, regardless of connection state.",
              "Statistical: For each external-facing service, calculate the daily count of unique source IPs that are present on a scanner threat intelligence feed. Establish a 30-day baseline of this count. Generate an alert if the daily count exceeds the 95th percentile of this historical baseline, indicating an unusual volume of scanning from known scanning infrastructure.",
              "Machine Learning: Train a logistic regression classifier on historical `conn.log` data. Use features such as `proto`, `id.resp_p`, `duration`, `conn_state`, and a binary feature indicating if the source IP was on a scanner list at the time. Use the trained model to predict the probability that a new, unseen inbound connection originates from a scanner, enabling detection of previously uncatalogued scanning IPs."
            ]
          },
          {
            "description": "Inbound HTTP/S requests to public-facing applications containing URI paths, User-Agent strings, or request payloads that match signatures of automated scanning or exploitation tools (e.g., Nuclei, Metasploit, nmap scripts).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "IDS/IPS Alerts"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web applications, API gateways, and load balancers.",
            "action": [
              "Symbolic: Implement and monitor IDS/IPS signatures that detect specific User-Agents (e.g., `User-Agent: Nuclei`), URI patterns (e.g., `/.env`), or payloads associated with common scanning and exploitation tools. Correlate these alerts with full request details in Zeek `http.log`.",
              "Statistical: For each source IP, calculate the Shannon entropy of the `uri` field from `http.log` records over a 5-minute window. A high entropy value suggests directory fuzzing or parameter guessing. Alert when the entropy for a source IP exceeds 3 standard deviations above the mean entropy calculated across all source IPs for that time period.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) on the frequency of requests containing high-risk keywords (e.g., 'cve-', 'jndi:', 'log4j') found in the `uri` and `post_body` fields of `http.log`. An observed frequency that significantly deviates from the forecasted trend indicates a potential exploitation wave, possibly driven by recent scan database findings."
            ]
          },
          {
            "description": "A single external IP address initiates connections to a set of destination ports on an internal host that has a high Jaccard similarity (>0.75) with the ports publicly listed for that host in a scan database (e.g., Shodan), all occurring within a condensed timeframe (e.g., under 10 minutes).",
            "data_sources": [
              "Zeek conn.log",
              "External Scan Database API"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter and DMZ, specifically monitoring traffic to all registered public IP addresses.",
            "action": [
              "Symbolic: Proactively query a scan database API for the organization's public IP ranges to generate a 'known exposed ports' list for each asset. Create a rule that triggers if an external IP connects to more than 5 distinct ports on this list for a single host within 10 minutes.",
              "Statistical: For each external source IP (`id.orig_h`), create a set of destination ports (`id.resp_p`) it connected to within a 10-minute window. Calculate the Jaccard similarity index between this observed port set and the 'known exposed ports' set for the target host. Alert if the Jaccard index exceeds a 0.8 threshold, indicating the source IP is likely iterating a pre-compiled list.",
              "Machine Learning: Use a clustering algorithm like DBSCAN on `conn.log` data, using features such as source IP, destination IP, and destination port. A small, dense cluster of connections from a single source IP to multiple ports on one or more internal hosts, where the port set is anomalous compared to clusters from normal traffic, can identify targeted reconnaissance that mirrors scan database results."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of inbound connection attempts targeting a specific service port, occurring within 48 hours after a configuration change (e.g., firewall rule update) that exposed the service to the internet.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Firewall/Network Device Change Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory Domain Controllers), VPN gateways, Remote Desktop gateways, and change management logs for network devices.",
            "action": [
              "Symbolic: Ingest network device change logs into the SIEM. Create a rule that, upon detection of a 'permit' rule change for a new service, triggers a 48-hour heightened monitoring period for that destination port. Alert on any connection attempts from IPs on a threat intelligence list during this window.",
              "Statistical: Establish a baseline of hourly connection counts per destination port using at least 30 days of historical `conn.log` data. Following a detected configuration change that exposes a new port, alert if the connection count for that port exceeds the 99th percentile of its historical baseline.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the volume of traffic to each external-facing service port. The model will learn the normal daily and weekly traffic patterns and automatically flag significant, unexpected spikes in activity that could correspond to a service being discovered and targeted post-exposure."
            ]
          },
          {
            "description": "A high volume of failed authentication events (Windows Event ID 4625) from one or more external IPs against a service recently identified as exposed in a public scan database. The attack often exhibits characteristics of password spraying, using a large list of usernames against a small list of passwords.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services such as Microsoft Exchange (OWA), RDP Gateways, and Active Directory Federation Services (ADFS).",
            "action": [
              "Symbolic: Query for external source IPs (`id.orig_h` in `conn.log`) that generate over 20 failed logins (Event ID 4625) for more than 5 distinct user accounts within a 10-minute window against a single host.",
              "Statistical: For each external source IP, calculate the ratio of failed logins (Event ID 4625) to successful logins (Event ID 4624) within a 1-hour window. Alert if this ratio exceeds 20:1 and the number of unique target accounts is greater than 5, indicating a likely password spraying attack.",
              "Machine Learning: Train a Random Forest classifier to identify password spraying attacks. Use features such as the rate of login attempts per source IP, the number of unique accounts targeted by that IP, the time between attempts, and a binary feature indicating if the targeted service was recently exposed (derived from change logs). The model will output a probability score for each source IP being a sprayer."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]