[
  {
    "information_requirement": "Is the adversary performing reconnaissance using spearphishing services against the enterprise?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1598.001",
        "name": "Spearphishing Service",
        "evidence": [
          {
            "description": "An inbound email's metadata (sender IP, sender domain, SMTP HELO string) exactly matches an indicator of compromise (IOC) on a high-confidence threat intelligence feed explicitly tagged with 'phishing' or 'reconnaissance'.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Gateway, Network Perimeter Firewalls",
            "action": [
              "Symbolic: Continuously query Zeek logs by joining smtp.log and conn.log on the 'uid' field. Generate a high-priority alert if the `smtp.log:helo` string, the domain part of `smtp.log:from`, or the associated `conn.log:id.orig_h` IP address matches an entry in the imported threat intelligence list.",
              "Statistical: For each sender IP address observed in `conn.log` associated with SMTP traffic, calculate the historical ratio of emails that match threat intelligence versus the total email count from that IP. Alert when this ratio for a given IP deviates by more than 3 standard deviations from its own 30-day rolling baseline, indicating a previously benign source may now be malicious.",
              "Machine Learning: Train and deploy a supervised classification model (e.g., Gradient Boosting) using features derived from Zeek logs (HELO string entropy, sender TLD, IP ASN, country code) and labeled threat intelligence data. The model should predict the probability that a new, unseen email is malicious. Generate an alert for any email where the model's predicted probability score exceeds a 0.90 confidence threshold."
            ]
          },
          {
            "description": "An inbound email's 'From' header display name has a high similarity score to a known internal executive or key employee, while the sender's actual email address originates from a public webmail provider (e.g., gmail.com, outlook.com, proton.me).",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Gateway, Human Resources Information System (for key personnel list)",
            "action": [
              "Symbolic: Create and maintain a list of key personnel display names (e.g., 'John Doe') and a list of common public webmail domains. Execute a recurring query against Zeek `smtp.log` to find emails where the `from` field's display name exactly matches a key person, but the sender's email domain is on the public webmail list. Flag any matches for immediate review.",
              "Statistical: For each inbound email, calculate the Jaro-Winkler similarity distance between the sender's display name and all names in the key personnel directory. Flag any email for review where the similarity score is greater than 0.95, the sender domain is a public webmail provider, and there is no prior email history with the sender's full email address in the past 180 days.",
              "Machine Learning: Deploy a trained classification model to detect impersonation attempts. Use features such as: display name string similarity to the internal directory, sender domain category (public vs. corporate), presence of urgency-related keywords in the subject, and historical communication frequency between sender and recipient. The model should output a 'Business Email Compromise Risk Score' for each incoming email, with scores above a defined threshold triggering an alert."
            ]
          },
          {
            "description": "The subject line of an inbound email from an external source contains a combination of low-frequency keywords associated with information gathering themes (e.g., 'urgent request', 'directory chart', 'confirm details').",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Gateway",
            "action": [
              "Symbolic: Create and apply a set of regular expressions to the `subject` field in `smtp.log` to detect reconnaissance-themed patterns, such as `/(urgent|confirm|verify).*(request|details|chart|directory)/i`. Generate a medium-priority alert for any match originating from an external, non-whitelisted domain.",
              "Statistical: Calculate Term Frequency-Inverse Document Frequency (TF-IDF) scores for all unigrams and bigrams in inbound email subjects over a rolling 30-day window to establish a baseline of common language. Generate an alert for emails containing terms with high TF-IDF scores that are also present in a predefined reconnaissance lexicon, especially if multiple employees receive such emails in a short timeframe.",
              "Machine Learning: Apply a pre-trained Natural Language Processing (NLP) topic modeling algorithm, such as Latent Dirichlet Allocation (LDA), to the subject lines of all inbound emails. Periodically analyze the topics generated by the model. Alert on clusters of emails that the model groups into a topic characterized by keywords like 'request', 'info', 'confirm', 'urgent', 'password', and 'credentials'."
            ]
          },
          {
            "description": "An external domain, not seen in the last 90 days, sends emails to a number of unique internal recipients that exceeds the 99th percentile for new senders within a one-hour window.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Email Gateway, Internal DNS Resolvers",
            "action": [
              "Symbolic: For any sending domain not present in `smtp.log` records from the last 90 days, trigger an alert if it sends emails to more than 25 unique internal recipients within one hour. Enrich the alert with WHOIS data (via `dns.log` correlation) to flag any domain registered within the last 30 days.",
              "Statistical: Establish a baseline for 'new sender' behavior by calculating the 99th percentile of unique recipients per hour for all domains during their first 24 hours of sending to the organization. Generate an alert whenever any new sender's recipient count exceeds this established percentile threshold.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or Prophet) on the total email volume per minute. If the model flags a significant anomaly, trigger a secondary process that applies a clustering algorithm (e.g., DBSCAN) to all emails within that anomalous time window. Use features like sender domain, subject similarity, and recipient count to group emails and identify a potential coordinated campaign."
            ]
          },
          {
            "description": "A cluster of more than 10 distinct endpoints, each running a browser process, resolves and connects to the same newly-observed, non-categorized domain within a 5-minute window.",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Internal DNS Resolvers, Network Egress Points",
            "action": [
              "Symbolic: Correlate Windows Event ID 4688 (Process Creation) where `NewProcessName` is a known browser (chrome.exe, firefox.exe, etc.) with subsequent `dns.log` queries from the same host IP. Alert if 10 or more distinct hosts query for the same domain that is not on an enterprise 'allow list' and has not been seen in `dns.log` in the past 90 days, all within a 5-minute window.",
              "Statistical: For each DNS query in `dns.log`, check if the domain has been seen before. Maintain a rolling count of unique hosts querying for 'first-seen' domains per minute. Alert when this count exceeds the 99.5th percentile of its historical 30-day baseline, indicating a potential coordinated link-clicking event.",
              "Machine Learning: Construct a graph where nodes represent users, processes, and domains. Create edges for 'user launched process' (from Event ID 4688) and 'process resolved domain' (from `dns.log`). Apply a community detection algorithm (e.g., Louvain Modularity) to find dense subgraphs that represent multiple users being directed to a single, uncommon domain, which signifies a likely coordinated spearphishing campaign."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]