[
  {
    "information_requirement": "Is an adversary actively gathering information about our network security appliances? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.006",
        "name": "Network Security Appliances",
        "evidence": [
          {
            "description": "A connection attempt is logged from a source IP address present on a high-confidence threat intelligence feed of known scanners or malicious actors to a known network security appliance.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Firewalls, VPN Concentrators, Internet Gateway Routers",
            "action": [
              "Symbolic: Continuously correlate source IP addresses of all inbound connections to network security appliances against a high-confidence cyber threat intelligence (CTI) feed of known scanners and malicious infrastructure. Generate an alert on any match found in Zeek conn.log where `id.orig_h` is in the CTI list and `id.resp_h` is a known security appliance.",
              "Statistical: Calculate the 99th percentile for the number of distinct destination ports contacted by a single source IP within a 1-minute window across the entire network. Alert on any source IP that is also present on a CTI feed and exceeds this percentile, indicating an unusually high rate of scanning from a known malicious actor.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression or Random Forest) using features such as source IP reputation from CTI, connection count, ratio of failed to successful connections (`conn_state` = 'REJ' vs 'SF'), and ASN information. Use the model to classify each inbound connection to a security appliance as 'benign' or 'reconnaissance', with a high-probability 'reconnaissance' classification triggering an alert."
            ]
          },
          {
            "description": "An inbound HTTP/S request directed at a network security appliance's web interface contains a User-Agent, URI path, or JA3 hash matching a known signature associated with reconnaissance tools (e.g., Nmap, Zgrab, Nuclei).",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Application Firewalls (WAFs), Reverse Proxies, VPN Concentrator Web Portals",
            "action": [
              "Symbolic: Scan Zeek http.log `user_agent` and `uri` fields, and Zeek ssl.log `ja3` field for requests to security appliances that match a curated list of regular expressions for tool-specific signatures (e.g., 'masscan', 'Nmap Scripting Engine', '/.env', '/.git/config') or known malicious JA3 hashes.",
              "Statistical: For all inbound HTTP traffic to security appliances, calculate the Shannon entropy of the User-Agent string. A User-Agent with an abnormally high or low entropy score compared to the established baseline distribution (e.g., outside 3 standard deviations of the mean entropy) indicates randomly generated or overly simplistic tool-based traffic and should be flagged for review.",
              "Machine Learning: Use a time series forecasting model (e.g., Prophet or ARIMA) to predict the expected volume of requests per hour that match specific scanner signatures (e.g., requests containing 'nmap'). An observed volume that significantly exceeds the predicted volume's confidence interval indicates a potential coordinated scanning campaign."
            ]
          },
          {
            "description": "A single external source IP address attempts connections to an abnormally high number of unique internal hosts (>50) on a common port within a short timeframe (<10 minutes), indicative of horizontal scanning.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway Routers, Core Network Switches, DMZ Firewalls",
            "action": [
              "Symbolic: Create a SIEM rule to alert if a single source IP (`id.orig_h`) establishes connections to more than 50 unique destination IPs (`id.resp_h`) on the same destination port (`id.resp_p`) within a 10-minute sliding window. Prioritize alerts where the destination IPs include known security appliances.",
              "Statistical: For each 10-minute window, calculate the distribution of unique destination hosts per source IP. Identify outliers by flagging any source IP whose count of unique destinations exceeds the 99.9th percentile of the distribution for that time window, indicating anomalous fan-out behavior.",
              "Machine Learning: Employ a clustering algorithm (e.g., DBSCAN) on connection data, using features like source IP, destination port, and inter-arrival time of connections. A dense cluster of connections originating from one IP to many destination IPs on the same port would be identified as an anomalous cluster representing horizontal scanning."
            ]
          },
          {
            "description": "A single external source IP address attempts connections to an abnormally high number of destination ports (>100) on a single network security appliance within a short timeframe (<5 minutes), with a high ratio of failed to successful connections.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Firewalls, VPN Concentrators, Public-facing Routers",
            "action": [
              "Symbolic: Create a SIEM rule to alert if a single source IP (`id.orig_h`) attempts to connect to more than 100 unique destination ports (`id.resp_p`) on a single destination IP (`id.resp_h`) within a 5-minute window, where the destination IP is a known security appliance.",
              "Statistical: For connections to a single security appliance IP, calculate the ratio of failed connections (e.g., Zeek `conn_state` of 'REJ', 'RSTO') to total connections for each source IP. A ratio exceeding a dynamic threshold, such as the 95th percentile of all source IP failure ratios for that appliance, indicates a likely port scan.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) on features of 'normal' traffic to security appliances (e.g., destination port, protocol, connection duration, bytes transferred). Use the trained model to identify new, unseen connections that deviate significantly from this normal profile, flagging them as anomalies indicative of vertical scanning attempts."
            ]
          },
          {
            "description": "A connection attempt is made from an external source to a management port (e.g., SSH, RDP, HTTPS Admin UI) on a network security appliance, or a failed login event is recorded, where the source IP's geolocation or ASN is inconsistent with a historical baseline of legitimate administrative activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Firewall Management Interfaces, VPN Administrator Portals, Router Management Consoles, Bastion Hosts",
            "action": [
              "Symbolic: Maintain an allow-list of approved IP subnets for management ports on network security appliances. Generate a high-severity alert for any connection attempt logged in Zeek conn.log (e.g., to TCP/22, TCP/443 management UI) from a source IP not on the list, or for any failed login event (Windows Event ID 4625) on a bastion host with a source IP not on the list.",
              "Statistical: For each management service on a security appliance, build a historical baseline of typical source countries and ASNs from Zeek logs. Calculate the frequency of connections from each country/ASN. An alert is generated if a connection originates from a country or ASN that has never been seen before connecting to that specific service.",
              "Machine Learning: Use an autoencoder neural network to learn a compressed representation of normal connection patterns to management interfaces, based on features like source/destination port, protocol, JA3 hash, time of day, and source ASN. A high reconstruction error for a new connection indicates it is anomalous and potentially part of a targeted fingerprinting attempt."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]