[
  {
    "information_requirement": "Is the adversary conducting reconnaissance via phishing for information?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1598",
        "name": "Phishing for Information",
        "evidence": [
          {
            "description": "An incoming email contains metadata (sender IP, sender domain) or content (embedded URLs) that matches a high-confidence threat intelligence feed of known phishing indicators.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter Firewall, Network DNS Resolvers, Web Proxy, Email Gateway",
            "action": [
              "Create a rule to query all inbound emails. For each email, compare the sender IP (`id.orig_h` in `Zeek conn.log`), sender domain (`from` field in `Zeek smtp.log`), and any extracted URLs from the email body against a threat intelligence feed of known malicious indicators. Generate a high-severity alert upon any match.",
              "For domains observed in `Zeek dns.log` that are not on an organizational allowlist, calculate the historical query frequency for each domain across the enterprise over the last 90 days. A domain with a query count below the 5th percentile that appears in an email is considered rare and suspicious. Increase suspicion if the domain's TLD is also statistically rare for the organization.",
              "Deploy a pre-trained classification model (e.g., Random Forest, Gradient Boosting) to generate a real-time phishing score for each incoming email. Features for the model should include: sender IP/domain reputation, domain age, ASN, TLD, presence of keywords associated with phishing, Levenshtein distance to internal domains, and whether the sender has prior communication history. An email with a score above a dynamically tuned threshold (e.g., 0.85) should be quarantined or flagged for analyst review."
            ]
          },
          {
            "description": "An incoming email either fails DMARC/SPF/DKIM authentication, originates from a domain registered within the last 30 days (Newly Registered Domain), or uses a typosquatted/look-alike domain visually similar to the organization's or a trusted partner's domain.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Network DNS Resolvers, Corporate Domain Registrar",
            "action": [
              "Implement a strict rule within the email gateway or SIEM. For every inbound email, parse the `Authentication-Results` header from `Zeek smtp.log`. Generate an alert if the header contains 'spf=fail', 'dkim=fail', or 'dmarc=fail' for the primary `From:` domain.",
              "Continuously enrich sender domains from `Zeek smtp.log` with WHOIS registration date data. Calculate the distribution of domain ages for all inbound email traffic over the last 30 days. Flag any email where the sender domain's age falls into the lowest 5th percentile (e.g., < 30 days old) for further inspection.",
              "Develop a process that uses a string similarity algorithm (e.g., Levenshtein distance, Jaro-Winkler) to compare all new, external sender domains against a list of internal and key partner domains. Use a clustering algorithm like DBSCAN to group potential typosquats. Review clusters of domains with a small edit distance (e.g., < 3) to identify and block malicious look-alike domains."
            ]
          },
          {
            "description": "A single external source (IP or domain) sends emails to a statistically significant number of unique internal recipients over a short period (e.g., one hour), where the source has no or very limited prior communication history with the organization.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Mail Transfer Agent (MTA), Network Intrusion Detection System (NIDS)",
            "action": [
              "Create a threshold-based rule that triggers an alert when a single source IP (`id.orig_h` in `Zeek conn.log`) or sender domain (`from` field in `Zeek smtp.log`) is observed sending emails to more than 50 unique internal recipients (`rcpt_to`) within a 60-minute window. Tune thresholds based on organizational baselines.",
              "For each external sender, calculate a 'fan-out ratio' (unique recipients / total emails sent) over a 15-minute rolling window. Establish a baseline distribution of this ratio for all legitimate senders. Generate an alert when a new or low-reputation sender exhibits a fan-out ratio that exceeds the 99th percentile of the established baseline.",
              "Apply time-series anomaly detection (e.g., using an LSTM autoencoder) to the volume of emails received from each external sender domain. Train the model on historical `Zeek smtp.log` data to learn normal sending patterns. An alert is triggered when the model detects a sudden, sharp spike in email volume from a single domain that deviates significantly from its predicted pattern."
            ]
          },
          {
            "description": "An email is delivered to a High-Value Target (HVT) from an un-allowlisted external domain, and the email exhibits multiple risk factors, such as being a Newly Registered Domain, containing urgency-inducing keywords ('password', 'urgent', 'action required'), or having a subject line formatted as a reply (RE:) to a non-existent conversation.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Executive Mailboxes, Finance Department Endpoints, IT Administrator Workstations, Privileged Access Management Systems",
            "action": [
              "Maintain a dynamic list of HVT email addresses. Create a high-priority rule that alerts on any email sent to an HVT where the sender's domain is not on a pre-approved allowlist AND (the subject contains keywords like 'urgent', 'invoice', 'password' OR the subject starts with 'RE:' but the `In-Reply-To` header is missing or invalid).",
              "For the HVT group, establish a baseline of normal communication by profiling sender domains, communication times, and subject line characteristics. Calculate the Shannon entropy of sender domains communicating with this group over a weekly period. A sharp decrease in entropy, caused by a new, persistent sender, should be flagged. Also, flag any communication from a domain that is a statistical outlier based on historical frequency.",
              "Train a dedicated binary classification model (e.g., Logistic Regression) to identify spearphishing attempts against HVTs. Use features like: sender reputation, domain age, character-level features of the domain name, presence of HVT names in the email body, keyword analysis for urgency, and whether the email contains a URL with a non-standard port. A high probability score from this model should trigger an immediate analyst investigation."
            ]
          },
          {
            "description": "A user sends an outbound email or initiates a data transfer to an external destination shortly after receiving and interacting with a suspected phishing email. The outbound activity is anomalous, such as the email containing an unusually large attachment or the data transfer going to a low-reputation domain.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log",
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Network Egress Points, Mail Transfer Agent (MTA), File Servers",
            "action": [
              "Create a stateful correlation rule. If an inbound email from `source.ip`/`source.domain` triggers a phishing alert for `recipient.user`, monitor for any outbound `Zeek smtp.log` or `Zeek conn.log` traffic from `recipient.user`'s workstation to `source.ip`/`source.domain` within the next 30 minutes. An alert should be generated on a match.",
              "For each user, create a statistical baseline of their normal outbound email activity using `Zeek smtp.log`, including average message size and attachment frequency/size. Monitor for outbound emails where the message size or attachment size is a significant outlier (e.g., > 3 standard deviations above the user's mean). Raise the alert severity if the recipient domain is also statistically rare for that user.",
              "Use a sequence analysis model (e.g., a Hidden Markov Model) to detect anomalous chains of user behavior. A high-risk sequence could be: [Inbound `smtp` from low-reputation domain] -> [Outbound `dns` query for domain in email] -> [Outbound `http` connection to that domain] -> [Windows Event ID 4663 for access to sensitive file shares] -> [Outbound `smtp` to low-reputation domain with large attachment (`files.log`)]. Train the model on benign user activity sequences to identify statistically improbable and therefore suspicious sequences."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]