[
  {
    "information_requirement": "Is the adversary performing vulnerability scanning against our external-facing infrastructure?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1595.002",
        "name": "Vulnerability Scanning",
        "evidence": [
          {
            "description": "An external source IP, present on a threat intelligence feed of known scanners or malicious actors, establishes an inbound connection, as observed in Zeek conn.log.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Perimeter Firewall, Threat Intelligence Platform, Cloud Network Security Groups",
            "action": [
              "For each inbound connection in Zeek conn.log, query the source IP (id.orig_h) against a threat intelligence database. Generate an alert if the IP is categorized as 'scanner', 'malicious', 'TOR', or 'proxy'.",
              "For source IPs matching a threat intelligence category, calculate the connection count over a 24-hour window. Alert if an IP's connection count exceeds the 95th percentile for all IPs within that same threat category, indicating abnormally persistent activity from a known-bad source.",
              "Train a logistic regression classifier to predict if a connection from a CTI-flagged IP is malicious reconnaissance. Use features such as threat intel category, total connection count in 24h, distinct ports contacted, and the distribution of connection states (e.g., ratio of REJ to S1). A high probability score (>0.9) indicates a targeted campaign."
            ]
          },
          {
            "description": "An inbound web request in Zeek http.log contains a User-Agent string matching a known vulnerability scanning tool (e.g., 'nmap', 'sqlmap', 'nikto', 'acunetix') or a URI path targeting common vulnerabilities, sensitive files, or administrative interfaces (e.g., '/.env', '/.git/config', '/wp-admin', '/phpmyadmin').",
            "data_sources": [
              "Zeek http.log",
              "Windows IIS Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing Web Servers, Web Application Firewalls, Application Gateways, Load Balancers",
            "action": [
              "In Zeek http.log, create a rule to alert on inbound requests where the user_agent field matches a regex list of scanner tools ('nmap|sqlmap|nikto') OR the uri field matches a regex list of sensitive paths and vulnerability probes ('/\\.env|/\\.git|/wp-admin').",
              "For each source IP, calculate the ratio of HTTP 4xx/5xx error responses to total requests in a 5-minute window. Alert if the error ratio exceeds 80% with a minimum of 20 total requests, which is indicative of forced browsing or vulnerability fuzzing.",
              "Utilize a pre-trained NLP model (e.g., a transformer-based classifier) to analyze URI strings. Classify requests into categories like 'Benign Navigation', 'Vulnerability Probe', 'SQL Injection Attempt', or 'Path Traversal'. Alert on classifications other than 'Benign Navigation' that originate from a single source IP in high frequency."
            ]
          },
          {
            "description": "An external source IP establishes a connection to a service port (e.g., 22/SSH, 3389/RDP, 21/FTP), receives the initial service banner, and immediately terminates the connection without attempting authentication. This is observed as a short-duration S1, RSTO, or RSTR connection in Zeek conn.log.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek rdp.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Servers, VPN Concentrators, Externally-facing servers hosting SSH/RDP/FTP",
            "action": [
              "Correlate Zeek conn.log events with protocol-specific logs (e.g., ssh.log). Alert if a connection UID has an 'S1' or 'RSTO' state in conn.log and a duration less than 2 seconds, with no corresponding successful authentication event in the protocol log within 30 seconds.",
              "For each sensitive service port (e.g., 22, 3389), establish a baseline ratio of successful authentications to total connection attempts per hour. Alert when this ratio for a specific source IP drops into the bottom 5th percentile of all source IPs, indicating a high rate of connection failures or aborts.",
              "Apply a time-series anomaly detection model (e.g., Isolation Forest) to the 'duration' field of established (S1 state) connections in Zeek conn.log, grouped by destination port. A sudden spike in the number of anomalously short-duration connections from a single source IP indicates automated banner grabbing."
            ]
          },
          {
            "description": "A single external source IP generates connection attempts to a large number of distinct destination ports (>50) on a single destination host within a short time frame (<1 minute), as seen in Zeek conn.log or firewall logs.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Perimeter Firewall, Edge Routers, Cloud Network Security Groups, Individual Host Firewalls",
            "action": [
              "In a SIEM, create a rule that alerts when a single source IP (id.orig_h) contacts a single destination IP (id.resp_h) on more than 50 unique destination ports (id.resp_p) within a 60-second window.",
              "For each source IP observed in a 5-minute window, calculate the Shannon entropy of the destination ports it contacted. An entropy score exceeding the 99th percentile of all source IP port entropies for that window, or a static threshold of 3.5, indicates a high degree of randomness characteristic of a port scan.",
              "Use a density-based clustering algorithm like DBSCAN on a 2D feature space of (timestamp, destination_port) for each source IP. A dense cluster that is wide along the destination_port axis but narrow on the time axis identifies a rapid vertical port scan."
            ]
          },
          {
            "description": "A single external source IP generates connection attempts to the same destination port (e.g., 445/SMB, 3389/RDP) across a large number of distinct destination hosts (>20) within the same subnet in a short time frame (<1 minute).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Perimeter Firewall, Edge Routers, Cloud Network Security Groups, Subnet Gateways",
            "action": [
              "In a SIEM, create a rule that alerts when a single source IP (id.orig_h) contacts more than 20 unique destination IPs (id.resp_h) on the same destination port (id.resp_p) within a 60-second window.",
              "Group Zeek conn.log data by source IP and destination port over 5-minute intervals. Calculate the count of unique destination IPs for each group. Alert if this count for any source IP exceeds the 99th percentile for that specific port's activity, indicating a targeted sweep.",
              "For each high-traffic port (e.g., 443, 80, 445), model the count of unique destination hosts contacted by a source IP as a time series. Use an algorithm like Seasonal Hybrid ESD (S-H-ESD) to detect anomalous spikes in the time series, which represent uncharacteristic network sweep behavior."
            ]
          },
          {
            "description": "A sequence of distinct but related low-fidelity alerts are generated by a single external source IP within a 1-hour window, such as a Threat Intelligence hit, followed by a port scan, and then a web vulnerability probe against a discovered web server.",
            "data_sources": [
              "SIEM Alerts",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM / Log Aggregation Platform, Security Orchestration, Automation, and Response (SOAR) Platform",
            "action": [
              "Create a SIEM correlation rule that triggers a high-priority meta-alert if Alert A (e.g., Port Scan) and Alert B (e.g., Web App Probe) both fire for the same source IP within 60 minutes. The rule should check that the target of Alert B was a host/port identified in Alert A.",
              "Implement a risk-based alerting (RBA) model. Assign a numerical risk score to individual alerts (e.g., Port Scan=10, Web Probe=15, CTI Hit=25). Sum the scores for each source IP over a 1-hour sliding window. An aggregate score exceeding a dynamic threshold (e.g., the 99.9th percentile of all IP scores) or a static one (e.g., >40) generates a high-fidelity 'Multi-Stage Reconnaissance' incident.",
              "Employ a sequence pattern mining algorithm (e.g., PrefixSpan) on historical alert data to identify common attacker TTP sequences (e.g., 'CTI Hit -> Port Scan -> Banner Grab -> Web Probe'). Deploy this as a model to analyze the live stream of alerts, classifying new alert sequences from a source IP in real-time if they match a known malicious pattern."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]