[
  {
    "information_requirement": "Is the adversary performing active scanning against our external infrastructure?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1595",
        "name": "Active Scanning",
        "evidence": [
          {
            "description": "A single external source IP initiates inbound connections and is present on a subscribed threat intelligence feed of known scanners, malicious hosts, or anonymizing proxies.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed",
              "Windows Defender Firewall with Advanced Security log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter firewalls, VPN gateways, cloud network security groups (e.g., AWS Security Groups, Azure NSGs), and other internet-facing network appliances.",
            "action": [
              "Symbolic (IOC Match): Continuously ingest threat intelligence feeds into a watch list of malicious IPs. Create a real-time rule that joins the source IP ('id.orig_h') from Zeek conn.log records against this watch list. Generate a high-severity alert for any match.",
              "Statistical (Ratio Analysis): For any IP that matches a CTI feed, calculate the ratio of rejected connections (e.g., Zeek conn_state 'REJ' or Windows Firewall drop events) to total observed connections over a 10-minute window. Flag the IP for investigation if this ratio exceeds 3 standard deviations above the baseline for all external traffic.",
              "Machine Learning (Classification): Develop and deploy a supervised classification model (e.g., Random Forest, Logistic Regression) trained on labeled historical data (malicious/benign). Use features such as: CTI feed match (binary), connection state, protocol, service, connection duration, and source ASN. The model should output a probability score for each connection being part of a malicious scan."
            ]
          },
          {
            "description": "Inbound HTTP/S requests to internet-facing services contain User-Agent strings, JA3/JA3S hashes, or other header values that are characteristic of automated scanning tools.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web servers, reverse proxies, Web Application Firewalls (WAFs), and Application Load Balancers.",
            "action": [
              "Symbolic (IOC Match): Maintain and apply a list of regular expressions that match User-Agent strings of known scanning tools (e.g., 'nmap', 'masscan', 'zgrab', 'sqlmap'). Scan the 'user_agent' field in Zeek http.log for matches. Separately, maintain a deny-list of JA3/JA3S hashes from Zeek ssl.log known to be associated with malicious tools and alert on matches.",
              "Statistical (Rarity Analysis): For a 24-hour period, calculate the frequency of every unique User-Agent string and JA3/JA3S hash observed in inbound traffic. Create an allow-list of common, legitimate values (e.g., popular browsers). Flag any value that falls below a rarity threshold (e.g., seen < 5 times) and is not on the allow-list for further analysis.",
              "Machine Learning (Anomaly Detection): Train an unsupervised anomaly detection model (e.g., Isolation Forest) on features derived from HTTP/S request headers. Features should include User-Agent string length, User-Agent entropy, presence/absence of common headers (e.g., Referer, Accept-Language), and the JA3/JA3S hash. The model will score each request; flag requests with high anomaly scores."
            ]
          },
          {
            "description": "A high volume of inbound connections from a single source IP address results in TCP connection states or flag combinations indicative of reconnaissance scanning (e.g., SYN scans, FIN scans, NULL scans).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log",
              "Windows Defender Firewall with Advanced Security log (Event ID 2004)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter firewalls, internet-facing hosts, and Internet-facing Windows Servers (e.g., IIS, RDP gateways).",
            "action": [
              "Symbolic (Threshold Alert): Implement a rule to alert when a single source IP generates more than 100 connections with a state of 'S0' (SYN sent, no SYN-ACK), 'REJ' (connection rejected), or 'RSTRH' (responder sent RST) in Zeek conn.log within a 1-minute window. Additionally, monitor Zeek weird.log for events like 'bad_TCP_header_len' or 'TCP_Christmas_scan' originating from a single source.",
              "Statistical (Distribution Analysis): For each external source IP, calculate the probability distribution of Zeek 'conn_state' values over a 5-minute window. Use a chi-squared goodness-of-fit test to compare this distribution to a baseline profile of normal traffic (which is typically dominated by 'SF' and 'RSTO'). Flag IPs with a statistically significant deviation from the baseline.",
              "Machine Learning (Time Series Forecasting): For each source IP, generate a time series representing the count of anomalous connection states ('S0', 'REJ', 'RSTR') per minute. Use a time series forecasting model (e.g., Prophet, ARIMA) to predict the expected count for the next interval. Generate an alert when the observed count significantly exceeds the forecasted value's confidence interval, indicating a sudden burst of scanning."
            ]
          },
          {
            "description": "A single external source IP address connects to an anomalously large number of unique destination ports on a single host (vertical scan) or unique destination hosts on a single port (horizontal scan) within a short time frame.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek icmp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter firewalls, demilitarized zone (DMZ) segments, and Cloud VPC Flow Logs.",
            "action": [
              "Symbolic (Threshold Count): For each unique source IP ('id.orig_h'), create a sliding 1-minute window. Within this window, count the number of distinct destination ports ('id.resp_p') per destination host and the number of distinct destination hosts ('id.resp_h') per destination port. Trigger an alert if $$ count(distinct id.resp_p) > 50 $$ for a single host (vertical scan) or if $$ count(distinct id.resp_h) > 50 $$ for a single port (horizontal scan).",
              "Statistical (Percentile Threshold): Over a 5-minute window, calculate two metrics for every source IP: the count of unique destination ports contacted and the count of unique destination hosts contacted. Compute the 99th percentile for both metrics across all sources to establish dynamic thresholds. Flag any source IP that exceeds either of these dynamic thresholds.",
              "Machine Learning (Clustering): Apply a density-based clustering algorithm (e.g., DBSCAN) to 5-minute batches of connection data. Use a feature space of [Source IP, Destination IP, Destination Port]. Scanners will form dense clusters that can be programmatically identified: vertical scans appear as a single source IP connected to a dense line of destination ports, and horizontal scans appear as a single source IP connected to a dense line of destination IPs."
            ]
          },
          {
            "description": "A single external source IP exhibits a high Shannon entropy calculated from the set of destination ports or hosts it connects to over an extended period (e.g., 1-24 hours), which is characteristic of broad, slow, and evasive probing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter firewalls, log aggregation systems, and SIEM/Data Lake holding long-term network logs.",
            "action": [
              "Symbolic (Heuristic Rule): For each source IP, track the time delta between the first observation of each new destination port connection. If the average time delta is high (e.g., > 10 seconds), but the cumulative count of unique ports contacted over 24 hours is also high (e.g., > 100), flag the source IP for manual review as a potential 'low and slow' scanner.",
              "Statistical (Entropy Analysis): For each source IP, aggregate the list of unique destination ports contacted over a rolling 1-hour window. Calculate the Shannon entropy of this list using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_{2} P(x_i) $$, where $$ P(x_i) $$ is the probability of seeing a specific port. Establish a baseline distribution of entropy values for normal traffic and flag any source IP whose entropy exceeds the 98th percentile.",
              "Machine Learning (Time Series Anomaly Detection): For each source IP, create a time series of its hourly destination port entropy. Train a recurrent neural network (RNN) autoencoder on historical data from known benign sources to learn normal entropy patterns. Apply the trained model to live data; a high reconstruction error for an IP's entropy time series indicates an anomalous, potentially evasive scanning pattern."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]