[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by disabling cryptographic hardware on network devices? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1600.002",
        "name": "Disable Crypto Hardware",
        "evidence": [
          {
            "description": "An administrative connection (e.g., SSH on port 22, Telnet on port 23) to a network device originates from an IP address that is not on the authorized management network allow-list or is present on a current threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, management subnets, jump boxes, log aggregation platforms (SIEM), internet gateways",
            "action": [
              "Symbolic: Join Zeek conn.log records (where `id.resp_p` is 22 or 23) against an allow-list of authorized management source IPs and a threat intelligence IP feed. Generate a high-severity alert for any connection where the source IP (`id.orig_h`) is not on the allow-list or is present on the threat feed.",
              "Statistical: For all administrative connections to network devices, establish a 30-day baseline of source Autonomous System Number (ASN) and country of origin frequency. Alert if a new connection originates from an ASN or country that falls below the 5th percentile of historical frequency, indicating a rare or first-seen source.",
              "Machine Learning: Train an Isolation Forest model using features from historical, legitimate administrative connections (e.g., source subnet, ASN, time-of-day, day-of-week). Apply the trained model to new connections in near real-time to classify them as 'inlier' (normal) or 'outlier' (anomalous). Flag all outlier connections for immediate investigation."
            ]
          },
          {
            "description": "A command executed on a network device's command-line interface (CLI) contains specific strings known to disable or alter hardware-based cryptographic functions, such as 'no crypto engine' or 'crypto engine software'.",
            "data_sources": [
              "Device Syslog",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network devices (routers, switches, firewalls), centralized syslog servers, TACACS+/RADIUS servers, management servers/jump boxes",
            "action": [
              "Symbolic: Implement a detection rule that applies a regular expression to search all network device syslog and command-line audit logs for patterns indicative of disabling crypto hardware (e.g., `/(no\\s+crypto\\s+engine|crypto\\s+engine\\s+software)/i`). Trigger a high-severity alert upon any match.",
              "Statistical: For each administrative user, calculate the Shannon entropy of their command strings within each CLI session. Establish a per-user baseline for session command entropy. Alert if a user's command entropy for a new session exceeds their historical average by more than two standard deviations, suggesting unusual command complexity or exploratory behavior.",
              "Machine Learning: Use a Natural Language Processing (NLP) topic modeling technique, such as Latent Dirichlet Allocation (LDA), on historical command logs to identify and categorize 'topics' of normal administrative activity (e.g., 'interface configuration', 'routing updates'). Classify new command sessions against these established topics. A session that has a low probability of belonging to any known topic should be flagged as anomalous for review."
            ]
          },
          {
            "description": "A successful administrative login to a network device exhibits multiple anomalous properties simultaneously when compared to the user's established baseline, such as an unusual source geolocation, time of day, and source host.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Active Directory, RADIUS, TACACS+), management servers/jump boxes, network gateway (for geolocation)",
            "action": [
              "Symbolic: For each user account, define an explicit geofence of expected source countries and a time-of-day window for normal business hours. Create a rule that alerts if a successful login (e.g., Windows Event ID 4624) to a network device occurs from a source IP outside the geofence OR outside the defined time window.",
              "Statistical: Develop a cumulative risk score for each administrative login session. Increment the score for each deviation from a user's multi-faceted baseline: +2 for a login from a new source country, +1 for a login time more than two standard deviations from the user's mean login hour, +1 for a session duration more than three standard deviations from the user's mean. Alert if the total score for a session exceeds a predefined threshold (e.g., 3).",
              "Machine Learning: Train a K-Means clustering algorithm on historical login data, using features such as hour-of-day, day-of-week, source ASN, and session duration from Zeek conn.log. A new login that falls far from any established cluster centroid is considered a spatial outlier and should be alerted on as a behavioral anomaly."
            ]
          },
          {
            "description": "A time-series analysis of network traffic at a key chokepoint shows a statistically significant decrease in the proportion of encrypted traffic (e.g., TLS, IPsec) relative to total traffic volume, particularly if correlated with a recent configuration change on an upstream network device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek ipsec.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network backbone switches, internet gateways, datacenter core routers, VPN concentrators",
            "action": [
              "Symbolic: Create a rule that generates a high-severity alert if the `service` field in a Zeek conn.log record indicates an unencrypted management protocol (e.g., 'telnet', 'ftp') was used to connect to a known network device IP address.",
              "Statistical: In 10-minute intervals, calculate a time series of the ratio of encrypted sessions (sum of session counts from Zeek ssl.log and ipsec.log) to total TCP sessions (from Zeek conn.log). Establish a baseline mean and standard deviation for this ratio over the last 30 days. Alert if the ratio drops more than three standard deviations below the baseline for at least two consecutive intervals.",
              "Machine Learning: Implement a time series anomaly detection model, such as ARIMA or Prophet, to forecast the expected volume of encrypted traffic (TLS and IPsec). Continuously compare the actual observed encrypted traffic volume against the forecasted volume and its confidence interval. An actual value that falls consistently below the lower bound of the confidence interval indicates a significant negative anomaly that requires investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]