[
  {
    "information_requirement": "Is the adversary staging or utilizing pre-positioned capabilities to support operations against the network? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608",
        "name": "Stage Capabilities",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host to an external destination IP address, domain, or URL matches an indicator on a high-confidence threat intelligence feed categorized as a known command and control (C2) server, malware distribution point, or phishing site.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points (e.g., Firewalls, Web Proxies), DNS resolvers, Internal network segments",
            "action": [
              "Join all outbound network logs against CTI feeds. Specifically, correlate destination IP addresses from Zeek conn.log, 'host' header values from http.log, and queried domains from dns.log against CTI lists of known malicious infrastructure. Generate a high-severity alert for any match.",
              "For each external destination IP and domain, calculate its prevalence (percentage of internal hosts connecting to it) over a 30-day window. Create a risk score by combining this prevalence score with CTI data. Flag destinations that are in the bottom 5th percentile for prevalence (rare) and also appear on any CTI feed, including lower-confidence 'grey lists'.",
              "Train a supervised classification model (e.g., Gradient Boosting) on labeled network flows. Use features such as: destination port, protocol, total bytes sent/received, connection duration, presence on CTI feeds (as a binary feature), and destination IP reputation. Deploy the model to score all new outbound connections in real-time to identify potential C2 or malware download activity that does not match known IOCs."
            ]
          },
          {
            "description": "An outbound HTTP or TLS connection exhibits artifacts in its headers or handshake that are known indicators of compromise. This includes specific User-Agent strings, URI path patterns, or JA3/JA3S hashes associated with known adversary tooling or malware.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points (e.g., Firewalls, Web Proxies), Encrypted traffic inspection points",
            "action": [
              "Create and maintain a signature list of malicious User-Agent strings, URI patterns, and JA3/JA3S hashes associated with adversary tooling. Continuously scan Zeek http.log and ssl.log against this list. Generate a high-severity alert on any match.",
              "For all observed User-Agent strings and JA3/JA3S hashes, calculate their prevalence across the organization over a 30-day rolling window. Flag any connection that uses an artifact falling into the bottom 1st percentile of prevalence for investigation, as this indicates a rare tool or client.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to feature vectors derived from TLS and HTTP connections. Features should include the JA3 hash, the JA3S hash, the set of TLS extensions, and the User-Agent string. Analyze small, distinct clusters that do not correspond to known legitimate applications to identify previously unknown C2 channels."
            ]
          },
          {
            "description": "An outbound network connection displays one or more of the following high-risk characteristics: 1) The service (e.g., HTTP) is running on a non-standard port. 2) The TLS certificate is self-signed. 3) The TLS certificate has an unusually short validity period (e.g., less than 90 days). 4) The destination domain is hosted by a dynamic DNS provider.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points (e.g., Firewalls, Web Proxies), DNS resolvers",
            "action": [
              "Implement specific detection rules: 1) Alert on services in Zeek conn.log (e.g., 'http', 'ssl') observed on ports other than their standard assignments. 2) From Zeek x509.log, alert when the certificate 'issuer' field is identical to the 'subject' field. 3) Maintain a list of known dynamic DNS providers and alert on any query for a domain within those TLDs from Zeek dns.log.",
              "From Zeek x509.log, calculate the distribution of certificate validity periods for all observed external domains. Flag connections using certificates with a validity duration in the bottom 5th percentile for investigation. Separately, for each service identified in Zeek conn.log, baseline the destination ports used and alert on connections to ports that are statistical outliers for that service.",
              "Implement a time series anomaly detection model (e.g., Holt-Winters) to monitor the daily count of new, previously unseen certificate issuers and subjects observed in Zeek x509.log. A statistically significant spike above the forecasted value can indicate an adversary registering new infrastructure or a widespread campaign."
            ]
          },
          {
            "description": "A DNS query or subsequent connection is made to an external domain that exhibits characteristics of maliciousness, such as: 1) The domain was registered very recently (e.g., within the last 60 days). 2) The domain name has a high character entropy, suggesting algorithmic generation (DGA). 3) The domain name is a typosquatted variation of a legitimate, high-value domain.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS resolvers, Egress points (e.g., Firewalls, Web Proxies)",
            "action": [
              "For every unique domain resolved in Zeek dns.log, enrich it with WHOIS data to get the creation date. Generate an alert if a connection is made to a domain registered within the past 60 days. Separately, maintain a list of critical internal and external domains and check every resolved domain against this list for typosquatting using a Levenshtein distance threshold of 2 or less.",
              "For every unique domain in Zeek dns.log, calculate its Shannon entropy. Compare the score against a distribution of entropy scores from a known-good domain list (e.g., the Tranco Top 1M). Flag domains with an entropy score in the top 5th percentile as potential DGA activity.",
              "Develop and deploy a deep learning classifier, such as a Long Short-Term Memory (LSTM) network, trained on large labeled datasets of DGA and legitimate domains. Feed all newly observed domains from Zeek dns.log into the model and investigate any domain that the model classifies as DGA with a high confidence score (e.g., > 0.90)."
            ]
          },
          {
            "description": "A file is downloaded from a known file-sharing, paste, or code repository site, and a corresponding process creation event involving that file occurs on the same host within a short time window (e.g., 5 minutes), indicating a potential Ingress Tool Transfer.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Egress points (e.g., Web Proxies)",
            "action": [
              "Create a stateful correlation rule that triggers when: 1) A file download is observed in Zeek logs from a domain on a watchlist of code/file sharing sites (e.g., github.com, pastebin.com, anonfiles.com). 2) On the same internal IP address, a Windows Event ID 4688 (Process Creation) event is logged within 5 minutes. 3) The 'New Process Name' or 'CommandLine' in the event contains the name of the file downloaded. Generate a high-severity alert.",
              "For each user or host, profile the file types (based on MIME types in Zeek files.log or file extensions) they typically download and from which source domains. Use this profile to identify statistical anomalies, such as a user from the HR department downloading a PowerShell script (.ps1) or an executable (.exe) from a code repository for the first time.",
              "Apply a sequence analysis model to chains of endpoint events. Train a model on normal sequences (e.g., browser -> download -> office doc -> no execution). Identify and alert on anomalous sequences, such as browser -> download (.zip) -> un-archive utility -> process creation (.exe), especially when originating from a low-reputation source domain."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]