[
  {
    "information_requirement": "Has an adversary staged resources for a strategic web compromise (watering hole) targeting our organization's users?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608.004",
        "name": "Drive-by Target",
        "evidence": [
          {
            "description": "An internal host's outbound network connection (DNS query or HTTP/S request) resolves to a domain or IP address listed on a threat intelligence feed as known infrastructure for drive-by-compromise, watering holes, or exploit kits.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise DNS Resolvers, Egress Firewall/Proxy, Threat Intelligence Platform (TIP), SIEM",
            "action": [
              "Create a detection rule that continuously joins outbound Zeek dns.log and conn.log records against a watchlist of domains and IPs from high-confidence threat intelligence feeds. Trigger a high-priority alert upon any match, including the source host, destination, and threat feed name.",
              "For each host, calculate a 24-hour rolling count of connections to domains/IPs on the threat intel watchlist. Identify hosts where this count exceeds the 95th percentile for all hosts in the same time window, indicating an unusual pattern of interaction with known malicious infrastructure.",
              "Develop a classification model (e.g., Logistic Regression, Gradient Boosting) to assign a risk score to each outbound connection. Use features such as: threat intelligence match (binary), destination domain reputation score, destination ASN reputation, volume of data transferred, and the historical frequency of connections from the enterprise to the destination. A score exceeding a predefined threshold indicates a high-risk connection warranting investigation."
            ]
          },
          {
            "description": "An internal host's browsing session generates a sequence of more than 3 HTTP requests to distinct domains within 5 seconds, where the 'Referer' header links each request, indicating a rapid, automated redirection chain often used to obscure the final malicious payload destination.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Web Proxy, Network Security Monitoring (NSM) sensors, DNS Resolvers, Endpoint Browsers",
            "action": [
              "Develop a query to reconstruct browsing sessions by correlating Zeek http.log entries using source IP, user-agent, and 'Referer' header over a short time window (e.g., 10 seconds). Alert if a reconstructed chain contains a domain from a known malicious redirector or ad network blocklist.",
              "For all browsing sessions, calculate the distribution of redirection chain lengths (number of unique domains) and speed (hops per second). Flag any session where the chain length or speed exceeds the 99th percentile as a statistical anomaly. Additionally, for each chain, calculate the Jaccard similarity between the set of domains visited and a pre-compiled list of common, legitimate domains; a score below 0.1 is highly suspicious.",
              "Apply a clustering algorithm (e.g., DBSCAN) to session-based features including chain length, duration, number of unique destination Autonomous System Numbers (ASNs), final destination domain age, and the ratio of 3xx HTTP status codes. Identify and investigate outlier clusters that do not group with typical browsing behavior."
            ]
          },
          {
            "description": "An internal host initiates a connection to an internet domain registered within the last 60 days, especially when combined with other risk factors like WHOIS privacy protection, non-standard port usage, or hosting on a non-business cloud provider.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log",
              "WHOIS Lookup Data",
              "Passive DNS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Enterprise Web Proxy, Threat Intelligence Platforms (for NRD and WHOIS feeds)",
            "action": [
              "Ingest a Newly Registered Domain (NRD) feed into a watchlist. Create a rule to alert on any DNS query (Zeek dns.log) or HTTP request (Zeek http.log) to a domain on this list. Escalate the alert priority if enrichment shows the domain uses WHOIS privacy or was registered within the last 7 days.",
              "Establish a baseline of the average age (in days) of domains visited across the enterprise. Alert when any user visits a domain whose age is a statistical outlier (e.g., in the bottom 1st percentile of all visited domain ages). Concurrently, track the rate of NRD visits per host over a 24-hour window and flag hosts whose rate exceeds 3 standard deviations from their own historical baseline.",
              "Utilize a time series forecasting model (e.g., SARIMA, Prophet) on the enterprise-wide count of NRDs visited per hour. An observed count that significantly exceeds the forecast's upper confidence interval suggests a potential widespread campaign. Correlate the hosts contributing to the anomaly with other suspicious activity."
            ]
          },
          {
            "description": "A file is downloaded from a low-reputation or newly registered domain, and the file exhibits high entropy (indicating obfuscation or encryption) or is an unusual file type for the source domain (e.g., an executable from a news site). This is followed within 60 seconds by a new process creation on the host originating from the web browser process.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Windows Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations and servers, Enterprise Web Proxy, Network File Analysis Sandbox, SIEM for correlation",
            "action": [
              "For every file identified in Zeek files.log, trigger a YARA scan using rulesets for common obfuscators and exploit kit payloads. If a rule matches, correlate the download event (by host IP and timestamp) with a subsequent process creation event (Windows Event ID 4688 or 1) from the browser process on the same host within a 1-minute window. Generate a high-priority alert on a successful correlation.",
              "For each downloaded script (.js, .vbs, etc.), calculate its Shannon entropy score. Flag any script with an entropy score exceeding the 95th percentile of all scripts downloaded in the last 30 days. Separately, profile the MIME types and file extensions served by each domain; use a chi-squared test to identify any download that represents a statistically significant deviation from the domain's established profile.",
              "Train a classifier (e.g., Decision Tree, Random Forest) to predict if a download is malicious. Features should include: file Shannon entropy, file size, source domain reputation, source domain age, whether the download originated from a long redirection chain, the parent process name (e.g., chrome.exe), and the file MIME type vs. historical norms for the domain. A high prediction probability triggers an alert."
            ]
          },
          {
            "description": "An internal host shows a statistically significant increase in connections to domains categorized as 'Advertising', immediately followed within 5 minutes by a connection to a newly registered domain, a domain with a low reputation score, or a direct-to-IP connection.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Firewalls/Proxies, DNS Resolvers, Threat Intelligence Platform, Ad-blocker logs",
            "action": [
              "Maintain a watchlist of domains associated with known malvertising campaigns. Alert if a connection from an internal host to a domain on this list is followed within 2 minutes by a connection to a domain on a threat intelligence blocklist or a domain registered in the last 7 days.",
              "For each host, create a baseline of connection counts and data volume to domains categorized as 'Advertising' over a 7-day rolling window. Use a moving average and standard deviation to detect spikes (e.g., count > 3 standard deviations above the average). For any host that triggers a spike, scrutinize its subsequent 5 minutes of network activity for rare events, such as connections to domains never before visited by the organization.",
              "Employ a multivariate time series anomaly detection model on enterprise-wide traffic to ad networks, looking for anomalous spikes in connection counts, data volume, and unique ad domains visited. For hosts identified as primary contributors to the anomaly, apply a pre-trained risk scoring model to their subsequent web traffic, using features like destination domain age, reputation, and presence in a redirection chain to identify likely malvertising victims."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]