[
  {
    "information_requirement": "Has an adversary enumerated objects in our cloud storage environments (e.g., AWS S3, Azure Blob Storage)?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1619",
        "name": "Cloud Storage Object Discovery",
        "evidence": [
          {
            "description": "A successful cloud API call for object enumeration (e.g., AWS eventName:ListObjectsV2, Azure operationName:Microsoft.Storage/storageAccounts/listKeys/action) is initiated from a source IP address that matches an entry in a threat intelligence feed for malicious IPs, proxies, or TOR nodes.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider management plane (for API logs), network egress points (for traffic logs), and threat intelligence subscription services.",
            "action": [
              "Continuously monitor cloud audit logs (e.g., AWS CloudTrail eventName:ListObjectsV2) for enumeration API calls. Join the source IP address from these events with a high-confidence, frequently updated threat intelligence feed of known malicious IPs, anonymizing proxies, and TOR exit nodes. Generate a high-severity alert upon any match.",
              "For each enumeration API call, extract the source IP address and enrich it with ASN and geolocation data. Compare the source ASN and country against a 30-day rolling baseline of legitimate administrative activity. Generate an alert if the ASN or country falls below a low-frequency threshold (e.g., 5th percentile) for that user or role, indicating an unusual origin.",
              "Develop a supervised classification model (e.g., Logistic Regression, Random Forest) trained on labeled historical cloud enumeration events. Use features including source IP reputation, ASN, country, time of day, user agent string, identity type (user vs. role), and whether the identity has performed this action before. Deploy the model to score new enumeration events in real-time, generating an alert for events classified as malicious with high confidence (e.g., > 0.85 probability)."
            ]
          },
          {
            "description": "A process is created with command-line arguments indicative of cloud storage discovery tools (e.g., s3scanner, cloud_enum), or a network connection to a cloud API endpoint contains a User-Agent string associated with these tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, DevOps/Cloud Engineering Workstations, CI/CD Pipeline Servers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Monitor Windows Event ID 4688 process creation events for command-line arguments matching a curated list of regular expressions for cloud discovery tools (e.g., 's3scanner', 'cloud_enum', 'aws s3 ls --recursive'). Concurrently, monitor Zeek http.log for User-Agent strings matching a known-bad list for these tools. Alert immediately on any match.",
              "For each process creation event (Windows Event ID 4688) involving cloud CLI tools (e.g., aws.exe, az.cmd), calculate the Shannon entropy of the command-line arguments. Establish a per-user baseline entropy score. Alert when a new command's entropy score exceeds a threshold, such as 3 standard deviations above the user's mean, indicating potentially obfuscated or unusually complex commands.",
              "Train an anomaly detection model (e.g., One-Class SVM or Isolation Forest) on the set of all User-Agent strings observed in Zeek http.log making requests to known cloud API endpoints over a 30-day period. Use the model to score new User-Agent strings in real-time. Flag any string identified as an anomaly for analyst review, as it may represent a custom or unrecognized discovery tool."
            ]
          },
          {
            "description": "The rate of object or container listing API calls from a single identity (user, role, or service principal) or source IP address exceeds a defined threshold within a short time window.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider audit logs (CloudTrail, etc.), identity and access management (IAM) services, and network flow log collectors (e.g., Zeek sensors at internet egress).",
            "action": [
              "Implement a rule that counts enumeration API calls (e.g., eventName:ListObjectsV2) per source IP and user identity over a 5-minute sliding window. Alert if this count exceeds a static threshold (e.g., 1000 calls) determined by operational requirements and baseline analysis.",
              "For each identity, create a historical baseline of enumeration API call counts per hour. Using a 60-minute sliding window, count the number of enumeration calls for each identity. Generate an alert if the count in the current window exceeds the 99th percentile of that identity's historical baseline, indicating an unusual burst of discovery activity.",
              "Develop a time series forecasting model (e.g., SARIMA, Prophet) on the aggregate count of enumeration API calls per minute for the entire cloud environment. The model will predict the expected volume and a confidence interval for the next minute. Generate an alert if the observed count exceeds the upper bound of the predicted confidence interval, suggesting an anomalous spike in enumeration activity at a macro level."
            ]
          },
          {
            "description": "An identity (user, role, or service principal) performs an object enumeration API call for the first time, or performs enumeration against a storage resource it has not previously accessed.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud audit logs, Identity and Access Management (IAM) role/policy configurations, and historical user activity databases/look-up tables.",
            "action": [
              "Maintain a lookup table of all identities that have performed enumeration actions in the last 90 days. Generate an alert whenever an identity not on this 'first time access' list performs an enumeration API call.",
              "For each identity, maintain a historical set of unique API calls and unique resource ARNs they have accessed over the last 90 days. On a new enumeration event, calculate the Jaccard similarity between the set {new_API_call, new_resource_ARN} and the identity's historical sets. Alert if the similarity score is 0, indicating both the action and the target resource are novel for that identity.",
              "Apply a clustering algorithm (e.g., K-Means or DBSCAN) to identities based on features derived from their IAM roles and historical API usage patterns. This creates behavioral peer groups. Within each peer group, identify identities performing enumeration actions as statistical outliers (e.g., their enumeration activity count is >3 standard deviations from the group mean). These outliers are anomalous relative to their peers and warrant investigation."
            ]
          },
          {
            "description": "An identity or source IP performs an object enumeration API call, which is followed within a short time window by a high volume of data access (GetObject), data deletion (DeleteObject), or permission modification (PutBucketPolicy) calls from the same actor.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Storage Buckets/Containers, Cloud Audit Logs, Network Egress Points",
            "action": [
              "Implement a stateful correlation rule that triggers when an identity performs an enumeration API call (e.g., List*). If the same identity subsequently performs more than 20 data access (Get*), deletion (Delete*), or permission modification (Put*) calls within a 30-minute window, generate a high-severity alert for a 'Discovery followed by Action' behavioral chain.",
              "Following an enumeration event by a specific identity, monitor the total data egress volume (bytes_resp in Zeek conn.log, responseElements.bytesTransferred in cloud logs) associated with that identity over the next 30 minutes. Compare this volume to the identity's historical 30-minute egress baseline. Alert if the post-discovery egress volume exceeds the 99th percentile of their normal baseline.",
              "Model user sessions as sequences of API calls. Train a sequence-based anomaly detection model (e.g., Hidden Markov Model, Recurrent Neural Network/LSTM) on sequences from benign user sessions. Feed new user API call sequences into the model in real-time. Generate an alert when the model assigns a low probability to an observed sequence (e.g., a ListObjects call followed by an anomalous number of GetObject calls), indicating a deviation from normal behavioral patterns and a potential attack chain."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]