[
  {
    "information_requirement": "Has an adversary performed discovery of Group Policy settings to identify environmental weaknesses or misconfigurations? (PIR)",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1615",
        "name": "Group Policy Discovery",
        "evidence": [
          {
            "description": "Execution of a process where the file hash (e.g., SHA256) matches a known signature for a Group Policy discovery tool, such as PowerView or a BloodHound ingestor.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain-joined endpoints and member servers where command execution and process creation are logged.",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) and alert when a process image's hash (e.g., SHA256) matches a known malicious signature for GPO discovery tools from an integrated threat intelligence feed.",
              "Statistical: For GPO discovery-related processes (e.g., gpresult.exe) that do not match a known malicious hash, analyze the parent-child process relationship. Calculate the rarity of the parent process (e.g., winword.exe, outlook.exe) spawning the discovery tool. Generate an alert if the parent process is statistically rare, such as falling outside the 99th percentile of common parent processes for that tool.",
              "Machine Learning: Develop and deploy a supervised classification model (e.g., Random Forest) trained on features from process execution events, including process name, parent process, command-line arguments, user context, and file hash. Use the model to classify each GPO-related execution as benign or suspicious, flagging activity that deviates from established baselines of administrative behavior."
            ]
          },
          {
            "description": "Execution of native utilities (e.g., gpresult.exe) or PowerShell with command-line arguments and script block content characteristic of GPO enumeration (e.g., `gpresult /z`, `Get-DomainGPO`, `Get-NetGPO`).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All domain-joined endpoints and member servers, especially those used by system administrators where PowerShell logging is enabled.",
            "action": [
              "Symbolic: Create a detection rule that monitors process creation events (Windows Event ID 4688) and PowerShell script block logs (Event ID 4104). The rule should trigger an alert on the execution of `gpresult.exe`, `powershell.exe`, or `pwsh.exe` with high-risk command-line argument patterns like `gpresult /z` or script block content containing `Get-GPO -All` or `Get-NetGPO`.",
              "Statistical: For all observed GPO-related command-line executions, calculate the entropy of the command-line string. Establish a baseline of command-line entropy for legitimate administrative scripts and flag any command whose entropy exceeds a set threshold (e.g., 95th percentile), which may indicate obfuscation. Additionally, perform frequency analysis on the user-host-command triplet to flag executions that are rare for a specific user or host.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., Seasonal ARIMA) to monitor the hourly frequency of GPO discovery commands per user. Train the model on at least 30 days of historical data to learn normal administrative patterns. Generate an alert when the model detects a significant spike in activity inconsistent with the user's established baseline."
            ]
          },
          {
            "description": "An unusual volume or pattern of LDAP queries from a single source host targeting objects of class 'groupPolicyContainer'.",
            "data_sources": [
              "Zeek ldap.log",
              "Windows Event ID 4661"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic to and from Domain Controllers, and Directory Service Access audit logs on Domain Controllers.",
            "action": [
              "Symbolic: Create a detection rule to alert on any LDAP search query containing the filter `(objectClass=groupPolicyContainer)`. Correlate this alert with other suspicious activity from the same source IP to increase its priority, as this query is a known precursor for tools like BloodHound and PowerView.",
              "Statistical: Using Zeek ldap.log or Windows Event ID 4661, establish a baseline of the hourly count of queries targeting 'groupPolicyContainer' objects for each source host over a 30-day rolling window. Generate an alert if the query count from a single host in a one-hour period exceeds a dynamic threshold, such as 3 standard deviations ($$ Z > 3 $$) above its historical mean.",
              "Machine Learning: Apply an unsupervised clustering algorithm (e.g., DBSCAN) to LDAP query data, using features such as source IP, query frequency, query filter complexity, and time of day. The model will group activity into clusters, allowing analysts to investigate hosts that fall into 'anomalous enumeration' clusters rather than 'normal administrative behavior' clusters."
            ]
          },
          {
            "description": "An anomalous pattern of file access within the SYSVOL 'Policies' directory (e.g., `\\<DOMAIN>\\SYSVOL\\<DOMAIN>\\Policies\\`), such as access by a non-administrative user or an unusually high number of files read from a single host.",
            "data_sources": [
              "Zeek smb_files.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SYSVOL share on all Domain Controllers where file system and SMB access auditing is enabled.",
            "action": [
              "Symbolic: Create a rule that triggers when a user account not belonging to a pre-defined administrative group (e.g., 'Domain Admins', 'Group Policy Creator Owners') accesses more than a threshold (e.g., 5) of unique files in the `\\SYSVOL\\<domain>\\Policies\\` directory within a 10-minute window, based on Windows Event ID 4663 or Zeek smb_files.log.",
              "Statistical: From Zeek smb_files.log or Windows Event ID 4663, calculate the total number of unique policy files read per user session accessing the SYSVOL share. Establish a distribution of this metric across all users over a 30-day period. Flag any session where the number of files read exceeds a high percentile (e.g., the 98th) of the distribution.",
              "Machine Learning: Train a One-Class SVM model on features of legitimate SYSVOL access events, including source host, user account, number of files accessed, and time of day. The model learns the boundary of 'normal' activity. Flag any new access event that falls outside this learned boundary as a potential anomaly, which can help detect novel enumeration methods."
            ]
          },
          {
            "description": "A sequence of events from a single source host involving an LDAP query for 'groupPolicyContainer' objects immediately followed by SMB access to the `\\SYSVOL\\<domain>\\Policies` share.",
            "data_sources": [
              "Zeek ldap.log",
              "Zeek smb_files.log",
              "Windows Event ID 4661",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers and network segments connecting endpoints to Domain Controllers.",
            "action": [
              "Symbolic: Implement a stateful correlation rule in a SIEM. If a source IP generates an LDAP query with the filter `(objectClass=groupPolicyContainer)` (from Zeek ldap.log or Windows Event ID 4661), start a 5-minute timer. If the same source IP is then observed accessing the `\\SYSVOL\\<domain>\\Policies` share (from Zeek smb_files.log or Windows Event ID 4663) within that window, generate a high-severity alert.",
              "Statistical: Build a transition probability matrix for sequences of network events per host. Calculate the conditional probability of an 'SMB SYSVOL Access' event occurring within 5 minutes after an 'LDAP GPO Query' event from the same source. If this transition probability is historically low (e.g., $$ P < 0.01 $$ based on historical data), flag the sequence as a statistically significant behavioral anomaly.",
              "Machine Learning: Utilize a sequence analysis model, such as a Hidden Markov Model (HMM), to learn common sequences of user and host actions across LDAP and SMB logs. The model will calculate the likelihood of an observed event sequence. The specific sequence of 'LDAP GPO Query' -> 'SMB SYSVOL Access' will be assigned a very low probability by a well-trained model, and any occurrence will be flagged as a high-confidence anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]