[
  {
    "information_requirement": "Has the adversary acquired and used access to the enterprise environment? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1650",
        "name": "Acquire Access",
        "evidence": [
          {
            "description": "A successful or failed authentication event (Windows Event ID 4624 or 4625) involves a username from a list of known-compromised corporate credentials provided by a Cyber Threat Intelligence (CTI) feed.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN gateways, Microsoft Entra ID), Domain Controller security logs, CTI feed aggregation platforms",
            "action": [
              "Continuously ingest CTI feeds of breached credentials into a dedicated watchlist or lookup table. Create a real-time detection rule that joins all authentication logs (Windows Event ID 4624, 4625) against this watchlist on the username field. Trigger a high-priority alert for any successful or failed login attempt involving an account on the watchlist.",
              "For any successful authentication from an account on the CTI watchlist, enrich the event with source IP data from Zeek conn.log. Compare the login's source Autonomous System Number (ASN) against the user's historical baseline of known ASNs from the past 90 days. If the ASN has not been seen for this user before (i.e., a frequency of zero in the baseline), escalate the alert for immediate incident response.",
              "Train a supervised classification model (e.g., XGBoost, Logistic Regression) on labeled historical authentication data. Features must include source IP reputation, time of day, day of week, source ASN, source geolocation, and a binary feature indicating if the account is on the CTI breach watchlist. Use the model to score each new login in real-time and alert when the predicted probability of being malicious exceeds a predefined threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "A high volume of failed authentication events (Windows Event ID 4625) from a single source IP address targets numerous distinct user accounts in a short period, such as more than 50 unique usernames from one IP address in under 5 minutes.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, VPN concentrators, Web Application Firewalls (WAFs), Identity Provider logs (e.g., Microsoft Entra ID Sign-in logs), Domain Controller security logs",
            "action": [
              "From authentication failure logs (Windows Event ID 4625), group events by source IP address over a 5-minute sliding window. Trigger a high-severity alert if a single source IP is responsible for failed logins against more than 50 distinct usernames within any window.",
              "For each source IP generating login failures, calculate the Shannon entropy of the set of unique usernames targeted in a 15-minute window. Establish a dynamic baseline by calculating the 99th percentile of entropy scores across all source IPs over the past 24 hours. Trigger an alert when the entropy for a specific source IP exceeds this dynamic threshold, indicating an abnormally diverse set of targeted accounts.",
              "Implement a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) to monitor the aggregate rate of failed logins (Windows Event ID 4625) per minute across the enterprise. The model should account for weekly and daily seasonality. Generate an alert when the observed failure rate significantly deviates from the forecasted range (upper bound), indicating a potential large-scale credential stuffing attack."
            ]
          },
          {
            "description": "A successful authentication (Windows Event ID 4624) originates from an IP address with properties (geolocation, ASN) that are both historically anomalous for the user and associated with high-risk network categories like anonymous proxies or TOR exit nodes.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services, CTI data feeds for IP reputation, Geolocation databases, Network flow log collectors",
            "action": [
              "For each successful external login (Windows Event ID 4624), enrich the source IP from Zeek conn.log with a CTI feed. Create a detection rule to trigger an immediate, critical-severity alert if the IP is tagged as a known TOR exit node, anonymous proxy, or a malicious C2 server.",
              "For each user, maintain a baseline of historical login source country and ASN pairs from the past 90 days. For each new successful login, if the source country-ASN pair is not in the user's baseline, calculate the global rarity of that pair across all users. If the pair is new for the user AND globally rare (e.g., seen in less than 1% of all company logins), trigger a high-severity alert.",
              "For each user, deploy an unsupervised anomaly detection model (e.g., Isolation Forest) trained on their historical login data. Features should include time-of-day and day-of-week (transformed into cyclical features), source country, and source ASN. Any new login classified as an outlier by the model should trigger an alert for manual review, indicating a significant deviation from the user's established pattern of life."
            ]
          },
          {
            "description": "Following the first successful login (Windows Event ID 4624) after a user's credentials appear in a CTI-reported data breach, high-risk post-authentication activities are observed within the same session. These activities include MFA device registration, privilege escalation (e.g., adding a user to an administrative group via Event ID 4732 or 4728), or suspicious DNS queries.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4672",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, CTI data feeds, Privileged Access Management (PAM) systems, DNS servers",
            "action": [
              "Correlate successful login events (Windows Event ID 4624) with a CTI database of breached credentials and their exposure dates. Create a rule to alert on the first successful login for any account where the login timestamp is after the credential exposure date. Enrich this alert with any subsequent privilege escalation events (e.g., 4732, 4728, 4672) from the same user session.",
              "For a session initiated by a 'first use post-breach' account, monitor subsequent actions and calculate a session risk score. Assign weights to specific events (e.g., +15 for a DNS query to a newly seen domain, +30 for adding a user to a local admin group via Event ID 4732). Trigger a high-severity alert if the cumulative session score exceeds a threshold determined by the 99th percentile of session scores for that user's role.",
              "Utilize a sequence analysis model, such as an LSTM-based autoencoder, trained on normal sequences of user actions (represented by event IDs and key parameters) following a login. For any session initiated by a 'first use post-breach' account, feed the action sequence into the model. A high reconstruction error indicates the sequence is anomalous (e.g., a login immediately followed by privilege escalation) and should trigger an alert."
            ]
          },
          {
            "description": "A web server process (e.g., w3wp.exe, httpd, nginx) spawns a command-line interpreter (e.g., cmd.exe, powershell.exe, sh, bash) or a reconnaissance tool (e.g., whoami.exe, ipconfig.exe), indicating the activation of a previously planted and acquired web shell.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing web servers, Application servers, Web server process logs",
            "action": [
              "Create a detection rule that alerts any time a web server parent process (e.g., w3wp.exe, apache.exe) is observed spawning a child process from a high-risk list, including cmd.exe, powershell.exe, pwsh.exe, sh, bash, whoami.exe, ipconfig.exe, or net.exe. This requires process creation logging (Event ID 4688) with command-line auditing enabled.",
              "Profile the parent-child process relationships for all web server processes over a 30-day baseline period. Calculate the frequency of each unique child process. Trigger an alert when a web server spawns a new child process that has never been seen before in the baseline (i.e., a frequency of zero), as this represents a statistically significant deviation from normal behavior.",
              "Train a supervised classification model on labeled process creation events (Event ID 4688) where the parent is a web server process. Use features from the child process, such as the process name and command-line arguments (e.g., using TF-IDF vectorization on the arguments), to classify each new process as benign or malicious, alerting on any process predicted as malicious with high confidence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]