[
  {
    "information_requirement": "Is an adversary impersonating a trusted person or organization to persuade a user to perform an action on their behalf?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1656",
        "name": "Impersonation",
        "evidence": [
          {
            "description": "An inbound email's source IP address, sender domain, or an embedded URL matches an indicator on a threat intelligence feed of known malicious IPs, domains, or URLs.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, DNS Resolvers, Web Proxy, Threat Intelligence Platform",
            "action": [
              "Create a SIEM rule that joins smtp.log, dns.log, and http.log records by session ID. Alert with high severity if the id.orig_h in smtp.log, query in dns.log, or host/uri in http.log matches any IP, domain, or URL on a threat intelligence feed.",
              "For sender domains present on a 'grey' intelligence list (e.g., newly registered domains), calculate their frequency of appearance in smtp.log over the last 90 days. Flag any such domain that also falls below the 5th percentile of historical frequency, as this combination of risk and rarity indicates a targeted attack.",
              "Deploy a classification model that scores incoming emails on a scale of 0 to 1. Use features such as sender IP reputation, domain age, SPF/DKIM/DMARC validation results from smtp.log, and threat feed matches. Trigger an alert for analyst review if an email's score exceeds a dynamically adjusted threshold, such as 0.85."
            ]
          },
          {
            "description": "An inbound email's 'From' header contains a display name matching a high-value internal identity (e.g., C-suite, finance), but the sender's domain is external and not on an allowlist of approved partner domains.",
            "data_sources": [
              "Zeek smtp.log",
              "Internal Identity List"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Directory Services, HR Information System",
            "action": [
              "Create a SIEM rule that references a watch list of high-value target display names. For each inbound email in smtp.log, parse the display name from the 'from' header. Generate a high-severity alert if the display name is on the watch list AND the sender's domain is not the internal domain or on a pre-approved partner domain list.",
              "For emails where the display name matches an internal executive, calculate the Levenshtein distance between the display name (e.g., 'Jane Doe') and the local-part of the sender's email address (e.g., 'jane.doe123'). Establish a baseline of this distance for legitimate external mail. Flag emails where this distance exceeds the 95th percentile of the baseline, indicating an unusual mismatch.",
              "Apply a clustering algorithm (e.g., DBSCAN) to features extracted from inbound email headers (smtp.log): display name string, sender domain, and top-level domain (TLD). Identify and alert on small, dense clusters that are separate from the main cluster of legitimate organizational email, as these may represent a coordinated impersonation campaign from a single source."
            ]
          },
          {
            "description": "An inbound email is received from a sender domain that has a low Levenshtein distance (e.g., 1-2 character difference) to the organization's primary domain or a known partner's domain, indicating potential typosquatting.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Approved Domain List"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, DNS Resolvers",
            "action": [
              "For each unique sender domain in smtp.log not on the approved list, script a process to calculate the Levenshtein distance against all domains on the approved list (internal and partner). Generate a medium-severity alert if the calculated distance is 1 or 2, indicating a potential typosquatting attempt.",
              "For each inbound sender domain, calculate a risk score using the formula $$ R = w_1(1/f) + w_2(1/d) $$, where $$ f $$ is the historical frequency of the domain in smtp.log and $$ d $$ is the minimum Levenshtein distance to an approved domain. Assign weights $$ w_1 $$ and $$ w_2 $$ based on risk appetite. Flag domains where the score $$ R $$ exceeds the 98th percentile of all calculated scores.",
              "Train a one-class SVM model using feature vectors derived from legitimate, frequently observed sender domains (e.g., character n-grams, domain length, TLD). Feed all new, unseen sender domains from smtp.log into the model. Flag any domain classified as an 'outlier' for analyst review as a potential typosquatting or other domain-based impersonation."
            ]
          },
          {
            "description": "An email contains high-urgency keywords ('urgent', 'payment', 'invoice') in the subject, targets a user in a sensitive role (e.g., finance, HR), and/or includes a high-risk attachment type (e.g., .iso, .img, .html, or a double extension like .pdf.exe).",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log",
              "Email Body Content"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Endpoint Devices, File Servers, Mail Content Inspection System",
            "action": [
              "Create a rule that triggers if an email in smtp.log has a subject matching a keyword list ('invoice', 'password reset', 'urgent') OR if a correlated files.log entry shows an attachment filename with a high-risk extension (.iso, .img, .html, .lnk). Increase alert severity if the recipient in smtp.log belongs to a 'sensitive roles' user group.",
              "For each department, calculate the baseline Shannon entropy of email subject lines from smtp.log. Create an alert for any inbound email whose subject line entropy score is more than 3 standard deviations from the department's mean, indicating either suspicious randomization or unusual simplicity common in attack campaigns.",
              "Apply a pre-trained Natural Language Processing (NLP) model to analyze email body content. Classify the email's intent (e.g., 'Financial Request', 'Credential Harvest', 'Benign'). Generate a high-severity alert if an email is classified as high-risk and is sent from an external, low-reputation domain."
            ]
          },
          {
            "description": "An authenticated internal user account sends emails that deviate from its established behavioral baseline (e.g., abnormal volume, unusual time of day, high recipient count), particularly following an anomalous login event.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Authentication Servers, Endpoint Devices, VPN Concentrators",
            "action": [
              "Create a correlation rule that triggers when a Windows Event ID 4624 (Successful Logon) from a source IP in an untrusted ASN (enriched via Zeek conn.log) is followed within 30 minutes by an outbound email blast from the same user account (e.g., recipient count > 50 in smtp.log).",
              "For each user, generate a 30-day rolling baseline of email activity from smtp.log, including average recipients per email and emails sent per hour. Alert if a user's activity exceeds the 99th percentile for either metric in a given hour, indicating a statistically significant deviation from their normal behavior.",
              "For each user, apply a time-series forecasting model (e.g., ARIMA or Prophet) to their hourly email sending volume from smtp.log. Generate an alert if the actual email volume in any given hour falls significantly outside the model's prediction interval, suggesting the account's behavior is no longer predictable and may be compromised."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]