[
  {
    "information_requirement": "Has the adversary gained initial access to the network via Wi-Fi?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1669",
        "name": "Wi-Fi Networks",
        "evidence": [
          {
            "description": "A successful (802.1X EAP-Success) or failed (EAP-Failure) Wi-Fi authentication event where the client's source MAC address or the access point's BSSID matches an entry on a threat intelligence watchlist of known malicious or unauthorized devices.",
            "data_sources": [
              "RADIUS authentication logs",
              "Zeek conn.log",
              "Zeek radius.log",
              "Wireless controller event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate wireless controllers, RADIUS authentication servers, Network monitoring sensors at Wi-Fi segment boundaries",
            "action": [
              "Join wireless authentication logs (e.g., RADIUS logs, Zeek radius.log) with a threat intelligence feed or internal watchlist of malicious/unauthorized MAC addresses and BSSIDs. Generate a high-severity alert for any successful or failed connection attempt involving a watchlisted identifier.",
              "For all connecting client MAC addresses, extract the Organizationally Unique Identifier (OUI). Calculate the frequency distribution of all OUIs observed over the last 30 days. Alert on any new connection from an OUI that falls in the bottom 5th percentile of frequency, indicating a rare type of hardware on the network.",
              "Train a binary classification model (e.g., Random Forest, Gradient Boosting) using labeled historical connection data (malicious/authorized). Features should include OUI, time of day, AP location, authentication type, and connection duration. Deploy the model to score new connections in real-time and alert on any connection classified as malicious with a confidence score above 0.9."
            ]
          },
          {
            "description": "A process creation event on an endpoint (e.g., Windows Event ID 4688) where the process name, hash, or command-line arguments match a known Wi-Fi reconnaissance or attack tool (e.g., 'aircrack-ng', 'kismet', 'netsh wlan show profiles key=clear').",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek software.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All corporate endpoints (especially laptops and mobile devices), Domain Controllers and SIEM for log aggregation",
            "action": [
              "Continuously scan process creation logs (Windows Event ID 4688) for process names, file hashes, or command-line string patterns matching a watchlist of Wi-Fi attack tools (e.g., 'aircrack-ng', 'reaver', 'ettercap', 'kismet', 'aireplay-ng', 'netsh wlan show profile'). Generate a high-severity alert upon any match.",
              "For network utility processes (e.g., 'netsh.exe'), calculate the Shannon entropy of their command-line arguments. Establish a baseline entropy value for each process. Alert when a command's entropy exceeds the 95th percentile of the historical baseline, indicating unusually high complexity or potential obfuscation.",
              "Train a time-series anomaly detection model (e.g., LSTM) on a host's network behavior metrics from Zeek logs (e.g., unique destinations per minute, protocol mix, connection count). When a symbolic rule for a suspicious process fires, check this model for anomalous network activity from the host in the subsequent 5-minute window. Escalate the alert if both conditions are met."
            ]
          },
          {
            "description": "Detection of a wireless access point that is either a) a Rogue AP broadcasting a non-corporate SSID from within the corporate network, or b) an Evil Twin AP broadcasting a corporate SSID (or a visually similar variant) from a BSSID not on the authorized list, or with a security configuration (e.g., Open, WEP) weaker than the corporate standard (e.g., WPA2/3-Enterprise).",
            "data_sources": [
              "Wireless Intrusion Detection System (WIDS/WIPS) logs",
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical office locations with Wi-Fi coverage, Wireless Intrusion Prevention System (WIPS) sensors, Corporate wireless controllers",
            "action": [
              "Maintain an inventory of authorized corporate APs, including their BSSID, SSID, security protocol, and physical location. Continuously monitor WIDS/WIPS probe responses and beacon frames. Generate a critical alert if an AP broadcasts a corporate SSID from an unauthorized BSSID or with a non-compliant security configuration.",
              "For each authorized BSSID, baseline its typical signal strength (RSSI) as seen by multiple WIPS sensors. Use a change point detection algorithm to monitor the RSSI time series. Alert on the sudden, persistent appearance of a new BSSID broadcasting a corporate SSID, or a known BSSID appearing with a drastically different RSSI profile, which may indicate a physically moved or spoofed AP.",
              "Apply a clustering algorithm (e.g., DBSCAN) to radio-frequency data (channel, signal strength, detected neighbors) of all observed access points. Authorized APs should form stable, predictable clusters. A new device appearing as a distinct outlier or forming a new small cluster, especially while mimicking a corporate SSID, should be flagged as a potential rogue or evil twin AP."
            ]
          },
          {
            "description": "A high volume of failed 802.1X authentication events or disassociation frames within a short time window, indicating either a brute-force/password spraying attack from a single client or a widespread deauthentication/disassociation attack affecting multiple clients.",
            "data_sources": [
              "RADIUS authentication logs",
              "Zeek radius.log",
              "Wireless controller event logs",
              "WIDS/WIPS logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "RADIUS authentication servers, Corporate wireless controllers",
            "action": [
              "Trigger an alert if a single source MAC address generates more than 20 failed authentication attempts within 5 minutes. Additionally, alert if WIPS logs detect a burst of deauthentication or disassociation frames (>50 frames in 1 minute) directed at the broadcast address or a specific client.",
              "Calculate a baseline for the rate of failed authentications per hour across the entire wireless network using a 30-day moving average and standard deviation. Alert if the current hourly failure rate exceeds the mean plus three standard deviations, suggesting a large-scale disruptive event.",
              "Use a time-series forecasting model (e.g., ARIMA or Prophet) on the minute-by-minute count of authentication failures. If the observed number of failures significantly exceeds the model's forecasted upper confidence interval for several consecutive minutes, flag it as a predictive anomaly indicative of a sustained attack."
            ]
          },
          {
            "description": "A successful wireless authentication from a) a client MAC address not registered in the asset inventory or b) a registered MAC address exhibiting behavior inconsistent with its known device profile, such as presenting a new DHCP fingerprint or connecting from two physically distant access points simultaneously ('impossible travel').",
            "data_sources": [
              "RADIUS authentication logs",
              "Zeek conn.log",
              "Zeek dhcp.log",
              "Wireless controller logs",
              "Asset Management Database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Access Control (NAC) system, Asset Management Database, DHCP servers, Network switches, Wireless controllers",
            "action": [
              "For each successful 802.1X authentication, join the client MAC address with the asset management database. Generate a medium-severity alert if the authenticating MAC address is not on the authorized device list.",
              "For each MAC address, maintain a list of APs it has recently connected to and their locations. Calculate the time between disconnect and reconnect events during roaming. If a device appears to 'roam' between two physically distant APs in a time frame that is physically impossible (e.g., traveling 1km in 5 seconds), flag it as a MAC spoofing event.",
              "Create a device fingerprint for each MAC address based on its DHCP request parameters (from Zeek dhcp.log) and TCP/IP stack characteristics (from Zeek conn.log). Train a one-class SVM or other anomaly detection model on the historical fingerprints for each device. If a new connection from a known MAC presents a fingerprint that the model flags as an anomaly, alert for potential MAC spoofing."
            ]
          },
          {
            "description": "A single host, identified by its hostname or MAC address, holding active IP addresses on both a wired and a wireless subnet simultaneously and actively routing or forwarding traffic between these two network interfaces.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "DHCP logs",
              "DNS logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, Endpoint devices, DNS and DHCP servers, Domain Controllers",
            "action": [
              "From DHCP logs, identify hostnames that have active leases on both wired and wireless subnets. Cross-reference these hosts with Windows Event ID 5156 (WFP permitted a connection) where the Application Name is `svchost.exe` and the Filter Run-Time ID corresponds to the Internet Connection Sharing (SharedAccess) service. Alert on a match.",
              "Using Zeek conn.log, find hosts with IPs on both wired and wireless subnets. For each such host, count the number of unique IP addresses on the wired network it communicates with from its wireless IP, and vice-versa. A non-bridging host should have a count near zero. Flag any host where this 'cross-network communication' count exceeds a low threshold (e.g., >5 unique hosts) as a potential bridge.",
              "Construct a communication graph from Zeek conn.log where nodes are IP addresses and edges represent connections. Apply a community detection algorithm (e.g., Louvain Modularity) to identify the wired and wireless subnets as distinct communities. Use a graph metric like betweenness centrality to score all nodes. A dual-homed host acting as a bridge will have an anomalously high betweenness centrality score as it connects the two communities."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]