[
  {
    "information_requirement": "Has the adversary executed commands on guest VMs using ESXi administration services?",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1675",
        "name": "ESXi Administration Command",
        "evidence": [
          {
            "description": "A process spawned by vmtoolsd.exe on a guest VM whose process hash, command-line arguments, or subsequent network connections match known-bad indicators from threat intelligence.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Guest Virtual Machines (especially Domain Controllers, Database Servers), Network Egress Points, Threat Intelligence Platforms",
            "action": [
              "For each process creation event (Windows Event ID 4688) where the parent process is 'vmtoolsd.exe', extract the child process hash, command line, and process ID. Correlate the process ID with network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) from the same host. Alert if the process hash, command-line arguments, destination IP addresses, or queried domains match entries in a subscribed threat intelligence feed.",
              "Calculate the historical rarity using term frequency-inverse document frequency (TF-IDF) of individual tokens (words, paths) within command-line arguments for all processes spawned by 'vmtoolsd.exe'. Flag any command line containing tokens that fall below a low percentile threshold (e.g., 1st percentile) of historical usage frequency, indicating an unusual command.",
              "Train a supervised classification model (e.g., Logistic Regression, Random Forest) on a labeled dataset of benign and malicious command lines. Use features such as string length, character entropy, presence of IP addresses, and keyword matches (e.g., 'esxcli', 'vm process kill'). Apply the model to score the maliciousness of new command lines from 'vmtoolsd.exe' child processes. An event with a high maliciousness score, even without a direct IOC match, should be flagged for review."
            ]
          },
          {
            "description": "The vmtoolsd.exe process on a guest VM is observed spawning a command-line interpreter or scripting engine (e.g., cmd.exe, powershell.exe, sh, bash, wscript.exe), which is a high-confidence indicator of arbitrary command execution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Guest Virtual Machines (especially Domain Controllers, Database Servers)",
            "action": [
              "Create a high-priority alert that triggers on any process creation event (Windows Event ID 4688) where the ParentProcessName is 'vmtoolsd.exe' and the NewProcessName is one of: 'cmd.exe', 'powershell.exe', 'pwsh.exe', 'wscript.exe', 'cscript.exe', 'sh', 'bash', 'zsh', 'rundll32.exe'. This behavior is almost always malicious and warrants immediate investigation.",
              "Over a 30-day rolling window, calculate the total count of shell processes spawned by 'vmtoolsd.exe' per host. The baseline for this count should be zero. Alert on any host where this count is greater than zero. Additionally, calculate the entropy of parent-child process pairs across the environment; a sudden increase in the entropy of pairs involving 'vmtoolsd.exe' indicates it is spawning a wider, anomalous variety of children.",
              "Develop a sequence analysis model (e.g., using a Long Short-Term Memory network or LSTM) trained on normal process execution chains on guest VMs. The model learns legitimate sequences of parent-child process relationships. Flag any sequence where 'vmtoolsd.exe' is the parent of a shell or scripting engine process as a high-probability anomaly, as this sequence should not exist in legitimate operations."
            ]
          },
          {
            "description": "A child process is spawned by vmtoolsd.exe that is not part of an established baseline of legitimate, expected child processes for VMware Tools operations.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Guest Virtual Machines (especially Domain Controllers, Database Servers)",
            "action": [
              "Establish and maintain a strict allowlist of known-good child process names for 'vmtoolsd.exe' (this list is typically very small, e.g., 'VMwareUser.exe', or empty). Create an alert to trigger for any process creation event (Windows Event ID 4688) where the parent is 'vmtoolsd.exe' and the child process name is not on the established allowlist.",
              "For each unique child process name spawned by 'vmtoolsd.exe', calculate its prevalence (frequency) across the entire fleet of guest VMs over a 30-day period. Alert on any child process that is statistically rare, for example, appearing on fewer than 1% of hosts or falling in the bottom 5th percentile of process frequency across the environment.",
              "Use an unsupervised anomaly detection algorithm, such as a one-class SVM or an Isolation Forest, trained on features of normal 'vmtoolsd.exe' child processes (e.g., one-hot encoded process name, command-line length, user context). Apply the trained model to new process creation events to identify outliers that deviate significantly from the learned 'normal' profile."
            ]
          },
          {
            "description": "A network connection from an ESXi management IP address to a guest VM on the VMware Tools port (TCP/902) is followed within a short time window by anomalous process creation or outbound network activity originating from that same guest VM.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ESXi Host Management Interfaces, vCenter Server, Virtual Machine Network Segments, Network Egress Points",
            "action": [
              "Correlate network logs (Zeek conn.log) with host logs (Windows Event ID 4688). Trigger an alert if a connection from a known ESXi host IP to a guest VM IP on TCP port 902 is followed within a 2-minute window by a process spawned from 'vmtoolsd.exe' on that guest VM that matches a suspicious pattern (e.g., spawning a shell, running reconnaissance commands like 'whoami' or 'net user').",
              "For each guest VM, establish a baseline of the daily volume (bytes) and count of connections received from ESXi management IPs on TCP port 902. Use time-series analysis (e.g., moving averages) to detect significant deviations (e.g., a spike exceeding 3 standard deviations from the mean) in this traffic. Correlate these network spikes with subsequent spikes in the number of processes spawned by 'vmtoolsd.exe' on the same guest VM.",
              "Use a graph-based analysis model where ESXi hosts, guest VMs, and processes are nodes. Create directed edges for 'connects to' (from Zeek conn.log data) and 'spawns' (from Windows Event ID 4688 data). Search for the specific subgraph pattern: [ESXi Host] -connects_on_902-> [Guest VM] -spawns-> [vmtoolsd.exe] -spawns-> [Anomalous Process]. A classifier can be trained to score the risk of these subgraphs based on process names, command-line arguments, and connection properties."
            ]
          },
          {
            "description": "A single source IP address, such as an ESXi host or administrative workstation, is observed initiating guest operations that result in process creation via 'vmtoolsd.exe' across an unusually high number of distinct guest VMs within a short time frame, indicating lateral movement or mass deployment.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Guest Virtual Machines (fleet-wide), ESXi Host Management Interfaces, vCenter Server",
            "action": [
              "Create a rule that triggers if a single source IP (inferred from network connections to guest VMs on port 902 preceding process creation) is associated with 'vmtoolsd.exe'-spawned processes on more than a static threshold of distinct guest VMs (e.g., >10 VMs) within a 5-minute window. This indicates a potential automated 'fan-out' attack.",
              "For each potential source IP communicating with guests, aggregate all 'vmtoolsd.exe'-spawned process events across all guest VMs. Group these events by the source IP over a rolling 10-minute window. Calculate the Shannon entropy of the set of targeted guest VM IP addresses for each source IP. A sudden, sharp increase in entropy for a single source indicates it is targeting a much wider and more random set of VMs than usual, a strong indicator of malicious activity.",
              "Use a density-based clustering algorithm (e.g., DBSCAN) on a dataset of guest operation events. Use features like source IP, timestamp, and a numerical representation of the target guest VM IP. A dense cluster of events originating from a single source IP and targeting many different VMs in a short time would be identified as an anomalous cluster, indicative of a coordinated attack like ransomware deployment."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]