[
  {
    "information_requirement": "Is the adversary attempting to discover virtual machines within the enterprise environment?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1673",
        "name": "Virtual Machine Discovery",
        "evidence": [
          {
            "description": "A network connection is established from an internal source IP address present on a threat intelligence watchlist to a known hypervisor management interface (e.g., ports 443, 902, 5988, 5989).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management network segments, Core network switches, Virtual infrastructure management servers (e.g., vCenter, SCVMM), Internet gateways",
            "action": [
              "Create a rule to continuously join an internal watchlist of malicious IP addresses with Zeek conn.log records where the id.resp_h is a known hypervisor and id.resp_p is a management port (e.g., 443, 902, 5988, 5989). Alert on any match.",
              "For each source IP connecting to hypervisor management interfaces, calculate the rarity of the source-destination pair based on a 30-day historical baseline of connections. Alert if the connection pair falls below the 5th percentile of historical frequency, indicating an anomalous and potentially malicious connection.",
              "Train a one-class SVM (Support Vector Machine) model on features from normal connection logs to hypervisor management interfaces (e.g., source IP subnet, time of day, bytes sent/received, protocol). Use the trained model to classify new connections as normal or anomalous. Connections flagged as anomalous by the model should generate an alert for analyst review."
            ]
          },
          {
            "description": "A process creation event is observed on a host or management server containing command-line arguments that match known VM discovery utilities or patterns (e.g., `esxcli vm process list`, `vim-cmd vmsvc/getallvms`, `Get-VM`, `wmic path MSVM_ComputerSystem get ElementName`, `virsh list --all`, `qm list`).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor hosts (ESXi, Hyper-V), Virtualization management servers, Domain Controllers, Administrator workstations, Jump boxes",
            "action": [
              "Monitor Windows Event ID 4688 and Sysmon Event ID 1 logs for process creation events where the ProcessCommandLine or CommandLine field matches a predefined list of regular expressions for VM discovery tools, such as `esxcli`, `vim-cmd`, `Get-VM`, `VBoxManage`, `virsh list`, `qm list`, or `systeminfo | findstr /i \"virtual\"`. Generate an alert upon a match.",
              "For each user account, establish a baseline of normally executed commands and their argument patterns. Calculate the Shannon entropy of the command-line arguments for each new process execution. An execution of a command with an abnormally low historical probability for that user (e.g., below the 1st percentile) or a sudden spike in argument entropy should trigger an alert.",
              "Develop a classification model (e.g., Random Forest or Gradient Boosting) trained on labeled command-line data (benign vs. malicious discovery) using NLP features like command length, n-grams, and presence of special characters. Deploy the model to score new process creation events in real-time and alert on high-probability malicious commands."
            ]
          },
          {
            "description": "A single source IP address initiates connections to a high number of distinct destination hosts or destination ports within a designated hypervisor network segment over a short time frame, indicative of a network sweep.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management network segments, DMZ, Core network switches, VLANs containing virtual infrastructure",
            "action": [
              "Create a stateful rule that triggers when a single source IP (`id.orig_h`) generates more than a fixed number (e.g., 20) of `conn.log` entries to unique destination IPs (`id.resp_h`) within the hypervisor VLAN in a 60-second window. Alert on any source IP that breaches this threshold.",
              "For each source IP, calculate the count of distinct destination IPs and destination ports contacted within a 5-minute sliding window. Establish a baseline distribution for these counts over a 30-day period. Alert if a source IP's activity exceeds the 99th percentile of the established baseline for either distinct destination IPs or ports.",
              "Use a time-series anomaly detection model (e.g., ARIMA or LSTM) to monitor the rate of new connections originating from individual hosts destined for the hypervisor subnets. The model should learn the normal daily and weekly cyclical patterns of connection rates. An alert is generated when the observed connection rate significantly deviates from the model's prediction, indicating a potential scanning activity."
            ]
          },
          {
            "description": "A legitimate hypervisor management tool (e.g., esxcli, PowerCLI) or API is used by a non-privileged user account, from a host not on an approved management host list, or in a manner that deviates from established frequency and time-of-day baselines.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek http.log",
              "ESXi /var/log/hostd.log",
              "ESXi /var/log/vobd.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Virtualization management servers (vCenter, SCVMM), Administrator workstations, Jump boxes/bastion hosts, Hypervisor hosts",
            "action": [
              "Maintain an explicit allow-list of user accounts and source hostnames authorized to execute hypervisor CLI tools (e.g., `esxcli`, `Get-VM`). Correlate process creation events (Windows Event ID 4688) with login data (Windows Event ID 4624) and alert on any execution by a user or from a host not on the allow-list.",
              "For each authorized administrative user, baseline the frequency and timing of hypervisor management commands over a 30-day period. Use a moving average and standard deviation to model normal activity. Alert if a user's command frequency in a 1-hour window exceeds 3 standard deviations above their historical average.",
              "Implement a peer group analysis model using k-means clustering to group administrative users based on their roles and API/CLI access patterns. For each user, compare their current hypervisor management activity against the aggregated behavioral profile of their peer group. An alert is generated if a user's activity is a statistical outlier compared to their peers."
            ]
          },
          {
            "description": "A successful authentication (Windows Event ID 4624) to a hypervisor management server from a source IP that recently generated a high volume of failed authentications (Windows Event ID 4625), followed within a short time window by process execution events (Windows Event ID 4688) matching VM discovery patterns.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management servers, Domain Controllers, RADIUS/TACACS+ servers, Identity and access management systems",
            "action": [
              "Create a correlation rule that triggers if a source IP generates >10 failed logins (Event ID 4625) followed by one successful login (Event ID 4624) to a hypervisor, AND within 10 minutes, the same user account from that login session executes a known discovery command (Event ID 4688) on that hypervisor. Alert on this specific sequence.",
              "Calculate a risk score for each login event to a hypervisor based on statistical features: rarity of source IP geolocation (enriched from Zeek conn.log), time-of-day anomaly (deviation from user's normal login hours), and the ratio of recent failed-to-successful logins from the source IP. If the score exceeds the 98th percentile, flag the session. If a flagged session is followed by any VM discovery command, escalate to a high-severity alert.",
              "Use a Hidden Markov Model (HMM) to model the sequence of attacker actions: (State 1: Failed Logins) -> (State 2: Successful Login) -> (State 3: Discovery Command). Apply the model to real-time event streams (Event IDs 4625, 4624, 4688) to calculate the probability of an observed event sequence matching the malicious state transition path. A high probability triggers an alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]