[
  {
    "information_requirement": "Is the adversary employing email spoofing for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1672",
        "name": "Email Spoofing",
        "evidence": [
          {
            "description": "An inbound email is received where the source IP address or domains found within the 'From', 'Reply-To', or 'Return-Path' headers are present on a high-confidence threat intelligence list of indicators associated with phishing or malware campaigns.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ network segment hosting email gateways, Network perimeter firewalls, Threat Intelligence Platform API endpoint",
            "action": [
              "Query all inbound email transactions. For each transaction, compare the source IP (`id.orig_h` in `conn.log`) and header domains (`from`, `reply_to`, `path` in `smtp.log`) against a curated list of high-confidence malicious indicators. Trigger a high-severity alert for any match.",
              "For each inbound email, aggregate reputation scores for the source IP and sender domain from multiple threat intelligence feeds. Calculate a weighted average risk score. Establish a threshold at the 85th percentile of scores observed from known-bad indicators over the last 30 days. Flag any email exceeding this threshold for review.",
              "Develop a supervised classification model (e.g., Gradient Boosting) using a labeled dataset of malicious and benign emails. Engineer features such as the source IP's ASN and country, domain age of the sender, TLD rarity, and aggregated threat intelligence scores. Deploy the model to score new emails in real-time. Generate an alert for any email with a predicted malicious probability greater than 0.90."
            ]
          },
          {
            "description": "An inbound email, purporting to be from a high-value domain (e.g., internal, key business partner, financial institution), fails SPF or DKIM authentication. Alternatively, an inbound email originates from a domain that has published a weak DMARC policy (`p=none` or `p=quarantine` with a low percentage).",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email security gateway, Corporate DNS resolvers, Directory of trusted partner domains",
            "action": [
              "Create a detection rule that triggers an alert when an inbound email meets both of the following conditions: 1) The 'From' header domain is on a watchlist of internal or high-value partner domains. 2) The email's SPF or DKIM authentication result is 'fail' or 'softfail'. Create a separate, lower-severity alert for any email from a high-value domain where the sender's DMARC policy is `p=none`.",
              "For each external sender domain, maintain a 30-day rolling baseline of the daily SPF/DKIM failure rate. Calculate the 95th percentile of this historical failure rate. Trigger an alert if the current day's failure rate for a specific domain exceeds this statistical threshold, indicating an abnormal number of authentication failures.",
              "For each high-value sender domain, apply a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) to the hourly count of emails failing SPF/DKIM checks. The model should account for daily and weekly seasonality. An alert is generated when the observed failure count significantly exceeds the model's forecasted range, suggesting a targeted spoofing campaign."
            ]
          },
          {
            "description": "An inbound email exhibits a mismatch between the domain in the friendly 'From' header (RFC5322.From) and the domain in the SMTP envelope 'MAIL FROM' (RFC5321.MailFrom). This mismatch is flagged as suspicious when the friendly 'From' domain is an internal domain or belongs to a trusted partner.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Transfer Agent (MTA) logs, Email security gateway inspection point",
            "action": [
              "For every inbound email processed, parse the `from` (RFC5322.From) and `path` (RFC5321.MailFrom) fields from `smtp.log`. Trigger a high-severity alert if the top-level domain plus one (TLD+1) of these fields do not match AND the `from` domain is on a watchlist of internal or high-value partner domains.",
              "Maintain a historical frequency map of all (`from` domain, `mailfrom` domain) pairs observed over the last 90 days. For any new email where the `from` domain is a trusted entity, check if the corresponding (`from`, `mailfrom`) pair has been seen before. If the pair is new or its frequency is in the bottom 5th percentile of all pairs associated with that `from` domain, flag it for review.",
              "For each high-value `from` domain, train an autoencoder model on the historical set of legitimate `mailfrom` domains associated with it (represented as categorical features or embeddings). For each new email, use the trained model to generate a reconstruction error for its `mailfrom` domain. An error score exceeding a predefined threshold (e.g., 99th percentile of reconstruction errors on a validation set) indicates an anomalous and likely spoofed `mailfrom` sender."
            ]
          },
          {
            "description": "The volume of inbound emails from a single source IP address, where the 'From' header purports to be from a specific trusted domain (internal or partner), significantly exceeds a historically established baseline within a short time frame.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow data collectors at the internet gateway, Email gateway transaction logs",
            "action": [
              "Implement a rule that counts the number of emails per source IP for each trusted 'From' domain over a 5-minute sliding window. Trigger an alert if this count exceeds a static threshold (e.g., 100 emails), indicating a potential bulk sending event.",
              "For each (`Source IP`, `From Domain`) pair, calculate the mean and standard deviation of email volume per 10-minute interval over a 30-day baseline. Generate an alert if the current volume in a 10-minute window exceeds the mean by more than 3 standard deviations (Z-score > 3).",
              "For high-volume (`Source IP`, `From Domain`) pairs, apply a time-series decomposition model (e.g., STL) to the hourly email counts to separate trend, seasonal, and residual components. Monitor the residual component and trigger an alert if it exceeds a dynamic threshold (e.g., 3 times the interquartile range of the historical residuals), flagging volume spikes not explained by normal business cycles."
            ]
          },
          {
            "description": "An inbound email claiming to be from a trusted 'From' domain originates from a source IP address whose network (ASN), geographic (country), or reputational attributes are inconsistent with the established profile of legitimate senders for that domain.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway routers, Subscription-based GeoIP and ASN databases",
            "action": [
              "Maintain an explicit allow-list of known-good source countries and ASNs for critical domains (e.g., your own domain, key financial partners). Trigger a high-severity alert for any email purporting to be from these domains that originates from a country or ASN not on the list.",
              "For each trusted sender domain, build a historical profile of legitimate source countries and ASNs observed over the last 90 days. For each new inbound email, calculate the Shannon entropy of the source ASN given the sender domain. A high entropy score, or an ASN/country pair never seen before, indicates a deviation from the established communication pattern and should be flagged.",
              "For each high-value sender domain, apply a density-based clustering algorithm (e.g., HDBSCAN) to the features of its source IPs, including ASN, country code, and IP reputation score, to identify 'clusters' of normal sending infrastructure. Score new inbound emails based on their proximity to these clusters. Emails that are classified as noise or fall into very small, sparse clusters are considered anomalous and should be alerted on."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]