[
  {
    "information_requirement": "Has the adversary accessed cached domain credentials? (PIR)",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003.005",
        "name": "Cached Domain Credentials",
        "evidence": [
          {
            "description": "A process creation event is logged where the process executable's cryptographic hash (e.g., SHA256) matches a known hash of a credential dumping utility (e.g., Mimikatz, secretsdump.py) from a verified threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon for Linux Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows and Linux Endpoints, Privileged Access Workstations, Critical Application Servers, and Domain Controllers.",
            "action": [
              "Symbolic (IOC Match): Correlate the process executable hash (from Sysmon Event ID 1) against a threat intelligence feed of known credential dumping tool hashes. Generate a high-severity alert upon a match.",
              "Statistical (Rarity Analysis): For each process execution, calculate the enterprise-wide prevalence of its hash. If a hash is seen on fewer than 5 hosts or less than 0.01% of the fleet and is not part of a known software deployment, increase its risk score. Further increase the score if the process runs from a temporary or user-writable directory (e.g., C:\\Users\\*\\AppData\\Local\\Temp, /tmp).",
              "Machine Learning (Classification): Train a supervised classification model (e.g., XGBoost, Random Forest) using process metadata as features. Include features such as: hash prevalence, file path entropy, parent process name, parent process path, process name string length, and a boolean for whether the process is signed. Classify new processes as benign or malicious based on this model."
            ]
          },
          {
            "description": "A process is executed with command-line arguments containing strings or regular expression patterns that are signatures for credential dumping, such as 'sekurlsa::logonpasswords', 'lsadump::cache', 'reg.exe save HKLM\\SECURITY', or 'tdbdump'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Auditd logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Authentication Servers, Linux systems integrated with Active Directory",
            "action": [
              "Symbolic (Regex Match): Create and apply a SIEM rule that uses regular expressions to search process command-line arguments for known credential dumping commands and patterns, such as 'sekurlsa::', 'lsadump::cache', 'reg.exe save HKLM\\\\SECURITY', and 'tdbdump'. Alert on any match.",
              "Statistical (Frequency Analysis): For each host and user, establish a baseline of command-line argument patterns used over a 30-day period using n-grams (n=3). Flag any command-line execution whose pattern falls into the 99.5th percentile of rarity for that specific user or host as anomalous and requiring review.",
              "Machine Learning (NLP Clustering): Apply a Natural Language Processing (NLP) model to generate embeddings for all observed command-line arguments. Use a clustering algorithm (e.g., K-Means) to group similar commands. Investigate new commands that fall into known malicious clusters or that are identified as outliers to all established benign clusters."
            ]
          },
          {
            "description": "An unauthorized process reads from or requests a handle to a critical registry hive object containing cached credentials, specifically '\\REGISTRY\\MACHINE\\SECURITY', '\\REGISTRY\\MACHINE\\SYSTEM', or '\\REGISTRY\\MACHINE\\SAM'.",
            "data_sources": [
              "Windows Event ID 4656",
              "Windows Event ID 4663",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Windows Servers with cached credentials enabled, User Workstations",
            "action": [
              "Symbolic (Allowlist/Blocklist): Deploy System Access Control Lists (SACLs) on the HKLM\\SECURITY, HKLM\\SYSTEM, and HKLM\\SAM registry hives. Create a SIEM rule to alert when a read handle (Windows Event ID 4656/4663) is requested by a process image path not on a pre-defined allowlist of legitimate system processes (e.g., lsass.exe, System, TrustedInstaller.exe).",
              "Statistical (Path Entropy): For each process accessing these critical hives, calculate the Shannon entropy of its file path string. A process accessing these hives from a high-entropy path (e.g., 'C:\\Users\\Public\\AppData\\Local\\Temp\\xkv9s7z2.exe'), which is statistically rare compared to baseline path entropy, is highly suspicious and should be scored as a high-risk event.",
              "Machine Learning (Clustering): Use an unsupervised clustering algorithm (e.g., DBSCAN) on events related to registry hive access. Cluster based on features like process name, user context, time of day, and parent process. Outlier clusters or individual outlier events that do not belong to established 'benign' clusters represent anomalous access patterns requiring investigation."
            ]
          },
          {
            "description": "A process not on an established allowlist requests a handle with specific access rights (e.g., PROCESS_VM_READ) to the Local Security Authority Subsystem Service (lsass.exe) process.",
            "data_sources": [
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, especially Domain Controllers",
            "action": [
              "Symbolic (Signature Match): Monitor Sysmon Event ID 10 (ProcessAccess) where the TargetImage is 'C:\\\\Windows\\\\System32\\\\lsass.exe'. Create a high-severity alert if the GrantedAccess code includes PROCESS_VM_READ (e.g., '0x1010', '0x1410', '0x1038') and the SourceImage is not on an allowlist of known security tools and system processes (e.g., MsMpEng.exe, svchost.exe).",
              "Statistical (Behavioral Baselining): Establish a baseline of (SourceImage, LogonId) pairs that access lsass.exe over a 30-day period. Alert on any new pair observed for the first time ('first-seen' analysis). Score the alert's severity based on the rarity of the SourceImage process across the enterprise; a rare process accessing LSASS is more suspicious than a common one.",
              "Machine Learning (One-Class SVM): Train a one-class SVM (Support Vector Machine) model on feature vectors from legitimate LSASS access events (SourceImage path, parent process, user, GrantedAccess code). Use this model to identify any new access events that are anomalous or novel, indicating a potential credential dumping attempt."
            ]
          },
          {
            "description": "A multi-stage attack is observed on a single host, where a credential dumping indicator (e.g., LSASS access, suspicious command) is followed within a 60-minute window by anomalous network authentication activity originating from that same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 10",
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise-wide network traffic gateways, Authentication logs on all servers, Process execution logs on all endpoints",
            "action": [
              "Symbolic (Correlation Rule): Create a stateful correlation rule that triggers when an alert for LSASS access or suspicious command-line usage is generated for a host. If, within the next 60 minutes, that same host originates network logons (Windows Event ID 4624, Logon Type 3) to more than 5 distinct internal hosts for the first time in 7 days, escalate to a high-severity incident.",
              "Statistical (Connection Baselining): Following a credential dumping alert on a host, analyze its subsequent network connections from Zeek conn.log. Calculate the historical 99th percentile of distinct destination IP addresses and destination ports contacted by that host per hour. If the host exceeds this statistical threshold in the hour following the alert, flag it for anomalous lateral movement.",
              "Machine Learning (Hidden Markov Model): Use a Hidden Markov Model (HMM) where the hidden states are 'Benign Activity', 'Credential Dumping', and 'Lateral Movement'. Train the model on sequences of security events (process creation, network connections, authentication events). An observed sequence of events that results in a high probability of transitioning from 'Benign Activity' to 'Credential Dumping' and then to 'Lateral Movement' would generate a high-confidence alert."
            ]
          },
          {
            "description": "A process reads from or is executed with arguments targeting Linux credential cache files, such as SSSD (`/var/lib/sss/db/cache_*.ldb`) or Quest Authentication Services (`/var/opt/quest/vas/authcache/vas_auth.vdb`).",
            "data_sources": [
              "Auditd logs",
              "Sysmon for Linux Event ID 1",
              "bash_history"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Linux servers and workstations integrated with Active Directory via SSSD or Quest/VAS.",
            "action": [
              "Symbolic (Signature Match): Using auditd, monitor for read access to '/var/lib/sss/db/cache_*.ldb' or '/var/opt/quest/vas/authcache/vas_auth.vdb' by any process whose user is not 'root' or 'sssd'. Additionally, create a regex rule to search shell logs and process command lines for the string 'tdbdump' used against these file paths.",
              "Statistical (Rarity Analysis): Establish a baseline of all processes that access the credential cache file paths. Any access from a process not in the baseline is anomalous. Calculate the rarity of the command-line arguments for any process accessing these files; a command seen for the first time is highly suspicious.",
              "Machine Learning (Classification): Train a supervised classification model (e.g., Logistic Regression) to classify file access events on these sensitive paths as benign or malicious. Features should include: user name, user privileges (is_root), process name, parent process name, and time of day. Label data based on known administrative scripts versus suspicious interactive sessions."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]