[
    {
        "information_requirement": "Is the adversary attempting to blend command and control traffic by impersonating legitimate protocols or services?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1001.003",
                "name": "Protocol or Service Impersonation",
                "evidence": [
                    {
                        "description": "Network traffic on standard service ports destined for IP addresses, domains, or autonomous systems known to be associated with command and control infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join destination IP addresses from Zeek conn.log, 'Host' headers from Zeek http.log, and queried domains from Zeek dns.log with a high-confidence, frequently updated CTI feed of known C2 servers and malicious autonomous systems. Alert on any matches, especially for traffic on common service ports (e.g., 80, 443) and investigate the associated host and user."
                    },
                    {
                        "description": "Network traffic matching specific signatures of known C2 frameworks that impersonate common protocols, such as distinctive JA3/JA3S hashes, User-Agent strings, URI patterns, or SSL certificate attributes.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek http.log",
                            "Zeek x509.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan Zeek ssl.log for JA3/JA3S hashes known to be used by C2 frameworks (e.g., Cobalt Strike, Empire, Metasploit). Analyze Zeek http.log for specific User-Agent strings or URI structures associated with these tools. Inspect Zeek x509.log for SSL certificates with common default values used by C2 kits (e.g., default organization names, short validity periods, specific issuer strings). Maintain and update lists of these patterns from CTI and open-source research and alert on matches."
                    },
                    {
                        "description": "Network connections to external IPs on common service ports (e.g., 80, 443) initiated by processes that typically do not establish external network connections or are not expected to communicate with the internet.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 5156",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal networking behavior for processes across the enterprise using data from Windows Event ID 4688 (Process Creation) and Windows Event ID 5156 (Network Connection) or Zeek conn.log. Identify processes initiating external connections that deviate from their established baseline (e.g., svchost.exe, lsass.exe, or administrative utilities making unexpected outbound calls). Use frequency analysis to flag rare process-to-destination connections and investigate associated activity."
                    },
                    {
                        "description": "Network connections exhibiting a regular, rhythmic pattern (beaconing) in their timing and/or having unusually long session durations, inconsistent with typical interactive user or legitimate service traffic.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log timestamps and durations for connections from internal hosts to external destinations. For each source-destination pair, calculate the time delta between consecutive connections. Use time series analysis and statistical tests (e.g., autocorrelation, Fourier analysis) to identify highly regular, periodic connections. Additionally, use IQR or percentile analysis to flag connections with unusually long durations compared to the baseline for that port/service. Correlate beaconing behavior with other suspicious indicators."
                    },
                    {
                        "description": "Network traffic on a standard service port that fundamentally violates the protocol specification or exhibits non-standard behavior, such as encrypted traffic without a proper TLS handshake on port 443.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for connections on TCP port 443 that fail to generate a corresponding Zeek ssl.log entry, indicating that the traffic is not valid TLS/SSL. Additionally, monitor Zeek ssl.log for records containing validation errors or unusual cipher suites. Use frequency analysis to identify internal hosts frequently engaging in such non-compliant communication, which may indicate custom C2 protocols masquerading on a standard port. Correlate with process-level data on the source host."
                    },
                    {
                        "description": "Network traffic on standard service ports exhibiting anomalous data flow ratios, such as unusually large client-to-server data volumes compared to server-to-client, inconsistent with the impersonated protocol.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For traffic on common ports (e.g., 80 for HTTP, 443 for HTTPS, 53 for DNS), analyze Zeek conn.log to calculate the ratio of bytes sent from the client (orig_bytes) to bytes sent from the server (resp_bytes). Establish baselines for typical data flow ratios for legitimate services. Use descriptive statistics and IQR/box plots to identify connections with highly anomalous data flow ratios (e.g., large data uploads over DNS or HTTP where downloads are expected) that deviate significantly from established baselines."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
