[
  {
    "information_requirement": "Is the adversary attempting to blend command and control traffic by impersonating legitimate protocols or services?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1001.003",
        "name": "Protocol or Service Impersonation",
        "evidence": [
          {
            "description": "A successful TCP or UDP network connection from an internal host to an external IP address, domain, or Autonomous System Number (ASN) that is present on a high-confidence threat intelligence feed of known command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Egress Firewalls, DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Continuously join destination IP addresses from Zeek conn.log, 'host' headers from Zeek http.log, and queried domains from Zeek dns.log against a high-confidence, frequently updated CTI feed of known C2 indicators (IPs, domains, ASNs). Generate an alert on any match.",
              "Statistical: Calculate the frequency of connections to newly observed domains or IPs across the enterprise over a 1-hour window. Flag destinations that receive connections from a statistically unusual number of unique internal hosts (e.g., > 95th percentile of new destination fan-out), as this may indicate a new, widespread C2 campaign.",
              "Machine Learning: Train a classification model (e.g., Random Forest, Gradient Boosting) on features from Zeek logs (conn_state, orig_bytes, resp_bytes, protocol) enriched with CTI data (e.g., IP reputation, domain age, ASN reputation). The model classifies each connection as benign or malicious. A high probability score for 'malicious' for a connection to a destination not on a static IOC list indicates a potential emerging C2 server."
            ]
          },
          {
            "description": "A TLS or HTTP connection exhibiting specific, hardcoded artifacts associated with known C2 frameworks, such as a matching JA3/JA3S hash, a known malicious User-Agent string, a specific URI pattern, or default/anomalous SSL certificate fields (e.g., empty subject, short validity).",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Web Proxies, TLS-terminating Firewalls, Intrusion Detection/Prevention Systems (IDS/IPS)",
            "action": [
              "Symbolic: Match JA3/JA3S hashes from Zeek ssl.log and User-Agent strings or URI patterns from Zeek http.log against a curated list of known C2 framework indicators. Also, alert on SSL certificates (Zeek x509.log) with subject/issuer fields matching known malicious patterns.",
              "Statistical: For SSL certificates observed in Zeek x509.log, calculate the Shannon entropy of the certificate's subject and issuer common name fields. Flag certificates with entropy in the lowest 5th percentile (indicating default or simplistic values) or with an unusually short validity period (e.g., < 30 days, in the 5th percentile of all certificate durations).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on feature vectors extracted from Zeek http.log and ssl.log, including User-Agent string length and entropy, URI structure (path depth, query parameter count), and JA3 hash. Identify small clusters of traffic that are distinct from the large clusters of legitimate browser and application traffic, as these may represent a specific C2 framework's activity."
            ]
          },
          {
            "description": "A network connection to an external destination is initiated by a process (e.g., lsass.exe, winlogon.exe) or from a parent-child process chain (e.g., WINWORD.EXE -> powershell.exe) that does not normally exhibit external networking behavior.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, User Workstations, Endpoints of privileged users (e.g., developers, system administrators)",
            "action": [
              "Symbolic: Correlate Process Creation events (Windows Event ID 4688) with Network Connection events (Windows Event ID 5156 or Sysmon Event ID 3) on the same host. Alert immediately if a process from a watchlist of sensitive system processes (e.g., lsass.exe, smss.exe, csrss.exe) makes an outbound network connection.",
              "Statistical: For each process name, build a historical baseline of legitimate parent processes and command-line arguments that initiate network connections. Use a scoring model where a rare parent-child-network triplet (e.g., winword.exe spawning cmd.exe which connects outbound) or a high-entropy command line contributes to a risk score. Alert when the score for a networking process exceeds the 98th percentile of its historical scores.",
              "Machine Learning: Train a one-class SVM or isolation forest model on features representing normal process network activity (e.g., process name, parent process name, command line hash, destination port, protocol, bytes out) per host role (e.g., web server, workstation). Flag any new process networking behavior that the model classifies as an anomaly."
            ]
          },
          {
            "description": "A series of connections from a single internal host to a single external destination, where the time interval between connections is nearly constant (low jitter) and the connection duration is uniform, indicating automated, non-interactive C2 beaconing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Network Taps/Sensors, Core network switch SPAN/TAP ports, Firewall Logs",
            "action": [
              "Symbolic: Search for connections to a single destination where the time between connections is consistently within a narrow range (e.g., 60s +/- 5s) and the connection duration is also consistent (e.g., < 1s), matching known C2 framework default profiles like Cobalt Strike.",
              "Statistical: For each internal source IP, group connections by destination IP and port. Over a rolling 1-hour window, calculate the standard deviation (jitter) and mean of the time delta between consecutive connections. Flag groups with a standard deviation below a low threshold (e.g., < 2 seconds) and a mean interval common for C2 (e.g., 5s to 600s).",
              "Machine Learning: For each source-destination pair, create a time series of connection events. Apply a Fast Fourier Transform (FFT) to this series to convert it to the frequency domain. Use an anomaly detection model to flag pairs with an abnormally strong, sharp peak in their frequency spectrum, which indicates a highly periodic signal characteristic of automated C2 beaconing."
            ]
          },
          {
            "description": "A TCP connection on a well-known service port (e.g., 443, 22) that does not conform to the expected application-layer protocol, such as non-TLS data transmitted over port 443, or a TLS session with a malformed or suspicious handshake.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Internal Network Segments via Zeek sensors, DMZ, Network Security Monitoring (NSM) sensor locations",
            "action": [
              "Symbolic: Join Zeek conn.log and Zeek ssl.log on the connection UID. Alert on any connection where conn.log.id.resp_p is 443 but for which no corresponding entry exists in ssl.log. Also, generate an alert for any 'active_protocol_violation' or 'inappropriate_protocol_on_port' notice in Zeek weird.log.",
              "Statistical: Profile the 'validation_status' field in Zeek ssl.log to establish a baseline for the normal rate of TLS errors (e.g., 'self-signed certificate in certificate chain'). Alert when the rate of a specific error from a single host, or the overall error rate, exceeds 3 standard deviations above the mean hourly rate.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) on feature vectors representing legitimate TLS handshakes from Zeek ssl.log (e.g., selected cipher suite, TLS version, certificate validity period, presence/absence of extensions like ALPN/SNI). Feed new handshakes into the model; those identified as outliers are anomalous and may represent a custom C2 handshake designed to mimic TLS."
            ]
          },
          {
            "description": "A network connection where the ratio of bytes sent from the client to bytes received from the server is highly atypical for the protocol in use on that port, such as a large data upload over DNS, or a high client-to-server data ratio over HTTP without a corresponding POST request.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Define strict rules for protocols with expected low upload volumes. Alert on any DNS query (UDP/53) in Zeek dns.log where the query length is greater than 255 bytes. Alert on any HTTP session (Zeek http.log) where the request_body_len is large (>1MB) but the HTTP method is GET.",
              "Statistical: For each destination port (e.g., 80, 443, 53), calculate the historical distribution of the connection ratio R = orig_bytes / (orig_bytes + resp_bytes). For new connections, calculate this ratio and flag any that fall in the extreme percentiles (e.g., > 99th percentile for port 80/443, or > 75th percentile for port 53) for that specific port's baseline.",
              "Machine Learning: For each common destination port (80, 443, 53), apply a density-based clustering algorithm (e.g., DBSCAN) to the [log(orig_bytes), log(resp_bytes)] feature space. Connections identified as noise points (outliers) that do not fit into the large, dense clusters of normal traffic are highly suspicious and may represent C2 channels with atypical data exchange patterns."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]