[
  {
    "information_requirement": "Is the adversary using steganography (T1001.002) for command and control (TA0011)? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1001.002",
        "name": "Steganography",
        "evidence": [
          {
            "description": "A file hash observed on the network matches a known hash of a steganography tool executable or library, or a network connection is established with an external IP address or domain known to be associated with steganography-based C2.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateways, DNS Resolvers, Proxy Servers, Endpoints",
            "action": [
              "Symbolic (IOC Match): Continuously compare file hashes extracted from Zeek files.log and process hashes from Windows Event ID 4688 against a threat intelligence feed of known steganography tool hashes. Generate a high-severity alert for any match.",
              "Statistical (Frequency Analysis): For all external connections in Zeek conn.log, calculate the frequency of connections to destination IP addresses and domains. Flag destinations that are rare for the organization (e.g., in the bottom 5th percentile of connection frequency) but are present on CTI watchlists for suspicious activity. A combination of rarity and a low-confidence IOC match increases the risk score.",
              "Machine Learning (Domain Classification): Utilize a pre-trained machine learning model (e.g., a random forest or gradient boosting classifier) to classify domains from Zeek dns.log. Use features like domain length, character entropy, TLD, and domain age to predict the likelihood of a domain being algorithmically generated (DGA) or malicious. A high maliciousness score for a domain receiving file uploads warrants investigation for steganography."
            ]
          },
          {
            "description": "Specific byte sequences, metadata keywords (e.g., 'Steg'), or anomalous header values characteristic of steganography tool watermarks are present within transferred files such as images, audio, video, or documents.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring (NSM) Sensor Grid, Internet Gateways, File Servers",
            "action": [
              "Symbolic (Signature Match): Deploy a set of YARA or regex rules to scan the content and metadata of files extracted via Zeek files.log. The rules should match known signatures, magic numbers, or text strings (e.g., 'stegdetect', 'OpenStego') inserted by common steganography tools into file headers or metadata fields. Alert on any rule match.",
              "Statistical (Metadata Anomaly): For common file types like JPEG and PNG, parse and baseline normal metadata field values and lengths. Flag any file where a metadata field length is a statistical outlier (e.g., exceeds the 99th percentile for its type), as these fields are often abused to hide data.",
              "Machine Learning (File Structure Classification): Train a classifier (e.g., a Support Vector Machine) to distinguish between benign files and files containing steganographic content. Use features extracted from the file structure, such as the size and entropy of different file segments (e.g., EXIF chunks in JPEGs, iTXt chunks in PNGs). A high probability score from the classifier indicates a likely steganographic payload."
            ]
          },
          {
            "description": "A transferred file (e.g., PNG, JPG, WAV) has a size that is a statistical outlier compared to a dynamically established baseline of file sizes for its specific MIME type and source or destination context.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateways, Web Application Servers, Content Delivery Networks (CDNs)",
            "action": [
              "Symbolic (Rule-Based Threshold): Establish static size thresholds for specific, highly standardized image types used by internal applications (e.g., icons, logos). Alert if a file of this type exceeds a hard-coded threshold, as any deviation is unexpected.",
              "Statistical (Z-Score/IQR): For each MIME type in Zeek files.log, maintain a rolling 30-day baseline of file sizes (mean, standard deviation). Calculate the Z-score for each new file transferred and flag any file with a Z-score greater than 3. Alternatively, use the Interquartile Range (IQR) method and flag any file with a size greater than Q3 + 1.5 * IQR.",
              "Machine Learning (Time Series Forecasting): Model the aggregate volume (in bytes) of specific file types transferred per hour as a time series. Use a forecasting model like SARIMA or Prophet to predict the expected volume for the next interval. A significant, unexplained spike in data volume that deviates from the model's prediction and its confidence interval could indicate large-scale activity using steganography."
            ]
          },
          {
            "description": "A process that does not normally initiate network connections (e.g., mspaint.exe, notepad.exe) is observed creating a network socket and establishing an external connection, particularly when the connection involves the upload or download of image or media files.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Virtual Desktop Infrastructure (VDI) Environments",
            "action": [
              "Symbolic (Process Whitelist): Maintain a whitelist of processes that are expected to make network connections. Correlate Windows Event ID 4688 (Process Creation) with Windows Event ID 5156 (Network Connection) and alert whenever a process not on the whitelist initiates an outbound connection.",
              "Statistical (Process Rarity): Create a baseline of all processes that make network connections and calculate the frequency of each. Identify the rarest processes (e.g., those in the bottom 1st percentile of connection frequency). Any network activity from these rare processes, such as 'mspaint.exe', should be flagged for immediate review, especially if the connection in Zeek conn.log corresponds to a file transfer.",
              "Machine Learning (Behavioral Clustering): Use an unsupervised learning algorithm (e.g., K-Means or DBSCAN) to cluster endpoints based on their process execution and network connection patterns. An endpoint that suddenly moves to a new cluster characterized by anomalous process-to-network behavior (e.g., a cluster where text editors make network connections) is a strong candidate for compromise."
            ]
          },
          {
            "description": "The calculated Shannon entropy of the least-significant bit (LSB) plane of a transferred image file approaches the theoretical maximum (e.g., > 7.9 for 8-bit color channels), while the entropy of higher-order bit planes remains low, a pattern inconsistent with natural images.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring (NSM) Sensor Grid, Data Loss Prevention (DLP) Systems",
            "action": [
              "Symbolic (Embedded File Header): Scan the extracted LSB data of an image for known magic numbers or headers of common file types (e.g., 'PK' for ZIP, '%PDF' for PDF). The presence of a file header embedded in the LSB plane is a definitive sign of steganography.",
              "Statistical (Chi-Square Test): For image files extracted from Zeek files.log, perform a chi-square analysis on the LSB data. Compare the observed frequency distribution of byte values in the LSB plane against the expected uniform distribution of random data. A high p-value (failing to reject the null hypothesis that the data is random), combined with a low p-value for higher-order bit planes, strongly indicates an embedded encrypted payload.",
              "Machine Learning (Steganalysis CNN): Feed images extracted from Zeek files.log into a pre-trained convolutional neural network (CNN) designed for steganalysis. The CNN can identify subtle statistical artifacts and spatial correlations introduced by steganographic algorithms. A high-confidence 'steganographic' classification from the model should trigger a high-priority alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]