[
  {
    "information_requirement": "Has the adversary attempted to dump credentials from compromised systems?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003",
        "name": "OS Credential Dumping",
        "evidence": [
          {
            "description": "A process is created with an executable name or command-line argument matching a known credential dumping tool, or a file is transferred over the network with a hash matching a known tool's signature.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations (PAWs), Network Egress Points",
            "action": "1. Symbolic: Create a detection rule that queries for process creation events (Windows Event ID 4688) where the process name matches a watchlist of known credential dumping tools (e.g., `mimikatz.exe`, `procdump.exe`, `fgexec.exe`, `pwdump.exe`). Create a second rule to search Zeek files.log for `md5` or `sha1` hashes that match a threat intelligence feed of known malicious tools. 2. Statistical: For all file transfers in Zeek files.log, calculate the rarity of the file's MIME type (`mime_type`) and file extension. Profile the frequency of executable (`.exe`) or script (`.ps1`) transfers over non-standard ports. A transfer of an executable file over a port typically used for DNS, for example, should be assigned a high anomaly score. Flag transfers that fall above the 99th percentile for this rarity score. 3. ML: Train a binary classification model (e.g., Random Forest) using features from process creation events (parent process, command-line length, command-line entropy, user context) and file transfer events (file size, MIME type, source/destination subnets) to predict whether the event is indicative of a credential dumping tool."
          },
          {
            "description": "A PowerShell script block log (Event ID 4104) contains obfuscated content or specific strings, function calls, and API invocations associated with credential dumping modules like PowerSploit or Invoke-Mimikatz.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Windows Servers, Active Directory Domain Controllers",
            "action": "1. Symbolic: Create a SIEM rule to search PowerShell script block logs (Windows Event ID 4104) for keywords such as `Invoke-Mimikatz`, `Get-GPPPassword`, `sekurlsa::logonpasswords`, `LsaSecrets`, `DumpCreds`, or `MiniDumpWriteDump`. Use regex to detect base64-encoded versions of these commands. 2. Statistical: For each script block log, calculate the Shannon entropy of the script content and the character frequency distribution. Establish a baseline for normal script entropy on your systems. Flag scripts with entropy scores exceeding 3 standard deviations from the mean, as they are likely obfuscated. 3. ML: Develop a time-series anomaly detection model (e.g., ARIMA) on the frequency and entropy of PowerShell script executions per host. An anomalous spike in the execution of high-entropy scripts on a host could indicate the deployment of a malicious PowerShell framework. Use a text classification model (e.g., using TF-IDF and a Naive Bayes classifier) to classify new scripts in real-time."
          },
          {
            "description": "A sequence of command-line executions is observed, including the creation of a volume shadow copy, followed by the extraction of `NTDS.dit`, `SAM`, or `SYSTEM` hives from the shadow copy.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for NTDS.dit), All Windows Systems (for SAM/SYSTEM hives)",
            "action": "1. Symbolic: Create a correlation rule that triggers when `vssadmin.exe create shadow`, `diskshadow.exe`, or `wmic.exe shadowcopy create` is executed, followed within a 10-minute window by a process copying `NTDS.dit`, `SAM`, or `SYSTEM` files from the new shadow copy path (e.g., `\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy[0-9]+\\...`). Also, alert on direct execution of `ntdsutil.exe` with `ifm` or `activate instance ntds` commands. 2. Statistical: Profile the frequency of `reg.exe save` and `ntdsutil.exe` commands per user and host. Alert when the execution count for a specific user or on a non-DC host exceeds the 99th percentile of historical activity. 3. ML: Use a sequence analysis model, like a Hidden Markov Model (HMM), to detect the specific chain of commands associated with credential harvesting (e.g., `vssadmin create` -> `copy from shadow` -> `vssadmin delete`). Train the model on both benign administrative command sequences and known attack patterns to differentiate between them."
          },
          {
            "description": "A file transfer is detected over the network containing a filename commonly associated with Linux credentials (e.g., 'shadow', 'id_rsa'), or an SSH session exhibits a rare source-destination pairing followed by an unusually large data transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing critical Linux servers, Network egress points, VPN concentrators",
            "action": "1. Symbolic: Create a detection rule that searches Zeek files.log for transfers where the `filename` field contains `shadow`, `passwd`, `.ssh/id_rsa`, or `.gnupg/*key*`. Alert if the transfer protocol is unencrypted (e.g., FTP, HTTP) or if the destination is an external IP address. 2. Statistical: For each SSH session in Zeek ssh.log, calculate the ratio of bytes sent from the server to the client (`resp_bytes` in conn.log) versus bytes sent from the client to the server (`orig_bytes`). A very high ratio after a short interactive session can indicate large file exfiltration. Flag sessions that are statistical outliers (e.g., > 3 standard deviations from the mean ratio). 3. ML: Use a graph-based anomaly detection algorithm on conn.log data to model normal communication patterns. Identify anomalous edges in the graph, such as a web server initiating an SSH connection to a database server. Augment this by clustering SSH sessions based on features like duration, bytes transferred, and client/server software versions to find outlier sessions."
          },
          {
            "description": "A process not on an established allowlist (e.g., `svchost.exe`, `wininit.exe`) requests a handle to the `lsass.exe` process with high-risk access rights, such as `PROCESS_VM_READ` (0x10).",
            "data_sources": [
              "Sysmon Event ID 10",
              "Windows Event ID 4656",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, Windows Servers, Domain Controllers",
            "action": "1. Symbolic: Using Sysmon Event ID 10 (`ProcessAccess`), create a high-severity alert for any process accessing `lsass.exe` where the `GrantedAccess` code includes `0x1010` or `0x1410`, and the `SourceImage` is not in a pre-defined allowlist of legitimate system/security processes. 2. Statistical: Build a baseline of all processes that access `lsass.exe`. Profile the frequency of access per source process name. Any process that has never been seen accessing LSASS before or whose access frequency suddenly spikes should be flagged. Calculate the rarity of the `GrantedAccess` code requested by each source process; a rare, high-privilege request from a common process is highly suspicious. 3. ML: Train a classification model (e.g., Logistic Regression) to determine if an LSASS access event is malicious. Features should include the source process name, parent process name, user context, the requested access mask, and whether the source process is signed. Use labeled data from known goodware and malware to train the model."
          },
          {
            "description": "A `GetNCChanges` directory replication request is observed over the network originating from an IP address not belonging to a known Domain Controller, or the request is initiated by a user account not authorized for replication.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network links between domain member segments and the DC segment",
            "action": "1. Symbolic: Create a rule that alerts when Windows Event ID 4662 is generated on a DC with `Accesses: Replicating Directory Changes` and the `Account Name` is not a DC computer account (ending in `$`). Also, monitor network traffic for `DRSUAPI` or `MS-DRSR` operations where the source IP is not in the allowlist of DC IPs. 2. Statistical: Establish a baseline of the volume and frequency of replication traffic (bytes, connections) between known DCs. A sudden increase in replication requests from a single DC, or the appearance of replication-like traffic patterns from a non-DC, should be flagged. 3. ML: Use a peer group analysis or clustering algorithm (e.g., K-Means) on hosts that initiate replication requests. All DCs should cluster together based on their behavior (protocols, frequency, time of day). Any host that initiates replication but falls outside this primary cluster is a strong candidate for a malicious DCSync attack."
          },
          {
            "description": "A file access event (Event ID 4663) is logged for the SAM file (`%SystemRoot%\\system32\\config\\SAM`) by a process other than `lsass.exe` or approved backup/AV software, or a registry access event (Event ID 4657) is logged for a sensitive LSA key by a non-system process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Systems, Domain Controllers",
            "action": "1. Symbolic: With object access auditing enabled on the SAM file and the `HKLM\\SECURITY\\Policy\\Secrets` registry key, create an alert for any access event (Windows Event IDs 4663, 4656, 4657) where the `Process Name` is not in a strict allowlist (e.g., `lsass.exe`, `services.exe`, `System`, approved backup agents). 2. Statistical: Profile the time-of-day for legitimate access to these objects (typically during boot or patching). Use a percentile-based approach to score access events based on their timing. Flag any access occurring outside the 5th-95th percentile of normal access times. 3. ML: Develop a one-class SVM (Support Vector Machine) model trained exclusively on legitimate access patterns to the SAM file and LSA registry keys. Any new access event that falls outside the learned boundary of 'normal' behavior is classified as an anomaly."
          },
          {
            "description": "A system boot event is logged where Wininit Event ID 12 indicates LSA did not start as a protected process, or a registry modification event is logged for the `RunAsPPL` key.",
            "data_sources": [
              "Windows Event ID 12",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows 8.1/Server 2012 R2 and newer systems, especially Domain Controllers and PAWs",
            "action": "1. Symbolic: Create a high-priority alert that triggers immediately upon detection of Windows System Event ID 12 from source `Wininit` which contains the string 'LSA was not started as a protected process'. Additionally, create an alert for any modification (Windows Event ID 4657) to the registry key `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\RunAsPPL`. 2. Statistical: This is a binary condition, making statistics less applicable for detection. However, monitor the frequency of modifications to the `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa` key in general. A host showing a statistically significant increase in modifications to this sensitive area, compared to its baseline or peer group, should be investigated. 3. ML: Use a configuration drift detection model. Train an autoencoder on the 'golden image' configuration of key security settings, including the `RunAsPPL` value. Periodically feed the current configuration of hosts into the model. A high reconstruction error signifies a significant and potentially unauthorized deviation."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]