[
    {
        "information_requirement": "Is the adversary attempting to exfiltrate data over an unusual network medium?",
        "tactic_id": "TA0010",
        "tactic_name": "Exfiltration",
        "indicators": [
            {
                "technique_id": "T1011",
                "name": "Exfiltration Over Other Network Medium",
                "evidence": [
                    {
                        "description": "Execution of processes with file hashes matching known malware that performs exfiltration over other network mediums, or connections to known malicious C2/exfiltration IPs over secondary interfaces.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) and extract the file hash of executed processes. Compare these hashes against a continuously updated threat intelligence feed of known malicious tools used for T1011. Simultaneously, monitor Zeek conn.log for outbound connections over secondary interfaces (e.g., Wi-Fi, Bluetooth) and correlate destination IP addresses against a CTI feed of known C2 or data exfiltration nodes. Alert on any matches."
                    },
                    {
                        "description": "Use of specific network command-line utilities or PowerShell cmdlets to enable, configure, or bridge a secondary network adapter (e.g., Wi-Fi, Bluetooth) outside of normal administrative activity.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create detection rules to specifically monitor for the execution of network configuration utilities (e.g., netsh.exe, ipconfig.exe, PowerShell.exe) with suspicious command-line arguments. Focus on patterns that enable or modify secondary adapters, such as 'netsh wlan connect', 'netsh interface set interface... enable', or PowerShell cmdlets like 'Enable-NetAdapter'. Correlate these command executions with the parent process and user context. Use frequency analysis to filter out legitimate administrative scripts and flag rare or interactive usage."
                    },
                    {
                        "description": "A sequence of events indicating the activation of a secondary network interface, followed by data staging activity, and then a large outbound data transfer over that newly activated interface.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 5156",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a correlated detection rule that triggers on the following sequence on a host within a short time window (e.g., 30 minutes): 1. A network configuration command enabling a secondary interface (from Windows Event ID 4688). 2. Execution of archiving or compression tools (e.g., 7z.exe, rar.exe, tar.exe) on user data directories (from Windows Event ID 4688). 3. A large or anomalous outbound data transfer detected in Zeek conn.log or Windows Event ID 5156 that can be attributed to the newly enabled interface. Use correlation analysis across these disparate data sources based on hostname and timestamp to detect the entire behavior chain."
                    },
                    {
                        "description": "Anomalous network traffic characteristics on a secondary network interface (Wi-Fi, Bluetooth, Cellular), such as unusual protocols, destination ports, or data transfer volumes that deviate from established baselines.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 5156"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish baselines for normal network traffic on secondary interfaces for hosts where such use is permitted. For each secondary interface, profile typical protocols, destination ports, connection durations, and data volumes using historical Zeek conn.log and Windows Event ID 5156 data. Use statistical methods like IQR or percentile analysis to detect significant outliers in connection bytes transferred. Calculate the entropy of destination ports or protocols for a given host's secondary interface over time; a sudden shift could indicate anomalous activity. Alert on any significant deviations from the established baseline."
                    },
                    {
                        "description": "A process not typically associated with network activity, or a legitimate process running from an unusual file path, initiating outbound connections over a secondary network interface.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 5156"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a baseline of processes that normally initiate network connections on endpoints and servers. Monitor Windows Event IDs 4688 and 5156 to identify the process name, path, and the network connection it initiates. Correlate this information to identify which network interface was used. Flag any process initiating a connection over a secondary interface if that process does not typically perform network activity (e.g., notepad.exe), or if a network-capable process (e.g., powershell.exe) is running from a non-standard location (e.g., C:\\Users\\...\\AppData\\Local\\Temp\\). Use frequency analysis to identify rare process-interface pairings."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
