[
  {
    "information_requirement": "Is the adversary attempting to discover network configuration information on the enterprise network? (PIR)",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1016",
        "name": "System Network Configuration Discovery",
        "evidence": [
          {
            "description": "A network discovery command is executed with arguments or output redirection patterns that match a known-malicious signature.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Critical Application Servers",
            "action": [
              "Create a SIEM rule using regular expressions to match specific, high-confidence malicious command-line patterns from threat intelligence in Windows Event ID 4688 process creation logs. Example: `ipconfig /all >> C:\\Users\\Public\\net_info.tmp`.",
              "Calculate the statistical rarity of command-line arguments and output paths for common discovery commands (ipconfig, arp, etc.). Alert when a command uses an argument or writes to a file path that falls in the bottom 1st percentile of observed historical usage.",
              "Train a logistic regression classifier on labeled command-line data (Event ID 4688). Use features such as command name, argument count, presence of redirection operators (>, >>), and output file path entropy. Deploy the model to score new command executions for maliciousness."
            ]
          },
          {
            "description": "A common system network configuration discovery utility (e.g., ipconfig, arp, route, nbtstat, Get-NetIPConfiguration) is executed by a process or user account outside of expected administrative activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Member Servers, Human Resources Systems",
            "action": [
              "Create a SIEM rule that alerts when a discovery utility (e.g., `ipconfig.exe`, `arp.exe`) is executed by a parent process not on an allowlist (e.g., `cmd.exe`, `powershell.exe`). Specifically, look for parent processes like `WINWORD.EXE`, `CHROME.EXE`, or `AcroRd32.exe`.",
              "Establish a baseline of execution frequency for each discovery command per user role (e.g., Standard User, IT Admin, Server Admin). Generate an alert if a user's execution count for a command exceeds 3 standard deviations above the historical baseline for their role within a 24-hour window.",
              "Utilize an unsupervised clustering algorithm (e.g., DBSCAN) on process execution events. Feature vectors should include user, host, parent process name, and command executed. Investigate clusters where discovery commands are grouped with other suspicious behaviors, such as being spawned from non-interactive processes."
            ]
          },
          {
            "description": "Multiple distinct network discovery commands are executed in rapid succession from a single host, indicating automated scripting or manual reconnaissance.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Development Environments",
            "action": [
              "Create a SIEM correlation rule that triggers when a single host executes 3 or more unique network discovery commands (from a watchlist including ipconfig, arp, route, nbtstat, netsh) within a 5-minute time window.",
              "For each host, calculate the Shannon entropy of the command names executed within a 10-minute sliding window. A sudden spike in entropy indicates a burst of diverse commands characteristic of reconnaissance. Alert when a host's command entropy deviates more than 2.5 standard deviations from its own historical baseline.",
              "Apply a sequence analysis model, such as a Hidden Markov Model (HMM), to command execution logs. Train the model on normal user and system behavior to learn common command sequences. Use the model to flag command sequences that have a very low probability of occurring, especially if they contain multiple discovery commands."
            ]
          },
          {
            "description": "A single source host establishes remote connections to multiple destinations and executes network discovery commands or queries, indicative of a network sweep.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dce_rpc.log",
              "Zeek ssh.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal Network Segments, Network Infrastructure (Switches, Routers)",
            "action": [
              "Create a SIEM rule to detect when a single source IP generates successful logins (Windows Event ID 4624, Logon Type 3) on an anomalous number of distinct destination hosts (e.g., >15) within a 30-minute window.",
              "Using Zeek conn.log, build a baseline of the number of unique destination hosts (out-degree) each host connects to on ports associated with remote administration (22, 135, 445, 5985) over a 24-hour period. Alert when a host's out-degree exceeds the 99th percentile of its historical behavior or the behavior of its peer group.",
              "Use a community detection algorithm (e.g., Louvain Modularity) on a communication graph built from Zeek conn.log. A host that suddenly begins communicating with hosts outside its normal community, especially on discovery-related ports, may be performing reconnaissance. Model these 'cross-community' connections as anomalies."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]