[
  {
    "information_requirement": "Has an adversary begun active internal reconnaissance by enumerating remote systems on the network?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1018",
        "name": "Remote System Discovery",
        "evidence": [
          {
            "description": "A process execution event where the process name, hash, or command-line arguments match a known non-native remote discovery tool (e.g., Nmap, Advanced IP Scanner), or network traffic exhibits signatures unique to such tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint and server subnets",
            "action": [
              "Create a detection rule to alert when a process creation event (Windows Event ID 4688) has a process name (e.g., 'nmap.exe', 'Advanced_IP_Scanner.exe') or file hash that matches a list of known offensive security tools. Supplement with network-based rules on Zeek http.log looking for unique User-Agent strings associated with these tools.",
              "Calculate the prevalence of every executable name across the enterprise over a 30-day window. Generate a low-frequency alert when a process is executed that falls below the 1st percentile of all observed process names, indicating a rare or non-standard tool.",
              "Deploy a pre-trained classification model (e.g., Random Forest, Gradient Boosting) that uses features from process execution events (parent process, command-line length and entropy, user context, binary metadata) to predict whether a process is a malicious discovery tool. Flag any process classified with high confidence."
            ]
          },
          {
            "description": "A single source host executes native discovery utilities (e.g., ping, net view, arp, tracert) in a manner indicative of scripting, such as high frequency, iterative arguments, or execution from an unusual parent process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, especially Domain Controllers and application servers",
            "action": [
              "Create a detection rule that triggers on Windows Event ID 4688 for the process 'net.exe' where the command line contains 'view', '/domain', or 'group \\\"Domain Computers\\\"'. Correlate with the parent process, flagging executions not originating from an interactive user shell.",
              "For each host, establish a 30-day baseline of the hourly execution count for 'ping.exe', 'net.exe', and 'arp.exe'. Alert if the execution count in any given hour exceeds three standard deviations from the host's historical average for that specific hour-of-day and day-of-week.",
              "Use a clustering algorithm (e.g., DBSCAN) to group hosts based on their command-line usage patterns for native utilities. Analyze features like command frequency, argument patterns, and time-of-day usage. Hosts that are classified as noise or fall into very small, distinct clusters are candidates for anomalous activity investigation."
            ]
          },
          {
            "description": "Execution of PowerShell or WMI with commands or queries designed to enumerate remote system properties, network shares, or test connectivity across a range of hosts, especially when initiated by a non-administrative or service account.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, especially Management servers and Domain Controllers",
            "action": [
              "Create a detection rule for PowerShell script block logs (Event ID 4104) containing discovery-related cmdlets (e.g., 'Test-Connection', 'Get-CimInstance', 'Resolve-DnsName') where the target computer name argument contains a variable, a 'Get-Content' call, or more than 10 comma-separated hostnames, indicating scripted enumeration.",
              "For 'powershell.exe' and 'wmic.exe' processes, calculate the Shannon entropy of the command-line arguments. Establish a baseline for typical entropy values. A command-line with an unusually high entropy score, especially for arguments following '-ComputerName' or '/node:', may indicate an obfuscated or programmatically generated list of targets.",
              "Implement a time-series anomaly detection model (e.g., ARIMA) to monitor the volume of outbound WMI and PowerShell Remoting connections per host. A sudden, sharp spike in this activity from a host that is not a designated administrative or management server is a strong indicator of malicious discovery."
            ]
          },
          {
            "description": "A single source host generates a high volume of connection attempts to numerous unique internal destination IPs, characterized by a high ratio of failed-to-successful connections or connections to a sequence of ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switch span/tap ports, internal network segment gateways, and data center distribution layer",
            "action": [
              "Using Zeek conn.log, create a rule to alert if a single source IP ('id.orig_h') generates connections with a state of 'REJ' (connection rejected) or 'RSTO' (reset by originator) to more than 50 unique destination IPs ('id.resp_h') on the same destination port within a 1-minute window.",
              "In 5-minute windows, calculate a 'scan score' for each internal source IP: (count of unique destination IPs) * (count of unique destination ports) / (total connections + 1). Establish a baseline for this score across all hosts and alert when any host's score exceeds the 99th percentile of the enterprise-wide distribution.",
              "Train a one-class SVM (Support Vector Machine) on feature vectors derived from normal host traffic in Zeek conn.log (e.g., connection count, destination IP entropy, port entropy, protocol mix). Use the model to classify new 5-minute traffic windows; traffic that the model classifies as an outlier indicates anomalous behavior consistent with network scanning."
            ]
          },
          {
            "description": "A 'fan-out' connection pattern where one host, within minutes of a new remote user logon, initiates connections to an abnormally high number of other internal systems on common administrative or service ports (e.g., SMB, RDP, RPC).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN Concentrators, Bastion Hosts, and internal network segments",
            "action": [
              "Correlate successful remote logons (Windows Event ID 4624 with Logon Type 3 or 10) with subsequent network activity from the source IP of the logon (from Zeek conn.log). Alert if, within 10 minutes of the logon, the host initiates connections to more than 20 unique internal IP addresses on ports 135, 139, 445, or 3389.",
              "For each user account, build a historical profile of their 'post-login fan-out' behavior, measured as the number of unique internal systems they connect to within 15 minutes of an initial logon. Alert if a user's fan-out count for a new session exceeds 4 standard deviations from their personal historical average.",
              "Model host-to-host communications as a directed graph. A new remote logon followed by discovery 'fan-out' appears as a new set of edges originating from a single node to many others. Use a graph-based anomaly detection algorithm to score the structural change to the graph, flagging rapid, high-degree outbound edge creation as anomalous."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]