[
    {
        "information_requirement": "Is the adversary using Windows Remote Management for lateral movement?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1021.006",
                "name": "Windows Remote Management",
                "evidence": [
                    {
                        "description": "WinRM network connections originating from hosts confirmed to be compromised or associated with prior malicious activity.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a dynamic watch list of internal IP addresses from hosts confirmed as compromised or associated with high-confidence security alerts. Continuously inner join this watch list with source IP addresses from Zeek conn.log traffic on ports 5985/5986 and with the source workstation field in Windows Event ID 4624 (Network Logon) on target servers. Alert on any match, as this indicates lateral movement from a compromised host."
                    },
                    {
                        "description": "Execution of command-line arguments or tool signatures characteristic of known malicious frameworks (e.g., Cobalt Strike, Empire) or living-off-the-land techniques tunneled through WinRM.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Windows Event ID 4688 for process creation events where the parent process is `WsmPrvSE.exe` (WinRM Service host). Scrutinize the 'CommandLine' field for patterns associated with malicious activity, such as: Base64-encoded PowerShell commands (`-enc`, `-e`), download cradles (`IEX(New-Object Net.WebClient).DownloadString`), reflective injection techniques, or specific command arguments used by tools like Mimikatz or BloodHound. Use regular expression matching on a curated list of these malicious patterns and alert on hits."
                    },
                    {
                        "description": "Anomalous WinRM network connection patterns, such as workstation-to-workstation connections, connections to servers from unusual sources, or a sudden increase in the volume or diversity of WinRM traffic.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for traffic on ports 5985/5986. Establish a baseline of normal WinRM traffic paths (e.g., admin workstations to specific servers) and volume. Use frequency analysis and graph analysis to detect rare or new source-destination pairs, especially peer-to-peer connections between workstations or connections to sensitive assets like Domain Controllers from non-administrative hosts. Use time series analysis to detect sudden spikes in overall WinRM connection volume, which may indicate automated lateral movement."
                    },
                    {
                        "description": "Anomalous process activity on a target host initiated via WinRM, such as the execution of a high volume of discovery commands or suspicious utilities not typical for remote administration.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On target systems, correlate network logon events (Windows Event ID 4624, Logon Type 3) with subsequent process creation events (Windows Event ID 4688) under the same logon session. Profile the typical processes launched during legitimate remote administration. Flag sessions that involve unusual child processes (e.g., `whoami`, `ipconfig`, `net user`, `nltest`, `certutil`, `reg.exe`), especially when they occur in rapid succession or are spawned by `WsmPrvSE.exe`. Use correlation analysis to link these process chains back to an initial WinRM connection and apply descriptive statistics to identify outlier sessions with an unusually high number of discovery commands."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
