[
  {
    "information_requirement": "Is the adversary evading defenses by smuggling malicious code within LNK file icon paths? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1027.012",
        "name": "LNK Icon Smuggling",
        "evidence": [
          {
            "description": "A file creation event for a file with a .lnk extension is observed, and subsequent parsing of the LNK file's IconEnvironmentDataBlock reveals a URL, IP address, or domain that has a positive match against a current, high-confidence threat intelligence feed.",
            "data_sources": [
              "Windows Sysmon Event ID 11",
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations (especially Desktop and Downloads folders), Email gateway sandboxes, Web proxy logs, DNS resolver logs.",
            "action": [
              "Symbolic: Create a detection rule that triggers when a file creation event (Windows Sysmon Event ID 11 or Windows Event ID 4663) for a target filename ending in '.lnk' occurs. The rule should automatically parse the LNK file to extract the string from the Icon path field. Correlate this extracted string (IP, domain, or URL) against a list of known malicious indicators from threat intelligence feeds. Generate a high-severity alert upon a match.",
              "Statistical: For all LNK file creation events, extract the Top-Level Domain (TLD) from any URL in the icon path. Calculate the frequency of each TLD observed across the enterprise over a 30-day rolling window. Flag any LNK file creation where the icon path TLD is in the bottom 5th percentile of observed TLDs (e.g., .xyz, .club, .top), as these are statistically less common in legitimate software and more common in malicious campaigns.",
              "Machine Learning: Develop a supervised classification model (e.g., Random Forest) trained on a labeled dataset of benign and malicious LNK files. Features for the model should include: string length of the icon path, presence of IP addresses vs. domains, character entropy of the path, and TLD reputation. Deploy this model to score newly created LNK files in real-time, alerting on those classified as malicious with a confidence score above a predefined threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "A file creation event for a file with a .lnk extension is observed, where the parsed icon path contains a UNC path pointing to a remote resource (e.g., \\\\<IP>\\DavWWWRoot\\, \\\\<domain>@SSL\\) or a local path pointing to an unusual location for icons (e.g., %TEMP%, %APPDATA%, C:\\Users\\Public\\).",
            "data_sources": [
              "Windows Sysmon Event ID 11",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, shared network drives, Terminal Servers/Citrix environments.",
            "action": [
              "Symbolic: Implement a detection rule that parses the icon path of all newly created LNK files (Windows Sysmon Event ID 11). Use regular expressions to match known malicious patterns, including UNC paths to external IP addresses (`^\\\\\\\\[0-9]{1,3}\\.`), WebDAV paths (`@SSL\\\\DavWWWRoot`), or local paths pointing to temporary or user-writable directories (`(Temp|APPDATA|Public|Downloads)`). Generate an alert on any match.",
              "Statistical: For all LNK files, extract the full icon path string and calculate its character entropy. Establish a baseline distribution of entropy scores for legitimate icon paths (which are typically low-entropy, e.g., 'C:\\\\Program Files\\\\...'). Alert on any LNK file whose icon path entropy exceeds a high percentile threshold (e.g., the 98th percentile), as obfuscated malicious paths will have statistically higher entropy.",
              "Machine Learning: Use an unsupervised learning model, such as an Isolation Forest, trained on the features of legitimate LNK icon paths observed in the environment. Features should include path length, directory depth, and presence of special characters. The model will create a boundary of 'normalcy'. Any new LNK file whose icon path features fall outside this boundary should be flagged as an anomaly for analyst review."
            ]
          },
          {
            "description": "The explorer.exe process is observed initiating an outbound TCP or UDP network connection to an IP address outside of the defined internal network space. This event is further corroborated by the transfer of a file with a MIME type associated with executables or scripts (e.g., 'application/x-msdownload', 'application/octet-stream').",
            "data_sources": [
              "Windows Sysmon Event ID 3",
              "Windows Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process and network logs, Network egress points (firewall, proxy), DNS resolver logs.",
            "action": [
              "Symbolic: Create a high-priority alert that triggers when Windows Sysmon Event ID 3 shows the process 'explorer.exe' initiating a network connection to a destination IP that is not on an allowlist of known-good internal or external destinations (e.g., Microsoft update servers). This behavior should have zero expected false positives in a properly configured environment.",
              "Statistical: On a per-host basis, track the count of outbound network connections made by 'explorer.exe' over a 24-hour period. The expected value is 0. Establish a simple statistical threshold: any host where the count of 'explorer.exe' outbound connections is greater than 0 should be flagged. Further risk-score the event by the reputation and rarity of the destination IP address across the enterprise.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA) on network flow data (Zeek conn.log), grouped by source process name. The model should learn the normal pattern of network traffic for 'explorer.exe' (which should be non-existent for outbound traffic). A sudden spike in bytes sent or connections initiated by 'explorer.exe' would be flagged as a time-series anomaly indicative of a payload download."
            ]
          },
          {
            "description": "A correlated sequence of events is observed on a single host within a short time window (e.g., < 5 minutes): 1) A .lnk file is created. 2) The explorer.exe process makes an outbound network connection. 3) A new process is created by a parent process like explorer.exe or rundll32.exe, where the executed image is unsigned or has low prevalence.",
            "data_sources": [
              "Windows Sysmon Event ID 11",
              "Windows Sysmon Event ID 3",
              "Windows Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process, file, and network event logs (SIEM/EDR); Network egress points.",
            "action": [
              "Symbolic: Build a correlation rule in the SIEM that triggers on a specific sequence of events from a single host within a 2-minute window: (Event 1: 'Windows Sysmon Event ID 11' with 'TargetFilename' ending in '.lnk') followed by (Event 2: 'Windows Sysmon Event ID 3' with 'Image' as 'explorer.exe' and a remote destination IP) followed by (Event 3: 'Windows Sysmon Event ID 1' with a suspicious parent process like 'explorer.exe' or 'rundll32.exe'). Generate a critical alert if all three conditions are met.",
              "Statistical: For each host, create a composite risk score. Increment the score based on the occurrence of suspicious atomic events within a 1-hour window: +10 for LNK file creation in a temp/download directory, +50 for an 'explorer.exe' outbound connection, +25 for execution of an unsigned binary. If the cumulative score for a host exceeds a statistically determined threshold (e.g., 99th percentile of all host scores), flag the host for investigation.",
              "Machine Learning: Utilize a graph-based analysis platform. Represent endpoint events (process creation, file writes, network connections) as nodes and their relationships (e.g., parent-child process) as edges. Use a pathfinding algorithm to search for subgraphs that match the known TTP of LNK smuggling (LNK write -> explorer.exe network connection -> suspicious process execution). This approach is robust against minor variations in the attack chain."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]