[
  {
    "information_requirement": "Is the adversary using defense evasion techniques via dynamic API resolution? (TA0005 - Defense Evasion) (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1027.007",
        "name": "Dynamic API Resolution",
        "evidence": [
          {
            "description": "A process is created from an executable file whose SHA256 hash matches a known threat intelligence indicator for malware using dynamic API resolution, or whose static analysis reveals an unusually small or empty Import Address Table (IAT).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, particularly domain controllers, application servers, and developer workstations.",
            "action": [
              "Symbolic: Execute a query against process creation logs (Windows Event ID 4688, Sysmon Event ID 1) to match the executable's SHA256 hash against a threat intelligence list of hashes known for API obfuscation or packing. Generate a high-severity alert upon a match.",
              "Statistical: For each new executable hash observed via process creation events, calculate its prevalence (count of unique hosts) across the environment over the past 30 days. Identify and score executables with a low prevalence (e.g., < 1% of hosts) and a parent process commonly associated with initial access (e.g., outlook.exe, winword.exe, chrome.exe). Alert on scores exceeding a defined threshold.",
              "Machine Learning: Deploy a pre-trained supervised classification model (e.g., Random Forest) that ingests PE file features (e.g., IAT size, section entropy, linker version, file size). Continuously score new executables observed in process creation events. Flag executables receiving a probability score for 'packed' or 'obfuscated' above a risk threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "A rundll32.exe process is created with a command line argument that invokes a DLL function by its ordinal number (e.g., '#123') rather than by its exported name, indicating an attempt to hide the function's purpose.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, focusing on command line logging from user workstations.",
            "action": [
              "Symbolic: Create a SIEM rule to parse command line arguments from process creation events (Windows Event ID 4688, Sysmon Event ID 1). Trigger an alert when process name is 'rundll32.exe' and the command line matches the regex pattern '.*\\\\.dll,\\\\s*#\\\\d+'.",
              "Statistical: Aggregate all unique rundll32.exe command lines observed over a 30-day period. Calculate the frequency of each unique command line across the enterprise. Flag any command line containing an ordinal call ('#<number>') that is statistically rare (e.g., observed on fewer than 5 hosts or seen for the first time).",
              "Machine Learning: Implement an unsupervised anomaly detection model (e.g., Isolation Forest) using features from rundll32.exe command lines (length, character class counts, presence of ordinal syntax). Train the model on a baseline of legitimate activity. Use the trained model to score new command lines in real-time and alert on those identified as significant outliers."
            ]
          },
          {
            "description": "A file with a PE header ('MZ' signature) is created in a user-writable or temporary directory and is subsequently loaded as a module or executed as a process by the same parent process within a short time window (e.g., under 30 seconds).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 11",
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User profile directories (%APPDATA%, %LOCALAPPDATA%, Downloads), temporary directories (%TEMP%, C:\\Windows\\Temp), and public-writable shares.",
            "action": [
              "Symbolic: Create a correlation rule that joins Sysmon Event ID 11 (FileCreate) events for files in user-writable paths with subsequent Sysmon Event ID 7 (ImageLoad) or Windows Event ID 4688 events where the file path and ProcessGUID match. Trigger an alert if the time difference between the file creation and the execution/load is less than a 60-second threshold.",
              "Statistical: For all correlated write-then-execute/load events, calculate the distribution of the time delta between the two actions. Flag events that fall within the bottom 1st percentile of this distribution. Additionally, create a stacked count of parent processes (e.g., winword.exe, powershell.exe) performing this behavior and flag any process whose frequency exceeds 2 standard deviations from its own baseline.",
              "Machine Learning: Develop a sequence analysis model (e.g., a Hidden Markov Model or LSTM) trained on event chains per ProcessGuid. Define a 'malicious' state as the sequence: Network Inbound -> FileCreate (PE in temp) -> ImageLoad/ProcessCreate. Use the model to calculate the probability of a given event sequence belonging to the malicious state and alert when the probability exceeds a set threshold."
            ]
          },
          {
            "description": "A running process exhibits dynamic behavior (e.g., network connections, process creation) that requires API functions (e.g., CreateProcess, Socket) which are not declared in the static Import Address Table (IAT) of its corresponding on-disk executable file.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Sysmon Event ID 22",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, network egress points (for Zeek logs), and malware analysis sandboxes/threat intelligence feeds (for IAT data).",
            "action": [
              "Symbolic: For a new process (Sysmon Event ID 1), automate the static analysis of its on-disk executable to extract its IAT. Correlate this static data with observed runtime behaviors. Trigger an alert if the process initiates a network connection (Sysmon Event ID 3) but its IAT lacks imports from networking libraries (e.g., ws2_32.dll, wininet.dll).",
              "Statistical: For each running process, calculate a 'Behavior-IAT Mismatch Score'. For each high-level behavior observed (e.g., network connection, child process creation, DNS query), add a point to the score if the corresponding API family is missing from the process's static IAT. Establish a distribution of these scores across all processes in the environment. Investigate processes with scores in the 99th percentile.",
              "Machine Learning: Train a binary classification model (e.g., XGBoost) to predict process maliciousness. Use two sets of features: static features from the PE file (IAT entries, section entropy) and aggregated runtime features (count of child processes, count of network connections, count of DNS queries). A high malicious probability score, particularly for processes with minimal IATs, indicates likely dynamic API resolution."
            ]
          },
          {
            "description": "A trusted, long-running system process (e.g., svchost.exe, explorer.exe, lsass.exe) exhibits anomalous behavior, such as initiating a network connection to a rare external destination or spawning an unusual child process (e.g., cmd.exe), which deviates from its established historical baseline.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical system processes on all Windows hosts, network traffic logs from perimeter firewalls and DNS servers.",
            "action": [
              "Symbolic: Create a high-priority alert rule that triggers when a core system process (e.g., lsass.exe, services.exe, wininit.exe) is the parent of a command-line interpreter (cmd.exe, powershell.exe, wscript.exe) based on process creation logs (Windows Event ID 4688, Sysmon Event ID 1).",
              "Statistical: For each critical system process (e.g., svchost.exe, explorer.exe), build a historical baseline of its child processes and network destinations (IPs, domains, ports) over a 30-day rolling window. Calculate the rarity of each new child process or network destination. Generate a medium-severity alert if a new behavior's rarity exceeds the 99th percentile (e.g., svchost.exe connecting to a never-before-seen domain).",
              "Machine Learning: For each critical system process, apply a time-series anomaly detection model (e.g., Prophet or SARIMA) to key behavioral metrics (e.g., hourly network data volume, number of child processes created, number of unique DNS lookups). The model should account for seasonality (e.g., time of day, day of week). Trigger an alert when a metric deviates significantly from its predicted value, indicating an anomalous change in behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]