[
  {
    "information_requirement": "Is the adversary exfiltrating data using traffic duplication?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1020.001",
        "name": "Traffic Duplication",
        "evidence": [
          {
            "description": "A network flow is established from an internal source to an external IP address or domain present on a high-confidence threat intelligence feed, specifically those categorized as C2 or data drop zones.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, Cloud virtual network gateways",
            "action": [
              "Symbolic: Continuously query Zeek conn.log and dns.log data, cross-referencing destination IPs and resolved domains against a threat intelligence feed of known malicious infrastructure. Generate an alert upon a match.",
              "Statistical: For connections to newly observed external IP addresses (not seen in the last 30 days), calculate the ratio of bytes sent to bytes received. Flag connections where this ratio exceeds a high threshold (e.g., >100:1) and the total data sent is above the 95th percentile for all new connections, suggesting data exfiltration rather than interactive communication.",
              "Machine Learning: Develop a domain generation algorithm (DGA) classifier using a recurrent neural network (RNN) or logistic regression model trained on features like domain length, character frequency, and n-gram analysis. Apply this model to all queries in Zeek dns.log to proactively identify and score potential C2 domains before they appear on threat feeds."
            ]
          },
          {
            "description": "A command containing keywords related to traffic mirroring or encapsulation (e.g., 'monitor session', 'port-mirroring', 'ERSPAN') is executed on a network management host, or GRE/ERSPAN traffic is observed flowing to an unauthorized external destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network management servers, Core switches/routers, Virtual network control planes (Cloud)",
            "action": [
              "Symbolic: Create a SIEM rule to monitor Windows Event ID 4688 (Process Creation) on network management servers for command-line arguments containing keywords such as 'monitor session', 'port-mirroring', 'span', 'erspan', 'gre', or 'create-traffic-mirror'. Alert on any match.",
              "Statistical: For all observed GRE (IP protocol 47) or ERSPAN traffic in Zeek conn.log, establish a baseline of legitimate source-destination pairs. Alert when a new flow appears where the destination is an external IP not on the established baseline of authorized network partners, especially if the flow's duration or volume exceeds the 95th percentile of historical encapsulated traffic.",
              "Machine Learning: Train an unsupervised learning model (e.g., Isolation Forest) on the sequence of commands typically executed by network administrators during a management session. Ingest command history logs (e.g., PowerShell transcripts or Event ID 4688) and flag any session containing a sequence of commands with a low anomaly score, indicating a deviation from normal administrative behavior."
            ]
          },
          {
            "description": "An outbound network flow's total data volume (orig_bytes) from a single internal source to a single external destination exceeds a statistically significant threshold (e.g., 3 standard deviations or the 99th percentile) compared to a 30-day historical baseline for that source or its subnet.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Server subnets, User workstation subnets, Database server segments",
            "action": [
              "Symbolic: Define a static threshold rule that alerts when any single connection from a standard user workstation to an external IP address exceeds a hard limit (e.g., 1 GB) in a 24-hour period. This acts as a simple, high-volume tripwire.",
              "Statistical: For each internal source IP, calculate a rolling 30-day baseline of daily outbound data volume (total orig_bytes in Zeek conn.log). Use descriptive statistics to identify the mean and standard deviation. Generate a high-severity alert if the daily volume for a host exceeds its mean by more than 3 standard deviations. This creates a dynamic, host-specific baseline.",
              "Machine Learning: Implement a time-series forecasting model (e.g., Prophet or ARIMA) for outbound traffic volume for key network segments (e.g., database servers). The model will predict the expected traffic volume for the next hour/day. Generate an alert when the observed traffic volume significantly deviates from the forecasted volume's confidence interval, indicating an unforeseen event like exfiltration."
            ]
          },
          {
            "description": "A high-volume outbound network flow exhibits characteristics of obfuscation, such as a Shannon entropy score above a defined threshold (e.g., > 4.5 for a DNS query) or a protocol-behavior mismatch reported by Zeek (e.g., 'inappropriate_FIN').",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Application servers, DNS resolvers",
            "action": [
              "Symbolic: Create a direct rule to alert on any event logged in Zeek's weird.log that is associated with a high-volume (>100MB) outbound connection. Specifically, look for 'data_before_established', 'inappropriate_FIN', and 'possible_split_routing' notices.",
              "Statistical: For outbound DNS traffic, calculate the Shannon entropy of the query name in Zeek dns.log. Establish a baseline of entropy scores across the enterprise. Flag connections where the query name entropy is in the top 2% of all observed values, as this is a common characteristic of C2 communication using randomized subdomains.",
              "Machine Learning: Train a supervised classifier (e.g., Random Forest) to distinguish between legitimate encrypted traffic and non-standard/obfuscated traffic. Use features from Zeek conn.log such as connection duration, byte counts, packet size distribution, and inter-arrival times. Apply the model to all outbound traffic to score connections for their likelihood of being malicious exfiltration attempts."
            ]
          },
          {
            "description": "A successful login (Windows Event ID 4624) to a network management host from an anomalous source (e.g., rare geolocation, first-time source IP) is followed within a short time window (e.g., 15 minutes) by the creation of a high-volume, long-duration outbound network flow from the managed network segment.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Active Directory), Network management servers, VPN concentrators, Network egress points",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a successful administrative login (Event ID 4624) is immediately preceded by a failed login (Event ID 4625) from the same source IP within 5 minutes, and this is followed within 15 minutes by the execution of a process containing a mirroring-related keyword on the same host.",
              "Statistical: For each user account, build a profile of normal login behavior including typical hours, source subnets/countries, and session durations. Assign a risk score to each login based on deviations from this profile (e.g., +1 for off-hours, +2 for new country). If a login's risk score exceeds a threshold (e.g., > 3), correlate with any anomalous outbound traffic from related network segments within the next hour.",
              "Machine Learning: Use a graph-based analysis model to map relationships between users, hosts they log into, and the network flows originating from those hosts. Apply a community detection or anomaly detection algorithm to this graph to identify unusual links, such as a user logging into a network device for the first time and that device immediately initiating a large data transfer to an unknown external entity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]