[
    {
        "information_requirement": "Is the adversary evading defenses using compression?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1027.015",
                "name": "Compression",
                "evidence": [
                    {
                        "description": "Detection of compressed archives matching known malicious file hashes or specific filenames used by threat actors.",
                        "data_sources": [
                            "Zeek files.log",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze file metadata from Zeek files.log (capturing file hash and name) and file creation events from Windows Event ID 4663 (capturing file name). Correlate observed file hashes and names against a high-confidence cyber threat intelligence (CTI) feed of known malicious compressed archives. Alert on any confirmed matches and investigate the associated host and network activity."
                    },
                    {
                        "description": "Use of command-line arguments for legitimate compression utilities (e.g., 7z.exe, rar.exe, tar) that are characteristic of malicious activity, such as creating password-protected, split, or self-extracting archives to stage or hide data.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for executions of common compression tools (7z.exe, rar.exe, tar, zip, etc.). Use regular expression matching on the process command line arguments to detect suspicious patterns, including: password protection flags (`-p`, `-hp`), silent creation/extraction (`-si`, `-y`), creation of self-extracting archives (`-sfx`), deletion of source files after archiving (`-sdel`), or archiving of sensitive system or user directories. Maintain and update a list of known malicious command-line patterns and flag any matches for review."
                    },
                    {
                        "description": "A sequence of events involving a downloaded compressed archive, followed by file extraction into a temporary or user-writable directory, and subsequent execution of a payload from that location.",
                        "data_sources": [
                            "Zeek files.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a correlation rule to detect the following sequence: 1) A compressed archive (e.g., .zip, .rar, .7z) is downloaded, identified via Zeek files.log. 2) On the destination host, a compression utility process (e.g., 7z.exe, tar.exe) is launched with the downloaded archive as an argument (Windows Event ID 4688). 3) Immediately following, a new process is executed from a common temporary location (%TEMP%, %APPDATA%, C:\\Windows\\Temp). Use correlation analysis based on hostname and a short time window (e.g., under 2 minutes) to link these discrete events into a high-fidelity alert for malicious payload delivery."
                    },
                    {
                        "description": "Identification of high-entropy data within command lines, scripts, or registry values, suggesting the presence of an embedded compressed or encoded payload for fileless execution.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously analyze command line arguments from Windows Event ID 4688, particularly for interpreters like powershell.exe, cmd.exe, cscript.exe, and wscript.exe. Calculate the Shannon entropy for command line strings. Establish a baseline for normal entropy values for common system and user processes. Flag any command line with an entropy value that is a significant outlier (e.g., >3 standard deviations above the mean, or identified using an Inter-Quartile Range (IQR) test) as potentially containing a compressed payload."
                    },
                    {
                        "description": "Creation or transfer of compressed archives with anomalous characteristics, such as unusual file extensions, double extensions, password protection, or low compression ratios, especially when transferred over non-standard ports.",
                        "data_sources": [
                            "Zeek files.log",
                            "Zeek conn.log",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze file metadata from Zeek files.log and Windows file creation events (4663). Identify archives with rare extensions, double extensions (e.g., `document.pdf.zip`), or those flagged as password-protected by network security monitoring tools. Calculate the compression ratio (uncompressed size vs. compressed size); unusually low ratios may indicate an already-encrypted payload wrapped in an archive to bypass defenses. Use frequency analysis on file extensions and descriptive statistics on compression ratios to find outliers. Correlate these findings with network context from Zeek conn.log, escalating priority for archives transferred over non-standard ports or to/from low-reputation IP addresses."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
