[
  {
    "information_requirement": "Has the adversary moved laterally within the network using Remote Desktop Protocol?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021.001",
        "name": "Remote Desktop Protocol",
        "evidence": [
          {
            "description": "A successful RDP logon (Windows Event ID 4624 with Logon Type 10) originates from a source IP address or involves a user account present on an active threat intelligence watchlist of known malicious indicators.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek rdp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, Threat Intelligence Feeds, VPN Concentrators",
            "action": [
              "Create a SIEM rule to cross-reference the source IP address ('IpAddress' field in Event ID 4624 or `id.orig_h` in Zeek conn.log) and username ('TargetUserName' in Event ID 4624) of every successful RDP authentication (Logon Type 10) against a maintained watchlist of known-bad IPs and compromised accounts. Trigger a high-severity alert upon a match.",
              "For each alert generated by the symbolic rule, establish a baseline of the target host's inbound RDP sources. Calculate the historical frequency of the triggering source IP connecting to this specific destination. An alert's priority is elevated if the connection is novel (first time seen) or if the source IP's connection frequency to this host is a statistical outlier (e.g., z-score > 3) compared to its past behavior.",
              "Train a supervised classification model (e.g., Logistic Regression, Random Forest) using labeled historical RDP sessions. Features should include: source/destination IP subnet, user account role, time of day, day of week, and binary features indicating if the source IP or account is on a watchlist. Use the model to score new RDP sessions from watchlisted entities, predicting the probability of maliciousness to prioritize analyst response."
            ]
          },
          {
            "description": "A host's security posture is modified to permit RDP, immediately followed by an outbound RDP connection from that same host. This includes registry changes to enable RDP (`HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\fDenyTSConnections` set to `0`) or firewall modifications to allow port 3389 (e.g., using `netsh`).",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Windows Security Event ID 4947"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Workstations, Servers not typically configured for RDP access",
            "action": [
              "Create a SIEM correlation rule that triggers when either a registry modification event (Event ID 4657 on key `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\fDenyTSConnections` to value `0`) or a Windows Firewall rule change (Event ID 4947 allowing TCP port 3389) is observed, and is followed within a 10-minute window by an outbound connection from the same host to destination port 3389 (from Zeek conn.log or process creation events for `mstsc.exe`).",
              "For alerts triggered by the symbolic rule, analyze the command line arguments from process creation events (Event ID 4688) occurring around the same time. Calculate the Shannon entropy of the parent process command line that initiated the change. A command line entropy score exceeding a baseline threshold (e.g., > 4.5), especially for processes like `powershell.exe` or `cmd.exe`, indicates potential obfuscation and increases the suspicion score.",
              "Develop a sequence analysis model using an LSTM or Hidden Markov Model. Train the model on normal sequences of administrative activity (e.g., registry, file, process, network events). Flag any host that exhibits the sequence 'Firewall/Registry RDP Enable -> Process Execution -> Outbound RDP Network Connection' if that sequence is a statistically rare anomaly compared to the learned legitimate administration patterns."
            ]
          },
          {
            "description": "A single source IP address or user account establishes successful RDP connections to a number of unique destination hosts that is anomalously high for a given time window (e.g., more than 5 distinct hosts in 1 hour), indicating scanning or lateral spread.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek rdp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, Core Switches, Domain Controller security logs",
            "action": [
              "Implement a SIEM rule that groups by source IP (`id.orig_h` in Zeek conn.log) or username (`TargetUserName` in Event ID 4624) and counts the distinct number of destination IPs (`id.resp_h` or `WorkstationName`) for connections to TCP port 3389 within a 1-hour sliding window. Trigger an alert if this count exceeds a static threshold (e.g., 5).",
              "For each user and source IP, establish a historical baseline of the number of unique RDP destinations they connect to per hour. Continuously monitor this count in a sliding window. Generate an alert if a user's or IP's current count exceeds the 99th percentile of their own historical behavior, indicating a significant deviation from their normal RDP usage pattern.",
              "Apply a density-based clustering algorithm like DBSCAN to RDP connection logs. Use features such as (source IP, count of unique destinations in 1-hour, mean time between connections). The algorithm will group normal activity into dense clusters. Any connection events that are classified as noise points (i.e., not belonging to any cluster) represent anomalous fan-out behavior and should be investigated."
            ]
          },
          {
            "description": "An RDP connection (TCP port 3389) is established between a source and destination host pair that have never communicated via RDP before, or that violates established network segmentation policies (e.g., a workstation in a user VLAN connecting to a server in a database VLAN).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Firewalls, VLAN access control lists (ACLs), Core Switches, Server and Endpoint logs",
            "action": [
              "In a SIEM, enrich network events with asset and identity information defining network segments and host roles (e.g., 'DEV_VLAN', 'DB_SERVER'). Create a rule that alerts on any RDP connection from Zeek conn.log where the source segment is not authorized to connect to the destination segment (e.g., `source_segment: 'DEV_VLAN'` and `destination_segment: 'FINANCE_VLAN'`).",
              "Maintain a baseline lookup table of all source-destination IP pairs that have communicated via RDP over the last 90 days. For each new RDP connection seen in Zeek conn.log, query this table. If the `(source_ip, destination_ip)` tuple has never been seen before (a 'first-time' connection), flag it for review. Prioritize first-time connections involving high-value assets.",
              "Construct a network graph where nodes are hosts and edges represent historical RDP connections. Apply a community detection algorithm (e.g., Louvain) to identify clusters of tightly-coupled systems. A new RDP connection that forms an edge between two previously disconnected communities is a high-confidence indicator of anomalous lateral movement and should be alerted on."
            ]
          },
          {
            "description": "Following a successful interactive RDP login (Windows Event ID 4624, Logon Type 10), the associated logon session (identified by Logon ID) spawns suspicious processes. This includes command-line reconnaissance (`whoami`, `net user`, `qwinsta`), execution of credential access tools (`mimikatz.exe`), or initiating anomalous outbound network connections.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Servers, Privileged Access Workstations, DNS Servers, Endpoint Process Logs",
            "action": [
              "Create a correlation rule that links a successful RDP login (Event ID 4624, Logon Type 10) to subsequent process creation events (Event ID 4688 or Sysmon Event ID 1) using the `LogonId` field. Alert if any spawned process command line contains strings indicative of reconnaissance (`ipconfig /all`, `net group 'Domain Admins'`), credential dumping (`procdump`, `lsass`), or lateral movement (`psexec`, `wmiexec`).",
              "For each RDP session, analyze all child processes. Calculate the prevalence of each process name and its command-line arguments against a baseline of all commands run across the enterprise. Flag sessions that execute rare commands (e.g., in the bottom 5th percentile of frequency) or commands with unusually high argument length or entropy, which can indicate encoded/obfuscated payloads.",
              "Train a classifier (e.g., Gradient Boosting) to score RDP sessions as 'benign' or 'malicious'. Extract features from the session activity, such as: count of reconnaissance commands, presence of rare processes, entropy of DNS queries, number of failed logons, and total network data transferred. Use the model's output probability to prioritize suspicious sessions for analyst investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]