[
  {
    "information_requirement": "Is the adversary evading defenses by smuggling malicious code within LNK file icon paths? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1027.012",
        "name": "LNK Icon Smuggling",
        "evidence": [
          {
            "description": "A Windows file creation event (Sysmon Event ID 11 or Event ID 4663) for a file with a '.lnk' extension is recorded. Automated parsing of the LNK file structure extracts an icon path containing a URL, IP address, or domain that matches an entry in a high-confidence threat intelligence feed.",
            "data_sources": [
              "Windows Sysmon Event ID 11",
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (user workstations, servers), specifically in user-writable directories like Desktop and Downloads; Email security gateway sandboxes; Web proxy and DNS server logs.",
            "action": [
              "Configure a SIEM rule to trigger on Windows Sysmon Event ID 11 or Event ID 4663 where the TargetFilename ends in '.lnk'. The automation workflow must parse the LNK file to extract the icon path string. If the extracted string contains a URL, IP, or domain, query it against all active threat intelligence feeds. Generate a critical alert upon a positive match.",
              "For every LNK file creation, parse the icon path to extract any Top-Level Domain (TLD). Maintain a 30-day rolling frequency count of all TLDs seen in LNK icon paths across the enterprise. Create an alert for any new LNK file containing a TLD that falls in the bottom 5th percentile of frequency, indicating a statistically rare TLD.",
              "Train a supervised classification model (e.g., XGBoost, Random Forest) on a labeled dataset of benign and malicious LNK files. Engineer features from the icon path, including: string length, character entropy, presence of an IP address, TLD (one-hot encoded), and the TLD's rank in a public reputation list. Deploy the model to score all new LNK files, generating an alert for any file classified as malicious with a probability score greater than 0.85."
            ]
          },
          {
            "description": "A Windows file creation event (Sysmon Event ID 11) for a '.lnk' file is recorded, where parsing the file reveals an icon path pointing to either a remote resource via a UNC path (e.g., \\\\10.0.0.5\\share, \\\\attacker.com@SSL\\webdav) or a non-standard local directory (e.g., %APPDATA%, C:\\Users\\Public\\).",
            "data_sources": [
              "Windows Sysmon Event ID 11",
              "Windows Event ID 4663",
              "Zeek smb_files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (user workstations, terminal servers), network file shares, and logs from domain controllers and SMB file servers.",
            "action": [
              "Create a SIEM rule that, upon observing a Sysmon Event ID 11 for a '.lnk' file, parses the icon path. Use regular expressions to alert if the path matches patterns for remote UNC paths (e.g., `^\\\\\\\\[0-9]`, `@SSL`), or if the local path points to a user-writable temporary directory (e.g., `%TEMP%`, `%PUBLIC%`, `%APPDATA%`).",
              "For every new LNK file, extract the icon path string and calculate its Shannon entropy score. Establish a baseline distribution of entropy scores for all LNK icon paths in the environment over a 90-day period. Generate a medium-severity alert for any LNK file whose icon path entropy exceeds the 98th percentile of the established baseline.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest or One-Class SVM) on features extracted from known-benign LNK icon paths. Features should include: path length, directory depth (count of '\\'), presence of numeric-only hostnames, and a boolean flag for UNC path. Deploy the model to score all new LNK files, flagging any that are identified as outliers for analyst investigation."
            ]
          },
          {
            "description": "The 'explorer.exe' process initiates an outbound network connection (Windows Sysmon Event ID 3) to an external IP address. This is corroborated by network data (Zeek conn.log) showing the connection and potentially by file transfer data (Zeek files.log) indicating a downloaded executable or script (e.g., MIME type 'application/x-msdownload').",
            "data_sources": [
              "Windows Sysmon Event ID 3",
              "Windows Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint EDR/process monitoring logs; Network security monitoring logs at egress points (e.g., firewalls, proxies); DNS server query logs.",
            "action": [
              "Deploy a SIEM rule that generates a high-severity alert when 'Image' is 'C:\\\\Windows\\\\explorer.exe' in a Windows Sysmon Event ID 3 (Network Connection) log, and the 'DestinationIp' is not on an approved allowlist of internal or known-good external IP ranges. This is anomalous behavior and warrants immediate investigation.",
              "On a per-host basis, calculate a daily count of distinct external destination IPs contacted by the 'explorer.exe' process. The expected value is zero. Any count greater than zero is a statistical anomaly. The risk score of the alert should be increased if the destination IP has a poor reputation or is statistically rare across the enterprise over the last 30 days.",
              "Apply a time-series anomaly detection algorithm (e.g., SARIMA, Prophet) to network flow data (Zeek conn.log), aggregated by the source process name identified via endpoint logs. Model the expected volume of outbound traffic (bytes_out) and connection counts for 'explorer.exe', which should be a near-zero baseline. Any statistically significant deviation from this baseline constitutes an anomaly and should trigger an alert."
            ]
          },
          {
            "description": "Within a short time window (<5 minutes) on a single host, a sequence of events is observed: 1) A '.lnk' file is created (Sysmon Event ID 11); 2) The 'explorer.exe' process initiates an outbound network connection (Sysmon Event ID 3); 3) A new process is created (Sysmon Event ID 1) by a suspicious parent (e.g., 'explorer.exe', 'rundll32.exe') and the new process image is unsigned or has a low prevalence in the environment.",
            "data_sources": [
              "Windows Sysmon Event ID 11",
              "Windows Event ID 4663",
              "Windows Sysmon Event ID 3",
              "Windows Sysmon Event ID 1",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Aggregated security logs in a central SIEM or data lake containing endpoint process, file, and network events; EDR platform consoles.",
            "action": [
              "Create a SIEM correlation rule that triggers on a single host within a 5-minute window if the following sequence occurs: [EVENT 1: Sysmon EID 11 where TargetFilename ends with '.lnk'] FOLLOWED BY [EVENT 2: Sysmon EID 3 where Image is 'explorer.exe' and DestinationIp is external] FOLLOWED BY [EVENT 3: Sysmon EID 1 where ParentImage is 'explorer.exe' or 'rundll32.exe']. This sequence match should generate a critical severity alert.",
              "Implement a host-based risk scoring system. Define weights for specific atomic behaviors observed within a rolling 1-hour window (e.g., LNK file created in Downloads: +10; explorer.exe outbound connection: +50; unsigned process execution: +25; process execution from temp dir: +15). Sum the scores for each host. Alert on any host whose total score exceeds the 99th percentile of the distribution of all host scores for the past 24 hours.",
              "Model endpoint event data as a property graph where events are nodes and their relationships (e.g., parent-child process, file-write-by-process) are edges. Use a graph query language (e.g., Cypher, Gremlin) to search for subgraphs matching the attack pattern: `(File {name: '*.lnk'})<-[:WROTE]-(Process)-[:CREATED]->(Process {name: 'explorer.exe'})-[:INITIATED]->(Connection {direction: 'outbound'})`. Flag any matching subgraphs as high-confidence malicious activity chains."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]