[
  {
    "information_requirement": "Has an adversary leveraged federated or synchronized identities to pivot from an on-premises host to a cloud service, and subsequently used that access to move laterally to another on-premises system? (PIR)",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1021.007",
        "name": "Cloud Services",
        "evidence": [
          {
            "description": "A successful federated authentication event (Windows Event ID 4624) from an on-premises host IP address on a watchlist of compromised systems, immediately followed by network connections (Zeek conn.log) from that same host to known cloud provider IP ranges (e.g., AWS, Azure, GCP).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, ADFS Servers, Network Egress Points, Endpoint devices",
            "action": [
              "Symbolic: Correlate a watchlist of known compromised user accounts or host IP addresses against successful authentication logs (Windows Event ID 4624, Logon Type 3) and network connection logs (Zeek conn.log) where the destination IP is within a known cloud provider's address space. An alert is generated upon a match.",
              "Statistical: For each user, establish a baseline of source hosts used for cloud authentication. Calculate the rarity of a user-host pair using a frequency analysis (e.g., if a user authenticates from a host they use <1% of the time). Generate a risk score if a rare user-host pair is observed authenticating to a cloud service.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA) on the volume of cloud authentications per user over a 30-day period. An alert is triggered if the observed authentication volume for a user on a given day exceeds the 99th percentile of the forecasted prediction interval, suggesting anomalous activity."
            ]
          },
          {
            "description": "A command-line process creation event (Windows Event ID 4688) for a known cloud CLI binary (e.g., az.exe, gcloud.cmd, aws.exe) that includes arguments associated with remote execution or credential access (e.g., az vm run-command, gcloud compute ssh, sts get-session-token).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Management Servers, CI/CD Pipeline Servers",
            "action": [
              "Symbolic: Create a detection rule that monitors for process creation events (Windows Event ID 4688) where the process name matches a list of cloud CLIs (aws.exe, az.exe, gcloud.cmd) and the command line arguments contain keywords from a watchlist of high-risk commands (e.g., run-command, get-session-token, compute ssh).",
              "Statistical: For each process, calculate the Shannon entropy of its command-line arguments. Establish a baseline entropy score for legitimate cloud CLI usage. Flag any execution where the command-line entropy significantly deviates (e.g., > 3 standard deviations) from the established baseline for that specific CLI tool, which may indicate obfuscated or unusually complex commands.",
              "Machine Learning: Use a pre-trained NLP classification model (e.g., a transformer-based model) to classify the intent of cloud CLI command-line arguments as 'benign', 'reconnaissance', or 'lateral movement'. Fine-tune the model on internal command-line data. Trigger an alert for any command classified as 'lateral movement' with high confidence."
            ]
          },
          {
            "description": "A single on-premises source IP address generates a statistically significant spike in the volume or diversity (entropy) of HTTP requests to cloud API endpoints (observed in Zeek http.log) within a short time window (e.g., 15 minutes), immediately followed by new network connections (observed in Zeek conn.log) from that same source IP to other internal assets on ports associated with lateral movement (e.g., TCP/445, TCP/3389, TCP/5985).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal network segments (East-West traffic), DNS servers",
            "action": [
              "Symbolic: If a host makes >100 unique API calls to a cloud provider domain in under 5 minutes, flag that host. If the flagged host then initiates a connection to another internal host on RDP (3389) or WinRM (5985) within the next 30 minutes, generate a high-severity alert.",
              "Statistical: For each host, calculate a 30-day rolling baseline of the daily count of unique cloud API endpoints accessed (from Zeek http.log 'host' and 'uri' fields). Alert if the daily count for a host exceeds the 95th percentile of its historical baseline, indicating potential enumeration.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from Zeek http.log (source IP, destination IP, request URI, user-agent) to identify anomalous clusters of cloud API activity. Correlate hosts in anomalous clusters with subsequent lateral movement activity detected by a separate anomaly detection system monitoring east-west traffic."
            ]
          },
          {
            "description": "A user's credentials are used for a successful federated authentication event (Windows Event ID 4624) from an on-premises host they have not historically used. This is followed by an inbound network connection (Zeek conn.log) from a known cloud provider IP range to a different internal host than the one that initiated the original authentication.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, ADFS Servers, Bastion Hosts, Network Firewalls/Gateways",
            "action": [
              "Symbolic: Maintain a state table of (user, host) logon pairs from Windows Event ID 4624. If a user authenticates to a cloud service from a host not in their historical set, flag the session. If an inbound connection from a cloud IP is then observed to a different internal host within 60 minutes, trigger an alert for a potential cloud-to-on-prem pivot.",
              "Statistical: For each user, create a frequency distribution of source hosts used for authentication. If a logon occurs from a host in the bottom 5th percentile of frequency for that user, assign it a high risk score. If this high-risk session is followed by an inbound cloud-to-on-prem connection, escalate the alert.",
              "Machine Learning: Model user access patterns as a graph where nodes are users, hosts, and cloud services. Use a graph-based anomaly detection algorithm to identify rare or previously unseen paths (e.g., User A -> Host X -> Cloud Service -> Host Y). An alert is generated when a new, high-risk path is completed."
            ]
          },
          {
            "description": "An HTTP POST/PUT request is made to a cloud management API endpoint associated with network configuration changes (e.g., ec2:AuthorizeSecurityGroupIngress, Microsoft.Network/networkSecurityGroups/write, compute.firewalls.patch). The change introduces a new rule allowing inbound traffic from the internet (0.0.0.0/0) or a wide internal range to a sensitive port (e.g., 3389, 22, 5985).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Cloud Management Consoles/APIs, Virtual Private Cloud (VPC) Flow Logs",
            "action": [
              "Symbolic: Create a rule to alert on any HTTP request captured in Zeek http.log to a cloud API endpoint containing keywords like 'AuthorizeSecurityGroupIngress' or 'networkSecurityGroups' where the request body contains 'CidrIp: ''0.0.0.0/0''' and a sensitive port number.",
              "Statistical: Baseline the daily rate of network security configuration changes per user. Use a Poisson distribution to model the expected number of these events. Alert if a user performs a number of changes in a single day that is a statistical outlier (e.g., p-value < 0.01), indicating an abnormal burst of activity.",
              "Machine Learning: Train a classification model to distinguish between legitimate and suspicious cloud network changes based on features like the user's role, source IP geolocation, time of day, and the specific rule being added/modified. An alert is triggered for any change classified as suspicious with high confidence."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]