[
  {
    "information_requirement": "Is the adversary collecting data from removable media?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1025",
        "name": "Data from Removable Media",
        "evidence": [
          {
            "description": "A process creation event is observed where the process image's file hash matches a known malicious hash associated with data theft tools, or the process name matches a high-fidelity list of such tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (desktops, laptops) with USB ports, physical servers with USB access, virtual machine hosts with USB passthrough enabled.",
            "action": "1. (Symbolic) Query process creation logs (Windows Event ID 4688) for processes launched from a removable drive path where the process name or file hash matches a threat intelligence list of known USB-specific data theft tools. Example: `ProcessPath MATCHES REGEX '^[D-Z]:\\.*' AND (ProcessName IN ('usbstealer.exe', 'datathief.exe') OR ProcessHash IN ('hash1', 'hash2'))`. 2. (Statistical) For processes launched from a removable drive, calculate the prevalence of the process name and hash across the enterprise. Alert on processes that are statistically rare (e.g., seen on fewer than 5 endpoints or <0.1% of the fleet) or have high entropy in their filenames, suggesting randomization. 3. (ML) Train a classification model (e.g., Random Forest) on features from process creation events (parent process, command line length, entropy of name, path) to predict whether a process launched from removable media is malicious. Use labeled historical data for training and apply the model to new events for real-time scoring."
          },
          {
            "description": "A command line execution or PowerShell script block is observed invoking a native utility (e.g., xcopy, robocopy, powershell.exe) with arguments indicating file enumeration or copying from a drive letter associated with removable media.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints (desktops, laptops) with USB ports, physical servers with USB access, virtual machine hosts with USB passthrough enabled.",
            "action": "1. (Symbolic) Create a detection rule that searches command line logs (Windows Event ID 4688) and PowerShell logs (Windows Event ID 4104) for the co-occurrence of file copy/search commands and removable drive letters. Example query: `(CommandLine CONTAINS 'xcopy' OR CommandLine CONTAINS 'robocopy' OR CommandLine CONTAINS 'Copy-Item') AND (CommandLine MATCHES REGEX '[D-Z]:\\\\')`. 2. (Statistical) For each user, establish a baseline of normal command-line activity related to file operations on removable media. Calculate the daily frequency and volume of `copy`/`xcopy`/`robocopy` operations per user. Alert when a user's activity exceeds a high percentile (e.g., 95th) of their own or their peer group's baseline. 3. (ML) Use an anomaly detection model (e.g., Isolation Forest) on features extracted from command-line arguments, such as the number of wildcards, use of recursive flags, and the count of targeted file extensions. The model can learn normal administrative or user behavior and flag command lines that deviate significantly."
          },
          {
            "description": "A high volume of file read operations from a single process targeting multiple files with sensitive extensions (e.g., *.docx, *.xlsx, *.pdf) on a removable media volume within a short time frame.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers and endpoints containing sensitive documents (e.g., finance, HR, legal departments). Object-level auditing must be enabled on these systems for removable media access.",
            "action": "1. (Symbolic) Create a rule that triggers when a script (e.g., PowerShell) or command-line tool (`findstr`) is executed with arguments that search for multiple sensitive file extensions on a removable drive. Example: `(ProcessName == 'powershell.exe') AND (CommandLine CONTAINS 'Get-ChildItem -Path E: -Recurse -Include *.docx,*.xlsx,*.pdf')`. 2. (Statistical) Aggregate file access events (Windows Event ID 4663) by user, process, and source drive. For each user accessing a removable drive, calculate the rate of file access events per minute and the diversity of file extensions accessed using an entropy score. Alert when the access rate exceeds the 99th percentile of historical activity or the extension entropy is unusually high. 3. (ML) Use a sequence analysis model (e.g., LSTM) to analyze the sequence of file access events (Event ID 4663) per user session. Train the model on normal user workflows to identify and flag anomalous sequences, such as rapid, recursive traversal of directories on a USB drive characteristic of automated collection scripts."
          },
          {
            "description": "A temporal correlation is observed on a single host where commands indicative of data collection from removable media are followed within a 30-minute window by either the creation of a compressed archive file or an outbound network connection to a rare destination.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), DNS servers, and endpoints with direct internet access. Correlation must occur across data from these NAIs.",
            "action": "1. (Symbolic) Create a correlation rule that triggers when a host that generated a removable media access alert also generates a subsequent alert for data staging (e.g., process creation of `7z.exe`, `rar.exe`) or data exfiltration (e.g., network connection to a known malicious IP) within 30 minutes. 2. (Statistical) For each host, monitor the volume of outbound network traffic (in bytes) in the 15 minutes following any file copy operation from a removable drive. Establish a baseline for this traffic volume. Alert if the post-copy outbound traffic exceeds a statistically significant threshold (e.g., 3 standard deviations above the mean or the 98th percentile) for that host. 3. (ML) Develop a time-series model (e.g., ARIMA) for each host's typical outbound data transfer patterns. After detecting a removable media access event, feed the subsequent network traffic data into the model. If the model flags the traffic as a significant anomaly compared to its forecast, generate an alert."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]