[
  {
    "information_requirement": "Has an adversary evaded defenses by executing a file with a trailing space in its name?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1036.006",
        "name": "Space after Filename",
        "evidence": [
          {
            "description": "A process is created from a file with a trailing space, and the file's hash matches a known malicious signature from threat intelligence feeds.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints (desktops, laptops) and critical servers (domain controllers, database servers, application servers).",
            "action": [
              "Symbolic: Query process creation logs (Windows Event ID 4688) for process names ending in a space character (`NewProcessName LIKE '% '`). For each event, compute the file hash and cross-reference it against a threat intelligence database of known malware hashes. Generate a high-severity alert on any match.",
              "Statistical: For all processes with a trailing space, calculate the prevalence of their file hashes across the enterprise. Hashes that appear on a small number of machines (e.g., fewer than 5, or in the bottom 5th percentile of prevalence) should be prioritized for investigation as potentially unique malware samples.",
              "Machine Learning: Develop a logistic regression model trained on file metadata (hash prevalence, file path, parent process) and threat intelligence labels (known good, known bad). Use this model to classify newly observed files with trailing spaces and malicious-matching hashes as either 'benign false positive' or 'confirmed malicious', helping to prioritize analyst response."
            ]
          },
          {
            "description": "A process is created from an executable file where the filename, excluding the trailing space, mimics a common system binary (e.g., 'svchost.exe', 'lsass.exe', 'powershell.exe').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System folders (e.g., C:\\Windows\\System32) and user profile directories on all endpoints and servers, where masquerading binaries are often placed.",
            "action": [
              "Symbolic: Create and maintain a watchlist of critical system process names (e.g., 'svchost.exe', 'lsass.exe', 'cmd.exe', 'powershell.exe'). Query process creation logs (Windows Event ID 4688) for events where the NewProcessName field matches a watchlist entry followed by a space (e.g., NewProcessName = 'svchost.exe '). Alert on any match.",
              "Statistical: For each process name on the watchlist, establish a baseline of its normal execution frequency per host. Monitor for executions of the same name with a trailing space. An event like 'svchost.exe ' occurring on a host where it has never been seen before is a statistical anomaly. Calculate the rarity of the process name/path combination; events in the 99th percentile of rarity warrant investigation.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features from process creation events (process name, command line arguments, parent process). Legitimate system processes will form dense clusters. A process like 'powershell.exe ' will be an outlier or part of a very small, sparse cluster, allowing for its automatic identification as anomalous."
            ]
          },
          {
            "description": "A file is created or written to disk with a filename containing one or more trailing spaces, particularly within a directory commonly used for staging, such as user temp or download folders.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User profile directories (Downloads, AppData, Temp), public-write shares, and web server upload directories.",
            "action": [
              "Symbolic: Scan file system object creation/modification logs (Windows Event ID 4663, 4656) for any ObjectName that ends with a space character and is located in a high-risk directory (e.g., 'C:\\Users\\*\\AppData\\Local\\Temp\\*', 'C:\\Windows\\Temp\\*'). Alert on any such creation event.",
              "Statistical: Calculate the entropy of filenames created in staging directories. Filenames with trailing spaces, especially if combined with random characters, may exhibit higher entropy than typical filenames. Monitor the daily average filename entropy per user; a sudden spike exceeding two standard deviations from the user's baseline could indicate staging activity. Also, track the frequency of file creations with trailing spaces per user; a user with a count in the top 95th percentile is anomalous.",
              "Machine Learning: Train a One-Class SVM (Support Vector Machine) on features of legitimate file creation events in temp directories (file extension, filename entropy, creating process). Use the trained model to identify file creation events with trailing spaces as outliers that do not conform to the established pattern of normal behavior."
            ]
          },
          {
            "description": "A process launched from a file with a trailing space initiates a network connection to an external IP address with a low reputation score or to a domain not previously observed in the organization's DNS traffic.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (monitored by Zeek), DNS servers, and all endpoints generating process and network logs.",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) where NewProcessName has a trailing space with network connection logs (Zeek conn.log, Windows Event ID 5156) from the same host IP within 60 seconds. Check the destination IP against a threat intelligence feed of known C2 servers. Alert on any match.",
              "Statistical: For processes with trailing spaces, analyze their destination domains from DNS logs (Zeek dns.log). Calculate the domain's age and its prevalence across the enterprise (domain popularity). A connection to a domain that is less than 30 days old and has been requested by fewer than 0.1% of hosts is a high-confidence statistical outlier.",
              "Machine Learning: Use a time series forecasting model (e.g., ARIMA) to predict the expected volume of outbound data (bytes_out in Zeek conn.log) for each host. When a process with a trailing space is executed, monitor the subsequent data transfer volume. If the actual volume significantly exceeds the predicted forecast (e.g., falls outside the 99% confidence interval), flag it as a potential data exfiltration or payload download event."
            ]
          },
          {
            "description": "A process with a trailing space in its name is observed with a parent process that is inconsistent with its established baseline (e.g., 'svchost.exe ' spawned by 'explorer.exe' instead of 'services.exe').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process trees on all enterprise endpoints and servers.",
            "action": [
              "Symbolic: Define a set of rules for valid parent-child process relationships (e.g., parent 'services.exe' -> child 'svchost.exe'). Query process creation logs (Windows Event ID 4688) for events where a child process has a trailing space in its name and the parent-child relationship violates a predefined rule. Alert on any violation.",
              "Statistical: Build a frequency table of all parent-child process relationships observed across the enterprise over a 30-day period. For any new process with a trailing space, look up its parent. If the parent-child pair has a very low frequency (e.g., it occurs less than 5 times in the entire dataset, placing it in the lowest percentile), it is a statistical anomaly and should be investigated.",
              "Machine Learning: Represent parent-child process relationships as a directed graph. Use a community detection algorithm (e.g., Louvain Modularity) to find clusters of related processes. A process with a trailing space that does not belong to any major community or that bridges two otherwise disconnected communities is a structural anomaly in the graph, indicating a likely malicious execution chain."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]