[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by masquerading account names? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1036.010",
        "name": "Masquerade Account Name",
        "evidence": [
          {
            "description": "A user account creation event (Windows Event ID 4720) is logged where the 'New Account Name' field contains a username matching a curated list of known malicious or suspicious account names (e.g., 'haxor', 'system.service', 'backup_admin').",
            "data_sources": [
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Workstations",
            "action": [
              "Symbolic: Continuously monitor for Windows Event ID 4720 (A user account was created) on all NAIs. Compare the 'Target Account Name' value against a regularly updated threat intelligence blocklist of known malicious account names. Generate a high-severity alert for any exact match.",
              "Statistical: For all account creation events (4720), calculate the Shannon entropy of the new username. Establish a baseline of username entropy for all existing accounts. Flag any new username whose entropy falls in the top 5th percentile (unusually random, e.g., 'x7g3f_svc') or bottom 5th percentile (unusually simple, e.g., 'a') for analyst review, as these can be indicative of automated creation.",
              "Machine Learning: Develop a supervised classification model (e.g., a Random Forest Classifier) trained on historical account creation data. Features should include the creator's account, source hostname, time of day, and text-based features from the username (length, character types). Label historical data with known-good (created by IT) and known-bad (from past incidents/red teams) examples. Use the model to score all new account creation events (4720) and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A user account creation event (Windows Event ID 4720) is logged for an account whose name matches common administrative or service account patterns (e.g., 'svc_*', '*_adm', 'backup'), and the 'Creator Subject' is not an authorized IT administrator account or automated provisioning service.",
            "data_sources": [
              "Windows Event ID 4720"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Cloud IAM Services (e.g., Azure AD)",
            "action": [
              "Symbolic: Monitor Windows Event ID 4720. Apply a set of regular expressions to the 'Target Account Name' to detect common service/admin patterns (e.g., '^(svc|sql|backup|adm|sys|net|hlp|help|dsk|desk).+', '.*admin(istrator)?$', '.*backup$'). If a pattern matches and the 'Subject Account Name' is not on an allowlist of IT administrator accounts, generate a medium-severity alert.",
              "Statistical: For all newly created accounts (4720) matching the service/admin patterns, analyze the creation timestamp. Calculate the baseline for legitimate service account creation times (e.g., typically during business hours on weekdays). Generate an alert if a pattern-matching account is created outside of the 95th percentile of normal creation times (e.g., 3 AM on a Sunday), indicating a deviation from standard IT procedure.",
              "Machine Learning: Use a time series anomaly detection model (e.g., SARIMA) on the frequency of service account creations. A sudden, anomalous spike in the creation of accounts matching service/admin patterns, which deviates significantly from the forecasted trend, should be flagged as a potential large-scale account creation event by an adversary."
            ]
          },
          {
            "description": "A user account creation or rename event (Windows Event ID 4720, 4781) is logged where the new account name contains non-standard ASCII characters or homoglyphs, and when normalized, visually resembles an existing high-privilege account name (e.g., 'ɑdmin' vs 'admin').",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4781"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, HR Systems, Financial Systems",
            "action": [
              "Symbolic: For each account creation (4720) or rename (4781), check if the 'Target Account Name' contains any characters outside the standard ASCII printable character set (32-126). If non-standard characters are present, generate an alert for manual inspection.",
              "Statistical: On a periodic basis, query for new accounts (4720, 4781). For each new name, generate a 'skeleton' by normalizing it (e.g., converting homoglyphs to their ASCII equivalents, removing non-alphanumeric characters, lowercasing). Calculate the Levenshtein distance between the skeleton and the skeletons of all existing privileged accounts. Alert if the distance is very low (e.g., < 2) but the original strings are different, indicating a likely homoglyph or typosquatting attack.",
              "Machine Learning: Train an autoencoder on the character-level representation of all legitimate existing usernames. The model will learn to reconstruct 'normal' usernames with low error. Feed all new usernames (from 4720, 4781) into the trained autoencoder. Usernames that result in a high reconstruction error are anomalous, potentially because they contain unusual character patterns like homoglyphs, and should be flagged for review."
            ]
          },
          {
            "description": "A user account creation or rename event (Windows Event ID 4720, 4781) is logged where the Jaro-Winkler similarity score between the new account name and an existing privileged account name exceeds a predefined threshold (e.g., > 0.90), indicating a potential typosquatting attempt (e.g., 'admnistrator' vs 'administrator').",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4781"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Privileged Access Workstations (PAWs), Key IT Personnel Endpoints",
            "action": [
              "Symbolic: Maintain a list of critical account names (e.g., CEO, CFO, key domain admins). For each account creation/rename (4720, 4781), check for common permutations of these critical names, such as swapped characters or missing letters (e.g., 'admnistrator', 'administator'). Alert on any matches.",
              "Statistical: For each new account name (from 4720, 4781), calculate its Jaro-Winkler distance to all existing accounts, especially those in privileged groups. Establish a distribution of 'nearest-neighbor' distances for legitimate new accounts. Flag any new account whose distance to a privileged account is an outlier (e.g., in the bottom 1st percentile of distances, indicating very high similarity), suggesting a deliberate typo.",
              "Machine Learning: Use unsupervised clustering (e.g., DBSCAN) on vector representations (e.g., TF-IDF of character n-grams) of all account names. Legitimate account names should form dense clusters. A new account that does not fall into any existing cluster or forms a tiny cluster of its own is an anomaly. If this anomalous account is also algorithmically similar to a high-privilege account, escalate the alert priority."
            ]
          },
          {
            "description": "A newly created account (within 72 hours of creation per Event ID 4720) performs a privileged action, such as being added to an administrative group (Event ID 4732), or exhibits anomalous network behavior, such as a high volume of failed connections or connections to rare external IP addresses (Zeek conn.log).",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4781",
              "Windows Event ID 4624",
              "Windows Event ID 4732",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Gateway, DNS Servers, Endpoint Devices",
            "action": [
              "Symbolic: Create a rule that triggers when an account created within the last 24 hours (Event ID 4720) is immediately added to a high-privilege group (e.g., 'Domain Admins', 'Enterprise Admins') via Event ID 4728 or 4732. This 'newborn admin' behavior is highly suspicious and should generate a critical alert.",
              "Statistical: For accounts created within the last 7 days, monitor their login activity (Event ID 4624) and network connections (Zeek conn.log). For each new account, calculate the rarity of its source IP's ASN and country. If the percentile rank of the ASN/country frequency is less than 5% (i.e., very rare) for that user's history, and it's an interactive login, increment a risk score. An aggregate score exceeding a threshold warrants investigation.",
              "Machine Learning: Implement a 'Time to First Action' model. For all accounts, train a model on the typical time delay between account creation and key activities (e.g., first login, first file share access, first remote connection). A newly created account that performs a sensitive action significantly faster than the learned baseline (e.g., an RDP session within minutes of creation) is an anomaly that should be flagged by the model."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]