[
  {
    "information_requirement": "Is the adversary exfiltrating sensitive data by chunking it into fixed sizes to evade detection?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1030",
        "name": "Data Transfer Size Limits",
        "evidence": [
          {
            "description": "A successful outbound network connection is established with a destination IP address, domain, or URL that matches a high-confidence threat intelligence feed of known malicious C2 or data exfiltration endpoints.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways, DNS resolvers, and web proxies",
            "action": [
              "Symbolic (IOC Match): Continuously inner join destination IPs from Zeek conn.log, requested domains from Zeek dns.log, and full URLs from Zeek http.log against a high-confidence threat intelligence feed of known malicious C2 or data exfiltration points (updated daily). Generate a high-severity alert for any successful connection.",
              "Statistical (Volume Analysis): For all threat intelligence matches, calculate the 95th percentile of outbound data volume (orig_bytes in Zeek conn.log) for the matched destination over the last 30 days. Escalate alerts where the current session's data volume exceeds this percentile, indicating unusually large transfers to a known-bad destination.",
              "ML (Reputation Scoring): Develop a reputation score for all external destinations using features like domain age, ASN reputation, and historical threat intelligence hits. Use a classification model (e.g., Logistic Regression) trained on known benign and malicious destinations. Flag new connections to destinations with a predicted 'malicious' probability above a predefined threshold (e.g., 0.8)."
            ]
          },
          {
            "description": "Observed outbound network traffic contains signatures or patterns (e.g., specific HTTP headers, DNS query structures, fixed inter-packet delays) that match the known behavior of specific data exfiltration tools.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways, web proxies, and internal DNS servers",
            "action": [
              "Symbolic (Signature Match): Deploy and monitor rule-based signatures (e.g., Suricata or Zeek scripts) that match known exfiltration tool patterns. For example, search Zeek http.log for POST requests with unusual Content-Type headers or custom headers used by known malware. For DNS, search Zeek dns.log for an abnormally high volume of TXT record queries to a single subdomain where the queried subdomains match a regular expression for encoded data.",
              "Statistical (Entropy Analysis): For DNS queries in Zeek dns.log, calculate the Shannon entropy of the subdomain portion of the query name. Establish a baseline entropy score for normal traffic. Flag queries where the entropy score exceeds 3 standard deviations above the mean, suggesting the subdomain is not human-readable and may contain encoded data chunks.",
              "ML (Time Series Forecasting): For a given source-destination pair, model the time delta between consecutive outbound packets using a time series model (e.g., ARIMA). Generate an alert when the observed inter-packet delays deviate significantly from the forecast, indicating a potentially automated and fixed timing pattern inconsistent with normal user behavior."
            ]
          },
          {
            "description": "Statistical analysis of an outbound network session reveals an abnormally low variance or standard deviation in the size of data packets or chunks, indicating data is being programmatically split into uniform sizes.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress network gateways and core network switches",
            "action": [
              "Symbolic (Rule-Based Threshold): For each outbound flow in Zeek conn.log lasting longer than 60 seconds and transferring more than 1MB, calculate the standard deviation of the orig_bytes field. Alert if the standard deviation is below a predefined low threshold (e.g., < 10 bytes), which is not typical for variable-content protocols like HTTP.",
              "Statistical (IQR Analysis): For each outbound connection in Zeek conn.log, collect the sizes of individual data chunks within a session (using a Zeek script to track orig_ip_bytes per packet). Calculate the Inter-Quartile Range (IQR) of these chunk sizes. Flag sessions where the IQR is in the bottom 5th percentile of all sessions, suggesting an artificially uniform data transfer pattern.",
              "ML (Clustering): Use a clustering algorithm (e.g., DBSCAN) on features extracted from network flows, including average packet size, standard deviation of packet size, and total bytes transferred. Identify and investigate clusters that are characterized by very low standard deviation of packet size but high total transfer volume, as these are anomalous and indicative of this technique."
            ]
          },
          {
            "description": "A series of periodic outbound connections from a single internal host is detected, where each connection instance transfers a nearly identical volume of data, indicating automated, chunked exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, servers hosting sensitive data, and domain controllers",
            "action": [
              "Symbolic (Beaconing Rule): For each source IP, group connections by destination IP and port. If more than 5 connections occur in an hour with a regular time interval (+/- 10% jitter) and the orig_bytes field in Zeek conn.log for each connection is within 5% of the others, generate an alert for potential beaconing with fixed data size.",
              "Statistical (Autocorrelation): For each internal source IP, create a time series of outbound connection events. Apply an autocorrelation function (ACF) to the time series to detect significant periodic signals. For any IP identified as beaconing, calculate the variance of the orig_bytes field across those periodic connections. Flag hosts with strong periodicity and a data volume variance below a statistically determined low threshold.",
              "ML (Anomaly Detection): Train an anomaly detection model (e.g., Isolation Forest) on features for each host, such as the number of outbound connections per hour, the average time between connections, and the standard deviation of bytes sent per connection. The model will learn the normal 'rhythm' of the network. Flag hosts that the model identifies as strong anomalies, as they may be exhibiting new, automated C2 behavior."
            ]
          },
          {
            "description": "An outbound network connection using a standard protocol (e.g., HTTP/S, DNS) is initiated by a process that does not typically perform network communication, or the protocol's usage is inconsistent with its specification.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, application servers, and user workstations",
            "action": [
              "Symbolic (Process Whitelist): Correlate network connections from Windows Event ID 5156 with process creation events from Windows Event ID 4688. Maintain a baseline of legitimate network-communicating processes (e.g., 'chrome.exe', 'outlook.exe'). Generate an alert when a process not on this baseline (e.g., 'powershell.exe', 'notepad.exe', a randomly named executable in `C:\\Users\\...\\AppData\\Local\\Temp\\`) initiates an outbound connection, especially if it involves significant data upload (orig_bytes in Zeek conn.log).",
              "Statistical (Data Ratio Analysis): For HTTP/S traffic in Zeek http.log, calculate the ratio of uploaded data (request_body_len) to downloaded data (response_body_len) for each session. Establish a baseline ratio for common applications. Flag sessions where the upload-to-download ratio exceeds the 99th percentile, suggesting an abnormal data transfer pattern that could be exfiltration disguised as web traffic.",
              "ML (JA3/JARM Hashing): Use Zeek to generate JA3 (client) and JARM (server) TLS fingerprints for all encrypted connections. Train a classification model to recognize legitimate application fingerprints (e.g., Chrome, Firefox, Windows Update). Flag any TLS connection initiated by a process whose JA3 fingerprint does not match the expected fingerprint for that application, indicating a potential masquerading or custom-coded TLS stack used for C2."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]