[
  {
    "information_requirement": "Is the adversary maintaining persistence using macOS Startup Items?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1037.005",
        "name": "Startup Items",
        "evidence": [
          {
            "description": "A process executes from a path within `/Library/StartupItems/` and the executable's hash is present on a threat intelligence list of known malware.",
            "data_sources": [
              "ESF ES_EVENT_TYPE_NOTIFY_EXEC",
              "Endpoint Process Creation Logs",
              "File Integrity Monitoring Logs",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on all macOS endpoints, specifically the `/Library/StartupItems/` directory.",
            "action": [
              "Query process execution logs for any process with an image path starting with `/Library/StartupItems/`. For each result, compute the SHA256 hash of the executable file. Alert if the hash matches any entry in the active threat intelligence feed for macOS malware.",
              "For all executables found in `/Library/StartupItems/` across all macOS endpoints, calculate the enterprise-wide prevalence (count of endpoints) for each unique file hash. Using a percentile threshold, flag any executable whose hash appears on fewer than 1% of monitored endpoints for further investigation as a 'rare' binary.",
              "Deploy a pre-trained static file classification model (e.g., a Gradient Boosting or Random Forest classifier) to analyze newly observed executables in `/Library/StartupItems/`. Use features such as file entropy, extracted strings, code signing status (valid, invalid, ad-hoc, unsigned), and imported function calls. Alert when the model classifies a file as malicious with a confidence score greater than 0.90."
            ]
          },
          {
            "description": "A file or directory is created or modified within `/Library/StartupItems/` by an unauthorized process, or its name exhibits high entropy, or its content matches malicious patterns.",
            "data_sources": [
              "ESF ES_EVENT_TYPE_NOTIFY_CREATE",
              "ESF ES_EVENT_TYPE_NOTIFY_WRITE",
              "Endpoint File Creation/Modification Logs",
              "File Integrity Monitoring Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on all macOS endpoints, specifically the `/Library/StartupItems/` directory.",
            "action": [
              "Deploy a YARA rule to continuously scan files created or written to within the `/Library/StartupItems/` path. The rule should match on suspicious strings (e.g., 'curl', 'bash -c', 'eval'), obfuscated script content, and known malware family signatures. Trigger an alert on any match.",
              "For all new file and directory names created in `/Library/StartupItems/`, calculate their Shannon entropy score. Establish a baseline mean and standard deviation for entropy of legitimate names. Alert on any new name with an entropy score greater than 3.0 or exceeding the baseline mean by 3 standard deviations, indicating probable randomization.",
              "Implement a time-series anomaly detection model (e.g., SARIMA) to monitor the rate of file creation/modification events within `/Library/StartupItems/` aggregated across the enterprise per hour. An alert should be generated if the model detects a statistically significant spike in activity that deviates from the established daily and weekly seasonal patterns, suggesting a coordinated deployment."
            ]
          },
          {
            "description": "A process, originating from an executable within `/Library/StartupItems/`, establishes an outbound network connection to an IP address or domain flagged as malicious, newly registered, or statistically rare for the organization.",
            "data_sources": [
              "ESF ES_EVENT_TYPE_NOTIFY_EXEC",
              "ESF ES_EVENT_TYPE_NOTIFY_CONNECT",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Endpoint Network Connection Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "macOS endpoints, Network egress points, and DNS servers.",
            "action": [
              "Join process execution logs (where image path starts with `/Library/StartupItems/`) with network connection logs (e.g., Zeek conn.log) on the host identifier within a 5-minute window of process start. Enrich the destination IP/domain with threat intelligence. Alert if the destination is on a blocklist for C2 servers, malware distribution, or phishing.",
              "For all domains resolved by processes originating from `/Library/StartupItems/` (via Zeek dns.log), calculate the domain's age from WHOIS data and its popularity rank (e.g., using a Tranco top 1M list). Create a risk score where points are added for low age (< 60 days) and low popularity (not in top 1M). Alert on connections where the risk score exceeds a defined threshold.",
              "Utilize a supervised classification model to score the maliciousness of TLS connections (from Zeek ssl.log) initiated by startup item processes. Features should include the JA3/JA3S fingerprint, TLS version, cipher suites, certificate details (issuer, self-signed status), and connection duration/byte count. Alert when the model's output probability for 'malicious' is > 0.85."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has the adversary escalated privileges to root by creating a malicious macOS Startup Item?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1037.005",
        "name": "Startup Items",
        "evidence": [
          {
            "description": "A file creation event occurs within `/Library/StartupItems/`, and the effective user ID (EUID) of the responsible process is greater than 0 (i.e., not root), and the process is not an authorized software deployment utility.",
            "data_sources": [
              "ESF ES_EVENT_TYPE_NOTIFY_CREATE",
              "Endpoint File Creation Logs with User Context",
              "Osquery process_events",
              "Osquery file_events"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on all macOS endpoints, specifically the `/Library/StartupItems/` directory and associated process user context.",
            "action": [
              "Create a detection rule that triggers on any file creation event within `/Library/StartupItems/`. The rule's logic must check if the creating process's effective UID is not 0. Exclude known legitimate installer processes (e.g., `installer`, `system_installd`, specific MDM agent names) via an allowlist. Alert on all other non-root writes.",
              "Profile the parent-child process relationships for processes that write to `/Library/StartupItems/`. Build a baseline of legitimate parent processes (e.g., `launchd`, `installer`). Monitor for any write event where the parent process is statistically anomalous (e.g., a web browser, terminal shell, or office application). Flag any parent process that falls below a 1% frequency threshold for investigation.",
              "Train a binary classification model (e.g., Logistic Regression) to predict if a write to `/Library/StartupItems/` is part of a privilege escalation attempt. Features must include the creating process name, its parent process name, the process's effective UID, its code signing status, and its command-line arguments. The model should be trained on labeled data from known good software installations versus simulated attacks."
            ]
          },
          {
            "description": "A new or modified script file within a `/Library/StartupItems/` subdirectory contains command strings or API calls used for user creation, security control tampering, or credential access.",
            "data_sources": [
              "File Integrity Monitoring Logs",
              "ESF ES_EVENT_TYPE_NOTIFY_CREATE",
              "ESF ES_EVENT_TYPE_NOTIFY_WRITE",
              "File Content Analysis Tools"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The contents of executable scripts within all subdirectories of `/Library/StartupItems/` on all macOS endpoints.",
            "action": [
              "Upon any file write event inside a subdirectory of `/Library/StartupItems/`, trigger an automated YARA scan of the modified file. The YARA ruleset should be designed to detect macOS-specific privilege escalation and persistence commands, such as `dscl`, `spctl --master-disable`, `csrutil disable`, and patterns for reverse shells. Generate a critical alert on any match.",
              "For all shell scripts located in startup items, parse the script content to extract all unique commands executed. Calculate the frequency of each command across the enterprise's entire population of startup scripts. Alert on any script containing commands that are statistically rare in this context (e.g., `dscl`, `kextload`, `whoami`), defined as appearing in less than 0.5% of all scanned scripts.",
              "Apply a Natural Language Processing (NLP) topic modeling technique (e.g., Latent Dirichlet Allocation - LDA) to the text content of all scripts in `/Library/StartupItems/`. Group scripts into topics like 'software installation,' 'system configuration,' and 'network setup.' Any script that falls into a newly emerging, unclassified topic or a topic with a high probability of malicious keywords should be flagged for manual analysis."
            ]
          },
          {
            "description": "A file permission modification event (`chmod`) is observed on a file within `/Library/StartupItems/` that makes it world-writable (e.g., 777, 666), or a write event is observed on a `StartupParameters.plist` file that alters its content.",
            "data_sources": [
              "File Integrity Monitoring Logs",
              "ESF ES_EVENT_TYPE_NOTIFY_SETATTR",
              "Osquery file_events",
              "Endpoint File Permission Modification Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All files and subdirectories within the `/Library/StartupItems/` path on all macOS endpoints.",
            "action": [
              "Monitor for file attribute modification events (e.g., `ES_EVENT_TYPE_NOTIFY_SETATTR`) on any file or directory within `/Library/StartupItems/`. Alert if the new file mode includes write permissions for 'group' or 'other' (e.g., `*w*` or `**w`). Additionally, alert on any modification to a `StartupParameters.plist` file after its initial creation.",
              "Establish a baseline of the expected file permissions for executables (`755` or `rwxr-xr-x`) and configuration files (`644` or `rw-r--r--`) within `/Library/StartupItems/`. Continuously monitor for and alert on any file whose permissions deviate from this established enterprise-wide norm. This detects misconfigurations that could be exploited.",
              "Use a sequence analysis model (e.g., a Hidden Markov Model) to learn the typical sequence of file system events during a legitimate software installation involving `/Library/StartupItems/` (e.g., create dir -> create plist -> create executable -> set perms to 755). An anomalous sequence, such as creating a file and then later changing its permissions to be world-writable, would be flagged by the model as a deviation from learned benign behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]