[
  {
    "information_requirement": "Is an adversary attempting to evade defenses by executing a payload from a file with a trailing space in its name?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1036.006",
        "name": "Space after Filename",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable filename contains a trailing space, and the file's SHA256 hash is present in a threat intelligence feed of known malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM/log aggregator containing process creation logs (Windows Event ID 4688, Sysmon Event ID 1) from all enterprise endpoints and servers.",
            "action": [
              "Query process creation logs for events where the process name or image path ends with a space. For each matching event, extract the file hash (e.g., from Sysmon Event ID 1 or by calculating it on the host). Cross-reference this hash against internal and external threat intelligence feeds. Generate a critical alert for any match.",
              "For all processes executed with a trailing space, calculate the prevalence of their file hash across the enterprise (stack counting). Prioritize investigation of hashes that appear on a small number of hosts (e.g., fewer than 5, or in the bottom 5th percentile of prevalence), as these represent rare and potentially targeted activity.",
              "Train a classification model (e.g., Logistic Regression, Random Forest) using features from process executions, including filename properties (has trailing space, entropy), file properties (hash prevalence, signer info), and parent process details. Use the model to assign a risk score to new processes with trailing spaces, helping to differentiate between benign edge cases and malicious activity."
            ]
          },
          {
            "description": "A process creation event is observed where the executable filename contains a trailing space and mimics a legitimate system binary (e.g., 'svchost.exe ', 'lsass.exe ', 'powershell.exe '), especially when executed from a non-standard file path.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM containing process creation logs from all endpoints, with a focus on processes executing from non-standard paths (e.g., C:\\Users\\*, C:\\Windows\\Temp) or system directories (e.g., C:\\Windows\\System32).",
            "action": [
              "Create and maintain a watchlist of critical system process names (e.g., 'svchost.exe', 'lsass.exe', 'wininit.exe'). Query process creation logs for events where the process name matches a watchlist entry followed by a space (e.g., ProcessName = 'svchost.exe '). Generate a high-severity alert for any match, especially if the file path is outside C:\\Windows\\System32.",
              "For each legitimate process name on the watchlist, establish a baseline of its normal execution path and parent process. Monitor for executions of the same name with a trailing space. Calculate the rarity of the observed process path and parent process combination. Flag events in the 99th percentile of rarity (e.g., 'svchost.exe ' running from C:\\Users\\Public) for investigation.",
              "Use a clustering algorithm (e.g., DBSCAN) on features extracted from process creation events (process name, command line, parent process, file path). Legitimate system processes will form dense, well-defined clusters. A masquerading process with a trailing space will be identified as a noise point or an outlier, allowing for its automatic detection as anomalous."
            ]
          },
          {
            "description": "A file is created or written to disk with a filename containing one or more trailing spaces, particularly within a directory commonly used for staging attacks (e.g., user temp, downloads, or public shares).",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized log aggregator containing file system audit logs (Windows Event ID 4663, Sysmon Event ID 11) from endpoints, file servers, and web servers with upload functionality.",
            "action": [
              "Monitor file creation logs for any filename that ends with a space character, especially within high-risk directories like 'C:\\Users\\*\\AppData\\', 'C:\\Windows\\Temp\\', and 'C:\\ProgramData\\'. Generate an alert for any file creation event matching this pattern.",
              "Calculate the entropy of filenames created in staging directories. Filenames with trailing spaces, especially when combined with random characters, may exhibit higher entropy than typical filenames. Monitor the daily average filename entropy per user; a sudden spike exceeding 2 standard deviations from a user's historical baseline indicates suspicious staging activity. Also, track the rate of file creations with trailing spaces per user; a rate in the top 95th percentile is anomalous.",
              "Train a One-Class SVM on features of legitimate file creation events in temp directories (e.g., filename entropy, file extension, creating process name, file size). Use the trained model to identify file creation events with trailing spaces as outliers that do not conform to the established pattern of normal behavior, flagging them for review."
            ]
          },
          {
            "description": "A process, launched from an executable with a trailing space in its filename, initiates an outbound network connection to a destination that is either on a threat intelligence blocklist, has a low reputation score, or is statistically rare for the organization.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (monitored by Zeek), DNS servers, and all endpoints generating process and network logs, aggregated in a SIEM.",
            "action": [
              "Correlate process creation events (Sysmon ID 1) involving a trailing space with network connection events (Sysmon ID 3, Zeek conn.log) from the same host within a short time window (e.g., 60 seconds). Check the destination IP or domain against threat intelligence feeds of known malicious C2 infrastructure. Alert on any match.",
              "For any network connection made by a process with a trailing space, analyze the destination domain from DNS logs (Zeek dns.log). Calculate the domain's age, global popularity, and internal prevalence. A connection to a domain that is less than 30 days old and has been requested by fewer than 0.1% of internal hosts is a high-confidence statistical outlier.",
              "Apply a time series forecasting model (e.g., Prophet, ARIMA) to each host's typical outbound data volume (bytes_out in Zeek conn.log). If a process with a trailing space executes and the subsequent outbound data volume significantly exceeds the forecasted amount (i.e., falls outside the 99% confidence interval), flag the event as potential command-and-control communication or data exfiltration."
            ]
          },
          {
            "description": "A process with a trailing space in its filename is created by a parent process that deviates from known, legitimate parent-child process relationships (e.g., 'svchost.exe ' spawned by 'winword.exe' instead of 'services.exe').",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM containing process creation logs from all enterprise endpoints and servers, enabling the reconstruction of process ancestry.",
            "action": [
              "Define and enforce a set of rules for expected parent-child process relationships (e.g., parent 'services.exe' -> child 'svchost.exe'; parent 'explorer.exe' -> child 'cmd.exe'). Query process creation logs for events where a child process has a trailing space and the parent-child relationship violates a predefined rule. Alert on any violation.",
              "Over a 30-day rolling window, build a frequency table of all parent-child process pairs observed across the enterprise. For any new process execution involving a trailing space, look up its parent-child pair in the frequency table. If the pair has a frequency in the bottom 1st percentile (i.e., is extremely rare), flag it as a statistical anomaly requiring investigation.",
              "Model process execution chains as a directed graph where nodes are processes and edges are parent-child relationships. Use a community detection algorithm (e.g., Louvain) to identify clusters of normal activity. A process with a trailing space that is not part of any major community or that acts as an anomalous bridge between two otherwise disconnected communities is a structural anomaly indicative of a malicious execution chain."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]