[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using filename manipulation?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1036.002",
        "name": "Right-to-Left Override",
        "evidence": [
          {
            "description": "The Unicode RTLO character (U+202E) or its common encoded variants (e.g., URL-encoded %E2%80%AE, UTF-8 bytes E2 80 AE) are present in a string associated with a filename, process command-line argument, DNS query, or registry key/value.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Zeek files.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Web Proxies, Mail Gateways, Active Directory Domain Controllers, DNS Resolvers",
            "action": [
              "Create a detection rule that searches for the literal byte sequence E2 80 AE (UTF-8 for U+202E) and its common string representations ('\\u202e', '%E2%80%AE') within process command lines (Windows Event ID 4688, Sysmon Event ID 1), created filenames (Sysmon Event ID 11), registry value modifications (Windows Event ID 4657), and network log fields such as filenames (Zeek files.log) and hostnames/URIs (Zeek http.log, Zeek dns.log). Alert on any match.",
              "For all process creation events (Windows Event ID 4688) and file creation events (Sysmon Event ID 11), calculate the Shannon entropy of the process command line and filename. Establish a baseline entropy value for common processes and file types across the enterprise. Alert when the entropy for a new event exceeds a high percentile threshold (e.g., 99th percentile) of the historical distribution for that process or file type, indicating an unusually complex string.",
              "Develop a supervised classification model (e.g., Random Forest) trained on a labeled dataset of benign and malicious filenames/command-lines. Engineer features such as n-gram frequency, character-type counts (alphabetic, numeric, special), string length, presence of known executable extensions, and the count of non-displayable or Unicode control characters. Deploy the model to score new process creation and file creation events in real-time. Events with a predicted malicious probability above a defined threshold (e.g., 0.90) should be escalated for investigation."
            ]
          },
          {
            "description": "A filename is observed containing the RTLO character (U+202E) immediately preceding a reversed, benign-looking file extension, while the true file extension is executable. For example, a file named 'report_[U+202E]gepj.scr' is rendered as 'report_rcs.jpeg'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, User Workstations, Email Servers, File Shares",
            "action": [
              "Create a detection rule using a regular expression to identify filenames that contain the RTLO character (e.g., \\u202E) followed by a reversed executable extension (e.g., 'exe.', 'rcs.', 'fdp.', 'sj.'). Search for this pattern in process command lines (Windows Event ID 4688) and filenames from network transfers (Zeek files.log). For network matches, correlate with the mime_type field in files.log to confirm if it is 'application/x-dosexec' or 'application/octet-stream', raising a high-severity alert if both conditions are met.",
              "Aggregate Zeek files.log data hourly. For each common non-executable file extension (.docx, .pdf, .jpg, .png), calculate the proportion of transfers where the MIME type is 'application/x-dosexec' or 'application/octet-stream'. Establish a baseline for this mismatch proportion. Alert when the hourly proportion for any extension exceeds a statistically significant threshold (e.g., 3 standard deviations above the 7-day rolling average).",
              "Implement a time-series anomaly detection model (e.g., SARIMA) on the hourly count of files with a mismatch between the file extension and the MIME type (e.g., extension is '.jpg', MIME type is 'application/x-dosexec'). Train the model on at least 30 days of historical data from Zeek files.log to account for daily and weekly seasonality. Generate an alert when an observation is flagged as an anomaly, indicating a statistically unexpected spike in masquerading activity."
            ]
          },
          {
            "description": "A legitimate document-handling process (e.g., explorer.exe, winword.exe, acrord32.exe) spawns an unexpected child process (e.g., cmd.exe, powershell.exe, rundll32.exe), which is a common post-exploitation step after a user is tricked by an RTLO-disguised file into executing a malicious payload.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, File Servers",
            "action": [
              "Create a detection rule that triggers an alert when a parent process from a list of common document viewers and office applications (e.g., 'winword.exe', 'excel.exe', 'powerpnt.exe', 'acrord32.exe', 'explorer.exe') spawns a child process from a list of interpreters and shells (e.g., 'powershell.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe', 'rundll32.exe'). Use Windows Event ID 4688 or Sysmon Event ID 1 data.",
              "Using process creation logs (Sysmon Event ID 1), compute the conditional probability P(Child | Parent) for all parent-child process pairs observed over the last 30 days. For each new process creation event, calculate this probability. If the probability is below a defined threshold (e.g., < 0.001) or if the pair has never been seen before, generate an alert to highlight a statistically rare process chain.",
              "Construct a process execution graph for each host, where nodes are process images and directed edges represent parent-child relationships. Use a graph-based clustering or community detection algorithm to find common execution patterns. A new process execution that connects two previously unconnected or loosely connected communities (e.g., a Microsoft Office process spawning a process that typically belongs to a network tools cluster) should be flagged as an anomaly for investigation."
            ]
          },
          {
            "description": "A file is downloaded or written to disk by a browser or email client (e.g., chrome.exe, outlook.exe), and within a short time window (e.g., < 30 seconds), a new process is created on the same host originating from that file, where the executed process name contains the RTLO character.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Network Egress Points",
            "action": [
              "Join network file transfer logs (Zeek files.log) with host process creation logs (Sysmon Event ID 1) on the destination IP/hostname and a time window of < 60 seconds. Create an alert if a files.log entry shows a downloaded filename with a non-executable extension (e.g., .jpg, .pdf) and a corresponding Sysmon event shows execution of a file with the same base name but containing the RTLO character.",
              "For each user, profile the frequency of 'file-create-then-process-create' sequences originating from browser/email client processes over a 30-day baseline period. Calculate the mean and standard deviation of this activity per user per hour. Generate an alert when a user's activity in a given hour exceeds a dynamic threshold (e.g., mean + 3 standard deviations), indicating an abnormal burst of drive-by or phishing-related executions.",
              "Train an unsupervised clustering model (e.g., DBSCAN) on 'download-then-execute' events. Features for each event should include: time delta between download and execution, file extension, file MIME type, source URL/domain, parent process of download, and entropy of the filename. The model will group normal, frequent behaviors into large clusters. Any event that is classified as noise or belongs to a very small cluster should be considered anomalous and flagged for analyst review."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]