[
  {
    "information_requirement": "Is the adversary exfiltrating data using a protocol other than the primary C2 channel? (TA0010 - Exfiltration)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1048",
        "name": "Exfiltration Over Alternative Protocol",
        "evidence": [
          {
            "description": "An outbound network connection (TCP/UDP/ICMP) or DNS query from an internal asset to an external IP address, domain, or URL that is present on a threat intelligence feed and flagged with a category related to exfiltration, malware C2, or anonymous proxy.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Egress Firewall, Corporate DNS Resolvers",
            "action": [
              "Symbolic: Continuously join destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log against a CTI feed of known malicious infrastructure. Generate an alert for any match.",
              "Statistical: For hosts communicating with newly observed domains or IPs (not seen in the last 30 days), calculate the ratio of bytes sent vs. received (`orig_bytes` / `resp_bytes`). Flag sessions where this ratio is in the 99th percentile of all outbound traffic for that host, suggesting one-way data dumping.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from Zeek conn.log (duration, protocol, service, orig_bytes, resp_bytes) and CTI data (domain age, reputation score). Use the model to score new, uncategorized connections for their likelihood of being malicious exfiltration traffic."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) containing command-line arguments for data transfer utilities (e.g., curl, certutil, bitsadmin, Invoke-WebRequest) immediately followed by an outbound network connection from the same host to an external destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Domain Controllers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Symbolic: Create a detection rule that triggers on Windows Event ID 4688 where the ProcessName is 'certutil.exe' and the CommandLine contains '-encode' and '-urlcache', or where the ProcessName is 'powershell.exe' and the CommandLine includes 'Invoke-WebRequest' with a non-internal destination URI. Correlate this event with a subsequent outbound connection in Zeek conn.log from the source host within 60 seconds.",
              "Statistical: Calculate the Shannon entropy of command-line arguments for common data transfer utilities. A high entropy score for arguments passed to `curl` or `certutil` can indicate encoded or encrypted data being staged for exfiltration. Flag commands with entropy scores greater than 3 standard deviations above the mean for that specific process.",
              "Machine Learning: Use a sequence analysis model (e.g., an LSTM) to learn normal sequences of parent-child process relationships and their associated network activity. Anomaly detection will flag sequences such as `cmd.exe` -> `powershell.exe` (with `Invoke-WebRequest`) -> large outbound TCP connection, if this sequence is historically rare for the user or host."
            ]
          },
          {
            "description": "A statistically significant increase in the volume or size of DNS or ICMP traffic from a single host, characterized by high-entropy query names, an abnormally high ratio of TXT/NULL queries to A/AAAA queries, or ICMP packets with payload sizes exceeding 64 bytes.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek icmp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Servers, Internet Gateway, Network Egress Points",
            "action": [
              "Symbolic: Create a detection rule to alert when a single source IP sends more than 100 DNS TXT or NULL queries to a single domain within a 5-minute window, or when any ICMP Echo Request/Reply packet has a payload size greater than 1024 bytes.",
              "Statistical: For each host, establish a baseline of DNS query type distribution (e.g., 80% A, 15% AAAA, 5% other). Alert if the percentage of TXT or NULL queries exceeds the 99th percentile of the established baseline. Additionally, calculate the character frequency distribution of DNS query names and flag queries with a distribution that deviates significantly from the norm (e.g., using a Chi-squared test), suggesting non-standard encoding.",
              "Machine Learning: Train a clustering algorithm (e.g., DBSCAN) on features from Zeek dns.log, such as query length, query entropy, and query type. The model will group normal DNS traffic together, and outlier clusters will represent anomalous activity like DNS tunneling, which can then be investigated."
            ]
          },
          {
            "description": "The total volume of outbound data from a single host over a specific protocol (e.g., HTTPS, DNS, SMB) exceeds a dynamically established statistical baseline by a significant margin, or the ratio of data sent to data received for a single connection is anomalously high.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Core Network Switches, Servers Hosting Sensitive Data (e.g., file shares, databases)",
            "action": [
              "Symbolic: Create a rule that alerts if any single connection (conn.log entry) from an internal client host to an external server has `orig_bytes` greater than 500MB over a non-standard port (not 80, 443).",
              "Statistical: For each internal host, calculate a 30-day rolling average and standard deviation of total daily outbound bytes, segmented by protocol and service. Generate an alert if the daily total for any segment exceeds the average by more than 3 standard deviations. Also, calculate the sent/received byte ratio for all connections and flag those in the top 1% (99th percentile).",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA or Prophet) for each host's outbound data volume per protocol. The model will forecast the expected data volume for the next hour/day. An alert is generated if the actual observed volume significantly exceeds the forecasted volume's confidence interval."
            ]
          },
          {
            "description": "Network traffic on a standard port (e.g., 53, 80, 443) where the protocol identified by deep packet inspection does not match the expected protocol for that port, such as non-TLS traffic on port 443 or non-DNS traffic on port 53.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dpd.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Taps/Sensors in the DMZ, Internet Gateway, Perimeter Firewalls",
            "action": [
              "Symbolic: Alert on any entry in Zeek's `dpd.log` which indicates a protocol violation (e.g., 'SSL_Threat_Unexpected_Protocol'). Also, create a rule to find connections on TCP/443 that do not have a corresponding entry in `ssl.log`, indicating non-TLS traffic.",
              "Statistical: Profile the 'service' field in Zeek conn.log for each standard destination port. For port 443, the service should be 'ssl' >99.9% of the time. Create an alert if the frequency of a non-standard service (e.g., 'ssh') on a standard port exceeds a low-frequency threshold (e.g., > 0.1% of connections for that port over 24 hours).",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) classifier on feature sets derived from normal traffic for a given port (e.g., for port 443, features would include attributes from `conn.log` and `ssl.log`). Use the trained model to classify new connections as either 'normal' (inlier) or 'anomalous' (outlier), effectively identifying traffic that doesn't conform to the learned profile of legitimate TLS."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]