[
  {
    "information_requirement": "Is the adversary exfiltrating data from the network over unencrypted non-C2 protocols? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1048.003",
        "name": "Exfiltration Over Unencrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "An outbound connection over an unencrypted protocol (e.g., HTTP on port 80, FTP on port 21) is established to an external destination IP or domain present on a threat intelligence feed of known exfiltration points or C2 servers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points of the network (e.g., firewalls, web proxies), DNS resolvers, and Network Taps providing traffic to Zeek sensors.",
            "action": [
              "Symbolic: Correlate destination IP addresses from `Zeek conn.log` (on ports 21, 80) and `Host` headers from `Zeek http.log` against a threat intelligence feed of known malicious domains/IPs. Further, search `Zeek http.log` for anomalous User-Agent strings associated with exfiltration tools. Generate a high-priority alert on any match.",
              "Statistical: Analyze `Zeek dns.log` to identify domains with low prevalence (queried by < 1% of hosts) or newly registered domains (e.g., less than 30 days old using WHOIS data). Calculate a risk score by combining rarity, domain age, and TLD (e.g., .xyz, .top). Flag requests in the top 5th percentile of risk.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from `Zeek dns.log` and `Zeek http.log` including domain name length, subdomain entropy, TLD, query type, historical prevalence, and user-agent string rarity. Use a labeled dataset of known good and bad domains for training to predict if a destination is malicious."
            ]
          },
          {
            "description": "A process creation event is logged with command-line arguments containing syntax for command-line utilities (e.g., `certutil`, `bitsadmin`, `curl`, `powershell`) known to be used for uploading data over unencrypted protocols.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (e.g., domain controllers, database servers), user workstations, particularly those of privileged users, and servers in the DMZ.",
            "action": [
              "Symbolic: Using regular expressions, search process creation logs (`Windows Event ID 4688`, `Sysmon Event ID 1`) for command-line patterns indicating exfiltration, such as `bitsadmin /transfer`, `certutil -urlcache -f http://...`, `powershell ... (New-Object System.Net.WebClient).UploadFile`, and `curl -T file.dat ftp://...`. Alert on any matches.",
              "Statistical: For each process name, establish a baseline for command-line length and entropy. Flag instances where the command-line entropy for a given process (e.g., `powershell.exe`) exceeds 3 standard deviations above its historical mean, or the command-line length is in the top 99th percentile, which can indicate obfuscated scripts or embedded data.",
              "Machine Learning: Develop a sequence classification model (e.g., an LSTM) to detect anomalous parent-child process relationships. Train the model using features such as parent process name, child process name, and child process command-line arguments. An alert is generated when a typically non-networking process (like `7z.exe`) spawns a networking utility (like `curl.exe`) with command-line arguments containing an external IP or domain."
            ]
          },
          {
            "description": "An internal host's total outbound data volume over an unencrypted protocol (e.g., HTTP, FTP, SMTP) in a 24-hour period significantly exceeds its own established 30-day baseline or the baseline of its peer group (e.g., other workstations in the same department).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, internal network segments containing sensitive data repositories, and Data Loss Prevention (DLP) systems at the network edge.",
            "action": [
              "Symbolic: Create a rule that alerts on any single outbound connection over HTTP/FTP from a user workstation to a non-corporate IP address that exceeds a fixed size, for example, 100MB, excluding connections to known cloud backup or file-sharing services.",
              "Statistical: For each internal host, calculate a rolling 30-day baseline of outbound bytes (`orig_bytes` in `Zeek conn.log`) per protocol. Group hosts by role (e.g., 'developer', 'sales') for peer comparison. Flag any host whose daily total outbound traffic exceeds the 99th percentile of its own historical baseline, or whose connection byte ratio (`orig_bytes` vs `resp_bytes`) is a statistical outlier (>3 standard deviations) compared to its peer group.",
              "Machine Learning: Implement a time series anomaly detection model (e.g., Prophet or an LSTM-based autoencoder) for each host's outbound data volume on unencrypted protocols. The model will forecast the expected data volume for the next 24-hour period. Generate an alert if the actual observed volume significantly deviates from the forecasted confidence interval, indicating an unexpected spike in data transfer."
            ]
          },
          {
            "description": "Data within a file transferred over an unencrypted protocol exhibits a Shannon entropy value inconsistent with its file type (e.g., high entropy for a .txt file), or the file's MIME type and file extension are mismatched.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network tap points capable of deep packet inspection (DPI), web proxies, and email gateways.",
            "action": [
              "Symbolic: Analyze `Zeek files.log` for files transferred over HTTP. Alert if the `mime_type` is `application/octet-stream` but the file extension is `.txt`, `.html`, or `.csv`. Also, search HTTP POST bodies in `Zeek http.log` for magic bytes of common archive formats (e.g., `50 4B 03 04` for ZIP, `37 7A BC AF 27 1C` for 7z).",
              "Statistical: Utilize the `entropy` field in `Zeek files.log` for files transferred over unencrypted protocols. Establish a baseline entropy range for common file extensions (`.txt`, `.docx`, `.jpg`). Alert on any file where the entropy is anomalously high (e.g., > 7.5 for a file with a `.txt` extension), suggesting compression or encryption before exfiltration.",
              "Machine Learning: Train a classification model to distinguish between legitimate and suspicious HTTP POST requests. Augment features with analysis of the POST body content: size, entropy, ratio of non-alphanumeric characters, and the presence of Base64-like character distributions (e.g., using `[A-Za-z0-9+/=]`). The model classifies each POST request as benign or potential exfiltration."
            ]
          },
          {
            "description": "A sequence of events is observed on a single host within a short time window (e.g., 10 minutes) where file archival or compression is immediately followed by a network connection from an unexpected process to an external destination over an unencrypted protocol.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Detection and Response (EDR) agents on hosts, Security Information and Event Management (SIEM) correlation engine, and central log aggregators for host and network data.",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers when, on the same host within a 10-minute window: 1) A process creation event (`Windows Event ID 4688`) for an archiving tool (e.g., `7z.exe`, `rar.exe`, `tar.exe`) is observed, followed by 2) a network connection event (`Sysmon Event ID 3` or `Zeek conn.log`) from a non-browser process to an external IP on ports 21, 80, or 53.",
              "Statistical: Profile the frequency of three-event process chains on endpoints (e.g., Parent -> Child -> Grandchild Network Connection). Identify rare sequences, such as `cmd.exe` -> `7z.a.exe` -> `ftp.exe`. Assign a risk score based on the inverse frequency of the observed sequence. Alert when the risk score for a sequence exceeds a dynamically calculated threshold (e.g., 99.9th percentile of all sequence scores).",
              "Machine Learning: Use a graph-based anomaly detection algorithm. Model host activity as a graph where nodes are processes, files, and network destinations, and edges represent interactions (e.g., 'created', 'wrote to', 'connected to'). Train the model on benign activity graphs. Flag new subgraphs that exhibit a short path between a sensitive file node (e.g., `finance_report.xlsx`) and an external network destination node, especially if the path involves an archiving process node."
            ]
          },
          {
            "description": "An unusual pattern of DNS traffic is observed from an internal host, characterized by an abnormally high volume of queries, queries for TXT or NULL records, or subdomains with high entropy or excessive length, indicative of data being encoded into DNS requests.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal and external corporate DNS resolvers, network taps monitoring DNS traffic.",
            "action": [
              "Symbolic: Create a rule to search `Zeek dns.log` for DNS queries where the query length exceeds a threshold (e.g., 100 characters) or contains patterns matching Base64 or Hex encoding within the subdomain. Alert on matches, especially for TXT record queries.",
              "Statistical: For each source host, calculate a baseline for the number of DNS queries per hour and the distribution of query types (A, AAAA, TXT, etc.). Alert if a host exceeds its 99th percentile for query volume or if the ratio of TXT queries to A queries is a statistical outlier compared to peers. Additionally, calculate the Shannon entropy of the first subdomain label in the query and alert on values > 4.5.",
              "Machine Learning: Train a classifier (e.g., Logistic Regression) to identify DNS tunneling. Use features from `Zeek dns.log` such as query length, subdomain entropy, count of numerical characters in subdomain, query type, and historical query count for the parent domain. Use a pre-labeled dataset of known tunneling and legitimate traffic for training."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]