[
  {
    "information_requirement": "Is the adversary exfiltrating data over an established C2 channel? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1041",
        "name": "Exfiltration Over C2 Channel",
        "evidence": [
          {
            "description": "A network connection to a destination matching a known C2 indicator (IP, domain, URL) shows a high outbound-to-inbound data ratio (e.g., > 10:1) and a total outbound data volume significantly larger than typical beaconing traffic (e.g., > 1 MB).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, Web Proxies",
            "action": [
              "Search for connections in Zeek conn.log where the destination IP ('id.resp_h') matches a threat intelligence feed of known C2 servers. For any match, alert if the outbound bytes ('orig_bytes') are greater than 1MB and the ratio of 'orig_bytes' to 'resp_bytes' is greater than 10.",
              "For each C2 indicator observed in the last 30 days, establish a baseline of normal beaconing traffic by calculating the 95th percentile of 'orig_bytes'. Create an alert for any new connection to that indicator that exceeds this percentile by more than 50%, indicating a statistically significant increase in outbound data transfer.",
              "Train a supervised classification model (e.g., Logistic Regression) using labeled data to distinguish between 'C2 Beacon' and 'C2 Exfiltration' states. Use features like 'orig_bytes', 'resp_bytes', byte ratio, 'duration', and packet timing variations. Apply the model to new connections to known C2 indicators to predict and alert on likely exfiltration activity."
            ]
          },
          {
            "description": "An HTTP/S connection to an external host uses a User-Agent, URI path, or JA3/S hash matching known C2 framework signatures for data transfer, and the connection's outbound bytes are at least 10 times greater than its inbound bytes.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Application Servers, Web Proxies",
            "action": [
              "Correlate Zeek http.log, ssl.log, and conn.log data. Alert when a connection's 'http.log' User-Agent or URI, or its 'ssl.log' JA3/S hash, matches a known C2 signature list AND the corresponding 'conn.log' entry shows 'orig_bytes' > (10 * 'resp_bytes').",
              "For traffic matching a C2 signature, calculate the Shannon entropy of the HTTP URI path or the server name in the TLS extension. Flag connections where the entropy score is greater than 3.5 or exceeds the 98th percentile of entropy scores for all web traffic, suggesting encoded data within the request.",
              "Develop a Random Forest classifier to identify C2 exfiltration within TLS traffic. Use features from ssl.log (JA3/S hash, cipher suite, TLS version) and conn.log (duration, orig_bytes, resp_bytes, byte ratio). Flag sessions that the model classifies as 'C2-Exfil' with a confidence score above 0.90."
            ]
          },
          {
            "description": "The total outbound data volume from a single host to an external destination over a specific service (e.g., TCP/443, TCP/80, UDP/53) in a one-hour window exceeds the host's established 99th percentile for that service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Core Network Switches, Servers hosting sensitive data",
            "action": [
              "Create a rule to alert when a single connection from a host has an outbound data transfer ('orig_bytes') greater than a high static threshold (e.g., 500MB) over a common C2 port (e.g., 80, 443, 53), excluding known corporate backup or large file transfer services.",
              "For each internal host and destination service (port), create a 30-day rolling baseline of the total hourly outbound bytes ('orig_bytes'). Alert if any host's outbound traffic in a given hour exceeds the 99th percentile of its own historical baseline for that specific service, indicating an anomalous volume of data transfer.",
              "For each host, apply a time-series anomaly detection model (e.g., Seasonal-ARIMA) to the outbound byte counts aggregated in 15-minute intervals. The model should learn the host's normal traffic patterns. Alert when an observed data point falls outside the model's predicted confidence interval, signaling a statistically improbable spike in egress traffic."
            ]
          },
          {
            "description": "On a single host, a process creation event for an archiving or compression utility (e.g., 7z.exe, tar, zip) is followed within 15 minutes by a single large outbound network connection (>100MB) or a series of smaller connections totaling a large volume to a single destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, File Servers, Domain Controllers, Application Servers",
            "action": [
              "Correlate process creation events (Windows Event ID 4688) for processes like '7z.exe', 'rar.exe', 'zip.exe', 'tar', 'gzip' with subsequent network connection logs (Zeek conn.log) from the same host IP within a 15-minute window. Alert if a single connection's 'orig_bytes' exceeds 100MB.",
              "For hosts where staging activity (use of archiving tools) is detected via process logs, establish the host's baseline outbound connection size (mean and standard deviation). Flag any subsequent connection from that host within 30 minutes that is more than 3 standard deviations larger than its average, indicating a statistically anomalous data transfer following staging.",
              "Use a sequence mining algorithm to discover frequent patterns of 'staging and exfiltration' from event logs (e.g., process creation, file creation, network connection). Train a model (e.g., Hidden Markov Model) on these sequences to identify and alert on new activity that matches the high-risk sequence with a high probability."
            ]
          },
          {
            "description": "A network connection from an internal host to a single external IP address persists for an unusually long duration (e.g., > 10 minutes) and maintains a high, asymmetric outbound-to-inbound byte ratio (e.g., > 20:1), excluding known data replication or backup services.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, VPN Concentrators, Egress Firewalls",
            "action": [
              "Query Zeek conn.log for connections where 'duration' > 600 seconds and ('orig_bytes' / 'resp_bytes') > 20. Exclude connections where the destination IP or port is on an allowlist for backup or large file transfer services. Alert on all other matches.",
              "For all connections with a duration > 600 seconds, calculate the 99th percentile of the outbound-to-inbound byte ratio for each destination port. Alert on any long-lived connection where its byte ratio exceeds this dynamically calculated threshold for its port, indicating it is an outlier compared to other long-running services.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN) to all completed network connections using features from Zeek conn.log: 'duration', 'orig_bytes', 'resp_bytes', byte ratio, and 'proto'. Manually investigate clusters and noise points identified as anomalies, as these represent connections that do not fit any normal traffic profile."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]