[
  {
    "information_requirement": "Is the adversary exfiltrating data using a custom or non-standard symmetric encryption scheme over a common protocol?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1048.001",
        "name": "Exfiltration Over Symmetric Encrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "An outbound network connection is established to a destination IP address or domain present on a threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Firewalls, Internal DNS Servers",
            "action": [
              "Symbolic: Inner join destination IP addresses from Zeek conn.log and resolved domains from Zeek dns.log against a high-confidence, continuously updated cyber threat intelligence (CTI) feed of known malicious hosts, exfiltration points, or anonymization services. Generate a high-priority alert for any matches.",
              "Statistical: Profile destination domains and Autonomous System Numbers (ASNs) accessed by the organization. Alert on connections to destinations that are rare (e.g., seen by fewer than 5 hosts in the last 30 days) and exhibit a high sent-to-received byte ratio (e.g., > 10:1).",
              "Machine Learning: Use a graph-based algorithm to model internal-to-external connections. Identify anomalous edges representing connections to new or rare subnets/ASNs, especially when combined with high data volume, and classify them based on community detection of known malicious infrastructure."
            ]
          },
          {
            "description": "High-entropy data is observed in the payload of outbound network traffic over protocols not typically used for encrypted bulk data transfer, such as HTTP, DNS, or ICMP.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Firewalls, Internal DNS Servers, Network Taps",
            "action": [
              "Symbolic: Define a static rule to alert when the calculated Shannon entropy of a DNS TXT record query payload from Zeek dns.log exceeds a fixed threshold (e.g., 7.5 on a scale of 0-8) and the query length is over 200 bytes.",
              "Statistical: For each protocol (HTTP, DNS), establish a per-host baseline of payload entropy. Alert when the entropy for a given connection exceeds the 99th percentile of the host's historical 30-day baseline, especially if the session byte count (orig_bytes) also exceeds its historical 99th percentile.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features like payload entropy, protocol, port, request/response size ratio, and session duration. Use the model to score each outbound connection for its likelihood of being encrypted exfiltration."
            ]
          },
          {
            "description": "An internal host exhibits a statistically significant increase in outbound data volume or an anomalous sent-to-received data ratio when communicating with an external destination.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Firewalls, Critical Asset Subnets (e.g., Database Servers, File Servers)",
            "action": [
              "Symbolic: Create a static rule to alert if any single connection from a client workstation to an external IP sends more than a predefined absolute threshold of data (e.g., 500MB) in a single session, as recorded in the 'orig_bytes' field of Zeek conn.log.",
              "Statistical: For each source host, calculate a rolling 30-day baseline of total outbound bytes ('orig_bytes') per destination IP. Alert when the outbound bytes for a new 24-hour period to a specific destination exceeds 4 standard deviations above the mean of that baseline.",
              "Machine Learning: Apply a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the total outbound data volume per host, aggregated hourly. Alert on anomalies that represent significant, unexpected spikes in data transfer that cannot be explained by normal periodicity."
            ]
          },
          {
            "description": "An outbound network connection with a large data transfer is initiated by a process not typically associated with network communication, such as a system utility or an unsigned binary.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Domain Controllers, Critical Servers",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process name from a watchlist (e.g., 'powershell.exe', 'bitsadmin.exe', 'certutil.exe') is seen in a process creation event (Event ID 4688) and is immediately followed by a network connection event (Event ID 5156) to an external IP address.",
              "Statistical: Maintain a frequency table of all process paths that initiate outbound network connections (by correlating Event ID 4688 and 5156). Alert when a process that is statistically rare (e.g., in the bottom 5% of all network-communicating processes) initiates a connection with a high data volume (e.g., > 95th percentile of all outbound connections observed in Zeek conn.log).",
              "Machine Learning: Use an unsupervised learning model (e.g., Isolation Forest) on features from correlated process and network events (parent process path, process path, command line arguments, destination IP, destination port, bytes sent). The model will learn normal process and network behavior and flag anomalous combinations indicative of malicious activity."
            ]
          },
          {
            "description": "A standard, often unencrypted, protocol like DNS or HTTP is used in a manner inconsistent with its specification, such as long-running sessions with continuous data upload without corresponding user-driven requests.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Firewalls, Internal DNS Servers, Web Proxies",
            "action": [
              "Symbolic: Alert on any DNS query of type TXT or NULL where the query name itself is longer than 100 characters and contains subdomains that do not resolve, suggesting data chunking and encoding in the subdomain names.",
              "Statistical: For HTTP traffic, calculate the ratio of POST requests to GET requests for each source-destination pair over a 1-hour window. Establish a baseline for this ratio. Alert when the ratio for a given pair exceeds its historical 98th percentile, indicating an abnormal amount of data upload.",
              "Machine Learning: Train a sequence-based model (e.g., an LSTM) on the sequence of protocol-specific events within a session (e.g., DNS query types, HTTP methods). The model learns normal sequences of interaction and flags sessions with anomalous sequences, such as a long series of DNS TXT queries or HTTP POSTs without corresponding requests."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]