[
    {
        "information_requirement": "Has the adversary executed commands using cloud APIs?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1059.009",
                "name": "Cloud API",
                "evidence": [
                    {
                        "description": "Execution of cloud CLI tools with command-line arguments matching known malicious signatures or specific IOCs from threat intelligence.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events of cloud CLIs (`aws.exe`, `az.exe`, `gcloud.exe`). Extract the full command line for each execution and scan it for atomic indicators of malicious activity, such as hardcoded IP addresses of known C2 servers, specific resource names used by known threat actors, or exact command strings identified in CTI reports. Maintain and continuously update a list of these selectors and use regular expression matching to find them in real-time."
                    },
                    {
                        "description": "Execution of cloud CLI tools using command patterns indicative of reconnaissance, credential access, or defense evasion.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creations of cloud CLIs. Analyze command lines for suspicious patterns that, while not uniquely malicious, are common in attacks. Examples include enumerating users/permissions (`iam list-users`, `az ad user list`), creating new access keys (`iam create-access-key`), modifying security groups to be permissive (`ec2 authorize-security-group-ingress --cidr 0.0.0.0/0`), or disabling logging (`s3api put-bucket-logging --logging-status Status=Disabled`). Create and maintain a library of these high-risk command patterns (using keywords like 'list', 'get', 'create-user', 'delete-trail', 'put-policy') and alert when they are executed, especially by non-administrative users or from hosts not associated with cloud management."
                    },
                    {
                        "description": "Execution of cloud CLI tools by unauthorized users, from atypical parent processes, or from unexpected file paths.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for the execution of cloud CLIs (`aws.exe`, `az.exe`, `gcloud.exe`). Establish a baseline of authorized user accounts, expected parent processes (e.g., specific CI/CD tools, `explorer.exe`, approved scripts), and standard file system locations for these tools. Use frequency analysis and correlation to flag executions that deviate from this baseline, such as a CLI being run by a user outside the DevOps team, spawned by `services.exe` or an Office application, or executed from a temporary directory (`%TEMP%`, `%APPDATA%`)."
                    },
                    {
                        "description": "Anomalous volume or frequency of cloud CLI process executions or network connections to cloud API endpoints from a single host.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "From Windows Event ID 4688, baseline the frequency and distribution of cloud CLI executions per host. From Zeek conn.log, baseline the volume and frequency of connections to known cloud API endpoints (e.g., `*.amazonaws.com`, `management.azure.com`) per host. Use time series analysis (e.g., moving averages, exponential smoothing) and outlier detection methods like Inter-Quartile Range (IQR) on the count of executions or connections per hour to detect statistically significant spikes in activity. A sudden burst of CLI commands or API connections from a host that is normally quiet or has a low, steady rate of activity could indicate scripted malicious actions."
                    },
                    {
                        "description": "Chaining of cloud API commands with other suspicious host-level activities, such as downloading a script, executing it, then making API calls.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate multiple log sources to identify suspicious sequences of behavior on a host. Look for a sequence within a short time window (e.g., 5-10 minutes) such as: 1. A download event via a command-line utility (e.g., `curl.exe`, `wget.exe` seen in Windows Event ID 4688). 2. Execution of a scripting engine (`powershell.exe`, `python.exe`) on the downloaded file. 3. Subsequent execution of cloud CLI tools (`aws.exe`) or a burst of network connections to cloud API endpoints (Zeek conn.log). Use correlation analysis based on host and timestamp to link these disparate events into a single, high-fidelity alert representing a multi-stage execution chain."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
