[
  {
    "information_requirement": "Is the adversary attempting to exfiltrate data via removable media? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1052.001",
        "name": "Exfiltration over USB",
        "evidence": [
          {
            "description": "A process is created on an endpoint, and the executable file's hash matches a known malicious tool used for data staging or exfiltration, particularly when interacting with removable media.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers, particularly those with sensitive data access or used by privileged accounts.",
            "action": [
              "Symbolic: Query process creation events (Windows Event ID 4688) and join with a threat intelligence feed of file hashes for known exfiltration tools (e.g., specific versions of 7-Zip, rclone, custom malware). Alert on any hash match, especially if the process is launched from a removable drive path.",
              "Statistical: Analyze the command line arguments of processes launched from removable media. Calculate the entropy of process names and command lines. A high entropy score, exceeding the 95th percentile of historical data for that host or user, may indicate packed or obfuscated malware.",
              "Machine Learning: Use a supervised classification model (e.g., Random Forest) trained on features from process creation events (parent process, command-line arguments, user context, file path) to classify processes as benign or malicious exfiltration activity. Continuously retrain the model with analyst-labeled data."
            ]
          },
          {
            "description": "A native command-line utility (e.g., robocopy, xcopy, PowerShell's Copy-Item) is executed with command-line arguments indicating a recursive copy from a sensitive internal location to a drive letter associated with removable media.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints with access to network shares, document management systems, and code repositories.",
            "action": [
              "Symbolic: Create a SIEM rule that monitors process creation events (Windows Event ID 4688) for processes like `robocopy.exe`, `xcopy.exe`, and `powershell.exe`. Use regular expressions on the command line to detect patterns like `robocopy \\\\fileserver\\sensitive [E-Z]:\\ /E` or `Copy-Item -Path C:\\Users\\*\\Documents -Destination [E-Z]:\\ -Recurse`. Alert on matches.",
              "Statistical: For each user, baseline the frequency and complexity of their command-line utility usage. Calculate a risk score based on the number of sensitive keywords (e.g., 'Recurse', '/E', '/S') and the presence of a removable drive letter in the command line. Flag commands with a score exceeding two standard deviations above the user's typical activity.",
              "Machine Learning: Develop a sequence analysis model (e.g., an LSTM) to identify anomalous sequences of commands. A sequence such as `net use`, followed by `dir` on a sensitive share, followed by `robocopy` to a USB drive, would be flagged as a high-risk sequence indicative of exfiltration staging and execution."
            ]
          },
          {
            "description": "The total volume of data (in bytes) or the total count of files written to a removable storage device within a defined time window significantly exceeds the established historical baseline for a specific user or host.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstations of users in departments handling PII, PHI, or intellectual property (e.g., HR, Finance, R&D).",
            "action": [
              "Symbolic: Configure a SACL on critical directories and monitor for file write access events (Windows Event ID 4663) where the Object Name points to a removable drive. Create a simple threshold rule to alert if more than 1 GB of data is written to a USB device in under 10 minutes by a single user.",
              "Statistical: For each user, establish a rolling 30-day baseline of daily data volume written to USB devices. Use descriptive statistics to model this baseline (mean, median, 95th percentile). Generate an alert when a user's daily write volume exceeds the 99th percentile of their historical activity.",
              "Machine Learning: Apply time-series anomaly detection (e.g., using SARIMA) to the stream of file write events (count and volume) to removable media, aggregated per user per hour. The model will learn seasonality (e.g., end-of-week reports) and flag activity that deviates significantly from the predicted pattern, indicating an unusual bulk data transfer."
            ]
          },
          {
            "description": "A temporal sequence of events is observed on a host: 1) A USB mass storage device is connected, 2) A data compression or archival process is launched, targeting sensitive directories, and 3) A high volume of file write operations to the newly connected USB device occurs within a short time frame (e.g., 5 minutes).",
            "data_sources": [
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 400",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints, with a focus on air-gapped or high-security zone systems where USB is a primary vector for data movement.",
            "action": [
              "Symbolic: Create a correlation rule that triggers when: (A) A USB Mass Storage Device connection event (Kernel-PnP Event ID 400) is logged, followed within 5 minutes by (B) a process creation event (Event ID 4688) for `7z.exe`, `zip.exe`, `rar.exe`, or `robocopy.exe`, which is then followed by (C) a high count (>100) of file write events (Event ID 4663) to the corresponding removable drive letter.",
              "Statistical: Calculate the conditional probability of a user creating a large archive file within 10 minutes of plugging in a USB device based on historical data. If this probability for a given event is a statistical anomaly (e.g., a p-value < 0.01), flag it for review. This identifies users who do not normally perform this sequence of actions.",
              "Machine Learning: Use a graph-based analysis model where nodes are users, hosts, processes, and drives. An anomalous event sequence (USB connect -> archive process -> file writes to USB) would create a specific subgraph. Train a model to recognize the structure of malicious subgraphs versus benign ones."
            ]
          },
          {
            "description": "File write operations to a removable storage device are performed by a non-interactive account (e.g., service account) or by a user account outside of their established baseline of normal working hours.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4634"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All servers (especially Domain Controllers, database servers) and workstations of privileged users (e.g., Domain Admins, developers).",
            "action": [
              "Symbolic: Create a detection rule that alerts on any process creation (Event ID 4688) or file write (Event ID 4663) activity involving a removable drive path that is initiated by a user account designated as a service account (e.g., accounts ending in '$' or belonging to a specific AD group). Also, alert on any such activity occurring between 10 PM and 6 AM local time.",
              "Statistical: For each user, profile their typical working hours by analyzing login/logoff events (Event ID 4624/4634) over a 90-day period to create an activity time histogram. Any file write activity to a USB device that falls into a time bucket with historically zero or near-zero activity (e.g., below the 5th percentile of activity) should be flagged as anomalous.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) to group users based on their behavior related to removable media usage (time of day, data volume, frequency). Users who are clustered into a small, outlier group, or whose activity suddenly shifts from one cluster to another should be prioritized for investigation."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]