[
  {
    "information_requirement": "Has the adversary installed software to capture user credentials via keystrokes? (PIR)",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1056.001",
        "name": "Keylogging",
        "evidence": [
          {
            "description": "A process creates a file or modifies a registry key/value whose hash or path/value respectively matches a known keylogger artifact from threat intelligence.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Sysmon Event ID 12",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical Application Servers, Domain Controllers, Terminal Servers",
            "action": [
              "Create a detection rule that queries for file creation events (Sysmon Event ID 11) and registry modification events (Sysmon Event ID 13). Alert if a file hash or a registry object path (e.g., `HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Userinit`) matches an entry in an IOC feed of known keyloggers.",
              "For registry modifications to sensitive keys associated with keylogging (e.g., `AppInit_DLLs`), establish a 90-day baseline of modification frequency per host. Alert if the daily modification count for any host exceeds its historical mean by more than 3 standard deviations.",
              "Feed features from registry modification events (e.g., parent process image path, target registry path, new value data type, new value length) into a pre-trained Gradient Boosting Machine (GBM) classifier to score the likelihood of the modification being malicious. Alert on any modification with a score greater than 0.9, indicating high similarity to known malicious persistence techniques."
            ]
          },
          {
            "description": "An unsigned or atypically signed kernel driver is loaded, or a service is installed by a non-standard process to load a suspicious driver.",
            "data_sources": [
              "Sysmon Event ID 6",
              "Windows Event ID 7045",
              "Windows Event ID 4697",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Privileged Access Workstations, Domain Controllers",
            "action": [
              "Create a detection rule that alerts when a driver is loaded (Sysmon Event ID 6) where the 'Signed' field is 'false' and the driver's hash is not on a pre-approved allowlist of legitimate, unsigned drivers.",
              "For each host, establish a baseline of common signers for loaded drivers using the `Signature` field from Sysmon Event ID 6. Calculate the prevalence of each signer across the enterprise. Flag any driver loaded from a signer that falls in the bottom 5th percentile of prevalence, indicating a rare signer.",
              "Use a time-series anomaly detection model (e.g., LSTM) on the frequency of new service installations (Windows Event ID 7045) per hour across the environment. An alert is triggered if the model detects a statistically significant spike that does not correlate with known software deployment or patching cycles."
            ]
          },
          {
            "description": "A process executes from a user-writable path, has a calculated file entropy indicative of packing, and loads keyboard input-related libraries without having an associated graphical user interface.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 7",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Virtual Desktop Infrastructure (VDI) fleet, Point-of-Sale Terminals",
            "action": [
              "Alert when a process loads `user32.dll` (Sysmon Event ID 7) and the process image path (Sysmon Event ID 1) is not in `C:\\Windows\\System32` or `C:\\Program Files` and the parent process is not `explorer.exe` or `winlogon.exe`.",
              "For each new executable file created (Sysmon Event ID 11), calculate its Shannon entropy. Flag any executable with an entropy score $$ > 7.2 $$ that is not signed by a trusted publisher and is not on an application allowlist.",
              "Train a One-Class SVM model on features of legitimate processes that load `user32.dll` (e.g., parent process name, command line length, count of loaded DLLs). Use the trained model to identify outlier processes that also load `user32.dll` but do not fit the established profile of benign, interactive applications."
            ]
          },
          {
            "description": "A non-browser process deletes browser cookie files, followed by the creation of a log file with frequent, small write operations, indicating credential harvesting preparation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Sysmon Event ID 23"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Web Application Servers, Authentication Servers",
            "action": [
              "Alert when a process deletes files matching browser cookie paths (Sysmon Event ID 23, `TargetFilename` contains 'Cookies') and the process image name is not `chrome.exe`, `firefox.exe`, `msedge.exe`, or an approved system utility.",
              "For processes creating files (Sysmon Event ID 11), monitor the rate of file modification events. Flag files that receive more than 10 write operations per minute where the average write size is less than 1KB, which is anomalous for typical file save operations.",
              "Implement a sequence analysis model (e.g., a Hidden Markov Model) to detect a specific chain of events: 1) a non-browser process deletes browser cookies (Sysmon EID 23), followed within 5 minutes by 2) the same process creating a new file (Sysmon EID 11), and then 3) making an external network connection (Sysmon EID 3). The model flags this entire sequence as a high-confidence keylogging and exfiltration event."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary collecting and staging captured keystroke data for exfiltration? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1056.001",
        "name": "Keylogging",
        "evidence": [
          {
            "description": "A process creates a file, named pipe, or registry entry with a high-entropy or randomly generated name, inconsistent with legitimate software behavior, used for staging collected keystrokes.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Sysmon Event ID 13",
              "Sysmon Event ID 17",
              "Sysmon Event ID 18"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Enterprise Endpoints (Workstations and Servers), Domain Controllers",
            "action": [
              "Continuously query SIEM data for Sysmon events (EID 11, 13, 17) where the `TargetFilename`, `TargetObject`, or `PipeName` matches a blocklist of known keylogger staging artifacts.",
              "Calculate the character entropy for all newly created named pipe names (Sysmon EID 17). Flag any named pipe whose name has an entropy score $$ > 3.5 $$ and is created by a non-system process, suggesting an algorithmically generated name for covert inter-process communication.",
              "Deploy a pre-trained machine learning model that performs lexical analysis on file paths, registry paths, and named pipes to classify them as benign or malicious. This model can detect suspicious-looking names and paths used for staging, even without an exact IOC match."
            ]
          },
          {
            "description": "A process flagged for suspicious installation or execution behavior establishes an outbound network connection to a low-reputation or newly observed IP address or domain.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies), DNS Servers, All Endpoints",
            "action": [
              "Correlate process GUIDs from host-based alerts (e.g., suspicious registry write) with subsequent network connection events (Sysmon EID 3) from the same GUID. If the destination IP is on a C2 blocklist from threat intelligence, or the domain was first seen in `Zeek dns.log` within the last 24 hours, escalate the alert.",
              "From `Zeek ssl.log`, build a frequency table of all JA3 fingerprints observed across the enterprise over a 30-day period. Alert when a TLS connection is established using a JA3 hash that has been seen on fewer than 5 hosts enterprise-wide, indicating a rare client application.",
              "Feed TLS connection metadata (JA3 hash, JA3S hash, destination IP, Server Name Indication, destination port) into a pre-trained random forest classifier that determines the likelihood of the connection being malicious C2 traffic. This can identify keylogger exfiltration even when connecting to previously unknown infrastructure."
            ]
          },
          {
            "description": "A non-browser process initiates periodic, low-volume (e.g., less than 2KB) outbound network connections to a single external IP address, exhibiting a regular 'heartbeat' pattern consistent with batched keystroke exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Sysmon Event ID 3",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies), User Workstations, DNS Servers",
            "action": [
              "Alert if a process other than a web browser or approved update agent makes an outbound connection (Sysmon EID 3) to a destination IP categorized as 'Newly Observed Domain' by threat intelligence and the connection payload size is less than 2KB.",
              "For each source-destination IP pair in `Zeek conn.log`, calculate the time delta between consecutive connections over a 24-hour window. A standard deviation of these time deltas $$ < 5 $$ seconds indicates a highly regular, machine-generated heartbeat. Combine this with a filter where the 95th percentile of `orig_bytes` is $$ < 2048 $$ bytes to identify low-and-slow exfiltration.",
              "Apply a Fast Fourier Transform (FFT) to a time series of connection counts per minute for each source IP to any destination. A strong peak in the frequency domain indicates a periodic signal (beaconing). The model automatically flags source IPs with strong periodicity that does not match known legitimate applications like NTP or other system agents."
            ]
          },
          {
            "description": "A hidden or temporary file experiences a steady stream of small write operations, and its total size closely matches the volume of data sent in a subsequent outbound network connection from the same process.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 2",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Staging Servers, Network Egress Points",
            "action": [
              "Create a rule that triggers when a process (identified by `ProcessGuid`) generates file write events (Sysmon EID 11) to a single file, and then the same `ProcessGuid` generates a network connection event (Sysmon EID 3) where the `SentBytes` value is within 10% of the total file size. The rule should be scoped to files in temporary or user-writable directories.",
              "For a given process, correlate file modification times (Sysmon EID 2) with network connection times (Sysmon EID 3). Calculate the time difference between the last file write and the network connection. Flag any instance where this difference is less than 60 seconds and the total bytes sent (`orig_bytes` in `Zeek conn.log`) is within 100 bytes of the final file size.",
              "Implement a state machine model that tracks process behavior. The model transitions between states: `START` -> `SUSPICIOUS_FILE_WRITE` (triggered by frequent, small writes to a hidden file) -> `NETWORK_CONNECTION` (triggered by an external connection from the same process). A transition to the `NETWORK_CONNECTION` state immediately after `SUSPICIOUS_FILE_WRITE` triggers a high-severity alert for 'Staged Data Exfiltration'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]