[
  {
    "information_requirement": "Is the adversary escalating privileges using Process Doppelgänging?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1055.013",
        "name": "Process Doppelgänging",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) shows a parent process hash matching a known Process Doppelgänging tool, while the child process image path points to a legitimate system binary (e.g., svchost.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, Executive Workstations",
            "action": [
              "Symbolic: Create a hunting rule to join process creation events (Windows Event ID 4688) with a threat intelligence list of file hashes for known Process Doppelgänging tools. Alert when a known malicious hash is seen as the 'Creator Process Name' or 'Parent Process Name' and the child process is a legitimate system binary.",
              "Statistical: For each process creation event, calculate the entropy of the parent process's command line. Establish a baseline entropy score for common parent processes. Alert when a parent process exhibits command-line entropy that is more than 3 standard deviations above its established norm, suggesting obfuscated or unusual parameters often used by injector tools.",
              "Machine Learning: Deploy a supervised classification model (e.g., Random Forest) trained on features from Windows Event ID 4688, such as parent process name, child process name, command line arguments, and user context. The model should be trained to classify process creation events as benign or suspicious, with a focus on identifying patterns associated with known Process Doppelgänging malware samples."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) shows a user-level parent process (e.g., winword.exe, acrord32.exe) spawning a core system child process (e.g., svchost.exe, lsass.exe), where the child process's 'Token Elevation Type' is 'Type 2' (%%1937, an elevated token), which is anomalous for this parent-child relationship.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Symbolic: Create a detection rule that triggers when a process from a list of common user applications (e.g., winword.exe, excel.exe, powershell.exe, chrome.exe) is the parent of a process from a list of core system binaries (e.g., lsass.exe, services.exe, csrss.exe).",
              "Statistical: For all parent-child process pairs observed in Windows Event ID 4688 logs, calculate the frequency of each pair. Generate alerts for pairs that occur in the bottom 1st percentile of frequency across the enterprise over a 30-day rolling window, indicating a rare and suspicious event.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on process creation event features, including the parent-child process names and the user session ID. Identify clusters of activity that are small and isolated (outliers), as these may represent one-off malicious actions like process injection from an unusual parent."
            ]
          },
          {
            "description": "A process, identified as suspicious via an anomalous creation event (e.g., rare parent-child pair), subsequently requests access (Windows Event ID 4656) to critical processes like 'lsass.exe' with 'PROCESS_VM_READ' or 'PROCESS_ALL_ACCESS' rights, or attempts to read (Windows Event ID 4663) the SAM file.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Servers, Credential Stores",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a Process ID from a high-risk process creation alert (e.g., from anomalous parentage) is seen within 60 seconds in an object access event (Windows Event ID 4656/4663) targeting 'lsass.exe' or the SAM file.",
              "Statistical: For processes that access 'lsass.exe' or the SAM file, baseline the frequency of the source process names. Alert when a process name that is statistically rare (e.g., not in the top 95% of common accessors like svchost.exe or backup agents) performs this action.",
              "Machine Learning: Develop a time-series model to analyze the sequence of events following a process creation. Train a Hidden Markov Model (HMM) to recognize malicious sequences, such as 'Anomalous Process Creation -> Process Access to lsass.exe -> Outbound Network Connection', and flag low-probability sequences."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using Process Doppelgänging?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1055.013",
        "name": "Process Doppelgänging",
        "evidence": [
          {
            "description": "A legitimate-appearing process (e.g., svchost.exe, explorer.exe) initiates an outbound network connection (Zeek conn.log) to an IP or domain on a threat intelligence feed, or to a domain registered within the last 30 days (Zeek dns.log).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies), DNS Servers, Endpoint Devices",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) with process creation logs (Windows Event ID 4688) on source IP and timestamp. Alert if the destination IP or resolved domain matches a known C2 indicator from a threat intelligence feed and the source process is a common system binary.",
              "Statistical: Analyze DNS logs (Zeek dns.log) to identify requests for domains with high Shannon entropy or those registered within the last 30 days. Calculate a risk score for connections to these domains based on other factors like non-standard port usage (Zeek conn.log) and origination from a system process.",
              "Machine Learning: Use an anomaly detection model (e.g., an Autoencoder) on network connection metadata (bytes sent/received, duration, protocol, destination port) for specific whitelisted processes. The model learns the normal network profile for processes like 'svchost.exe' and flags connections that have a high reconstruction error, indicating they do not fit the learned benign profile."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) is observed where the on-disk binary is a legitimate, signed Microsoft executable (e.g., svchost.exe), but its parent process is an unlikely candidate (e.g., winword.exe, chrome.exe) or its command line is null when one is typically expected.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Terminal Servers",
            "action": [
              "Symbolic: Define a list of expected parent-child relationships for critical system processes (e.g., 'wininit.exe' -> 'services.exe' -> 'svchost.exe'). Create a rule to alert on any process creation event that violates this defined lineage.",
              "Statistical: For each system process, build a statistical model of its command-line arguments, including length and token frequency. Flag any instance where the command line is an outlier, such as a length of zero when the mean is greater than 10 or containing tokens that are in the bottom 1% of frequency.",
              "Machine Learning: Train a One-Class SVM model on benign process creation events for a specific system process (e.g., 'rundll32.exe'). Use the trained model to identify any new creation events for that process that deviate significantly from the learned 'normal' profile, indicating potential masquerading."
            ]
          },
          {
            "description": "A process identified by its name as a standard system utility (e.g., svchost.exe) exhibits network behavior inconsistent with its role, such as periodic, fixed-interval outbound connections (beaconing), connections to non-standard ports, or data transfer volumes characteristic of C2 channels.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS recursive resolvers, Endpoint Devices",
            "action": [
              "Symbolic: Leverage Zeek's 'notice.log' for events like 'C2::Beaconing' or 'SSL::Invalid_Server_Cert'. Correlate the source IP of these notices with process execution logs (Windows Event ID 4688) to identify if a legitimate-looking system process is the source of the suspicious traffic.",
              "Statistical: For each host, group network connections (Zeek conn.log) by destination IP and calculate the time delta between consecutive connections. Identify beaconing by finding connections where the standard deviation of the time delta is very low (indicating regular intervals). Further risk-score this activity if the source process is a common system binary.",
              "Machine Learning: Apply time-series forecasting (e.g., ARIMA) to the volume of outbound data per process. Generate an alert when the actual data volume significantly exceeds the forecasted volume with its confidence interval, suggesting unexpected data exfiltration or C2 communication from a process that was doppelgänged."
            ]
          },
          {
            "description": "A process associated with a legitimate system binary (e.g., runtimebroker.exe, services.exe) spawns a child process indicative of interactive or reconnaissance activity, such as cmd.exe, powershell.exe, whoami.exe, net.exe, or ipconfig.exe.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Internal Web Servers, Developer Workstations",
            "action": [
              "Symbolic: Create a high-severity alert rule for any event where the parent process name is on a list of core system processes (e.g., svchost.exe, lsass.exe, services.exe) and the child process name is on a list of interactive shells or reconnaissance tools (e.g., cmd.exe, powershell.exe, whoami.exe, net.exe).",
              "Statistical: Build a baseline of all child processes spawned by each system process across the enterprise. Alert when a system process spawns a child that has never been observed before or is in the lowest percentile of historical frequency for that parent.",
              "Machine Learning: Use a graph-based analysis approach where processes are nodes and parent-child relationships are edges. Apply community detection algorithms to find normal clusters of activity. A process like 'svchost.exe' spawning 'cmd.exe' would create an edge between two normally separate communities, flagging it as a 'bridge' anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]