[
  {
    "information_requirement": "Has the adversary achieved privilege escalation using process injection?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1055",
        "name": "Process Injection",
        "evidence": [
          {
            "description": "A high-privilege process (e.g., lsass.exe, services.exe) receives a remote thread or memory access from an untrusted source process, and shortly thereafter, the host initiates an outbound network connection to an IP address or domain on a threat intelligence feed.",
            "data_sources": [
              "Sysmon Event ID 8",
              "Sysmon Event ID 10",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, Privileged Access Workstations",
            "action": [
              "Correlate Sysmon Event ID 8 (CreateRemoteThread) or Event ID 10 (ProcessAccess) with Zeek conn.log and dns.log data on a per-host basis. Join the destination IP addresses and requested domains against a threat intelligence feed of known command-and-control (C2) servers. Generate a high-severity alert for any match that occurs within 5 minutes of the process access/injection event.",
              "For each process access (Event ID 10) or remote thread creation (Event ID 8) event targeting a high-privilege process, analyze the subsequent network connections from the host in Zeek conn.log. Calculate the historical rarity of the destination IP, ASN, and port for that host's process. Flag connections where the destination IP falls into the 99th percentile of rarity or the destination port is not in the top 95% of historically used ports for that host.",
              "Train a time-series anomaly detection model (e.g., LSTM) on baseline network traffic volume (bytes_out) and connection counts per minute for critical servers. Monitor for significant deviations from the predicted baseline that occur immediately following a cluster of Sysmon Event ID 8 or 10 alerts on that host. A spike in traffic volume post-injection event indicates potential data staging or exfiltration."
            ]
          },
          {
            "description": "A process originating from a non-standard path (e.g., %APPDATA%, %TEMP%) or a non-system binary (e.g., WINWORD.EXE) creates a remote thread in a critical system process (lsass.exe, services.exe, winlogon.exe).",
            "data_sources": [
              "Sysmon Event ID 8",
              "Sysmon Event ID 10",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Privileged User Endpoints, Tier 0/1 Servers",
            "action": [
              "Monitor for Sysmon Event ID 8 where the SourceImage path is not in 'C:\\Windows\\System32\\' and the TargetImage is one of 'lsass.exe', 'services.exe', 'winlogon.exe', or 'csrss.exe'. Exclude known-good source processes (e.g., specific security agent binaries) via an explicit allow-list. Alert on any non-allow-listed event.",
              "Build a baseline of all source->target process pairs for Sysmon Event ID 8 events across the enterprise. Calculate the frequency of each pair. Generate a risk score based on the inverse frequency (rarity) of the pair. Alert on pairs that exceed a 98th percentile rarity score, especially when the source process image path is in a user-writable directory.",
              "Use a classification model (e.g., Random Forest) trained on labeled Sysmon Event ID 8 data. Features should include source/target process names, image paths, user context, parent processes, and command-line arguments. The model should classify each remote thread creation event as 'benign' or 'malicious-injection'. Deploy the model to score new events in real-time."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using process injection?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1055",
        "name": "Process Injection",
        "evidence": [
          {
            "description": "A common, network-capable application (e.g., a web browser, svchost.exe) is used to initiate C2 communication following a remote thread creation event, masquerading malicious traffic as legitimate application traffic.",
            "data_sources": [
              "Sysmon Event ID 8",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Internet-facing Web Servers, DNS Resolvers",
            "action": [
              "Monitor for Sysmon Event ID 8 events where the TargetImage is a common browser (chrome.exe, firefox.exe, msedge.exe) or svchost.exe. Correlate by TargetProcessGUID with subsequent network connections (Zeek conn.log) and DNS queries (Zeek dns.log). Join the destination IPs/domains with a threat intelligence feed of C2 servers and newly registered domains (NRDs). Alert on any matches.",
              "For each common network application (e.g., browsers, svchost), build a baseline of destination country codes, ASNs, and JA3/JA3S hashes from Zeek logs. After a Sysmon Event ID 8 targets one of these applications, analyze its subsequent network traffic. Alert if the traffic goes to a statistically rare country/ASN (e.g., >99th percentile of rarity) or uses a JA3/JA3S hash never before seen from that application on that host.",
              "Train a classifier to distinguish between benign and malicious (e.g., C2) network traffic based on features from Zeek conn.log (duration, protocol, service, byte counts, connection state) and dns.log (query length, entropy, TLD). Apply this model to network flows originating from processes that were recently targeted by a remote thread (Sysmon Event ID 8). Flag connections classified as malicious with high confidence."
            ]
          },
          {
            "description": "A legitimate process, after being targeted for injection, exhibits behavior inconsistent with its normal function, such as spawning command-line interpreters or accessing unusual files.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 8",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, User Workstations, Application Servers",
            "action": [
              "Trigger an alert if a process (e.g., notepad.exe, explorer.exe) that was the target of a Sysmon Event ID 8 event subsequently spawns a command-line interpreter ('cmd.exe', 'powershell.exe') as a child process (Sysmon Event ID 1) or writes an executable file ('.exe', '.dll', '.ps1') to disk (Sysmon Event ID 11).",
              "For each common process name, build a baseline of normal child processes and file modification/creation paths. Following a Sysmon Event ID 8 event targeting a process, compare its subsequent child processes and file system activity against this baseline. Use a simple scoring system: +1 for a rare child process, +1 for writing to a rare directory path. Alert if the score exceeds a predefined threshold (e.g., > 1).",
              "Employ a sequence analysis model (e.g., Hidden Markov Model) where states are process behaviors (e.g., 'spawn_shell', 'write_file', 'net_connect') and transitions have probabilities learned from benign data. After an injection event (Sysmon Event ID 8), trace the sequence of subsequent actions by the target process. If the observed sequence has a very low probability under the benign model, flag it as anomalous."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]