[
  {
    "information_requirement": "Has the adversary executed commands using AutoHotKey or AutoIT scripts? (PIR)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1059.010",
        "name": "AutoHotKey & AutoIT",
        "evidence": [
          {
            "description": "An AutoHotkey/AutoIt interpreter or a compiled script is executed, and its file hash matches a known-malicious signature. Separately, the process initiates a network connection to a domain or IP address present on a threat intelligence feed of known command and control (C2) servers.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise workstations, Application Servers, Domain Controllers, Network Egress/Internet Gateway",
            "action": [
              "Symbolic (IOC Match): Correlate process execution events (Windows Event ID 4688, Sysmon Event ID 1) with network logs (Zeek conn.log, dns.log) on the same host within a 1-minute window. For any process named 'AutoHotkey.exe', 'AutoIt3.exe', or any executable with a hash from Zeek files.log, query its SHA256 hash, destination IPs, and resolved DNS queries against threat intelligence feeds. Generate a high-severity alert on any match.",
              "Statistical (Port/Protocol Rarity): For network connections (Zeek conn.log) originating from AutoHotkey/AutoIt processes, aggregate destination ports and protocols over a 30-day baseline. Calculate the frequency distribution for each port-protocol pair across the enterprise. Generate an alert if a connection uses a pair that falls into the bottom 5th percentile of usage, suggesting a non-standard C2 channel.",
              "Machine Learning (Classification): Train a supervised classification model (e.g., Gradient Boosting) using features from process (Sysmon Event ID 1) and network (Zeek conn.log) logs. Features to include: process name, parent process, command-line length and entropy, PE file characteristics from Zeek pe.log (entropy, sections, imports), destination IP reputation, destination port rarity, JA3/JA3S hash, and connection duration/byte counts. The model will classify each AutoHotkey/AutoIt-related execution event as benign or malicious, alerting on high-probability malicious events."
            ]
          },
          {
            "description": "An AutoHotkey or AutoIt interpreter ('AutoHotkey.exe', 'AutoIt3.exe') is executed from a non-standard file path (i.e., not 'C:\\Program Files\\...'). The script file path, parsed from the command line, also points to a user-writable or temporary location like '%APPDATA%', '%TEMP%', or 'C:\\Users\\Public\\'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise workstations, User profile directories on servers, Shared network drives",
            "action": [
              "Symbolic (Path Allow/Deny-list): Using process creation logs (Windows Event ID 4688, Sysmon Event ID 1), monitor for executions of 'AutoHotkey.exe' or 'AutoIt3.exe'. Alert if the process path is not in an approved directory (e.g., 'C:\\Program Files\\AutoHotkey'). Concurrently, parse the command-line arguments to identify the script file path and alert if it resides in a high-risk directory like '%TEMP%', '%APPDATA%', or 'C:\\Users\\Public\\'.",
              "Statistical (Path Rarity): Aggregate all interpreter and script file paths from AutoHotkey/AutoIt process creation events (Sysmon Event ID 1) over a 30-day baseline to establish path frequency statistics. For each new execution, calculate the rarity of its interpreter and script paths. Generate an alert if a path's frequency is below the 1st percentile, or if the path has never been seen before, flagging it as a statistical outlier.",
              "Machine Learning (Anomaly Detection): Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) on process execution data (Sysmon Event ID 1). Feature vectors should include categorical features for parent process name and user account, and features derived from the interpreter and script file paths (e.g., path depth, presence of keywords like 'Temp' or 'Public'). The model will assign an anomaly score to each execution; scores exceeding a predefined threshold will trigger an alert."
            ]
          },
          {
            "description": "An executed PE file lacks a valid digital signature and exhibits characteristics of a compiled AutoIt/AHK script. These characteristics include PE section names like '.AU3!.' or '.AHK!.', specific resource entries, and a file entropy value higher than that of typical signed executables, indicating packing.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek pe.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Internet Gateway (for PE file capture), Enterprise workstations, Download directories",
            "action": [
              "Symbolic (PE Section Match): Scan Zeek pe.log for transferred executables containing PE section names '.AU3!.' or '.AHK!'. For each match, extract the file's SHA256 hash. Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) to see if an executable with the matching hash was executed. Alert on any confirmed execution of a suspicious PE file identified at the network layer.",
              "Statistical (File Entropy): Using data from Zeek files.log or an equivalent endpoint file analysis tool, calculate the Shannon entropy for all newly observed executables. Establish a baseline entropy distribution for known-good, signed executables. Generate an alert for any executable that is both unsigned (from Sysmon Event ID 1 or PE analysis) and has an entropy value in the top 2nd percentile (e.g., > 7.2), indicating likely packing.",
              "Machine Learning (Classification): Develop a multi-class classifier (e.g., LightGBM) to categorize executable files based on PE features. Extract features from Zeek pe.log and files.log, including: entropy, presence/absence of a valid signature, number of sections, specific section names ('.AU3!', '.AHK!'), size of sections, imported functions, and linker timestamp. Train the model to classify files as 'Benign', 'Packed', or 'Compiled-Script'. Alert on 'Packed' or 'Compiled-Script' classifications, prioritizing those that are also observed being executed on an endpoint."
            ]
          },
          {
            "description": "An AutoHotkey/AutoIt interpreter or a suspected compiled script is the parent of a new process (e.g., 'cmd.exe', 'powershell.exe', 'certutil.exe'). The child process's command line contains either high-entropy strings, base64 encoded content, or keywords indicative of remote code execution or file download (e.g., 'IEX', 'DownloadString').",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise workstations, Application Servers, Domain Controllers",
            "action": [
              "Symbolic (Suspicious Child Process): From process creation logs (Sysmon Event ID 1), identify parent-child relationships. Generate an alert if a parent process is 'AutoHotkey.exe', 'AutoIt3.exe', or a known compiled script hash, and the child process is a LOLBAS (e.g., 'powershell.exe', 'cmd.exe', 'rundll32.exe'). Increase alert severity if the child's command line contains suspicious substrings like '-enc', 'IEX', 'DownloadString', '-decode', or 'http:'.",
              "Statistical (Command-Line Entropy): For every child process spawned by an AutoHotkey/AutoIt parent, calculate the Shannon entropy of its command-line arguments. Establish a baseline distribution of command-line entropy for all processes across the environment. Alert when a command line's entropy exceeds the 99th percentile of the baseline (e.g., a score > 4.5), suggesting obfuscated or encoded commands.",
              "Machine Learning (Sequence Analysis): Implement a sequence analysis model (e.g., an n-gram model) to learn common sequences of parent-child processes and their associated command-line patterns. Train the model on a baseline of benign activity. Score new process chains involving AutoHotkey/AutoIt based on their probability of occurring. Flag sequences with very low probability scores as anomalous, indicating a deviation from normal execution chains."
            ]
          },
          {
            "description": "An AutoHotkey/AutoIt process initiates a network connection that is anomalous based on destination, pattern, or data profile. This includes connecting to a low-reputation or statistically rare IP address/domain, or exhibiting periodic 'heartbeat' connections (beaconing) characterized by regular time intervals and consistent payload sizes.",
            "data_sources": [
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Internet Gateway, DNS Servers, Enterprise workstations",
            "action": [
              "Symbolic (Threat Intel Match): Using Sysmon Event ID 3 (Network Connection), which directly links a process to a network connection, filter for events where the Image is 'AutoHotkey.exe', 'AutoIt3.exe', or a suspected compiled script. Check the DestinationIp and DestinationHostname against threat intelligence feeds for known C2 servers. Generate a high-severity alert on any match.",
              "Statistical (Connection Rarity): For each host, create a baseline of outbound connections from Zeek conn.log, including destination IP/ASN/country and JA3S hash. For a new connection from an AutoHotkey/AutoIt process, calculate a rarity score based on a combination of these features (e.g., a destination ASN never seen from this host before). Alert if the combined rarity score exceeds the 99th percentile, indicating a statistically unlikely connection.",
              "Machine Learning (Beacon Detection): For each host-destination IP pair where the source process is linked to AutoHotkey/AutoIt, create a time series of connection events from Zeek conn.log. Analyze the time delta between connections and the consistency of bytes transferred (orig_bytes, resp_bytes). Use statistical methods like autocorrelation or Fourier transforms to identify repeating, non-random patterns. Flag any connection pair that exhibits a strong periodic signal with low jitter as potential C2 beaconing."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]