[
  {
    "information_requirement": "Is an adversary using process hollowing to execute malicious code under the guise of a legitimate process? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1055.012",
        "name": "Process Hollowing",
        "evidence": [
          {
            "description": "A legitimate Windows process (e.g., svchost.exe, explorer.exe, runtimebroker.exe) is created by a parent process that is not on a pre-defined whitelist of expected parents, such as an Office application (winword.exe), a script interpreter (powershell.exe), or a binary executing from a user-writable directory (e.g., C:\\Users\\*\\AppData\\Local\\Temp).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User Workstations, Member Servers",
            "action": [
              "From Windows Event ID 4688 logs, build and maintain a whitelist of known-good parent-child process relationships for critical system binaries (e.g., services.exe -> svchost.exe, wininit.exe -> lsass.exe). Trigger an alert for any observed parent-child creation event that is not on this explicit whitelist.",
              "Continuously analyze parent-child process pairs across the enterprise using frequency analysis. Calculate the probability of each pair occurring. Generate a low-priority alert or an event for investigation for pairs that fall below a rarity threshold (e.g., observed less than 5 times in the last 30 days enterprise-wide), as these represent statistical outliers.",
              "Use an unsupervised learning algorithm, such as a one-class SVM or isolation forest, trained on a baseline of normal parent-child relationships. The model will learn the normal distribution of process creations. Use the trained model to score new process creation events; events with a high anomaly score indicate a deviation from the established norm and potential hollowing activity."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) is followed by an abnormally long delay before the first associated event, such as a child process creation (Windows Event ID 4688) or an outbound network connection (Zeek conn.log), indicating it may have been created in a suspended state.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical Application Servers",
            "action": [
              "For specific high-value processes, define a hard-coded time threshold (e.g., 5 seconds) for 'time-to-first-action' (first child process or network connection). Correlate process creation time (Event ID 4688) with the timestamp of the first related event. Trigger an alert if this delta exceeds the defined threshold.",
              "For all processes, calculate a moving average and standard deviation of the 'time-to-first-action' delta, grouped by process name. Flag any instance where the delay for a newly created process exceeds 3 standard deviations above the historical average for that specific process, indicating a statistical anomaly.",
              "Use clustering algorithms (e.g., K-Means, DBSCAN) to group processes based on features like 'time-to-first-action', parent process, and command line length. Analyze clusters to identify those with long delays and other suspicious characteristics. New processes falling into these 'suspicious' clusters should be flagged for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to evade defenses using process hollowing? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1055.012",
        "name": "Process Hollowing",
        "evidence": [
          {
            "description": "A legitimate Windows process, such as notepad.exe or svchost.exe, establishes a network connection to an IP address or domain listed on a threat intelligence feed, where the connection originates shortly after the process was created by an anomalous parent (e.g., winword.exe).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, User Workstations",
            "action": [
              "From network logs (Zeek conn.log, dns.log), identify all connections originating from processes commonly used for hollowing. Join this data with process creation logs (Windows Event ID 4688) to identify the parent process. If the destination IP/domain is on a C2 threat feed AND the parent process is anomalous (e.g., not services.exe for svchost.exe), generate a high-severity alert.",
              "Profile the network destinations (IPs, domains, JA3/JA3S hashes) for all common system processes. Calculate the Shannon entropy of destination domains requested by a single process instance over a short time window (e.g., 5 minutes). A high entropy score, indicating connections to many different, unrelated domains, is anomalous and could signify C2 activity via domain fronting or a DGA.",
              "Train a graph-based anomaly detection model on process creation and network connection data. Represent processes, hosts, and destination IPs as nodes, and creation/connection events as edges. The model learns normal graph structures. Flag subgraphs that exhibit rare patterns, such as an Office application node creating a calculator.exe node which then connects to a low-reputation IP node."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) contains a creator process name or command-line arguments that match regular expression patterns derived from open-source reporting on known process hollowing malware (e.g., Formbook, Dridex) or tools.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Create and maintain a set of regular expression or YARA rules that match known command-line arguments, process names, or file paths associated with process hollowing tools and malware. Continuously scan the 'Creator Process Name' and 'CommandLine' fields in Windows Event ID 4688 logs against these rules. A match triggers an immediate alert.",
              "Tokenize all command-line arguments from Event ID 4688 logs. Use a TF-IDF (Term Frequency-Inverse Document Frequency) model to score the rarity of each token/argument. Flag and investigate processes that are created with statistically rare arguments, especially when combined with other suspicious indicators like an unusual parent process.",
              "Train a text classification model (e.g., using a Bag-of-Words or Word2Vec approach) on a large dataset of benign and malicious command lines. The model learns to classify a given command line as malicious or benign based on its content and structure. Deploy this model to score all new process creation events."
            ]
          },
          {
            "description": "A process that typically does not initiate network connections (e.g., calculator.exe) is observed making an outbound connection (Zeek conn.log), or a process with predictable network behavior (e.g., svchost.exe) connects to a destination port other than its established baseline (e.g., not 80, 443, 53).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, User Workstations, Application Servers",
            "action": [
              "Maintain a list of processes that should never make network connections (e.g., 'calculator.exe', 'notepad.exe'). Correlate process execution logs (Event ID 4688) with network logs (Zeek conn.log) and alert on any observed outbound connection from a process on this blacklist.",
              "For each process name, build a statistical baseline of its network behavior, including a set of normal destination ports, protocols, and connection frequency. Use a percentile-based threshold to alert on activity that is statistically rare, such as a connection over a port that accounts for less than 0.1% of historical connections for that process.",
              "Use an autoencoder to learn a compressed representation of normal network connection patterns (features: process name, destination port, protocol, data volume, time of day). The model will have a low reconstruction error for normal activity. Monitor the reconstruction error for new connections; a high error indicates an anomalous pattern that deviates from the learned norm and may signify a hollowed process."
            ]
          },
          {
            "description": "A parent process creation (Event ID 4688) is followed by a child process creation (Event ID 4688) and then the parent's termination (Event ID 4689) within an extremely short time window (e.g., under one second).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Define a state machine logic in the SIEM: State 1: Parent process creation (4688). State 2: Child process creation (4688) by parent PID. State 3: Parent process termination (4689). Trigger an alert if the transition from State 1 to State 3 occurs in less than a fixed threshold (e.g., 2 seconds).",
              "For every parent-child process creation event, calculate the lifespan of the parent process after the child is created. Group these lifespans by parent process name and calculate the distribution. Flag instances where the parent's lifespan falls into the bottom 1st percentile for its process type, indicating an abnormally fast termination.",
              "Use a sequence analysis model, such as a Recurrent Neural Network (RNN) or Hidden Markov Model (HMM), trained on sequences of endpoint events (process creation, termination, file access, network connections). The model learns normal sequences of events. Flag sequences matching the 'create-create-terminate' pattern with an anomalous time delta as high-risk."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]