[
  {
    "information_requirement": "Is the adversary using mail protocols for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1071.003",
        "name": "Mail Protocols",
        "evidence": [
          {
            "description": "A mail protocol connection (SMTP, POP3, IMAP) where the source or destination IP address or domain matches an entry on a threat intelligence feed of known malicious C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points",
            "action": [
              "Query Zeek conn.log for connections on mail ports (25, 110, 143, 465, 587, 993, 995) and Zeek smtp.log for HELO/MAIL FROM domains. Join the destination IP and domain against a CTI feed of known C2 indicators. Generate an alert on any match.",
              "For all mail server domains not present in CTI feeds, calculate the frequency of each effective-top-level-domain-plus-one (eTLD+1) over the last 30 days. Identify and flag for review any domains that fall within the lowest 5th percentile of frequency.",
              "Develop and apply a Random Forest classifier trained on features such as domain age (from WHOIS lookups), lexical analysis (entropy, vowel-to-consonant ratio), and DNS query patterns. Score all new mail server domains observed in Zeek logs and alert on domains classified as malicious with high confidence (>0.9)."
            ]
          },
          {
            "description": "An email message contains headers, a subject line, or body content that matches known patterns of C2 communication, such as unusual User-Agent strings or specific keyword formatting.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek pop3.log",
              "Zeek imap.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Mail Relays",
            "action": [
              "Execute a ruleset of regular expressions against Zeek smtp.log fields, including `subject`, `from`, `user_agent`, and `x_originating_ip`, to find signatures of known C2 tools (e.g., long non-dictionary words, Base64-encoded strings, GUIDs). Generate an alert upon a rule match.",
              "For each outbound email, calculate the ratio of non-alphanumeric characters to total characters in the subject line. Establish a 30-day baseline distribution for this ratio. Flag emails where this ratio exceeds the 99th percentile, indicating a potentially structured, non-prose subject line.",
              "Apply an unsupervised Latent Dirichlet Allocation (LDA) model to the corpus of all email subject lines over a 7-day window. Review the generated topics manually. Flag for investigation any topics that are semantically meaningless or consist of random character collections, as they may represent a C2 channel."
            ]
          },
          {
            "description": "Mail protocol connections from a single host to a single destination that occur at regular, periodic intervals with low jitter, or consistently outside of profiled user activity hours.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices and Internet Gateway/Egress Points",
            "action": [
              "For each source-destination IP pair on mail ports, check if the time delta between 10 or more consecutive connections remains constant within a small tolerance (e.g., 5 seconds). Flag any such series as potential C2 beaconing.",
              "For each unique source IP, group all outbound mail protocol connections by destination IP. Calculate the standard deviation of the inter-arrival time for each group over a 24-hour period. Flag groups with a standard deviation below a low threshold (e.g., < 5 seconds) and a connection count > 10 as highly periodic.",
              "For each host, create a time series of connection counts to external mail servers binned in 1-minute intervals. Apply a time-series decomposition model (e.g., STL) to isolate the periodic component. Alert on hosts exhibiting a strong periodic signal with a frequency not matching known business patterns."
            ]
          },
          {
            "description": "A mail protocol session with an anomalous data transfer volume or a client-to-server byte ratio that deviates significantly from an established baseline.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points",
            "action": [
              "Implement a static rule to alert on any single mail protocol connection from Zeek conn.log where the originator's bytes (`orig_bytes`) exceed a high, environment-specific threshold (e.g., 50MB), which could indicate bulk data exfiltration.",
              "For each source host, establish a 30-day baseline of the `orig_bytes` field and the ratio of `orig_bytes` to `resp_bytes` for mail protocol connections. Alert on any new connection where either value exceeds the 98th percentile for that specific host's baseline.",
              "Apply an Isolation Forest model to all mail protocol connections, using features from Zeek conn.log such as `duration`, `orig_bytes`, `resp_bytes`, and `orig_pkts`. The model will identify sessions that are statistical outliers compared to the learned baseline of normal traffic. Alert on connections flagged as highly anomalous."
            ]
          },
          {
            "description": "Mail protocol network traffic originates from a process not on an approved allowlist of mail clients (e.g., powershell.exe) or from a standard mail client spawned by an unusual parent process (e.g., OUTLOOK.EXE spawned by wmic.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices",
            "action": [
              "Correlate network connections on mail ports from Zeek conn.log with process creation events (Windows Event ID 4688 or Sysmon Event ID 1). Alert if the process name (e.g., `powershell.exe`) is not on a defined allowlist of approved mail clients (`outlook.exe`, `thunderbird.exe`).",
              "For each host, create a baseline of processes that initiate outbound mail connections and their frequency. Alert when a process initiates a mail connection that has never been seen before on that host or is in the bottom 1st percentile of historical frequency for that host.",
              "Train a Gradient Boosting classifier using features from Sysmon Event ID 1, such as parent process name, command-line arguments, and process integrity level. Apply the model to score all processes initiating mail protocol connections and alert on any process classified as suspicious with high confidence."
            ]
          },
          {
            "description": "Data within specific, human-readable email fields (e.g., subject, headers) exhibits a high Shannon entropy score, indicating the presence of non-textual, potentially encrypted or encoded, C2 data.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Mail Relays",
            "action": [
              "Create a rule that uses a regular expression to find subject lines in Zeek smtp.log that are longer than 50 characters, contain no spaces, and consist solely of characters from the Base64 character set ([A-Za-z0-9+/=]). Alert on any match.",
              "For every email, calculate the Shannon entropy of the `subject` and `helo` fields from Zeek smtp.log. Maintain a 30-day rolling average and standard deviation for the entropy of these fields. Flag any email where the entropy score for either field is more than 3 standard deviations above the mean.",
              "Develop a Logistic Regression classifier trained on a labeled dataset of normal and encoded text strings, using features including string length, Shannon entropy, and n-gram frequency. Apply the trained model to score the `subject` field of all emails and alert on any subjects classified as encoded with high probability."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]