[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by clearing persistence artifacts? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.009",
        "name": "Clear Persistence",
        "evidence": [
          {
            "description": "A deletion event (file, registry, user account) where the target object's name or path exactly matches an entry in a threat intelligence feed of known malicious persistence artifacts.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Windows Event ID 4726"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, User Workstations",
            "action": [
              "Symbolic: Continuously compare arguments of deletion events (file paths from Windows Event ID 4663, registry keys from 4657, and account names from 4726) against a CTI feed of known malicious persistence artifacts. Alert on any exact match for the deletion of a known-bad indicator.",
              "Statistical: For each user, establish a baseline of normal deletion activity for persistence-related objects (e.g., registry run keys, scheduled tasks). Calculate the moving average and standard deviation of such deletions. Alert when a user's deletion activity for these specific locations exceeds 3 standard deviations from their personal or peer group baseline in a 24-hour period.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from deletion events, including user context, parent process, object path, and time of day. Label data using historical incidents and known-good administrative activity. Use the model to score new deletion events in real-time, alerting on those classified as 'malicious' with high confidence."
            ]
          },
          {
            "description": "Execution of schtasks.exe, sc.exe, or reg.exe with command-line arguments that explicitly delete a scheduled task, service, or common registry-based persistence mechanism.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Tier 0/1 Servers, Endpoint devices of privileged users",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for command-lines containing `schtasks.exe /delete`, `sc.exe delete`, or `reg.exe delete` targeting common persistence hives (e.g., `HKLM\\...\\Run`, `HKCU\\...\\Run`). Alert if the parent process is not a standard administrative tool (e.g., `explorer.exe`, `mmc.exe`) or if the command is executed under a non-administrative user context.",
              "Statistical: For each host, profile the frequency and command-line argument structure of `schtasks.exe`, `sc.exe`, and `reg.exe` executions. Calculate the entropy of command-line arguments. An unusually high entropy score or a statistically rare combination of arguments (e.g., using a percentile rank below 5%) for a deletion command should trigger an alert.",
              "Machine Learning: Use a sequence analysis model (e.g., an LSTM) to analyze the sequence of command-line executions per user session. Train the model on benign administrative sessions versus known attack chains. An alert is generated when a sequence of commands, including a persistence deletion command, matches a pattern deemed highly anomalous or similar to a known malicious TTP."
            ]
          },
          {
            "description": "A single process ID or user session initiates deletion events across at least two distinct persistence categories (e.g., Scheduled Tasks, Services, Registry Run Keys, User Accounts) within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4701",
              "Windows Event ID 4657",
              "Windows Event ID 4726",
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, Active Directory Domain Controllers",
            "action": [
              "Symbolic: Create a rule that triggers when a single Logon ID (from Windows Security Events) is associated with deletion events from two or more of the following categories within 5 minutes: Scheduled Task Deletion (Event ID 4701), Service Deletion (Event ID 4697), Registry Run Key Deletion (Event ID 4657), and User Account Deletion (Event ID 4726).",
              "Statistical: Aggregate deletion-related events (file deletion 4663, task deletion 4701, registry key/value deletion 4657, user deletion 4726) by originating process ID and user session. For each 5-minute window, calculate the count of unique persistence mechanism types targeted. Establish a baseline for this metric across the enterprise. Alert when a process or session's count of targeted mechanism types exceeds the 99th percentile of the baseline.",
              "Machine Learning: Employ a clustering algorithm (e.g., DBSCAN) on event features such as time, host, user, and persistence mechanism type. The goal is to identify dense clusters of cleanup activity that are temporally and logically related. Clusters containing a high diversity of persistence mechanism types but originating from a single user/process are flagged as highly suspicious cleanup operations."
            ]
          },
          {
            "description": "A persistence artifact (user account, scheduled task, service) is deleted or disabled within 72 hours of its creation, where the artifact was associated with anomalous network connections or process executions during its lifespan.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4726",
              "Windows Event ID 4698",
              "Windows Event ID 4701",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (Domain Controllers), Internet Gateway, DNS Servers, Endpoint devices",
            "action": [
              "Symbolic: Upon creation of a persistence artifact (user account 4720, task 4698), tag the entity. If, during its lifetime, the entity is associated with an IOC match (e.g., process execution of a known-bad hash, network connection to a C2 IP/domain from Zeek conn.log/dns.log), place it on a watchlist. If the watched entity is then deleted (account 4726, task 4701) or disabled, generate a high-severity alert.",
              "Statistical: For newly created persistence artifacts, track the time-to-deletion (TTD). Calculate the distribution of TTD for all artifacts. An alert is generated for any artifact whose TTD falls below the 5th percentile (e.g., deleted within hours or a few days), especially if the associated user or process also exhibits other statistically anomalous behaviors.",
              "Machine Learning: Use a time-series anomaly detection model on the lifecycle events of persistence mechanisms. The model would learn normal patterns of creation, usage, and eventual deletion. A sequence of 'create -> anomalous activity -> quick delete' would be flagged as a significant temporal anomaly, indicative of an adversary cleaning up a temporary persistence foothold."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]