[
  {
    "information_requirement": "Is the adversary attempting to evade detection by clearing network history or configurations?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.007",
        "name": "Clear Network Connection History and Configurations",
        "evidence": [
          {
            "description": "Execution of a known malicious history-clearing utility, identified by its file hash (e.g., SDelete, BleachBit) or a high-entropy process name.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Application servers, and Jump Boxes where remote access is common.",
            "action": [
              "Symbolic: Create a detection rule that monitors process creation events (Windows Event ID 4688) and compares the process image hash against a curated list of known history-clearing tool hashes (e.g., SDelete, CCleaner, BleachBit) from threat intelligence feeds. Alert on any match.",
              "Statistical: For all newly observed process names from process creation events (Windows Event ID 4688), calculate the Shannon entropy of the filename. Establish a baseline for typical process name entropy across the environment. Flag any process names in the top 99th percentile of entropy scores, as adversaries may use randomized names for their tools. Correlate high-entropy names with process execution from non-standard directories (e.g., %TEMP%, %APPDATA%).",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from process creation events (Windows Event ID 4688), such as parent process, command-line length, presence of specific keywords, and process name entropy. Use a labeled dataset of known benign and malicious (history-clearing) process executions to classify new events in real-time as suspicious or benign."
            ]
          },
          {
            "description": "Execution of built-in command-line utilities (e.g., `wevtutil.exe`, `reg.exe`, `powershell.exe`) with arguments specifically constructed to delete RDP connection history from the registry, clear event logs, or remove `.rdp` files.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, and administrative workstations.",
            "action": [
              "Symbolic: Create a detection rule using regular expressions to monitor command-line arguments in process creation events (Windows Event ID 4688). The regex should target specific patterns such as `wevtutil cl`, `Clear-EventLog`, `reg delete .*Terminal Server Client`, and `del /f /q .*.rdp`. Alert on matches, especially when executed by non-administrative users or SYSTEM.",
              "Statistical: For each host, calculate a baseline of the frequency and diversity of command-line arguments used with `reg.exe`, `wevtutil.exe`, and `powershell.exe`. Use a z-score to detect hosts exhibiting an anomalous spike in the usage of deletion-related commands (`delete`, `cl`, `Remove-Item`) targeting sensitive paths. A count exceeding 3 standard deviations from the host's or peer group's baseline is suspicious.",
              "Machine Learning: Use a Natural Language Processing (NLP) model to analyze and classify command-line strings from process creation events (Windows Event ID 4688). Fine-tune the model to recognize the semantic intent of 'clearing history' versus normal administrative use of the same commands. This model can score the maliciousness of a command line based on the combination of the executable, arguments, and targeted paths, providing a more nuanced detection than simple keyword matching."
            ]
          },
          {
            "description": "A statistically significant spike in deletion events for registry keys under `HKCU\\Software\\Microsoft\\Terminal Server Client` or file objects like `Default.rdp` and `Cache\\*.bin`.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Windows Event ID 4660"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Registry and file system on endpoints and servers, particularly those accessed via RDP.",
            "action": [
              "Symbolic: Create a detection rule that triggers an alert upon the deletion (Windows Event ID 4660) of the specific registry key `HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Servers` or the deletion (Windows Event ID 4663) of the file `C:\\Users\\*\\Documents\\Default.rdp`. This provides a high-fidelity signal.",
              "Statistical: Enable object access auditing for the `...\\Terminal Server Client` registry key and `*.rdp` files. For each host, establish a time-series baseline of modification/deletion events (Event IDs 4657, 4663). Use a moving average to model normal behavior. Alert when the observed count of these events in a short time window (e.g., 10 minutes) exceeds a dynamic threshold, such as the 95th percentile of the historical distribution.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., LSTM Autoencoder) trained on the frequency of object access events (Event IDs 4657, 4663) for sensitive RDP artifacts across all hosts. The model learns the normal rhythm of these activities and flags any host whose event pattern significantly deviates from the learned normal behavior."
            ]
          },
          {
            "description": "A sequence of events where a remote logon (RDP) is immediately followed by the deletion of RDP history artifacts on the same host within a short time window (e.g., under 15 minutes).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek rdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs and file/registry audit logs on RDP-enabled systems; Network traffic logs at ingress/egress points.",
            "action": [
              "Symbolic: Create a SIEM correlation rule that looks for a successful RDP logon (Windows Event ID 4624, Logon Type 10) followed by a process execution (Event ID 4688) with command-line arguments matching history-clearing patterns or a file/registry deletion event (Event ID 4663/4660 on RDP artifacts) on the same host and for the same user within 15 minutes. Enrich with source IP from Zeek rdp.log.",
              "Statistical: For each user, calculate the conditional probability of history-clearing actions occurring post-RDP logon: P(Clear | RDP_Login). Establish a baseline of this probability for all users. If a user who has a historically low probability suddenly exhibits this behavior, flag it as a statistical anomaly.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) to learn common sequences of user actions post-login from event logs (4624, 4688, 4663). The model would learn normal 'login -> work -> logout' patterns. The sequence 'RDP Login -> Registry Delete -> File Delete -> Logout' would be identified as a rare and anomalous sequence, triggering an alert."
            ]
          },
          {
            "description": "Modification of host-based firewall rules or network configuration (e.g., using `netsh`) not associated with a change management ticket or known administrative process, especially if it occurs outside of business hours.",
            "data_sources": [
              "Windows Event ID 4719",
              "Windows Event ID 5025",
              "Windows Event ID 5031",
              "Windows Event ID 4688",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Host-based firewalls on workstations and servers; Network infrastructure devices; Change management log databases.",
            "action": [
              "Symbolic: Create a rule that monitors for process creation events (Windows Event ID 4688) where `netsh.exe` is used with arguments like `advfirewall firewall delete rule`, or for Windows Event ID 5025 (Windows Firewall Service has been stopped). Correlate these events with a list of authorized administrator accounts and maintenance windows. Any such event outside these parameters should generate a high-priority alert.",
              "Statistical: Profile the rate of firewall modification events (Event IDs 4719, 5025, 5031) per host and per user. Establish a baseline for the number of changes per day/week. Use a z-score to identify hosts or users with a statistically significant increase in firewall modification activity compared to their own history and their peer group. A z-score greater than 3 indicates anomalous behavior.",
              "Machine Learning: Train a supervised classification model to distinguish between legitimate and malicious firewall changes. Features could include user account, time of day, day of week, parent process, correlation with a change management ticket (via API), and the specific rule being modified. The model can then classify new firewall change events in real-time, flagging those with a high probability of being malicious."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]