[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by clearing logs? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.001",
        "name": "Clear Windows Event Logs",
        "evidence": [
          {
            "description": "A process is executed whose file hash (e.g., SHA256) matches a known malicious tool with log clearing capabilities, or a process is executed from a file path associated with suspicious tools (e.g., C:\\temp\\mimikatz.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, User Workstations",
            "action": [
              "Symbolic: Continuously monitor process creation events (Windows Event ID 4688). Extract the file hash (e.g., SHA256) of every new executable. Correlate these hashes against a high-confidence threat intelligence feed of known malicious tool hashes (e.g., Mimikatz, custom log wipers) that include log clearing capabilities. Generate a high-priority alert on any match.",
              "Statistical: Analyze process creation events (Windows Event ID 4688) to establish a baseline of common process names and their parent processes for each host. Calculate the rarity of a process name using frequency analysis (e.g., if a process name appears on <1% of assets, flag it). A rare process executing from a non-standard directory (e.g., C:\\Users\\Public\\, C:\\temp\\) should have its risk score elevated.",
              "Machine Learning: Use a supervised machine learning model (e.g., a Random Forest classifier) trained on labeled process execution data (Windows Event ID 4688). Features for the model should include process name entropy, command-line argument length and entropy, parent process legitimacy, and file path rarity. The model will classify each new process execution as benign or malicious, flagging suspicious tool executions."
            ]
          },
          {
            "description": "The explicit generation of Windows Security Event ID 1102 ('The audit log was cleared'), or the command-line execution of `wevtutil.exe` with 'cl' or 'clear-log' arguments, or the PowerShell cmdlet `Clear-EventLog`.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Windows Servers with security logging enabled, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Create a high-priority, zero-tolerance alert for any occurrence of Windows Security Event ID 1102. Additionally, create a detection rule that searches process command-line logs (from Windows Event ID 4688) and PowerShell script block logs (Event ID 4104) for the exact strings 'wevtutil.exe cl', 'wevtutil.exe clear-log', or 'Clear-EventLog'.",
              "Statistical: Establish a baseline for accounts that normally perform administrative actions involving `wevtutil.exe` or `powershell.exe`. Calculate the frequency of these commands per user. An alert should be triggered if an account that has never (or rarely, e.g., bottom 5th percentile) executed these commands does so. Additionally, analyze the time-of-day for these commands; an execution at an anomalous time is a high-confidence indicator.",
              "Machine Learning: Develop a time-series anomaly detection model for the occurrence of Event ID 1102. While any single occurrence is suspicious, the model can detect patterns, such as log clearing happening at regular intervals. For command-line analysis, use a classification model to score the maliciousness of a full command line, using features like the presence of suspicious keywords ('cl', 'Clear-EventLog') and obfuscation patterns."
            ]
          },
          {
            "description": "A file deletion event ('DELETE' access) is logged for a file with a '.evtx' extension located in the `C:\\Windows\\System32\\winevt\\Logs\\` directory, as captured by file system auditing.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of critical Windows hosts (Domain Controllers, member servers)",
            "action": [
              "Symbolic: Enable System Access Control Lists (SACLs) on the `C:\\Windows\\System32\\winevt\\Logs\\` directory to audit for deletion attempts. Create a high-severity alert rule that triggers on Windows Event ID 4663 where the Object Name ends in '.evtx' and the Accesses field contains 'DELETE'. This activity is almost always malicious and requires immediate investigation.",
              "Statistical: Profile the frequency of Event ID 4663 events per host and process name. A sudden spike in these events targeting the `winevt\\Logs` directory is anomalous. Calculate a moving average of these events over a 24-hour window; an alert should be triggered if the current count exceeds a percentile-based threshold (e.g., 99th percentile) of the historical distribution.",
              "Machine Learning: Use an unsupervised anomaly detection algorithm (e.g., Isolation Forest) on file system activity events (like Event ID 4663). The model should be trained on features such as target file path, file extension, access type, and the process performing the action. The model can identify that a 'DELETE' operation on an '.evtx' file by a non-system process is a rare and anomalous combination of features."
            ]
          },
          {
            "description": "A monitored host's log forwarding volume to a central collector drops significantly or ceases entirely for a sustained period, not correlated with a planned maintenance window, or a 'Service Stop' event for the 'Windows Event Log' service is recorded.",
            "data_sources": [
              "Windows Event ID 7036",
              "SIEM internal logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM/Log Aggregator, Network Egress/Ingress Points, Domain Controllers",
            "action": [
              "Symbolic: Create an alert that triggers on Windows Event ID 7036 where the service name is 'Windows Event Log' and the state is 'stopped'. Additionally, configure the SIEM to generate a 'heartbeat failure' alert if no logs are received from a critical asset for a predefined period (e.g., 15 minutes) while network traffic is still observed from the host's IP in Zeek conn.log.",
              "Statistical: For each log-forwarding host, ingest SIEM metadata on log volume per minute. Calculate a baseline log rate (events/minute) and its standard deviation over a 30-day rolling window. Generate an alert if the log rate for a host drops more than 3 standard deviations below its mean for a sustained period (e.g., >5 minutes) and is not correlated with a known shutdown.",
              "Machine Learning: Implement a time-series forecasting model (e.g., Prophet) for each host's log volume. The model will predict the expected log volume for the next 15 minutes. If the actual observed log volume falls significantly outside the model's prediction interval (e.g., below the lower 99% confidence bound), trigger an anomaly alert. This method is more robust to natural fluctuations in log volume."
            ]
          },
          {
            "description": "A primary log clearing indicator (e.g., Event ID 1102) is observed on a host within a short time window (e.g., 30 minutes) of other high-risk events like privilege escalation (Event ID 4672), new user account creation (Event ID 4720), or remote service installation (Event ID 7045).",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4688",
              "Windows Event ID 4672",
              "Windows Event ID 4720",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SIEM/Log Aggregator, Critical Servers",
            "action": [
              "Symbolic: Define a correlation rule in the SIEM that triggers a high-severity incident when a log clearing event (Event ID 1102 or `wevtutil` in command line of 4688) occurs on the same host within 30 minutes of another MITRE ATT&CK-related event, such as new user creation (4720), user added to privileged group (4728, 4732), special privileges assigned (4672), or new service installed (7045).",
              "Statistical: Develop a risk scoring system for hosts. Assign points for suspicious events (e.g., 10 points for a new user, 20 for privilege escalation, 50 for log clearing). Use a sliding time window (e.g., 60 minutes) to sum the risk score for each host. If a host's cumulative score exceeds a statistically determined threshold (e.g., the 99.5th percentile of all host scores), escalate for immediate investigation.",
              "Machine Learning: Use a graph-based analysis approach. Model security events as nodes in a graph, with edges representing relationships (e.g., same host, same user, occurred within 5 minutes). Use a graph neural network (GNN) or community detection algorithms to identify clusters of highly connected, suspicious activity. A cluster containing a log-clearing event node along with nodes for credential dumping and lateral movement would represent a high-confidence attack sequence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]