[
  {
    "information_requirement": "Is the adversary relocating malware to evade defenses? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.010",
        "name": "Relocate Malware",
        "evidence": [
          {
            "description": "A file with a hash matching a known malicious indicator is created or executed from a new or uncommon disk location, suggesting a relocation event.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Detection and Response (EDR) logs and Windows Security Event Logs forwarded from all managed endpoints and servers.",
            "action": [
              "Symbolic: Query SIEM for file creation (Windows Event ID 4663) or process creation (Windows Event ID 4688) events where the file hash matches a list of known malicious hashes from threat intelligence feeds. Alert on any match.",
              "Statistical: For each process execution event (Windows Event ID 4688), calculate the enterprise-wide prevalence of the associated file hash over the last 30 days. Flag processes whose hash is present on fewer than 1% of endpoints for review, as this low prevalence is characteristic of non-standard or malicious software.",
              "Machine Learning: Deploy a pre-trained file classification model that scores executables based on features like hash, path, signer, and entropy. Correlate high-probability alerts (e.g., score > 0.9) with file creation events (Windows Event ID 4663) in multiple locations within a short time window to specifically identify relocation of a newly classified malicious file."
            ]
          },
          {
            "description": "An executable file is created or a process is initiated where the filename exhibits high Shannon entropy, matches known malicious naming conventions (e.g., typosquatting), or uses a double extension.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Common staging directories (%APPDATA%, %TEMP%, %PUBLIC%, Downloads), and user profile directories on all endpoints.",
            "action": [
              "Symbolic: Using SIEM queries on process creation events (Windows Event ID 4688), apply a set of regular expressions to the ProcessName or NewProcessName field to detect patterns like double extensions (e.g., \\.docx\\.exe$), typosquatting of system executables (e.g., scvhost\\.exe), or names used by known tools (e.g., mimikatz\\.exe).",
              "Statistical: For each process creation event (Windows Event ID 4688), calculate the Shannon entropy of the filename component of the process path. Compare this value to a pre-computed baseline distribution of entropy scores for all known-good executables in the environment. Flag any filename with an entropy score in the 95th percentile or higher for investigation.",
              "Machine Learning: Develop and deploy a filename classification model (e.g., Random Forest) trained on a labeled dataset of benign and malicious filenames. Extract features such as filename length, n-gram frequency, character-type ratios (letters, numbers, symbols), and Shannon entropy. Apply the model to all new process creation events (Windows Event ID 4688) and alert on any filename classified as 'malicious' with high confidence."
            ]
          },
          {
            "description": "A process executes using a legitimate system file name (e.g., svchost.exe, lsass.exe) but from a non-standard file path where it does not normally reside (e.g., C:\\Users\\Public).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System-critical directories (e.g., C:\\Windows\\System32, C:\\Windows\\SysWOW64) and common user-writable directories (%TEMP%, %APPDATA%, C:\\Users\\Public).",
            "action": [
              "Symbolic: Create a watchlist of critical Windows process names (e.g., svchost.exe, lsass.exe, csrss.exe) and their legitimate, absolute paths (e.g., C:\\\\Windows\\\\System32\\\\svchost.exe). Query process creation events (Windows Event ID 4688) where the ProcessName is on the watchlist but the ImagePath is NOT in the list of legitimate paths. Alert on any match.",
              "Statistical: For each distinct process name (e.g., 'svchost.exe'), create a statistical profile of its valid execution paths and parent processes from historical data (90 days of Windows Event ID 4688). For each new process execution, compare its path and parent process against this profile. Flag any execution where the path/parent combination is statistically rare (e.g., seen less than 0.01% of the time for that process name).",
              "Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest) on a dataset of benign process creation events (Windows Event ID 4688). Use features such as process name, parent process name, file path components (e.g., depth, directory name entropy), and command-line argument characteristics. Apply the model to new process events in real-time to identify anomalous combinations, such as 'svchost.exe' running from '%APPDATA%' with 'powershell.exe' as a parent."
            ]
          },
          {
            "description": "A sequence of events on a single host within a short time window (e.g., < 5 minutes) indicates a file is created, moved or copied to a new location, executed from the new location, and then the original file is deleted.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4660",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint and server file systems, with a focus on correlating activity between download/staging directories (Downloads, Temp) and persistence/execution directories (ProgramData, AppData, Startup folders).",
            "action": [
              "Symbolic: Create a stateful correlation rule in the SIEM that triggers on a specific sequence of events per host within a 2-minute window: (File Create in Path A) -> (File Create in Path B) -> (Process Create from Path B) -> (File Delete of Path A). Enrich this by checking if Path B is a known persistence location.",
              "Statistical: For each host, aggregate file and process events into sessions. Define a specific event sequence: (S1: File Create, Path A) -> (S2: File Create, Path B, different from A) -> (S3: Process Create, from Path B) -> (S4: File Delete, Path A). Calculate the frequency of this complete S1-S4 sequence across the enterprise. Flag hosts where this sequence occurs, as it is statistically rare for benign software installation.",
              "Machine Learning: Train a sequence-based anomaly detection model (e.g., LSTM Autoencoder) on streams of file system and process events (Event IDs 4663, 4688, 4660) from known-benign host activity. The model learns normal sequences of file/process interactions. Feed real-time event streams from endpoints into the model and alert when the reconstruction error exceeds a dynamically tuned threshold, indicating a statistically improbable sequence of events like create-copy-execute-delete."
            ]
          },
          {
            "description": "A process, originating from a directory commonly excluded from AV scans (e.g., %TEMP%), establishes an external network connection to a destination with a rare JA3S hash or to a destination not on an allowlist.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process execution logs, network egress points (firewalls, proxies), and Zeek sensors monitoring north-south traffic.",
            "action": [
              "Symbolic: Create a correlation search that joins process creation events (Windows Event ID 4688) with network connection logs (Zeek conn.log) based on source IP and a 1-minute time window. Trigger an alert if a process's ImagePath points to a high-risk directory (e.g., %TEMP%, %PUBLIC%, %APPDATA%), the process hash is not on an allowlist of known good software, and the destination IP in the corresponding conn.log entry is external and not on an organizational allowlist of sanctioned services.",
              "Statistical: For processes executing from high-risk directories (e.g., %APPDATA%), establish a statistical baseline of their network behavior using Zeek logs. For each new connection, check if the destination IP's JA3S hash (from Zeek ssl.log) is in the bottom 1st percentile of prevalence for that process name. Additionally, flag connections where the outbound data volume (orig_bytes from conn.log) exceeds the 99th percentile for that process.",
              "Machine Learning: For processes running from high-risk locations, create a multivariate time-series model (e.g., VAR or an LSTM-based model) using features from Zeek conn.log such as connection count per minute, total bytes out, and average connection duration. The model learns the normal temporal patterns of network activity for these processes. Flag any time window where the model's forecast error is anomalously high, indicating a deviation like a C2 heartbeat or data exfiltration."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]