[
    {
        "information_requirement": "Is the adversary attempting to evade defenses by clearing command history?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense-Evasion",
        "indicators": [
            {
                "technique_id": "T1070.003",
                "name": "Clear Command History",
                "evidence": [
                    {
                        "description": "Execution of specific, explicit commands known to clear or delete shell history files.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a high-fidelity alert rule that triggers on the execution of processes containing exact command-line strings for history clearing. Monitor Windows Event ID 4688 for commands like 'history -c', 'rm *bash_history', 'rm *zsh_history', 'del *ConsoleHost_history.txt', and 'cat /dev/null > *bash_history'. Monitor Windows Event ID 4104 (PowerShell Script Block Logging) for the specific command 'Clear-History'. These are high-confidence selectors but can be easily evaded."
                    },
                    {
                        "description": "Use of shell commands or script patterns designed to programmatically disable history, manipulate history variables, or obfuscate the deletion of history files.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 and 4104 for command patterns that manipulate history logging. Look for commands that set history-related environment variables to null or zero (e.g., 'HISTSIZE=0', 'unset HISTFILE', '$env:PSReadlineOptions.HistorySaveStyle = \"SaveNothing\"'). Use regular expressions to detect command-line arguments that reference history files ('*bash_history*', '*ConsoleHost_history.txt*') in combination with file redirection from '/dev/null' or obfuscated 'rm'/'del' commands. Correlate these patterns within a short time window for a single user/host to identify a sequence of history tampering."
                    },
                    {
                        "description": "Deletion of or writing to shell history files by a process that is not a standard, interactive user shell, or a shell executing with an anomalous parent process.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events where the command line includes history-clearing commands (e.g., 'rm', 'del', 'history', 'Clear-History') and analyze the parent process. Use correlation analysis to alert when the parent process is not a standard interactive shell (e.g., powershell.exe, cmd.exe, bash.exe) but is instead a non-interactive process like services.exe, wmic.exe, or a custom executable. For higher fidelity, enable SACLs on history file locations and monitor Windows Event ID 4663 for delete or write access attempts, flagging operations from unexpected process names."
                    },
                    {
                        "description": "Anomalous frequency or timing of history file modification or history-clearing commands for a specific user or host, particularly following a remote login.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104",
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal activity for each user/host. Monitor the execution of history-clearing commands (from Event ID 4688/4104) and identify users or hosts executing them with a significantly higher frequency than their peers or their own historical average, using descriptive statistics and percentile analysis to find outliers. Correlate a successful remote login event (Windows Event ID 4624 Logon Type 3 or 10; or Zeek conn.log for a new SSH session) with a subsequent history-clearing event on the same host within a short timeframe (e.g., 1-5 minutes). Use time series analysis to detect unusual spikes in history-clearing activity across the enterprise."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
