[
  {
    "information_requirement": "Has the adversary gained initial access using compromised domain accounts?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078.002",
        "name": "Domain Accounts",
        "evidence": [
          {
            "description": "A successful or failed authentication from an external source IP address matches a known malicious IP from a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., ADFS, VPN gateways), Domain Controllers, Cloud identity providers",
            "action": [
              "Symbolic: Continuously join the source IP addresses from external authentication logs (Windows Event IDs 4624, 4625) and network flow logs (Zeek conn.log) against a threat intelligence list of known malicious IPs. Generate a high-priority alert on any match.",
              "Statistical: For IPs not on a threat list, calculate the ratio of failed to successful logins (Event ID 4625 / Event ID 4624) per source IP over a 1-hour window. Flag any IP whose failure ratio exceeds the 99th percentile of the historical distribution for all external IPs.",
              "Machine Learning: Train a supervised classification model (e.g., Gradient Boosting Classifier) on labeled historical data, using features such as IP reputation from passive DNS, ASN, country, time of day, and login success/failure counts. Use the model to predict in real-time whether a new external login attempt is malicious."
            ]
          },
          {
            "description": "A single external IP address generates a high volume of failed authentications against one or many domain accounts, indicative of a brute-force or password spraying attack.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Public-facing application servers with AD integration, VPN concentrators",
            "action": [
              "Symbolic: Create a rule that triggers when a single source IP generates >20 failed logins (Event ID 4625) for a single account in 5 minutes (brute-force). Create a second rule for a single source IP generating >20 failed logins for >20 distinct accounts in 5 minutes (password spray).",
              "Statistical: Aggregate authentication failures (Event ID 4625) by source IP and target account per minute. Calculate the count of distinct accounts targeted by each IP. Flag any IP where the failure count or the distinct account count is more than 3 standard deviations above the mean for that time window.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., ARIMA or Seasonal-Hybrid-ESD) on the stream of authentication failure events, segmented by source IP. An anomalous spike in failures from a single source would trigger an alert for further investigation."
            ]
          },
          {
            "description": "A single domain account logs in successfully from two or more geographically disparate locations in a time period shorter than physically possible.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN Concentrators, Cloud IAM services",
            "action": [
              "Symbolic: For each successful login (Event ID 4624), enrich the source IP with geolocation data. For each new login, calculate the required travel speed from the previous login's location. If the calculated speed exceeds a set threshold (e.g., 600 mph), generate an alert.",
              "Statistical: For each user, maintain a distribution of calculated travel speeds between their consecutive logins. Flag any new login where the calculated speed falls into the 99.9th percentile of all observed speeds for that user or across the organization.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on the historical geolocations of a user's logins. A new login that does not fall into an established geographic cluster and is not explainable by travel time is flagged as a spatial outlier and a potential impossible travel event."
            ]
          },
          {
            "description": "A successful domain account authentication originates from an IP address with attributes (e.g., geolocation, ASN, ISP) that are rare or have never been seen for that specific user's account.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN Concentrators, Cloud IAM services",
            "action": [
              "Symbolic: For each user account, maintain a baseline list of historically seen source countries, ASNs, and ISPs from successful logins (Event ID 4624). Generate an alert on the first-ever login from a new country or from an ASN categorized as high-risk (e.g., hosting provider, TOR exit node).",
              "Statistical: For each user, calculate the frequency of logins from each country and ASN. For a new login, calculate its rarity score based on historical frequency. Alert if the login's location rarity score is below a threshold (e.g., it is rarer than the 5th percentile of all locations for that user).",
              "Machine Learning: Model each user's normal login context (country, ASN, time of day, day of week) using a One-Class SVM or an autoencoder. A new login that is classified as an anomaly by the model (i.e., has a high reconstruction error) is flagged for review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using compromised domain accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1078.002",
        "name": "Domain Accounts",
        "evidence": [
          {
            "description": "A host with an active domain account session initiates network traffic to a destination IP or domain that matches a known Command and Control (C2) server on a threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, Endpoint workstations, Internal network sensors",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log destination IPs) and DNS query logs (Zeek dns.log queried domains) against a threat intelligence feed of known C2 servers. Alert on any match from a host with an active domain account session.",
              "Statistical: For outbound TLS connections (Zeek ssl.log), calculate the frequency of observed JA3 hashes across the enterprise. Alert on connections from hosts that use a JA3 hash that is globally rare (e.g., in the bottom 1% of prevalence). Also, calculate the entropy of queried domains in Zeek dns.log and alert on high-entropy results.",
              "Machine Learning: Use a time-series analysis model on outbound connection volume and data payload size per host. A periodic, repeating pattern ('heartbeat') with low data volume is indicative of C2 beaconing and can be flagged as anomalous."
            ]
          },
          {
            "description": "A new domain account is created (Event ID 4720) and is added to a privileged group (Event ID 4728/4732) within a short time window, and the account name exhibits non-standard characteristics.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4728",
              "Windows Event ID 4732"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: Create a correlation rule that alerts when a user creation event (Event ID 4720) is followed by that same user being added to a privileged group like 'Domain Admins' or 'Administrators' (Event ID 4728, 4732) within a 5-minute window.",
              "Statistical: For every new account creation (Event ID 4720), calculate the Shannon entropy of the username. Flag usernames with an entropy score significantly higher than the baseline average for new accounts (e.g., > 2 standard deviations), suggesting a randomly generated name.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to predict if a new username is suspicious. Features should include username length, character-type ratio (letters vs. numbers), entropy, and n-gram frequency compared to a dictionary of common English and technical words."
            ]
          },
          {
            "description": "A service installation (Event ID 4697) or scheduled task creation (Event ID 4698) is initiated by a domain account that is not authorized for such administrative actions.",
            "data_sources": [
              "Windows Event ID 4697",
              "Windows Event ID 4698",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Member servers",
            "action": [
              "Symbolic: Alert when a Service Installation event (Event ID 4697) or Scheduled Task Creation event (Event ID 4698) is logged for a user account that is not in a predefined list of authorized administrative or system accounts.",
              "Statistical: Profile the frequency of service/task creation per user account. Flag any user whose daily or weekly creation count exceeds the 99th percentile of their own historical baseline or their peer group's baseline (e.g., a user in 'Marketing' creating any services).",
              "Machine Learning: Use a classification model on process creation events (Event ID 4688) to identify anomalous parent-child relationships, such as `explorer.exe` spawning `schtasks.exe` or `sc.exe`, especially when initiated by a standard user account on a server."
            ]
          },
          {
            "description": "A domain account exhibits login or network activity with a highly regular, periodic cadence, indicative of automated C2 beaconing rather than human behavior.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network egress points",
            "action": [
              "Symbolic: Create a rule to detect logins (Event ID 4624) or network connections (Zeek conn.log) that occur at the exact same second and minute of the hour, every hour (e.g., HH:05:30), for several consecutive hours.",
              "Statistical: For each account, analyze the time deltas between consecutive login events or network beacons. Calculate the standard deviation of these time deltas over a 24-hour period. A value near zero indicates highly regular, automated activity and should be alerted.",
              "Machine Learning: Apply a Fast Fourier Transform (FFT) to the time series of an account's activity (e.g., a binary signal of connection start times). A strong, narrow peak in the frequency domain indicates a dominant periodic signal, characteristic of automated C2 beaconing."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary elevated privileges using compromised domain accounts?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1078.002",
        "name": "Domain Accounts",
        "evidence": [
          {
            "description": "A process creation event (Event ID 4688) shows the execution of `net.exe` or `powershell.exe` with command-line arguments to add a user to a privileged group.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Member servers, Domain Controllers",
            "action": [
              "Symbolic: Monitor process creation events (Event ID 4688) for `ProcessName` `net.exe` or `powershell.exe` where the `CommandLine` contains strings like 'net group \"Domain Admins\"' or 'Add-ADGroupMember -Identity \"Domain Admins\"'.",
              "Statistical: Establish a baseline of command-line argument patterns for `net.exe` and `powershell.exe`. Calculate the term frequency-inverse document frequency (TF-IDF) for arguments. Flag commands with rare argument combinations like 'group' and 'add' when executed by non-administrative accounts.",
              "Machine Learning: Train a sequence-based model (e.g., an LSTM) on historical command-line activity for different user roles. Flag a command sequence as anomalous if it deviates significantly from a user's established behavioral profile, such as a user from the 'Sales' role suddenly using Active Directory administration commands."
            ]
          },
          {
            "description": "A group membership change event (Event ID 4728/4732) adding a user to a privileged group is immediately followed by a successful logon event (Event ID 4624) by that user to a critical asset like a Domain Controller.",
            "data_sources": [
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a `TargetUserName` is added to a privileged group (Event ID 4728 or 4732) and a successful logon (Event ID 4624) from the same `TargetUserName` with a privileged logon type (e.g., Type 2 or 10) occurs on a Domain Controller within 15 minutes.",
              "Statistical: For all accounts added to privileged groups, track the time-to-first-privileged-logon. Flag accounts where this time is in the bottom 5th percentile (i.e., the fastest 5% of all such events), suggesting an immediate, scripted exploitation of the new privilege.",
              "Machine Learning: Use a graph-based anomaly detection model where users, groups, and assets are nodes. The creation of a new edge (user added to 'Domain Admins' group) followed quickly by another edge (user logs into 'DC01') that is historically rare can be flagged as a high-risk event path."
            ]
          },
          {
            "description": "An account recently added to a privileged group performs a high-impact, privileged action (e.g., accessing a DC's ADMIN$ share, running `ntdsutil.exe`) for the first time in its history.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, File Servers with sensitive data",
            "action": [
              "Symbolic: Maintain a state table of accounts added to privileged groups in the last 7 days. Alert if any of these accounts generates an event for the first time, such as accessing a sensitive network share like ADMIN$ or C$ on a DC (Event ID 5145) or executing `ntdsutil.exe` (Event ID 4688).",
              "Statistical: Maintain a historical baseline of all unique privileged actions (e.g., sensitive file access events, process executions) performed by each user. After a privilege change, monitor for new actions. Score the risk of the new action based on its overall rarity in the organization and alert if the risk score exceeds a threshold.",
              "Machine Learning: Model each user's activity as a set of actions. After a privilege change, compare the user's new set of actions to their historical set using a Jaccard similarity score. A low score indicates a significant change in behavior, which, combined with the recent privilege escalation, indicates high risk."
            ]
          },
          {
            "description": "A logon event (Event ID 4624) for a non-administrative user shows a Token Elevation Type of 'Full' (%%1938), indicating a UAC bypass or unexpected privilege escalation.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Member servers",
            "action": [
              "Symbolic: Alert on any successful logon event (Event ID 4624) where the 'Token Elevation Type' field is 'TokenElevationTypeFull (%%1938)' for any user account not on a pre-approved list of administrators who perform such actions.",
              "Statistical: For each user account, calculate the historical ratio of full tokens ('%%1938') to default tokens ('%%1937'). Alert if a new logon causes this ratio to deviate by more than 3 standard deviations from the user's established baseline, indicating an unusual escalation.",
              "Machine Learning: Train a decision tree classifier to determine if a full token logon is legitimate or suspicious. Features should include the user's role, the host system's role, the parent process that requested the elevation, and the time of day. Flag logons classified as suspicious by the model."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using compromised domain accounts?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1078.002",
        "name": "Domain Accounts",
        "evidence": [
          {
            "description": "A process creation event (Event ID 4688) initiated by a domain account contains command-line arguments known to disable or tamper with security controls (e.g., AV, EDR, logging).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Member servers",
            "action": [
              "Symbolic: Monitor process creation events (Event ID 4688) for command lines containing specific defense evasion signatures, such as `Set-MpPreference -DisableRealtimeMonitoring $true`, `netsh advfirewall set allprofiles state off`, or `wevtutil cl Security`.",
              "Statistical: Analyze the command line arguments of `powershell.exe` and `netsh.exe` processes. Calculate the frequency of specific defense-disabling keywords. Alert if the frequency for a given user or host spikes above its 99th percentile.",
              "Machine Learning: Use a natural language processing (NLP) model, like a pre-trained BERT, fine-tuned on malicious scripts and commands to analyze command-line arguments. Flag commands that have a high semantic similarity score to known defense evasion techniques."
            ]
          },
          {
            "description": "A legitimate domain account executes a native Windows binary (LOLBAS) from an unusual path or with command-line arguments indicative of malicious activity, such as file download or code execution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Member servers",
            "action": [
              "Symbolic: Alert on process creation (Event ID 4688) for `certutil.exe` with `-urlcache` and `-f` arguments, or for `powershell.exe` with `-e`, `-enc`, or `-encodedcommand` arguments, especially when the parent process is an Office application or a browser.",
              "Statistical: Calculate the entropy of command-line arguments for common processes like `powershell.exe`, `mshta.exe`, and `rundll32.exe`. A high entropy score is indicative of an encoded or obfuscated command and should be flagged for investigation.",
              "Machine Learning: Model normal parent-child process relationships and command-line structures using a graph-based model. Flag any new process execution that creates a rare edge in the graph (e.g., `winword.exe` spawning `powershell.exe` with a long, high-entropy command line)."
            ]
          },
          {
            "description": "Evidence of event log clearing is observed, either through a specific log clearing event (Event ID 1102) or an unexplained gap in log collection from a host.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Domain Controllers, Member servers",
            "action": [
              "Symbolic: Generate a critical-severity alert for any occurrence of Event ID 1102 ('The audit log was cleared'). Also, alert on process creation (Event ID 4688) for `wevtutil.exe` with the `cl` or `clear-log` argument.",
              "Statistical: Monitor the volume of events per log source per hour. Alert if the event count for a critical log (like the Security log) from a specific host drops to zero for a period and then resumes. This 'log gap' is a strong indicator of clearing.",
              "Machine Learning: Train a time-series forecasting model (e.g., Prophet) for each host to predict its expected log volume. Flag any host where the actual log volume significantly deviates negatively from the predicted volume, which could indicate log tampering or a collection failure."
            ]
          },
          {
            "description": "A successful logon event (Event ID 4624) shows a domain account typically used for interactive sessions (Logon Type 2 or 10) authenticating with a non-interactive type (e.g., Type 4 for Batch, Type 5 for Service).",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint workstations, Member servers",
            "action": [
              "Symbolic: Create a rule to alert on successful logon events (Event ID 4624) where a user account from a 'Standard Users' group authenticates with Logon Type 5 (Service), Type 4 (Batch), or Type 8 (NetworkCleartext).",
              "Statistical: For each user, maintain a profile of their normal logon types (e.g., 90% Type 2, 10% Type 10). Alert if a logon occurs with a type that has a zero or near-zero probability in that user's historical profile, indicating a sharp deviation from normal behavior.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means) to group users based on their typical logon type patterns and other session features. If a user's activity causes them to shift from a 'Standard Interactive Users' cluster to a 'System Processes' cluster, flag this transition as an anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]