[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by removing network share connections?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1070.005",
        "name": "Network Share Connection Removal",
        "evidence": [
          {
            "description": "A process executes that deletes a network share connection, and the file hash of that process is present on a threat intelligence feed of known malicious tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "End-user Workstations, Domain Controllers, File Servers, Application Servers",
            "action": [
              "For every process creation event (Windows Event ID 4688, Sysmon Event ID 1), calculate the file hash. Compare this hash against a threat intelligence feed of known malicious file hashes. Generate an alert upon an exact match.",
              "Calculate the prevalence of all file hashes observed executing with command-line arguments containing 'net', 'use', and '/delete' or 'Remove-SmbMapping'. Flag any hash that is statistically rare across the enterprise (e.g., seen on less than 0.1% of endpoints) for investigation.",
              "Train a supervised classification model (e.g., Random Forest) on features from process creation events, including process hash prevalence, parent process name, user context, and command-line arguments. Use the model to score the likelihood of malice for any process. An execution involving share deletion that receives a high probability score for being malicious should trigger an alert."
            ]
          },
          {
            "description": "Direct execution of built-in Windows commands or PowerShell cmdlets used to delete network share connections, such as 'net use /delete' or 'Remove-SmbMapping'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104 (PowerShell Script Block Logging)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "End-user Workstations, Application Servers, Domain Controllers",
            "action": [
              "Create a detection rule to monitor process creation events (Windows Event ID 4688) for command lines containing 'net.exe' or 'net1.exe' and both 'use' and '/delete' arguments. Create a parallel rule for PowerShell Script Block logs (Windows Event ID 4104) to detect executions of 'Remove-SmbMapping' or 'Remove-PSDrive'.",
              "For each user, build a baseline of parent processes that typically spawn 'net.exe' with '/delete' arguments. Calculate the rarity of the parent process for each new execution. Generate an alert if a rare parent process (e.g., 'svchost.exe', 'wscript.exe', 'mshta.exe') executes a share deletion, especially outside of business hours.",
              "Train a logistic regression model using features from command-line and PowerShell logs, such as time of day, user account, parent process, and host. The model should classify each share deletion event as either 'Benign' (e.g., associated with a logoff script) or 'Suspicious'. Flag all 'Suspicious' classifications for analyst review."
            ]
          },
          {
            "description": "A sequence of events occurs from a single source host and user account within a short time window (e.g., under 15 minutes): 1) An SMB connection is made, 2) file access or transfer activity is observed, and 3) a command is executed to delete the network share connection.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Zeek smb_files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, Network Security Monitoring Sensors, Domain Controllers, Endpoint Devices",
            "action": [
              "Create a correlation rule that triggers when events from the same source host and user occur within a 15-minute window in this order: 1) SMB connection to a file share (Zeek conn.log on port 445), 2) file transfer or access (Zeek smb_files.log or Windows Event ID 5145), and 3) share deletion command (Windows Event ID 4688 or 4104).",
              "Using Zeek conn.log, calculate the historical distribution of SMB session durations for each user-share pair. Alert on any new session whose duration falls in the bottom 5th percentile (anomalously short) and which is immediately followed by a share deletion command (Windows Event ID 4688) on the source host.",
              "Train a sequence analysis model, like a Hidden Markov Model (HMM), on event logs (process, file access, network) to learn normal sequences of user activity. Use the model to evaluate new sequences of events in real-time. Flag any sequence containing a share deletion that has a low probability score, indicating it deviates from established benign patterns (e.g., logoff scripts)."
            ]
          },
          {
            "description": "Network telemetry shows an SMB session with an anomalously short duration, or a sudden drop in SMB traffic from a client, which is inconsistent with historical baselines for that client or user.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb_mapping.log",
              "Windows Event ID 4634"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring Sensors (e.g., Zeek), Core Switches, File Servers, Authentication Logs from Domain Controllers",
            "action": [
              "Create a rule that monitors Zeek smb_mapping.log for new connections. If the connection 'uid' from conn.log associated with that mapping has a duration less than a fixed threshold (e.g., 60 seconds), and is not followed by a corresponding user logoff event (Windows Event ID 4634) on the source host within 2 minutes, flag it for review.",
              "For each client IP, create a time series of total SMB traffic volume from Zeek conn.log. Using a moving average and standard deviation, identify significant drops in traffic (>3 standard deviations below the average). Correlate these drops with host logs; if the drop does not correspond to a user logoff event (Windows Event ID 4634), raise an alert.",
              "Train a time-series anomaly detection model (e.g., Prophet) on historical SMB session durations from Zeek conn.log to learn normal patterns, including time-of-day and day-of-week seasonality. Apply the model to new session data to identify durations that fall outside the model's predicted confidence interval (anomalously short sessions), which could indicate a rapid cleanup."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]