[
  {
    "information_requirement": "Is an adversary performing file and directory discovery on enterprise systems?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1083",
        "name": "File and Directory Discovery",
        "evidence": [
          {
            "description": "A process execution event where the process name or file hash matches a known malicious discovery tool, such as Seatbelt or SharpHound.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log aggregation platform (SIEM) containing process execution logs from all enterprise endpoints and servers, with a focus on high-value assets like Domain Controllers, file servers, and developer workstations.",
            "action": [
              "Create a watchlist of known discovery tool process names (e.g., `Seatbelt.exe`, `SharpHound.exe`) and their corresponding file hashes from threat intelligence feeds. Trigger a high-severity alert upon a direct match in process creation logs (Windows Event ID 4688, Sysmon Event ID 1).",
              "Calculate the enterprise-wide prevalence for every process hash seen in process creation logs. Flag any execution where the hash's prevalence is below a defined threshold (e.g., seen on < 5 hosts) and the parent process is an interactive shell (`powershell.exe`, `cmd.exe`).",
              "Deploy a pre-trained Random Forest classification model to score each process creation event. Input features should include process name entropy, parent process name, command-line argument length, and the enterprise-wide prevalence of the hash. Alert on executions classified as malicious with a high confidence score (>0.9)."
            ]
          },
          {
            "description": "A process creation event for a native command-line utility (`dir`, `tree`, `find`, `where`) where the command-line arguments contain patterns indicative of broad or sensitive file system enumeration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log aggregation platform (SIEM) containing process execution logs from all endpoints and servers, particularly those where interactive command-line use is rare or should be highly scrutinized (e.g., web servers, database servers, application servers).",
            "action": [
              "From process creation logs, create detection rules using regular expressions to match command-line arguments of utilities like `dir`, `tree`, and `find`. Look for patterns such as recursive searches combined with output redirection (`dir C:\\ /s /b > C:\\Users\\Public\\files.txt`) or searching for sensitive file types (`dir \\\\fileshare\\* /s /b | findstr .pem .kdbx .bak`).",
              "For each user and host pair, establish a historical baseline of command-line arguments used with common discovery utilities (`dir`, `tree`, etc.). For each new execution, calculate the Jaccard distance between the set of new arguments and the historical set. Flag executions where the arguments used are statistically rare for that entity (e.g., exceeding the 98th percentile of rarity scores).",
              "Implement a sequence analysis model (e.g., an LSTM) to analyze the sequence of command lines executed by a user within a session. Train the model on benign command sequences from across the enterprise. Flag any user session where the sequence of commands has a low probability score, indicating a deviation from normal workflow, especially if it contains discovery commands followed by compression or network activity."
            ]
          },
          {
            "description": "A statistically significant spike in the number of file system discovery commands (`dir`, `tree`) or file access events (`Object Type: File`) generated by a single user or process within a short time frame, compared to their individual historical baseline.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log aggregation platform (SIEM) containing process creation and file audit logs from critical assets like file servers, SharePoint servers, source code repositories, and Domain Controllers.",
            "action": [
              "Create a rule that triggers if a single user or process generates more than 1000 file access events (Windows Event ID 4663 with Object Type: File) or executes more than 100 discovery-related commands (`dir`, `tree`, `find`) within a 5-minute window.",
              "For each user and host, establish a rolling 30-day baseline of file access counts (from Windows Event ID 4663) and discovery command executions (from Windows Event ID 4688) per hour. Generate an alert when the current hour's activity for a user/host exceeds a dynamic threshold, such as 3 standard deviations above the mean.",
              "For each user and process, model the time series of file access event counts (Event ID 4663) using an anomaly detection algorithm like SARIMA or Prophet. The model should account for weekly and daily seasonality. Flag any time window where the actual event count significantly exceeds the model's predicted confidence interval."
            ]
          },
          {
            "description": "A single process or user account accesses multiple, distinct, pre-defined sensitive directories or files within a short time window, where such access is not part of their established baseline behavior.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File audit logs (Event ID 4663) from servers hosting sensitive departmental data (Finance, HR, Legal), Domain Controllers (SYSVOL, NTDS.dit location), and source code repositories.",
            "action": [
              "Define a watchlist of critical file paths and directories (e.g., `C:\\Windows\\NTDS\\`, `*\\SYSVOL\\*\\Policies\\`, `*\\secrets\\*`, `*\\.ssh\\`). Create a rule that alerts when a single process accesses more than 3 distinct directories from this watchlist within a minute, based on Windows Event ID 4663 logs.",
              "For a given process over a 10-minute window, calculate the Shannon entropy of the directory paths it accesses (from Event ID 4663). Compare this entropy score to a baseline for that specific process name or user, and alert if it exceeds a percentile-based threshold (e.g., 99th percentile), indicating unusually broad directory traversal.",
              "Vectorize file access patterns for each user based on the directories they access. Use a density-based clustering algorithm (e.g., DBSCAN) to identify user accounts that are outliers (i.e., do not belong to any major behavioral cluster). Prioritize alerts for outliers whose activity involves access to sensitive directories."
            ]
          },
          {
            "description": "A single source host establishes an anomalously high number of SMB connections to distinct shares or servers across the network, particularly targeting administrative shares like C$ or ADMIN$.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek conn.log",
              "Zeek smb_mapping.log",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic data from network taps monitoring East-West traffic between subnets. Zeek sensors deployed at key network chokepoints (e.g., data center core, user access layer). Windows Security logs from all file servers and domain controllers.",
            "action": [
              "From Zeek `smb_mapping.log` or Windows Event ID 5145, create a rule that alerts when a single source IP (`id.orig_h` or `Source Address`) attempts to access more than 10 unique host/share combinations in a 5-minute window. Add high severity if the `Share Name` includes `C$` or `ADMIN$`.",
              "For each source IP, calculate the number of unique destination IPs it connects to on port 445 (from Zeek `conn.log`) within an hour. Establish a baseline distribution for this 'fan-out' metric across all hosts. Flag any host whose fan-out exceeds the 95th percentile of its peer group (e.g., other workstations).",
              "Construct a graph where nodes are hosts and edges represent SMB connections (from Zeek `conn.log` on port 445). Use a community detection algorithm (e.g., Louvain) to identify normal traffic clusters. Flag hosts that begin making connections that bridge previously disconnected communities or that have a sudden, sharp increase in their node degree centrality."
            ]
          },
          {
            "description": "A correlated sequence of events originating from a single host, beginning with broad local file discovery, followed by network share enumeration, and culminating in the creation of a compressed archive file.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Sysmon Event ID 11",
              "Zeek smb_mapping.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized log management platform (e.g., SIEM, data lake) capable of correlating events from disparate sources, including endpoint process logs (Windows, Sysmon) and network traffic logs (Zeek).",
            "action": [
              "Create a stateful correlation rule that tracks activity from a single host. Trigger a high-priority alert if the following sequence occurs within a 1-hour window: (1) Execution of a recursive `dir` command (Event ID 4688), followed by (2) SMB enumeration against >5 distinct servers (`smb_mapping.log`), followed by (3) The creation of a `.zip`, `.rar`, or `.7z` archive (Sysmon Event ID 11 or Event ID 4688).",
              "Assign a risk score to individual atomic events (e.g., recursive `dir` = 5 points, access to a sensitive directory = 10 points, SMB enumeration = 15 points, archive creation = 20 points). Sum these scores for a given host over a rolling 30-minute window. Alert when a host's risk score spikes above a statistically determined threshold (e.g., 4 standard deviations above the mean of its peer group).",
              "Develop and deploy a Hidden Markov Model (HMM) where the hidden states represent stages of an attack (e.g., 'Benign', 'Reconnaissance', 'Staging'). The observable emissions are categorized security events (e.g., 'recursive_dir', 'smb_scan', 'archive_creation'). For each host, continuously feed its stream of security events into the model. Alert when the model transitions to and remains in the 'Reconnaissance' or 'Staging' state with high probability."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]