[
  {
    "information_requirement": "Has the adversary attempted to enumerate cloud accounts?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1087.004",
        "name": "Cloud Account",
        "evidence": [
          {
            "description": "A network connection from an internal host to a known cloud provider IAM API endpoint (e.g., iam.amazonaws.com, graph.microsoft.com, iam.googleapis.com) where the source IP's geolocation is from a country with no business presence, or the source IP is present on a current threat intelligence feed of known malicious hosts.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet egress points, forward and reverse proxy servers, and enterprise DNS resolvers.",
            "action": [
              "Create a rule to continuously correlate source IP addresses from Zeek conn.log traffic destined for known cloud IAM API endpoints against an up-to-date threat intelligence feed of malicious IPs or known anonymizing services. Generate an alert for any match.",
              "For all connections to cloud IAM APIs, geolocate the source IP. Maintain a statistical baseline of allowed source countries based on at least 30 days of historical data. Alert when a connection originates from a country that falls below the 1st percentile of historical connection frequency, indicating a rare and potentially unauthorized location.",
              "Train a binary classification model (e.g., Random Forest) using features from Zeek conn.log (source IP, destination IP, duration, service, orig_bytes, resp_bytes, country code, ASN) to predict malicious connections to IAM endpoints. Use labeled historical data and CTI feeds for training. Apply the model in real-time to score new connections and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a known cloud CLI binary (e.g., 'aws.exe', 'az.exe', 'gcloud.exe') or PowerShell ('powershell.exe', 'pwsh.exe') executing specific account enumeration sub-commands (e.g., 'list-users', 'list-roles', 'get-iam-policy', 'Get-MsolRoleMember', 'az ad user list').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrator workstations, developer endpoints, and CI/CD pipeline servers",
            "action": [
              "Create a detection rule using regular expressions to search the 'CommandLine' or 'ProcessCommandLine' field in Windows Event ID 4688 logs for the execution of cloud CLI tools (pwsh.exe, powershell.exe, az.exe, aws.exe, gcloud.exe) paired with enumeration-specific arguments such as 'Get-MsolRoleMember', 'az ad user list', 'aws iam list-users', 'aws iam list-roles', 'gcloud projects get-iam-policy', or 'gcloud iam service-accounts list'. Generate an alert for any match.",
              "For each user and host, establish a baseline of normal command-line executions. Calculate the Shannon entropy of the command-line arguments for each executed cloud CLI process. Alert when a cloud CLI process is executed with command-line entropy that exceeds the 95th percentile for that entity, or if a user executes a specific enumeration command for the first time.",
              "Use a clustering algorithm (e.g., DBSCAN) on vectorized command-line data (using techniques like TF-IDF on tokenized arguments and process names). Identify and label clusters of normal administrative activity. Treat any cloud CLI execution that is classified as a noise point or falls outside of established clusters as an anomaly and flag for investigation to find novel enumeration techniques."
            ]
          },
          {
            "description": "An anomalously high rate of distinct HTTP GET or POST requests from a single source IP to cloud IAM API URI paths within a short time window, indicating programmatic enumeration or 'spraying' activity.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring sensors at internet egress points and cloud-native flow logs (e.g., AWS VPC Flow Logs).",
            "action": [
              "Define a rule that triggers when a single source IP (from Zeek conn.log) makes more than 20 distinct API calls to known cloud IAM URI paths (e.g., containing '/users', '/roles', '/policies' in Zeek http.log) within a 5-minute window. Alert on any host that trips this hard threshold.",
              "For each source IP, profile the number and variety (unique count) of IAM API calls per hour to establish a baseline. Using a rolling 1-hour window, generate an alert if the number of API calls exceeds 3 standard deviations above the entity's mean, or if the count of unique API paths exceeds the 99th percentile for that entity.",
              "Implement a time-series anomaly detection model (e.g., ARIMA or an LSTM-based autoencoder) on the volume of IAM API calls per source IP over 1-minute intervals. Train the model on at least 30 days of historical Zeek http.log data to learn normal request patterns. Use the model to predict the expected call volume and alert when the actual volume significantly deviates from the prediction's confidence interval."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a cloud CLI tool on a host is temporally correlated (within 60 seconds) with a subsequent network connection (Zeek conn.log) from that same host to a cloud IAM API, where the associated user account is not a member of a designated cloud administrator group.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Active Directory Security Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Virtual Desktop Infrastructure (VDI), CI/CD servers, and Domain Controllers for user attribute enrichment.",
            "action": [
              "Create a stateful correlation rule that joins Windows Event ID 4688 and Zeek conn.log on the host IP within a 60-second window. The rule must match a cloud CLI process name with a destination IP resolved to a cloud IAM domain. Enrich the event with the user's group memberships from Active Directory and alert if the user is not a member of a pre-approved 'Cloud Administrators' security group.",
              "Profile the population of users who execute cloud CLI commands that generate external network traffic. Alert if a user from a historically low-activity department (e.g., Marketing, HR) executes a cloud CLI command, and increase the alert severity if the command is statistically rare (falls below the 5th percentile of command frequency) across the entire organization.",
              "Develop a risk scoring model using a supervised algorithm (e.g., Gradient Boosting) on features from the correlated events: user role (from AD), host criticality, time of day (is_business_hours), command-line entropy, and the historical frequency of this user-action pair. Train the model on labeled past incidents to predict a risk score for each correlated event. Automatically escalate events with a score above a predefined confidence threshold."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]