[
  {
    "information_requirement": "Is the adversary maintaining persistence using additional email delegate permissions?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1098.002",
        "name": "Additional Email Delegate Permissions",
        "evidence": [
          {
            "description": "A recorded mailbox permission change (Microsoft 365 Unified Audit Log operations: `Add-MailboxPermission`, `Set-MailboxFolderPermission`, `Add-MailboxFolderPermission`; or PowerShell Script Block Logging for these cmdlets) where the UserPrincipalName of the actor or the target mailbox is on a predefined watchlist of high-risk or compromised accounts.",
            "data_sources": [
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Domain Controllers, Identity and Access Management (IAM) systems",
            "action": [
              "Create a rule to analyze PowerShell Script Block Logs (Windows Event ID 4104) and Microsoft 365 Unified Audit Logs for mailbox permission modification operations (`Add-MailboxPermission`, `Set-MailboxFolderPermission`). Trigger an alert if the actor's or target's user principal name is found on a pre-defined watchlist of compromised or high-risk accounts.",
              "For all user accounts, calculate the historical frequency of executing mailbox permission changes over a 90-day baseline. Flag any account that executes these changes at a rate exceeding the 95th percentile of its own historical activity, or of its peer group's activity (e.g., other non-admin users), as this indicates a behavioral anomaly.",
              "Train a classification model (e.g., Random Forest) using features such as the actor's role, the target's role, time of day, source IP reputation, and a binary flag for watchlist presence. Use this model to assign a risk score to each permission change event, alerting on events with a score indicating a high probability of maliciousness."
            ]
          },
          {
            "description": "A recorded mailbox permission change that grants 'FullAccess' rights, or that assigns any permission to a user account with an account creation date less than 30 days prior, or to an account categorized as a non-interactive service account.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688",
              "Microsoft 365 Unified Audit Log",
              "Active Directory Replication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Domain Controllers, Identity and Access Management (IAM) systems",
            "action": [
              "Create a SIEM rule to parse PowerShell logs (Event ID 4104) and Microsoft 365 audit logs for permission change events. Generate an alert if the 'Rights' parameter contains 'FullAccess', or if the target user account's creation timestamp (from Active Directory) is less than 30 days old, or if the target account is categorized as a service account.",
              "For each administrator, calculate the Shannon entropy of the types of permissions they grant over a 30-day window. A sudden, sharp decrease in entropy (e.g., repeatedly granting only 'FullAccess') can indicate scripted or automated activity. Alert if an admin's permission entropy score drops more than 2 standard deviations below their individual baseline.",
              "Use a time-series anomaly detection model (e.g., ARIMA) on the stream of permission change events for the organization. The model learns normal daily/weekly patterns of changes (volume, rights types). An alert is generated when a cluster of events, such as multiple 'FullAccess' grants in a short period, significantly deviates from the forecasted pattern."
            ]
          },
          {
            "description": "A recorded mailbox permission change event, followed within 60 minutes by a successful mailbox login event from the newly delegated account, where the login originates from a source IP address or exhibits a User-Agent string not seen for the original mailbox owner in the preceding 90 days.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Microsoft 365 Unified Audit Log",
              "Azure AD Sign-in Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, VPN Concentrators, Network Firewalls/Gateways, Endpoint devices",
            "action": [
              "Correlate permission change events (Event ID 4104, M365 UAL) with subsequent mailbox access logs (Event ID 4624, Azure AD Sign-in Logs) within a 60-minute window. Join with a 90-day historical baseline of source IPs and User-Agents for the original mailbox owner. If the new delegate's source IP or User-Agent is not in the baseline, generate an alert.",
              "For each user, maintain a statistical profile of their access locations (countries, ASNs) and devices (User-Agents). After a new delegate is added to a mailbox, score the new delegate's first access based on the rarity of its location and device against the original user's profile. If the combined rarity score is in the top 5th percentile, flag the access for review.",
              "Employ an unsupervised learning model (e.g., K-Means clustering) to group a user's typical access events into 'normal' clusters based on features like IP geolocation, user agent, time of day, and ASN. When a new delegate accesses the mailbox, if their access event does not fall into any of the pre-established 'normal' clusters for that mailbox, classify it as an anomaly and alert."
            ]
          },
          {
            "description": "Following a delegation event on a mailbox, outbound emails sent from that mailbox exhibit a volume, recipient pattern, or time-of-day that is anomalous compared to the original mailbox owner's 90-day activity baseline.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log",
              "Microsoft 365 Message Trace Logs",
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, On-premises Exchange Servers, Microsoft 365 Tenancy, Network Egress Points",
            "action": [
              "After a delegation event, monitor outbound email logs (M365 Message Trace, Zeek smtp.log) from the delegated mailbox. Trigger an alert if more than 100 internal emails are sent within a 1-hour period to recipients who have not received an email from the original owner in the last 90 days.",
              "For each mailbox, establish a 30-day rolling baseline of outbound email activity including average daily volume and recipient domain distribution. After a delegation event, if the sending volume from that mailbox exceeds 3 standard deviations above the baseline mean, or if the Jaccard similarity between the set of new recipient domains and the baseline domains drops below 0.2, flag the activity as anomalous.",
              "Use a time-series forecasting model (e.g., Prophet) to predict the expected volume and flow of emails from a given mailbox. After a delegation event, compare the actual email activity against the forecast. A significant and sustained deviation in the residual error (actual vs. predicted) indicates a change in behavior and should generate an alert for potential misuse."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting privilege escalation using additional email delegate permissions?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1098.002",
        "name": "Additional Email Delegate Permissions",
        "evidence": [
          {
            "description": "A mailbox permission change event where the target mailbox belongs to a user who is a member of a high-privilege group (e.g., 'Domain Admins', 'Enterprise Admins', 'C-Suite') and the change is executed by a user account present on a watchlist of suspicious or compromised accounts.",
            "data_sources": [
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log",
              "Active Directory Replication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Domain Controllers, Identity and Access Management (IAM) systems",
            "action": [
              "Create a high-severity SIEM rule that triggers on any mailbox permission change event where the target mailbox user is a member of a 'High-Value Target' group (e.g., 'Domain Admins', 'C-Suite') AND the actor performing the change is on a 'Suspicious Accounts' watchlist.",
              "Calculate a risk score for every permission change event using a weighted sum: $$ RiskScore = w_1 \\cdot IsTargetPrivileged + w_2 \\cdot IsActorOnWatchlist + w_3 \\cdot PermissionRarity(FullAccess) $$. An event where a suspicious actor grants 'FullAccess' to a privileged account would receive a high score. Alert on any event with a score exceeding the 99th percentile of all historical event scores.",
              "Use a graph-based anomaly detection model on the organization's identity graph. The creation of an improbable 'has-permission-on' edge from a low-privileged or suspicious user node to a high-centrality, privileged user node (e.g., CEO, Domain Admin) would be flagged as a likely privilege escalation attempt."
            ]
          },
          {
            "description": "A recorded mailbox permission change event where the 'Actor' and 'Delegate' identities are the same, but the 'Target Mailbox Owner' identity is different, especially when the target mailbox owner is a member of a high-privilege group.",
            "data_sources": [
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log",
              "Active Directory Replication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Domain Controllers",
            "action": [
              "Parse PowerShell logs (Event ID 4104) and M365 audit logs. Create a rule that alerts when the actor identity is identical to the delegate identity but different from the target mailbox owner's identity. Increase severity if the target mailbox owner's group membership includes privileged groups.",
              "For each user who executes permission changes, calculate the ratio of grants to self on another's mailbox versus grants to other users. A user who normally has a ratio of 0 but suddenly grants themself permission on another mailbox will have a ratio spike. Flag any user whose self-granting ratio deviates by more than 3 standard deviations from their personal or peer-group baseline.",
              "Train a binary classifier (e.g., Logistic Regression) to distinguish between legitimate and illegitimate permission changes where the actor is the delegate. Features would include: source IP, time of day, target mailbox owner's role, actor's role, and historical frequency of this action by the actor. An event classified as 'illegitimate' with high confidence would trigger an alert."
            ]
          },
          {
            "description": "A mailbox permission change command is executed by: (1) a user account not belonging to a pre-defined administrative group authorized for such changes, or (2) an authorized administrator account acting outside of their established baseline for activity hours or source IP address ranges.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688",
              "Microsoft 365 Unified Audit Log",
              "Active Directory Replication Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, SIEM/Log Management Platform, VPN Concentrators, Management Workstation Subnets",
            "action": [
              "Maintain a list of authorized Exchange administrator group members. Create a rule to alert on any mailbox permission change command executed by a user not in this group. For authorized admins, create a secondary rule that alerts if the action's source IP (from Zeek conn.log or M365 UAL) is not within an approved list of management subnets or known countries.",
              "For each authorized administrator, establish a baseline of their activity time-of-day using a 24-hour histogram. Alert if a permission change occurs during a time window that falls in the lowest 10th percentile of their historical activity (e.g., 3 AM for an admin who only works 9-5). Similarly, baseline source IPs and alert on statistically rare source IPs.",
              "Use an Isolation Forest algorithm to detect anomalous administrative actions. The model is trained on a dataset of legitimate permission changes, with features like admin identity, source IP, target user, permission type, and timestamp. Malicious actions, being different, will be isolated with fewer partitions and flagged as anomalies."
            ]
          },
          {
            "description": "A sequence of events: (1) A new delegate permission is granted on a high-value mailbox. (2) The new delegate account successfully accesses the mailbox. (3) Within one hour of access, the same delegate account initiates authentication failures to other systems or engages in unusually large data transfers from the same source IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek dce_rpc.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Domain Controllers, Critical Application Servers, Network Core, Network Egress Points",
            "action": [
              "Create a stateful rule: (1) Detect a permission change on a high-value mailbox. (2) Within 24 hours, detect access to that mailbox by the new delegate. (3) Within 1 hour after access, detect a spike of authentication failures (Event ID 4625) or a successful RDP/DCE-RPC connection (Zeek rdp.log, dce_rpc.log) from the delegate's source IP to a different Tier 0 server. Trigger an alert on this completed sequence.",
              "After a delegate accesses a high-value mailbox, monitor the network traffic volume (bytes_out) from their source IP in Zeek conn.log. Compare this volume to their own 30-day historical baseline. If the data transferred in any 1-hour window exceeds the 99th percentile of their typical hourly transfer volume, flag it as potential data staging or exfiltration.",
              "Employ a sequence analysis model (e.g., Hidden Markov Model) trained on normal user behavior sequences (e.g., login -> read email -> access SharePoint). An anomalous sequence, such as 'grant permission to VIP -> login as delegate -> access VIP mailbox -> attempt RDP to domain controller', would have a very low probability under the trained model and be flagged as a suspicious lateral movement chain."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]