[
  {
    "information_requirement": "Is the adversary using an external proxy for command and control communications? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1090.002",
        "name": "External Proxy",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host matches a known malicious proxy, VPN, or anonymizer service indicator from a threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Network Gateways and Corporate DNS Resolvers",
            "action": [
              "Symbolic: Join Zeek conn.log destination IPs and Zeek dns.log queried domains with a threat intelligence feed of known proxy/VPN/TOR node indicators. Generate an alert for any observed match, including the source host, destination, and indicator details.",
              "Statistical: For each external destination Autonomous System Number (ASN), calculate the historical count of unique internal source hosts connecting to it over a 30-day baseline. Flag any destination ASN that experiences a sudden spike in new unique source hosts, defined as a 3-sigma deviation from the daily average, as it may indicate a newly leveraged proxy service.",
              "Machine Learning: Train a classification model, such as a Random Forest, using features from Zeek conn.log (e.g., duration, orig_bytes, resp_bytes, proto) and Zeek dns.log (e.g., TTL, query length) to predict if a connection is proxy-like. Use a labeled dataset of known benign traffic and known proxy traffic for training and flag connections with a high probability score."
            ]
          },
          {
            "description": "A process is created with a filename or file hash that matches a known external proxy or tunneling tool.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: Match the NewProcessName or hash from Windows Event ID 4688 against a curated list of known proxy tool names and hashes (e.g., htran, ngrok, chisel, plink). Generate an alert on any exact match.",
              "Statistical: Calculate the prevalence of each process name across the enterprise over a 30-day rolling window. Flag any process with a prevalence below a dynamic threshold (e.g., seen on fewer than 0.1% of hosts) for investigation, as it may represent a custom or rarely used proxy tool.",
              "Machine Learning: Train an anomaly detection model, such as an Isolation Forest, on process execution events using features like process name entropy, parent process name, and file path depth. Flag executions that the model scores as highly anomalous for manual review."
            ]
          },
          {
            "description": "A process is created with command-line arguments containing patterns indicative of network proxying or tunneling configuration.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: Use regular expressions to search command-line arguments in Windows Event ID 4688 for keywords and patterns such as '-listen', '-tran', '-proxy', '-R:', '-L:', or IP:port syntax. Alert on any matches.",
              "Statistical: Calculate the character-level entropy of command-line arguments for all executed processes. Establish a baseline entropy score for common processes. Flag executions where the command-line entropy exceeds the 98th percentile of the process's historical baseline, as this can indicate obfuscated scripts or parameters.",
              "Machine Learning: Use a Natural Language Processing (NLP) topic modeling technique like Latent Dirichlet Allocation (LDA) on the corpus of all command-line arguments. Identify topics related to network configuration and proxying. Flag new process executions whose command lines have a high probability of belonging to these suspicious topics."
            ]
          },
          {
            "description": "An outbound SSL/TLS connection exhibits a JA3 or JA3S fingerprint known to be associated with a specific proxy tool or C2 framework.",
            "data_sources": [
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Network Gateways",
            "action": [
              "Symbolic: Match JA3 and JA3S hashes extracted from Zeek ssl.log against a continuously updated threat intelligence list of fingerprints known to be used by commodity proxy tools (e.g., ngrok, chisel) and C2 frameworks (e.g., Cobalt Strike, Metasploit).",
              "Statistical: Establish a baseline of common JA3/JA3S hashes in the environment. Flag any JA3/JA3S hash that is new or has a very low prevalence (e.g., seen from < 5 hosts) and is connecting to a non-categorized or high-risk domain for further scrutiny.",
              "Machine Learning: Use unsupervised clustering (e.g., K-Means) on SSL/TLS session features including the JA3 hash, cipher suites, certificate details (issuer, duration), and SNI. Analyze clusters for groups of suspicious connections that do not match known-good traffic patterns, which could represent a new or unknown proxy tool."
            ]
          },
          {
            "description": "A process not typically network-aware (e.g., notepad.exe) or executing from a non-standard file path (e.g., C:\\Users\\Public\\) initiates an outbound network connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers, Egress Network Gateways",
            "action": [
              "Symbolic: Correlate Windows Event ID 4688 and Zeek conn.log data. Maintain an explicit allowlist of processes expected to make network connections. Alert on any process not on this list that initiates an external connection.",
              "Statistical: For each process name, build a baseline of its common parent processes. Flag any execution where the parent process deviates from this baseline (e.g., svchost.exe spawning from winword.exe) and is associated with external network activity.",
              "Machine Learning: Train a classifier to predict if a process execution is 'suspicious' based on a feature set including process name, parent process, command-line length, and file path characteristics (e.g., depth, location in user vs. system space). Flag executions classified as 'suspicious' that are subsequently linked to network connections."
            ]
          },
          {
            "description": "An outbound network flow exhibits characteristics of C2 beaconing, such as highly periodic connections, long durations with low data volume, or a significantly asymmetric data flow (high upload-to-download ratio).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Network Gateways",
            "action": [
              "Symbolic: Monitor Zeek weird.log for 'ssl_not_ssl', 'possible_split_routing', or 'http_on_unusual_port' notices, which can indicate tunneling or non-standard C2 protocols.",
              "Statistical: For each source-destination IP pair in Zeek conn.log, calculate the standard deviation of the time deltas between consecutive connections. A very low standard deviation indicates periodic beaconing. Separately, calculate the ratio of orig_bytes to resp_bytes; flag connections where this ratio exceeds 10:1 and the total volume is below a 10KB threshold.",
              "Machine Learning: Apply a time-series anomaly detection algorithm, such as Seasonal-Hybrid ESD (S-H-ESD), to the bytes-sent and bytes-received data streams for each internal host. Flag hosts that exhibit anomalous spikes or changes in their traffic patterns that are inconsistent with established daily and weekly seasonalities."
            ]
          },
          {
            "description": "A direct outbound connection on ports 80 or 443 is made from a user endpoint, where the destination IP is not the designated corporate web proxy and belongs to a public cloud, hosting, or VPN provider ASN.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoint Subnets, Egress Network Gateways",
            "action": [
              "Symbolic: Define the IP address(es) of the corporate web proxy. Create a rule to alert on any connection from a user subnet to an external destination on ports 80/443 that does not have the proxy IP as its destination.",
              "Statistical: Enrich all direct-connection destination IPs with ASN information. Maintain a 30-day baseline of connection counts to ASNs associated with cloud/hosting/VPN providers. Flag any host whose daily connection count to these ASNs exceeds 3 standard deviations above its own average.",
              "Machine Learning: Use a community detection algorithm, such as Louvain Modularity, on a graph where nodes are internal hosts and external IPs, and edges are connections. Investigate small, tightly-knit communities of internal hosts all connecting to the same non-mainstream external IP, as this could represent a shared C2 proxy."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]