[
    {
        "information_requirement": "Is the adversary maintaining persistence by modifying local or domain groups?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1098.007",
                "name": "Additional Local or Domain Groups",
                "evidence": [
                    {
                        "description": "A user account is added to a persistence-enabling group (e.g., Remote Desktop Users, Server Operators) by a subject user logged in from a known malicious IP address.",
                        "data_sources": [
                            "Windows Event ID 4732",
                            "Windows Event ID 4728",
                            "Windows Event ID 4756",
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Join successful logon events (Windows Event ID 4624, Type 10 for RDP) with network connection logs (Zeek conn.log) to identify the source IP addresses of active user sessions. Correlate these sessions with group addition events (Windows Event IDs 4732, 4728, 4756) performed by the same user account ('SubjectUserName'). Inner join the source IP of the active session with a high-confidence threat intelligence feed of malicious IPs. Alert on any group additions made by a user logged in from a known-malicious IP address."
                    },
                    {
                        "description": "A user is added to a sensitive group using a specific command-line pattern (e.g., 'net localgroup') spawned by a suspicious parent process.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for the execution of `net.exe` or `powershell.exe`. Analyze the command line arguments for patterns related to group membership modification (e.g., `net localgroup \"Remote Desktop Users\" ... /add`, `Add-LocalGroupMember`). Correlate these events with their parent process. Flag executions where the parent process is anomalous, such as a web server process (e.g., w3wp.exe), an Office application, or a PowerShell process running a heavily obfuscated or encoded command. Use correlation analysis to link the command to the suspicious parent."
                    },
                    {
                        "description": "A user or machine account is added to a group that grants remote access or administrative persistence (e.g., Remote Desktop Users, Server Operators, DnsAdmins) by an unauthorized or unexpected account.",
                        "data_sources": [
                            "Windows Event ID 4732",
                            "Windows Event ID 4728",
                            "Windows Event ID 4756"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor group addition events (4732 for local groups, 4728/4756 for domain groups). Maintain a baseline of accounts authorized to make changes to sensitive groups. Alert when the 'SubjectUserName' (the account making the change) is not on the authorized list, is a service account, or is a standard user account. Use descriptive statistics to identify accounts making an unusually high number of group changes or changes occurring outside of business hours, and use time series analysis to detect spikes in this activity."
                    },
                    {
                        "description": "An account recently added to a sensitive group is immediately used to create or modify another persistence mechanism, such as a scheduled task or service.",
                        "data_sources": [
                            "Windows Event ID 4732",
                            "Windows Event ID 4728",
                            "Windows Event ID 4698",
                            "Windows Event ID 7045"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a watchlist of user accounts that have recently been added to sensitive groups (identified via Event IDs 4732, 4728). Correlate this watchlist with subsequent events indicating scheduled task creation (4698) or new service installation (7045) performed by those same accounts. Use a short time window for correlation (e.g., within 1-24 hours of the group addition) to detect this sequence of behavior indicative of establishing layered persistence."
                    },
                    {
                        "description": "A machine account, after being added to a sensitive domain group, is used for anomalous resource access or lateral movement activity, deviating from its established baseline.",
                        "data_sources": [
                            "Windows Event ID 4728",
                            "Windows Event ID 4756",
                            "Windows Event ID 4624",
                            "Windows Event ID 4769",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify machine accounts (names ending in '$') added to sensitive domain groups (Event IDs 4728, 4756). Establish a baseline of normal activity for machine accounts (e.g., typical source/destination hosts for logons, typical Kerberos service tickets requested). Monitor for deviations after a group membership change, such as interactive logons (Event ID 4624, Type 2/10), logons to multiple workstations, or Kerberos service ticket requests (Event ID 4769, Zeek kerberos.log) for services outside their normal function (e.g., requesting tickets for administrative access to workstations)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Has the adversary elevated privileges by modifying local or domain groups?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1098.007",
                "name": "Additional Local or Domain Groups",
                "evidence": [
                    {
                        "description": "A user account is added to a high-privilege group (e.g., Administrators, Domain Admins) by a subject user account with a known suspicious or default name.",
                        "data_sources": [
                            "Windows Event ID 4732",
                            "Windows Event ID 4728",
                            "Windows Event ID 4756"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor group addition events (4732, 4728, 4756) where the 'TargetGroupName' is a high-privilege group. Compare the 'SubjectUserName' (the account making the change) against a maintained list of known default, temporary, or suspicious account names used by threat actors or penetration testing tools (e.g., 'test', 'admin', 'backup', 'support_388945a0', etc.). Alert on any matches indicating a potential compromise or use of a known malicious tool."
                    },
                    {
                        "description": "A user is added to a privileged group as part of a rapid, scripted sequence of events characteristic of an automated privilege escalation tool.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4732",
                            "Windows Event ID 4728"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and monitor for a rapid sequence of events on a host within a very short time window (e.g., less than 5 seconds): 1. A suspicious process starts (e.g., PowerShell with an encoded command, a generic name like 'svchost.exe' from an unusual directory). 2. That process immediately spawns `net.exe` or uses a PowerShell cmdlet to add a user to a privileged group (monitored via 4688 command lines and confirmed with 4732/4728). 3. The newly privileged user's token is used to spawn a new, higher-integrity process. Use correlation analysis of process (4688) and group management (4732/4728) events by time, host, and process ID to detect this automated pattern."
                    },
                    {
                        "description": "An account is added to a high-privilege group (e.g., 'Administrators', 'Domain Admins') by an account that is not a designated administrator, or the change occurs outside of an approved change window.",
                        "data_sources": [
                            "Windows Event ID 4732",
                            "Windows Event ID 4728",
                            "Windows Event ID 4756"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter all additions to high-privilege groups using Event IDs 4732, 4728, and 4756. Compare the 'SubjectUserName' against an explicit allowlist of authorized administrator accounts. Alert on any additions made by accounts not on this list. Additionally, use time series analysis to establish a baseline of when these changes normally occur (e.g., during business hours on weekdays); flag any additions that occur at anomalous times (e.g., 3 AM on a Sunday) as potential unauthorized privilege escalation."
                    },
                    {
                        "description": "An account, immediately after being added to a privileged group, is used to execute administrative commands, access the SAM database, or dump credentials.",
                        "data_sources": [
                            "Windows Event ID 4732",
                            "Windows Event ID 4728",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a temporary, high-priority watchlist of accounts immediately after they are added to a privileged group (via 4732, 4728). Monitor subsequent process creation events (4688) initiated by these accounts. Alert if these accounts execute commands indicative of consolidating privileged access, such as accessing the SAM registry hive, running credential dumping tools (e.g., mimikatz, though detected by process name/command), or using `wmic.exe` or `ntdsutil.exe` for sensitive operations within minutes of the privilege escalation."
                    },
                    {
                        "description": "An account, immediately after being added to a domain-level privileged group, is used for widespread lateral movement or to access the Kerberos Key Distribution Center (KDC).",
                        "data_sources": [
                            "Windows Event ID 4728",
                            "Windows Event ID 4756",
                            "Windows Event ID 4624",
                            "Zeek conn.log",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify accounts added to groups like 'Domain Admins' or 'Enterprise Admins' (via 4728, 4756). Monitor for subsequent network logons (Event ID 4624 Type 3) from that account to a high number of distinct hosts in a short period. Use entropy measures on the destination host names to detect widespread, non-targeted access. Additionally, monitor Zeek kerberos.log for Kerberos TGT or TGS requests from the newly privileged account targeting the krbtgt service or other sensitive Service Principal Names (SPNs), indicating an attempt to forge tickets (Golden/Silver Ticket attacks)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
