[
  {
    "information_requirement": "Has the adversary gained initial access via replication through removable media?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1091",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable's path originates from a removable drive volume, and the file's SHA256 hash is present in a known-malware threat intelligence feed.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices (workstations, laptops), Kiosks and shared-use terminals, Physical entry points to sensitive or air-gapped networks, Visitor check-in stations",
            "action": [
              "For each process creation event (Sysmon Event ID 1) where the process image path is on a removable drive, calculate the file's SHA256 hash. Query the hash against all subscribed threat intelligence feeds. Generate a critical alert for any match.",
              "Calculate the enterprise-wide prevalence (count of unique hosts) for the hash of every executable launched from removable media over the last 90 days. Flag any executable whose hash prevalence falls below the 1st percentile for investigation as a potentially rare or targeted tool.",
              "Apply a pre-trained classification model (e.g., XGBoost, Random Forest) to feature vectors extracted from each removable media process execution. Features should include file entropy, PE header details (imports, sections), command-line arguments, parent process name, and user context. Flag executions that receive a 'malicious' probability score greater than 0.9 for analyst review."
            ]
          },
          {
            "description": "A file creation event (Sysmon Event ID 11) for 'autorun.inf' or a Link file (.lnk) is observed on a removable drive volume. Alternatively, a process creation event (Sysmon Event ID 1) is observed where the executed file has 'Hidden' and/or 'System' attributes set.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices with enabled USB ports, Systems used for imaging or deploying software, Vendor maintenance laptops",
            "action": [
              "Create a rule to alert on any file creation event (Sysmon Event ID 11) on a removable drive with the filename 'autorun.inf'. For .lnk file creations, parse the file to extract the target path and command line arguments; alert if the target is an executable or script located on the same removable media.",
              "For each file created on removable media (Sysmon Event ID 11), calculate the character-level entropy of the filename. Establish a baseline of typical filename entropy per user. Alert when a created filename's entropy exceeds the 99th percentile of the user's baseline, suggesting a randomized or obfuscated name.",
              "Apply an Isolation Forest model to file creation events on removable media. Use features such as filename length, filename entropy, file extension, parent process name, and time of day. Investigate file creations identified by the model as strong anomalies, as they may represent suspicious file staging."
            ]
          },
          {
            "description": "A process creation event (Sysmon Event ID 1) from a removable drive volume is observed within 60 seconds of a corresponding device connection event (e.g., Kernel-PnP Event ID 400), and the parent process is not 'explorer.exe' or another authorized shell process.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 400",
              "Microsoft-Windows-Kernel-PnP/Configuration Event ID 410",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoint devices, High-security area workstations, Server room physical access points, Industrial Control System (ICS) Human-Machine Interfaces (HMIs)",
            "action": [
              "Correlate a PnP device connection event (Kernel-PnP Event ID 400 or 410) with a subsequent process creation event (Sysmon Event ID 1) from the corresponding drive letter. If the time delta is less than 60 seconds and the parent process is not 'explorer.exe' or another authorized shell, generate an alert for potential Autorun activity.",
              "For each user, baseline the distribution of time deltas between USB insertion and the first process execution from that device. Flag any execution that falls into an anomalous time window (e.g., < 5th percentile of the user's typical interaction time), suggesting automated execution rather than manual user interaction.",
              "Apply a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the rate of process executions from removable media per host. Correlate detected anomalies (spikes) with recent device connection events. A spike immediately following a connection is highly indicative of an Autorun-based event."
            ]
          },
          {
            "description": "A process, whose ancestor process originated from a removable drive, performs one or more of the following actions: 1) Initiates an external network connection (Sysmon Event ID 3), 2) Modifies a common persistence registry key (Sysmon Event ID 13), or 3) Writes a file to a sensitive system directory like %SystemRoot%\\System32 (Sysmon Event ID 11).",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Sysmon Event ID 11",
              "Sysmon Event ID 13",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers (for authentication logs), Network egress points (for C2 traffic), All endpoint devices, DNS Resolvers",
            "action": [
              "For any process launched from removable media, track its process GUID (via Sysmon Event ID 1). Trigger an alert if this process GUID is associated with a subsequent network connection to a known-bad IP/domain (Sysmon Event ID 3 enriched by Zeek conn.log), a modification to a registry autorun key (Sysmon Event ID 13), or the creation of an executable file in %SystemRoot% (Sysmon Event ID 11).",
              "For each process launched from removable media, build a risk score based on its child activities. Assign points for: initiating a network connection (Zeek conn.log) to a destination country not seen in the user's last 30 days; making a DNS request (Zeek dns.log) for a domain with high entropy; creating a child process like 'powershell.exe' or 'wscript.exe'. Alert if the total score exceeds the 99th percentile of scores observed from benign processes.",
              "Model process activity as a tree where the root is the process from the removable drive. Extract features from the tree (e.g., depth, breadth, node types like 'NetworkConnection', 'RegistryWrite'). Use a pre-trained tree-based classification model (like Random Forest) to classify the entire activity tree as malicious or benign. Flag trees classified as malicious with high confidence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary replicating or moving laterally using removable media?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1091",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A file is written to a removable drive (Sysmon Event ID 11) on a corporate endpoint, and the file's SHA256 hash matches an entry in a threat intelligence feed for known malware.",
            "data_sources": [
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal workstations, File servers, Jump boxes, Systems in secure network enclaves",
            "action": [
              "Upon a file creation event on a removable drive (Sysmon Event ID 11), hash the file in near-real-time. Correlate the hash against a threat intelligence database. Generate a high-severity alert if a match is found, indicating a compromised host is attempting to stage malware for lateral movement.",
              "Monitor the rate at which hosts write executable files (.exe, .dll, .scr) to removable media. Establish a baseline for each host/user. Alert when a host's rate exceeds a predefined statistical threshold (e.g., 3 standard deviations above its mean, or > 95th percentile for the organization), suggesting automated replication behavior.",
              "Apply a pre-trained file classifier (e.g., based on LightGBM) to every executable file written to removable media. Use features like file entropy, PE import hash, file size, and the name of the writing process. Alert on any file classified as malicious with a probability > 0.9, indicating potential staging of a novel malware variant."
            ]
          },
          {
            "description": "A file creation event (Sysmon Event ID 11) on a removable drive is observed for 'autorun.inf'. Separately, an executable file (.exe, .scr) is written to a removable drive with a filename containing a double extension (e.g., 'document.pdf.exe') or a right-to-left-override (RTLO) character.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal workstations and servers with USB access, Shared departmental file shares (as a source for files being copied)",
            "action": [
              "Create a rule to alert on any file creation event (Sysmon Event ID 11) on a removable drive for the filename 'autorun.inf'. Create a separate rule to detect filenames containing the Unicode RTLO character (U+202E) or common double extensions (e.g., '.pdf.exe', '.doc.scr').",
              "Analyze the filenames of executables written to removable media. Calculate the Levenshtein distance between the filename (without extension) and common document-related terms ('report', 'invoice', 'resume'). Flag files with a low distance but an executable extension as suspicious.",
              "Use clustering algorithms (e.g., DBSCAN) on the feature vectors of files written to removable drives (e.g., filename entropy, file entropy, PE import hashes). Identify clusters of anomalous files that may represent a single malware family replicating itself with slight variations in filenames or packing."
            ]
          },
          {
            "description": "A file hash, first observed being written to a removable drive on Host_A (Sysmon Event ID 11), is later observed being executed from a removable drive on a different host, Host_B (Sysmon Event ID 1).",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 1",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal network segments containing multiple workstations or servers, Systems with high user mobility (e.g., shared operations centers), Air-gapped network transfer stations",
            "action": [
              "Maintain a state table of file hashes written to removable media (from Sysmon Event ID 11), including (Hash, SourceHost, Timestamp). For every process execution from removable media (Sysmon Event ID 1), query this table for the process's hash. If a match is found where ExecutingHost != SourceHost, generate a high-confidence alert for lateral movement via removable media.",
              "Construct a directed graph where nodes are hosts and edges represent a file hash moving between them via removable media. Analyze the graph for nodes with an unusually high out-degree (a spreader) or in-degree (a frequent victim). Use centrality metrics like PageRank to identify influential spreaders in a widespread propagation scenario.",
              "Train a sequence model (e.g., LSTM) on pairs of events: (file write to USB, process execute from USB). Features should include the user, source host, destination host, and time delta. Flag sequences where the destination host is not a typical target for the source user/host (e.g., Finance user's file executing on an Engineering host) as anomalous."
            ]
          },
          {
            "description": "A process originating from a removable drive (Sysmon Event ID 1) or its descendants initiates network connections (Sysmon Event ID 3) to more than 10 other internal hosts on ports 139, 445, or 3389 within a 5-minute window. Alternatively, the host generates a high volume of failed network logon events (Windows Event ID 4624, Logon Type 3) in the same timeframe.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, Authentication servers (Domain Controllers), Network sensor tap points",
            "action": [
              "For a process originating from a removable drive (Sysmon Event ID 1), correlate its ProcessGUID with subsequent network connections (Sysmon Event ID 3). Alert if this process or its children connect to more than 10 unique internal hosts on port 445 (SMB) within 5 minutes.",
              "For processes launched from removable media, baseline the number of distinct internal IPs and unique destination ports they connect to within 15 minutes of execution. Alert if a process exceeds the 98th percentile for either of these metrics, indicating potential network scanning or worm-like propagation.",
              "Use a time-series model to analyze the rate of failed network logon events (Windows Event ID 4624, Logon Type 3, Failure Status not '0xC0000064') per source host. If a process execution from removable media is temporally correlated with a significant, anomalous spike in failed logons originating from that host, flag it as a likely credential-based lateral movement attempt."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]