[
  {
    "information_requirement": "Is the adversary maintaining persistence using additional email delegate permissions?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1098.002",
        "name": "Additional Email Delegate Permissions",
        "evidence": [
          {
            "description": "A mailbox permission modification event (e.g., Add-MailboxPermission, Set-MailboxFolderPermission) where the source user account executing the change or the target user account receiving the permission is present on a high-risk watchlist.",
            "data_sources": [
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Domain Controllers",
            "action": [
              "Symbolic: Create a rule that analyzes PowerShell Script Block Logs (Windows Event ID 4104) and Microsoft 365 Unified Audit Logs for mailbox permission modification operations. The rule should trigger an alert if the actor's user principal name or the target mailbox's user principal name is found on a pre-defined watchlist of compromised or high-risk accounts.",
              "Statistical: For all accounts, calculate the historical frequency of performing mailbox permission changes over a 90-day baseline. Flag any account that executes these changes at a rate exceeding the 95th percentile of its own or its peer group's historical activity, as this indicates a behavioral anomaly.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features such as the actor's role, the target's role, time of day, source IP reputation, and a binary flag for watchlist presence. Use this model to assign a risk score to each permission change event, alerting on events with a score indicating a high probability of maliciousness."
            ]
          },
          {
            "description": "The execution of a mailbox permission change command that grants 'FullAccess' rights, or assigns any level of permission to a user account that is newly created (e.g., <30 days old) or is a non-interactive service account.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Identity and Access Management (IAM) systems",
            "action": [
              "Symbolic: Create a SIEM rule to parse PowerShell logs (Event ID 4104) and Microsoft 365 audit logs for permission change events. Generate an alert if the 'Rights' parameter contains 'FullAccess', or if the target user account's creation timestamp is less than 30 days old, or if the target account is categorized as a service account.",
              "Statistical: For each administrator, calculate the Shannon entropy of the types of permissions they grant over a 30-day window. A sudden, sharp decrease in entropy (e.g., repeatedly granting only 'FullAccess') can indicate scripted or automated activity. Alert if an admin's permission entropy score drops more than 2 standard deviations below their individual baseline.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., ARIMA) on the stream of permission change events for the organization. The model learns normal daily/weekly patterns of changes (volume, rights types). An alert is generated when a cluster of events, such as multiple 'FullAccess' grants in a short period, significantly deviates from the forecasted pattern."
            ]
          },
          {
            "description": "A sequence of events where a mailbox receives new delegate permissions, followed shortly by mailbox access from a source IP or device never before associated with that mailbox's typical access patterns.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, VPN Concentrators, Network Firewalls/Gateways",
            "action": [
              "Symbolic: Correlate permission change events (Event ID 4104, M365 UAL) with subsequent mailbox access logs (Event ID 4624, Azure AD Sign-in Logs) within a 60-minute window. If the source IP of the subsequent access by the new delegate does not appear in the last 90 days of access history for the original mailbox owner, generate an alert.",
              "Statistical: For each user, maintain a statistical profile of their access locations (countries, ASNs). After a new delegate is added to a mailbox, score the new delegate's first access location based on its rarity for the original user's profile. If the location's rarity score is in the top 5th percentile (e.g., a country never seen before for that user context), flag the access for review.",
              "Machine Learning: Employ an unsupervised learning model (e.g., K-Means clustering) to group a user's typical access events into 'normal' clusters based on features like IP geolocation, user agent, time of day, and ASN. When a new delegate accesses the mailbox, if their access event does not fall into any of the pre-established 'normal' clusters for that mailbox, classify it as an anomaly and alert."
            ]
          },
          {
            "description": "An account with newly delegated permissions sends email from the delegated mailbox with characteristics (e.g., high volume, unusual recipient domains, anomalous time-of-day) that deviate significantly from the historical sending patterns of the original mailbox owner.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log",
              "Microsoft 365 Message Trace Logs",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, On-premises Exchange Servers, Microsoft 365 Tenancy, Network Egress Points",
            "action": [
              "Symbolic: After a delegation event, monitor outbound email logs (M365 Message Trace, Zeek smtp.log) from the delegated mailbox. Trigger an alert if more than 100 internal emails are sent to recipients not in the original owner's typical contact graph within a 1-hour period, suggesting an internal spearphishing campaign.",
              "Statistical: For each mailbox, establish a 30-day rolling baseline of outbound email activity including average daily volume and recipient domain distribution. After a delegation event, if the sending volume from that mailbox exceeds 3 standard deviations above the baseline mean, or if the Jaccard similarity between the set of new recipient domains and the baseline domains drops below 0.2, flag the activity as anomalous.",
              "Machine Learning: Use a time-series forecasting model (e.g., Prophet) to predict the expected volume and flow of emails from a given mailbox. After a delegation event, compare the actual email activity against the forecast. A significant and sustained deviation in the residual error (actual vs. predicted) indicates a change in behavior and should generate an alert for potential misuse."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting privilege escalation using additional email delegate permissions?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1098.002",
        "name": "Additional Email Delegate Permissions",
        "evidence": [
          {
            "description": "A mailbox permission change where the target mailbox belongs to a user in a high-privilege group (e.g., Domain Admins, C-suite) and the permissions are granted by an account on a watchlist of suspicious or recently compromised accounts.",
            "data_sources": [
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Domain Controllers",
            "action": [
              "Symbolic: Create a high-severity SIEM rule that triggers on any mailbox permission change event where the target mailbox user is a member of a 'High-Value Target' group (e.g., 'Domain Admins', 'C-Suite') AND the actor performing the change is on a 'Suspicious Accounts' watchlist.",
              "Statistical: Calculate a risk score for every permission change event using a weighted sum: $$ RiskScore = w_1 * (IsTargetPrivileged) + w_2 * (IsActorSuspicious) + w_3 * (PermissionRarity) $$. An event where a suspicious actor grants 'FullAccess' to a privileged account would receive a high score. Alert on any event with a score exceeding the 99th percentile of all historical event scores.",
              "Machine Learning: Use a graph-based anomaly detection model on the organization's identity graph. The creation of an improbable 'has-permission-on' edge from a low-privileged or suspicious user node to a high-centrality, privileged user node (e.g., CEO, Domain Admin) would be flagged as a likely privilege escalation attempt."
            ]
          },
          {
            "description": "A mailbox permission change event where the actor account is the same as the account being granted permissions, but the target mailbox belongs to a different user, particularly a user with higher privileges.",
            "data_sources": [
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy",
            "action": [
              "Symbolic: Parse PowerShell logs (Event ID 4104) and M365 audit logs. Create a rule that alerts when the actor identity is identical to the identity being granted permissions but is different from the target mailbox owner's identity. Increase severity if the target mailbox owner is a member of a privileged group.",
              "Statistical: For each user who executes permission changes, calculate the ratio of self-granted permissions to permissions granted to others. A user who normally never self-grants permissions but suddenly does so would have a ratio spike from 0 to 1. Flag any user whose self-granting ratio deviates by more than 2 standard deviations from their personal or peer-group baseline.",
              "Machine Learning: Train a binary classifier (e.g., Logistic Regression) to distinguish between legitimate and illegitimate self-granted permissions. Features would include: source IP, time of day, target mailbox owner's role, actor's role, and historical frequency of this action by the actor. An event classified as 'illegitimate' with high confidence would trigger an alert."
            ]
          },
          {
            "description": "A non-administrative user account executing mailbox permission change commands, or a legitimate administrative account performing such changes outside of normal business hours or from an unusual source system.",
            "data_sources": [
              "Windows Event ID 4104",
              "Windows Event ID 4688",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, SIEM/Log Management Platform",
            "action": [
              "Symbolic: Maintain a list of authorized Exchange administrator accounts. Create a rule to alert on any mailbox permission change command executed by a user not on this list. For users on the list, create a secondary rule that alerts if the action is performed from a source IP not on an approved list of management subnets.",
              "Statistical: For each authorized administrator, establish a baseline of their activity time-of-day using a 24-hour histogram. Alert if a permission change occurs during a time window that falls in the lowest 10th percentile of their historical activity (e.g., 3 AM for an admin who only works 9-5). Similarly, baseline source IPs and alert on statistically rare source IPs.",
              "Machine Learning: Use an Isolation Forest algorithm to detect anomalous administrative actions. The model is trained on a dataset of legitimate permission changes, with features like admin identity, source IP, target user, permission type, and timestamp. Malicious actions, being different, will be isolated with fewer partitions and flagged as anomalies."
            ]
          },
          {
            "description": "An account accesses a newly delegated high-value mailbox, followed by anomalous network activity from that same account's source IP, such as authentication attempts to other critical systems or large data transfers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek rdp.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premises Exchange Servers, Microsoft 365 Tenancy, Domain Controllers, Critical Application Servers, Network Core",
            "action": [
              "Symbolic: Create a stateful rule: (1) Detect a permission change on a high-value mailbox. (2) Within 24 hours, detect access to that mailbox by the new delegate. (3) Within 1 hour after access, detect an authentication failure (Event ID 4625) or a successful RDP connection (Zeek rdp.log) from the delegate's source IP to a different Tier 0 server. Trigger an alert on this completed sequence.",
              "Statistical: After a delegate accesses a high-value mailbox, monitor the network traffic volume (bytes_out) from their source IP in Zeek conn.log. Compare this volume to their own 30-day historical baseline. If the data transferred in any 1-hour window exceeds the 99th percentile of their typical hourly transfer volume, flag it as potential data staging or exfiltration.",
              "Machine Learning: Employ a sequence analysis model (e.g., Hidden Markov Model) trained on normal user behavior sequences (e.g., login -> read email -> access SharePoint). An anomalous sequence, such as 'grant permission to VIP -> login as delegate -> access VIP mailbox -> attempt RDP to domain controller', would have a very low probability under the trained model and be flagged as a suspicious lateral movement chain."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]