[
  {
    "information_requirement": "Is the adversary using an external proxy for command and control communications? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1090.002",
        "name": "External Proxy",
        "evidence": [
          {
            "description": "An outbound network connection's destination IP address, domain name, or port matches an entry on a threat intelligence feed of known proxy, VPN, or anonymization services.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Network Gateways and Corporate DNS Resolvers",
            "action": [
              "Symbolic: Continuously join Zeek conn.log destination IPs (id.resp_h) and Zeek dns.log queried domains (query) against a threat intelligence feed of known malicious proxy/VPN/TOR node indicators. Generate an alert for any observed match, including the source host, destination, and indicator details.",
              "Statistical: For each external destination Autonomous System Number (ASN), calculate the historical count of unique internal source hosts connecting to it over a 30-day baseline. Flag any destination ASN that experiences a sudden spike in new unique source hosts, defined as a value exceeding the 99th percentile or a 3-sigma deviation from the daily average, as it may indicate a newly leveraged proxy service.",
              "Machine Learning: Train a classification model (e.g., Random Forest, Gradient Boosting) to predict if a connection is proxy-like. Use a labeled dataset of known benign and proxy traffic, with features from Zeek conn.log such as duration, orig_bytes, resp_bytes, proto, and destination port, and from Zeek dns.log such as TTL and query length. Flag connections with a high probability score for review."
            ]
          },
          {
            "description": "A process is created with a file hash or filename that matches a known external proxy or tunneling tool (e.g., ngrok, chisel, htran).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: Match the ProcessName/NewProcessName or file hash (SHA256, MD5) from Windows Event ID 4688 or Sysmon Event ID 1 against a curated list of known proxy tool names and hashes. Generate an alert on any exact match.",
              "Statistical: Calculate the prevalence of each process name (e.g., 'ngrok.exe') across the enterprise over a 30-day rolling window. Flag any process with a prevalence below a dynamic threshold (e.g., seen on fewer than 0.1% of hosts or < 5 hosts total) for investigation, as it may represent a custom or rarely used proxy tool.",
              "Machine Learning: Train an anomaly detection model, such as an Isolation Forest, on process execution events. Use features like process name entropy, parent process name, file path depth, and whether the process is signed. Flag executions that the model scores as highly anomalous for manual review as potential unknown proxy tools."
            ]
          },
          {
            "description": "A process is created with command-line arguments containing keywords, switches, or syntax characteristic of establishing a network proxy or tunnel.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: Scan command-line arguments in Windows Event ID 4688 or Sysmon Event ID 1 using regular expressions for patterns like '-listen', '-tran', '-proxy', '-R:[0-9]{1,5}:', '-L:[0-9]{1,5}:', 'c:s', 'c:c', or IP:port syntax. Alert on any matches.",
              "Statistical: Calculate the character-level entropy of command-line arguments for all executed processes. Establish a baseline entropy score for common enterprise processes (e.g., svchost.exe). Flag executions where the command-line entropy exceeds the 98th percentile of that process's historical baseline, as this can indicate obfuscated scripts or packed arguments.",
              "Machine Learning: Use a Natural Language Processing (NLP) topic modeling technique like Latent Dirichlet Allocation (LDA) on the corpus of all command-line arguments. Identify topics related to network configuration, remote access, and proxying. Flag new process executions whose command lines have a high probability of belonging to these suspicious topics."
            ]
          },
          {
            "description": "An outbound SSL/TLS connection's JA3 or JA3S fingerprint hash matches a known fingerprint associated with a malicious or proxying tool.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Network Gateways",
            "action": [
              "Symbolic: Match JA3 and JA3S hashes extracted from Zeek ssl.log against a continuously updated threat intelligence list of fingerprints known for commodity proxy tools (e.g., ngrok, chisel) and C2 frameworks (e.g., Cobalt Strike, Metasploit).",
              "Statistical: Establish a baseline of common JA3/JA3S hashes in the environment over 30 days. Flag any JA3/JA3S hash that is new or has a very low prevalence (e.g., seen from < 0.05% of hosts) and is connecting to a non-categorized or high-risk domain for further scrutiny.",
              "Machine Learning: Use unsupervised clustering (e.g., K-Means, DBSCAN) on SSL/TLS session features. Join Zeek ssl.log with x509.log and include the JA3 hash, cipher suites, certificate issuer, certificate validity period, and Server Name Indication (SNI). Analyze clusters for groups of suspicious connections that do not match known-good traffic patterns, which could represent a new or unknown proxy tool."
            ]
          },
          {
            "description": "A process that does not normally initiate network connections, or is running from an unusual file path, makes an outbound network connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers, Egress Network Gateways",
            "action": [
              "Symbolic: Correlate Sysmon Event ID 3 (Network Connection) with process information. Maintain an explicit allowlist of processes expected to make network connections (e.g., chrome.exe, outlook.exe). Alert on any process not on this list that initiates an external connection, especially from non-standard paths like C:\\Temp\\ or C:\\Users\\Public\\.",
              "Statistical: For each process name, establish a baseline of its network behavior over 30 days, including the number of distinct destination ports and destination ASNs. Flag a process execution as anomalous if it communicates on a port it has never used before or if it connects to a destination ASN not seen in its baseline.",
              "Machine Learning: Train a classifier (e.g., Logistic Regression) to predict if a process execution is 'suspicious' based on a feature set including process name, parent process, command-line length, and file path characteristics (e.g., depth, location in user vs. system space). Flag executions classified as 'suspicious' that are subsequently linked to network connections via Sysmon Event ID 3."
            ]
          },
          {
            "description": "An outbound network flow's inter-arrival time, connection duration, or data volume ratio (bytes sent vs. received) is anomalous when compared to an established baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Network Gateways",
            "action": [
              "Symbolic: Monitor Zeek weird.log for notices such as 'ssl_not_ssl', 'possible_split_routing', or 'http_on_unusual_port', and correlate with connection logs to identify hosts exhibiting protocol tunneling or evasion.",
              "Statistical: For each source-destination IP pair in Zeek conn.log, calculate the standard deviation of the time deltas between consecutive connections over a 24-hour window. A standard deviation near zero indicates highly periodic beaconing. Separately, calculate the ratio of orig_bytes to resp_bytes; flag connections where this ratio exceeds a 10:1 threshold and the total volume is below 10KB.",
              "Machine Learning: Apply a time-series anomaly detection algorithm (e.g., S-H-ESD, Prophet) to the aggregated bytes-sent and bytes-received data streams for each internal host. Flag hosts that exhibit anomalous spikes or changes in their traffic patterns that are inconsistent with established daily and weekly seasonalities."
            ]
          },
          {
            "description": "A direct outbound connection on TCP/80 or TCP/443 from a user endpoint does not go to the designated corporate web proxy, and the destination IP resolves to a public cloud, hosting, or VPN provider's ASN.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoint Subnets, Egress Network Gateways, DNS Resolvers",
            "action": [
              "Symbolic: Define the IP address range of corporate web proxies. Create a rule to alert on any connection from a user subnet to an external destination on ports 80 or 443 that does not have a proxy IP as its destination.",
              "Statistical: Enrich all direct-connection destination IPs with ASN information. Maintain a 30-day baseline of connection counts to ASNs associated with public cloud, hosting, or VPN providers. Flag any host whose daily connection count to these ASNs exceeds 3 standard deviations above its own average.",
              "Machine Learning: Use a community detection algorithm (e.g., Louvain Modularity) on a graph where nodes are internal hosts and external IPs, and edges represent connections. Investigate small, tightly-knit communities of internal hosts all connecting to the same non-mainstream external IP, as this could represent a shared C2 proxy infrastructure."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]