[
  {
    "information_requirement": "Is the adversary establishing persistent access by registering devices? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1098.005",
        "name": "Device Registration",
        "evidence": [
          {
            "description": "A successful device registration request to an identity provider's registration endpoint where the source IP address is present on a threat intelligence feed or the HTTP User-Agent string matches a known malicious tool signature.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Azure AD Audit Logs",
              "Azure AD Signin Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Cloud Identity Provider (IdP) consoles (e.g., Azure AD, Okta, Duo), VPN concentrators",
            "action": [
              "Symbolic: Join Zeek conn.log with a threat intelligence feed of known malicious IP addresses. Alert when a source IP associated with a successful connection to a known device registration endpoint (e.g., enterpriseregistration.windows.net) matches the feed.",
              "Statistical: For each source IP making a device registration request, calculate the rarity of its ASN and geolocation compared to the historical baseline of all registration requests over the last 90 days. Flag IPs originating from ASNs or countries in the bottom 5th percentile of frequency.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) on labeled historical registration data, using features such as source IP geolocation, ASN, time of day, and User-Agent string. Use the model to predict the probability of a new registration event being malicious in real-time."
            ]
          },
          {
            "description": "A successful device registration where the registered device name exhibits high character entropy, is inconsistent with organizational naming conventions, or matches a regular expression pattern for known malicious toolkits.",
            "data_sources": [
              "Zeek http.log",
              "Azure AD Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider (IdP) audit logs, Network decryption points (SSL/TLS inspection)",
            "action": [
              "Symbolic: From Azure AD Audit Logs for 'Add device' events, or from decrypted HTTP POST data in Zeek http.log, apply regular expressions to the device name field to detect known malicious patterns or lack of adherence to organizational naming policy. Alert on matches.",
              "Statistical: For each new device registration, calculate the Shannon entropy of the device name string. Establish a baseline distribution of entropy scores for legitimate device names. Alert on new registrations where the device name's entropy score exceeds the 95th percentile of the baseline.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., ARIMA) on the volume of device registrations grouped by device name patterns. A sudden spike in registrations with a new, previously unseen pattern could indicate a scripted attack."
            ]
          },
          {
            "description": "A successful device registration for a user account that is preceded by multiple failed login attempts (e.g., Windows Event ID 4625) for the same account, and/or originates from a geographic location or ISP that is anomalous for that specific user.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Azure AD Signin Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Active Directory Domain Controllers), Cloud Identity Provider (IdP) sign-in logs, VPN concentrators",
            "action": [
              "Symbolic: Create a rule that triggers when a successful device registration event for a user is preceded by more than 5 failed login events (Windows Event ID 4625 or Azure AD signin failure) for the same user within the last 15 minutes.",
              "Statistical: For each user, maintain a historical profile of successful registration geolocations, ASNs, and times of day. For each new registration, calculate a risk score based on deviations from the user's established norms. Alert when the cumulative score exceeds a predefined threshold.",
              "Machine Learning: Develop a one-class SVM (Support Vector Machine) model for each user based on their historical registration features (IP, geolocation, time, User-Agent). Classify each new registration event; events that fall outside the learned 'normal' boundary are flagged as anomalous."
            ]
          },
          {
            "description": "The rate of successful device registrations for a single user account, or from a single source IP address, exceeds a statistically determined threshold within a defined time window (e.g., more than 2 devices in 1 hour).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Azure AD Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider (IdP) audit logs, Internet gateway",
            "action": [
              "Symbolic: Create a SIEM rule to count device registration events (e.g., Azure AD Audit Log event 'Add device') per user and per source IP. Alert if the count for any user exceeds 2 within 1 hour, or if the count for any source IP exceeds 5 across all users within 1 hour.",
              "Statistical: Calculate the rolling average and standard deviation of device registration events per hour for the entire organization. Alert when the number of registrations in the current hour exceeds 3 standard deviations above the rolling average.",
              "Machine Learning: Implement a time-series forecasting model (e.g., Prophet) on the overall device registration volume. Continuously compare the actual registration count against the model's forecast. An actual count that consistently exceeds the upper bound of the forecast's confidence interval indicates an anomalous spike."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary elevating privileges or bypassing policies by registering devices? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1098.005",
        "name": "Device Registration",
        "evidence": [
          {
            "description": "Within 24 hours of a successful device registration, the device's assigned internal IP address initiates an outbound connection to an IP address or resolves a domain name present on a C2 threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, DNS resolvers, Endpoint devices",
            "action": [
              "Symbolic: Maintain a dynamic list of internal IP addresses assigned to devices registered in the last 24 hours. Join Zeek dns.log records originating from these IPs with a CTI feed of malicious domains. Alert on any match.",
              "Statistical: For newly registered devices, analyze the distribution of requested TLDs (Top-Level Domains) in Zeek dns.log. Flag any device that requests domains from TLDs known for malicious use (e.g., .xyz, .top) at a rate significantly higher than the organizational baseline.",
              "Machine Learning: Use a pre-trained DGA (Domain Generation Algorithm) detection model to score all DNS queries from newly registered devices. A high DGA score for a resolved domain indicates a likely C2 connection and should trigger an alert."
            ]
          },
          {
            "description": "A user account, operating from a newly registered device, accesses a predefined set of more than 3 high-value applications or data shares with inter-request timings of less than 1 second, indicating scripted access.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web servers hosting sensitive applications, File servers, Internal network segments",
            "action": [
              "Symbolic: Define a set of 'crown jewel' application URLs or server IPs. Create a rule that alerts when an IP associated with a device registered in the last 24 hours makes successful connections to >3 of these resources within a 5-minute window.",
              "Statistical: For each user, baseline the typical time delta between requests to different internal applications. For a newly registered device, calculate the time deltas between resource accesses. Flag sessions where the median time delta is below the 1st percentile of the user's historical baseline.",
              "Machine Learning: Model user-application access sequences using a Markov chain, where each state is an application and transition probabilities are learned from historical data. If the observed sequence from a new device has a very low probability under the user's model, flag it as anomalous."
            ]
          },
          {
            "description": "A specific user-resource access attempt results in a success, where historical logs for the same user-resource pair from a different device show only failures, and this change in access occurs within 24 hours of a new device registration for that user.",
            "data_sources": [
              "Zeek http.log",
              "Azure AD Signin Logs",
              "Azure AD Conditional Access Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider (IdP) conditional access policy logs, Web application firewalls (WAFs), Authentication servers",
            "action": [
              "Symbolic: For a user who just registered a new device, query their Azure AD Sign-in logs. Alert if a successful login to a resource (conditionalAccessStatus == 'success') occurs from the new device, where all previous attempts to that same resource resulted in failure.",
              "Statistical: For each user, maintain a set of resources they are typically denied access to. After a new device registration, monitor for successful access to any resource in this 'denied set'. Any single occurrence should be flagged for review due to its low probability.",
              "Machine Learning: Train a model for each user that predicts the probability of successful access to a given resource based on device context (compliance status, IP, etc.). If the model predicts a low probability of success but the event is a success from a new device, flag it as a potential policy bypass."
            ]
          },
          {
            "description": "An IP address associated with a newly registered device initiates connections to more than 20 unique internal hosts on common administrative ports (22, 3389, 5985) within a 10-minute window, a behavior indicative of internal reconnaissance.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, Endpoint devices, Network core switches",
            "action": [
              "Symbolic: From an IP tagged as a newly registered device, monitor Zeek conn.log for connections to destination ports 22, 135, 445, 3389, 5985, 5986 on internal IP ranges. Alert if connections are attempted to more than 10 distinct internal hosts within 5 minutes.",
              "Statistical: For an IP tagged as a newly registered device, calculate the entropy of the destination IP addresses it connects to within a 1-minute sliding window using Zeek conn.log. An entropy score significantly higher than the baseline for typical workstations indicates network scanning.",
              "Machine Learning: Create a network behavior profile for a 'standard workstation' using features like protocol distribution, number of peers, and bytes sent/received. Use an anomaly detection algorithm (e.g., Isolation Forest) to score the behavior of newly registered devices against this profile. High anomaly scores indicate behavior inconsistent with a normal workstation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]