[
  {
    "information_requirement": "Is the adversary leveraging legitimate external web services (dead drop resolvers) for command and control communications? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1102.001",
        "name": "Dead Drop Resolver",
        "evidence": [
          {
            "description": "An internal host connects to a URI on a known content-hosting platform (e.g., GitHub, Pastebin), and within a 5-minute window, initiates a new network connection to a destination that is either on a threat intelligence list, has a low reputation score, or is a newly registered domain (registered < 30 days ago).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Corporate DNS Servers, Web Proxy Servers",
            "action": [
              "Create a stateful rule that joins Zeek http.log, conn.log, and a threat intelligence feed of malicious C2 IPs/domains. Trigger an alert if a source IP connects to a URI on a predefined list of resolver platforms (e.g., pastebin.com, raw.githubusercontent.com) and then connects to an IP/domain from the threat feed within 5 minutes.",
              "Enrich Zeek dns.log data with domain registration dates (from WHOIS data) and third-party reputation scores. For each host, create a stateful analysis that flags if it connects to a resolver platform and then, within 5 minutes, resolves and connects to a domain that is statistically anomalous (e.g., first time seen in 90 days, age < 30 days, or reputation score below a 10th percentile threshold). Alert if the frequency of this two-step pattern for a host exceeds 2 standard deviations above the organizational mean.",
              "Model host network activity as a sequence of events (e.g., 'CONN_github.com', 'DNS_newly-registered-domain.com', 'CONN_newly-registered-domain.com'). Use a sequence mining algorithm (e.g., GSP) on historical data to identify common, legitimate sequences and flag rare sequences that match the resolver-to-C2 pattern, especially if the destination node has features associated with maliciousness (e.g., high entropy, newly registered)."
            ]
          },
          {
            "description": "An HTTP request to a legitimate content-hosting platform contains a User-Agent string that is either associated with known malicious tools, is a non-standard programmatic agent (e.g., 'python-requests', 'curl'), or has a prevalence of less than 1% across all enterprise traffic to that specific service over the last 30 days.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Web Proxy Servers",
            "action": [
              "Maintain a watchlist of known malicious and non-standard User-Agent strings (e.g., 'curl/7.68.0', 'python-requests/2.25.1', default UAs from libraries). Create a rule to match these strings in the 'user_agent' field of Zeek http.log records where the destination host is a known resolver platform.",
              "For each high-traffic destination service (e.g., api.github.com, pastebin.com), calculate the frequency distribution of all User-Agent strings observed over the last 30 days. Generate an alert for any User-Agent string that falls below a low prevalence threshold (e.g., used by < 1% of hosts or constitutes < 0.5% of requests to that service).",
              "Use a character-level autoencoder or a clustering algorithm (e.g., DBSCAN) on features extracted from User-Agent strings (e.g., length, token count, character entropy). Investigate clusters that are small (outliers) or distant from the large, dense clusters representing common web browsers, as these indicate structural anomalies."
            ]
          },
          {
            "description": "An endpoint exhibits a pattern of periodic, low-jitter 'heartbeat' connections to a legitimate web service, or the data transfer volume to such a service deviates more than 3 standard deviations from its own established 30-day baseline for that specific service.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Network Traffic Sensors, Internet Gateway/Egress Points",
            "action": [
              "Create a rule to alert on any connection to a pre-defined list of dead-drop-capable services where the response size ('resp_ip_bytes' in Zeek conn.log) is between 50 and 500 bytes and the request occurs between 10 PM and 5 AM local time.",
              "For each source IP and destination service pair, calculate a 30-day rolling baseline for connection frequency, data volume ('orig_ip_bytes', 'resp_ip_bytes'), and the standard deviation of the time between connections (jitter). Alert if a new connection's metrics exceed 3 standard deviations from the mean or if the jitter is exceptionally low (e.g., < 1 second), indicating automated beaconing.",
              "Apply a time-series anomaly detection model, such as a Seasonal-ARIMA or an LSTM-based autoencoder, to each host's connection frequency and data volume to specific services. The model learns the normal 'rhythm' of communication. Flag any time window where the observed traffic falls significantly outside the model's predicted confidence interval."
            ]
          },
          {
            "description": "A network connection to a legitimate web service is initiated by a process that is not an approved web browser, is unsigned, or is executing from a non-standard file path (e.g., C:\\Users\\Public\\, %TEMP%).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Workstations and Servers, Domain Controllers",
            "action": [
              "Correlate network connections from Zeek conn.log or Windows Event ID 5156 with process creation events (Windows Event ID 4688) by source IP and timestamp. Alert when the process name in event 4688 is not on an allowlist of web browsers and its associated network connection destination IP resolves to a known content hosting platform.",
              "Build a profile of common network-connecting processes and their parent processes. Calculate the enterprise-wide prevalence of each process making outbound connections. Flag connections made by processes that are statistically rare network initiators (e.g., in the bottom 5% of prevalence) or have a rare parent-child relationship (e.g., 'services.exe' spawning 'powershell.exe' which connects to pastebin.com).",
              "Train a classification model (e.g., Random Forest) on process features (path, name, signature status, command-line arguments, parent process) to predict if a process is malicious. Use the model to score processes identified via network-process correlation, and alert on high-scoring processes making connections to dead-drop platforms."
            ]
          },
          {
            "description": "An HTTP/S request to a legitimate web service contains a URI path or query parameter with a Shannon entropy score above 4.5, or involves a direct request to a raw content URL (e.g., 'pastebin.com/raw/...', 'raw.githubusercontent.com/...').",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Web Proxy Servers with SSL/TLS Inspection",
            "action": [
              "Create a rule to alert on any HTTP request from Zeek http.log where the 'host' header is 'raw.githubusercontent.com' or the URI path contains '/raw/'. Additionally, monitor Zeek ssl.log for 'server_name' (SNI) matching these raw content domains.",
              "For all requests to a given service (e.g., 'github.com'), calculate the Shannon entropy of the URI path and query string. Establish a baseline distribution of entropy scores over a 30-day period. Alert on any request where the entropy is in the top 1% (99th percentile), indicating likely randomization or encoding.",
              "Train a character-level Recurrent Neural Network (RNN) on legitimate URI structures for popular services. A high reconstruction error on a new URI from Zeek http.log suggests its structure is anomalous and likely machine-generated for C2 purposes."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]