[
  {
    "information_requirement": "Is the adversary using external web services for one-way command and control (C2)? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1102.003",
        "name": "One-Way Communication",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host to an external web service domain, URL, or IP address that is present on a threat intelligence feed of known C2 dead drop locations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Web Proxy and Egress Firewalls",
            "action": [
              "Symbolic: Create a watch list of domains, URLs, and IP addresses from a CTI feed for known one-way C2 channels. Continuously join network logs (Zeek conn.log for destination IP, ssl.log for SNI, http.log for host/URI) against this watch list. Generate an alert for any match.",
              "Statistical: For all connections to known file/text sharing services (e.g., pastebin.com, gist.github.com), calculate the historical frequency of connections from each internal source IP. Flag any source IP whose connection frequency to these services increases by more than three standard deviations above its 30-day baseline.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on labeled historical network logs where features include destination domain reputation, URL path entropy, and connection count. Use the model to predict the probability that a new connection is a C2 dead drop check-in."
            ]
          },
          {
            "description": "An outbound TLS or HTTP connection to a legitimate external web service that exhibits anomalous artifacts, such as a User-Agent string not associated with standard browsers, a URL path matching known C2 patterns, or a JA3/JA3S hash associated with a known malicious tool.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Web Proxy and Egress Firewalls",
            "action": [
              "Symbolic: Maintain and apply a ruleset that matches against non-standard User-Agent strings (e.g., 'Python-urllib', 'curl/*', 'Wget/*') in Zeek http.log, known malicious JA3/JA3S hashes in Zeek ssl.log, and regex patterns for C2 URL paths (e.g., '/raw/[a-zA-Z0-9]+') when the destination is a common web service. Alert on any match.",
              "Statistical: For each User-Agent seen in http.log, calculate its prevalence across the enterprise. Identify User-Agents in the bottom 5th percentile of prevalence that are connecting to high-reputation domains (e.g., social media, code repositories). Scrutinize these rare User-Agents for malicious activity.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on JA3 hashes from Zeek ssl.log to group clients based on their TLS fingerprint. Investigate small, newly-formed clusters or clients that migrate to an anomalous cluster, as this may indicate the introduction of a new C2 tool."
            ]
          },
          {
            "description": "A non-browser or script interpreter process (e.g., powershell.exe, cscript.exe, svchost.exe) initiating an outbound network connection to an external web service.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstations and Servers",
            "action": [
              "Symbolic: Correlate process creation logs (Windows Event ID 4688) with network connection logs (Zeek conn.log) on IP and timestamp. Alert if a process name from a watchlist (e.g., 'powershell.exe', 'rundll32.exe', 'mshta.exe') makes an external network connection to a domain categorized as 'Social Media', 'File Sharing', or 'Code Repository'.",
              "Statistical: For each host, build a baseline of processes that normally make external network connections. Calculate the frequency of each process-to-destination domain pair. Score pairs based on rarity (e.g., using an inverse frequency model). A high score for a pair involving a system process indicates a potential anomaly.",
              "Machine Learning: Train an autoencoder on feature vectors representing process network behavior (e.g., process name, command line, parent process, destination domain, port). Use the model to identify anomalous connections by flagging processes with high reconstruction error, indicating they deviate from learned normal behavior."
            ]
          },
          {
            "description": "A series of outbound network connections from a single internal host to a single external destination, exhibiting a consistent time interval (jitter) between connections and a low variance in data volume sent.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Firewalls and Network Taps",
            "action": [
              "Symbolic: For each source-destination IP pair in Zeek conn.log, inspect sessions over a 24-hour window. Trigger an alert if more than 10 connections occur where the time difference between consecutive connections is consistently N seconds (e.g., 60s +/- 5s) and the 'orig_bytes' field is consistently less than 1KB.",
              "Statistical: For each source-destination pair, compute the standard deviation of the inter-arrival time between connections over a rolling 1-hour window. Also compute the standard deviation of the 'orig_bytes' field. Flag pairs where both metrics fall below a low threshold (e.g., bottom 1st percentile of all connections), indicating highly regular, non-human communication.",
              "Machine Learning: Apply a Fast Fourier Transform (FFT) to the time series of connection events for each source-destination pair. A strong peak in the frequency domain indicates a dominant periodic signal, characteristic of C2 beaconing. Use this as a feature to train a beacon detection model."
            ]
          },
          {
            "description": "A network connection to an external web service where the ratio of bytes sent to bytes received is highly asymmetric (close to 1.0 or greater), inconsistent with typical browsing behavior where response size far exceeds request size.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Firewalls and Network Taps",
            "action": [
              "Symbolic: From Zeek conn.log, filter for all successfully established connections ('conn_state' = 'SF'). Alert on any connection to a web port (80, 443) where the ratio of response bytes to request bytes ($$ resp\\_bytes / orig\\_bytes $$) is less than 1.1 and the 'orig_bytes' is greater than 0, as this is highly atypical for web GET requests.",
              "Statistical: For each internal source IP, calculate the 30-day rolling average and standard deviation of the $$ resp\\_bytes / orig\\_bytes $$ ratio for connections to external web services. Flag any host whose average ratio for a given day drops more than two standard deviations below its historical mean.",
              "Machine Learning: Use an unsupervised anomaly detection algorithm like Isolation Forest on connection features including the $$ resp\\_bytes/orig\\_bytes $$ ratio, duration, orig_pkts, and resp_pkts. The model will learn the characteristics of normal web traffic and assign anomaly scores to connections that deviate, such as those with unusual asymmetry."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]