[
  {
    "information_requirement": "Is the adversary leveraging legitimate external web services (dead drop resolvers) for command and control communications? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1102.001",
        "name": "Dead Drop Resolver",
        "evidence": [
          {
            "description": "A host connection to a URI on a legitimate web service (e.g., Pastebin, GitHub) matches a known dead drop resolver pattern, or a connection to a known C2 server occurs within 2 minutes of visiting a legitimate content hosting platform.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Web Proxies, DNS Resolvers",
            "action": [
              "Symbolic: Ingest a threat intelligence feed of known dead drop resolver URIs and malicious C2 IPs/domains. Create a rule to match these IOCs against records in Zeek http.log (for URIs) and Zeek dns.log/conn.log (for domains/IPs).",
              "Statistical: For each internal host, create a stateful analysis. If a connection is made to a domain on a list of common content hosting platforms, monitor for any subsequent connection to a low-reputation or newly-seen domain (e.g., seen for the first time in 30 days) within a 2-minute window. Calculate the frequency of this two-step pattern across the organization and flag hosts with unusually high counts.",
              "Machine Learning: Use a graph-based algorithm to model sequences of network connections. Represent hosts and domains as nodes and connections as timed, directed edges. Identify anomalous paths that consistently lead from a common, legitimate web service node to a disparate set of suspicious endpoint nodes (e.g., those with low centrality or low reputation scores)."
            ]
          },
          {
            "description": "An HTTP request to a legitimate content hosting or social media platform contains a User-Agent string that is non-standard, has a low prevalence across the enterprise (<0.5%), or is associated with known malware.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Web Proxies",
            "action": [
              "Symbolic: Maintain and query against a list of known non-standard or malicious User-Agent strings (e.g., 'curl/7.68.0', 'python-requests', default library UAs, or values from malware analysis reports) in Zeek http.log records.",
              "Statistical: For each high-traffic destination service (e.g., api.github.com, pastebin.com), calculate the frequency distribution of all User-Agent strings observed over the last 30 days. Generate an alert for any User-Agent string that falls below a low prevalence threshold (e.g., used by <0.5% of hosts connecting to that service).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from User-Agent strings (e.g., length, token count, presence of version numbers, character entropy). Investigate clusters that are small (outliers) or distant from the large, dense clusters representing common web browsers."
            ]
          },
          {
            "description": "An endpoint exhibits a pattern of regular, low-jitter 'heartbeat' connections or a data transfer volume to a legitimate web service that deviates more than 3 standard deviations from its own 30-day baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Endpoint Network Telemetry",
            "action": [
              "Symbolic: Create a rule to alert on any connection to a pre-defined list of dead-drop-capable services where the response size ('resp_bytes' in Zeek conn.log) is between 50 and 500 bytes and the request occurs outside of standard business hours.",
              "Statistical: For each host-service pair, establish a 30-day rolling baseline of connection frequency, data volume (orig_bytes, resp_bytes), and inter-arrival time. Alert if a new connection's metrics exceed 3 standard deviations from the mean. A very low standard deviation of inter-arrival times (low jitter) indicates potential automated beaconing.",
              "Machine Learning: Apply a time-series anomaly detection model (e.g., ARIMA or an LSTM-based autoencoder) to each host's connection frequency and data volume to specific services. Flag any time window where the observed traffic falls significantly outside the model's predicted confidence interval."
            ]
          },
          {
            "description": "A network connection to a legitimate web service is initiated by a process that is not a standard web browser, is unsigned, or is executing from a non-standard file path (e.g., C:\\Users\\Public\\, %APPDATA%).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstation and Server Endpoints, Domain Controllers",
            "action": [
              "Symbolic: Correlate Zeek conn.log destination IPs with Windows Event ID 4688 process creation events by source IP and timestamp. Alert when the 'ProcessName' in event 4688 is not on an allowlist of web browsers (e.g., 'chrome.exe', 'msedge.exe') and the destination IP belongs to a content hosting platform.",
              "Statistical: Calculate the enterprise-wide prevalence of processes making network connections. Enrich process data with parent process information. Flag connections made by processes that are statistically rare network initiators or have a rare parent process (e.g., 'svchost.exe' spawning 'cmd.exe' which connects to a paste site).",
              "Machine Learning: Train a classification model (e.g., Random Forest) on process features (path, name, signature status, command-line arguments) to predict if a process is malicious. Use the model to score processes identified via network-process correlation, and alert on high-scoring processes making connections to dead drop platforms."
            ]
          },
          {
            "description": "An HTTP request to a legitimate web service contains a URI path or query parameter with a Shannon entropy score above 4.5, or involves a direct request to a raw content URL (e.g., 'pastebin.com/raw/...').",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Web Proxies",
            "action": [
              "Symbolic: Create a rule to alert on any HTTP request from Zeek http.log where the URI contains '/raw/' or the host is 'raw.githubusercontent.com' and the HTTP referrer field is empty or does not match the parent domain (e.g., github.com).",
              "Statistical: For all requests to a given service, calculate the Shannon entropy of the URI query string. Establish a baseline distribution of entropy scores and alert on any request where the entropy is in the top 1% (99th percentile), indicating likely randomization or encoding.",
              "Machine Learning: Train an autoencoder neural network on legitimate URI structures for popular services (e.g., path tokens, query parameter keys). A high reconstruction error on a new URI from Zeek http.log suggests its structure is anomalous and potentially generated by malware for C2."
            ]
          },
          {
            "description": "An internal host connects to a known content-hosting platform and, within a 5-minute window, initiates a new connection to a destination domain that was registered within the last 30 days or has a low reputation score.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Egress Points, Internal DNS Resolvers",
            "action": [
              "Symbolic: Create a stateful rule that triggers when a connection to a domain in a 'resolver_platforms' list (e.g., github.com, pastebin.com) from a host is followed within 5 minutes by a connection from the same host to a domain present on a 'malicious_c2' threat intelligence list.",
              "Statistical: Enrich Zeek dns.log with domain registration date (from WHOIS data) and third-party reputation scores. For each host, count occurrences of the pattern: connection to a legitimate service, followed by a DNS query for a domain aged < 30 days, followed by a connection to that new domain. Alert if this pattern's frequency for a host exceeds 2 standard deviations above the organizational mean.",
              "Machine Learning: Model host network activity as a sequence of events (e.g., 'CONN_github', 'DNS_newly-registered-domain.com', 'CONN_newly-registered-domain.com'). Use a sequence mining algorithm (e.g., GSP) to find common legitimate sequences and flag rare sequences that match the dead drop resolver pattern."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]