[
  {
    "information_requirement": "Has an adversary established a multi-stage command and control channel for persistent or interactive access? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1104",
        "name": "Multi-Stage Channels",
        "evidence": [
          {
            "description": "A process on an endpoint initiates an outbound network connection to an external IP address or domain that is present on a threat intelligence feed of known first-stage command and control (C2) servers or redirectors.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways and proxies, DNS resolvers, User endpoints",
            "action": [
              "Create a SIEM rule to join outbound network connections (Zeek conn.log `id.resp_h` or Windows Event ID 5156 `RemoteAddress`) with DNS queries (Zeek dns.log `query`). Match the resolved IP or queried domain against a threat intelligence feed of known first-stage C2 indicators. Alert upon any match, enriching the alert with process information from the corresponding Windows Event ID 4688.",
              "For each source host, maintain a baseline of destination domains, ASNs, and countries over a 30-day rolling window. Calculate the frequency of each. For a new connection, if the destination domain's frequency is in the bottom 1st percentile (i.e., rare) for that host and the destination ASN is also in the bottom 5th percentile of all ASNs connected to by the organization, flag the connection for review. This identifies statistically unlikely destinations.",
              "Train a supervised classification model (e.g., Gradient Boosting Machine) using features extracted from DNS and TLS traffic. Features should include: domain lexical analysis (length, entropy, n-gram score), registration data (age, registrar), TLS handshake details (JA3 hash, cipher suites, self-signed cert), and resolution data (number of IPs, ASN). Use the model to score each new external connection; a probability score exceeding a predefined threshold (e.g., 0.85) indicates a likely C2 connection."
            ]
          },
          {
            "description": "A network session from an internal host to an external destination results in an HTTP 3xx redirect response, and the subsequent connection to the new 'Location' header destination is to a low-reputation domain or a different ASN than the initial server.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, transparent/explicit web proxies, DNS resolvers",
            "action": [
              "Create a stateful SIEM rule that monitors Zeek http.log. Trigger when a `uid` shows a request to an external host that returns a 3xx status code. The rule should then track if the same internal host (`id.orig_h`) makes a new request to the `Location` header value from the redirect response within 2 seconds, and if this new destination domain is on a blocklist, is newly registered (< 30 days), or is a non-FQDN IP address.",
              "Profile HTTP sessions by `uid` in Zeek http.log to establish a baseline for redirect chain length (number of 3xx responses before a 200 OK). Calculate the 99th percentile for redirect chain length across the enterprise. Flag any session that exceeds this threshold, as long redirect chains can be used to obfuscate the final C2 destination.",
              "Implement a sequence analysis model (e.g., an LSTM Autoencoder) trained on sequences of network events grouped by session (`uid`). A normal sequence might be [DNS A?, TCP SYN, HTTP GET, HTTP 200]. The model will flag anomalous sequences, such as [DNS A?, TCP SYN, HTTP GET, HTTP 302, DNS A? (new domain), TCP SYN (new IP)], which represent a potential redirect-based hand-off."
            ]
          },
          {
            "description": "A single, long-running process, identified by its unique Process GUID or PID/start-time combination, establishes an initial network communication pattern, then abruptly shifts its behavior to a new pattern involving different destination ports, protocols, ASNs, or TLS fingerprints (JA3/JA3S).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Domain Controllers, Critical application servers, Internet gateways and proxies",
            "action": [
              "Using process creation events (Windows Event ID 4688) to track a `NewProcessId`, create a stateful rule that first observes a connection from this process to an external destination. If the same process later initiates a new connection where the destination port, protocol, and destination ASN are all different from the initial connection, and the new JA3/JA3S hash (from Zeek ssl.log) does not match a known good application profile, trigger an alert.",
              "For each running process, create a multi-dimensional baseline of its network behavior (vector of features: avg. bytes sent, destination port entropy, destination IP entropy, protocol mix). Continuously calculate the Mahalanobis distance of its current behavior (e.g., over a 5-minute window) from its historical baseline. A distance score exceeding a dynamic threshold (e.g., 3 standard deviations from the mean distance) indicates a significant behavioral shift and potential hand-off.",
              "For each process, stream its network connection metadata (e.g., bytes_out, destination_port) as a multivariate time series. Apply an online change point detection algorithm (e.g., Bayesian Online Change Point Detection) to this stream. A detected change point signifies an abrupt shift in the process's communication pattern, which could correspond to a C2 stage transition. The alert should include the data before and after the detected change."
            ]
          },
          {
            "description": "A process downloads a file over the network, identified by a MIME type like 'application/x-dosexec' or from a low-reputation source. Within seconds, a new process is created, and this new process initiates an outbound network connection to a different external IP/ASN than the original file download source.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Internet gateways, Egress web filters",
            "action": [
              "Create a SIEM correlation rule that triggers on the following sequence within a 60-second window: 1. A file download event (Zeek files.log) with a MIME type of 'application/x-dosexec' or 'application/octet-stream'. 2. A process creation event (Windows Event ID 4688) on the same host where the `ParentProcessName` matches the process associated with the download. 3. A new outbound connection (Zeek conn.log) from the `NewProcessId` from event #2 to a destination ASN different from the file download source.",
              "Establish a baseline distribution of the time delta between a file being written to disk by a browser and a new process being created by the user (e.g., clicking 'run'). Separately, analyze the time delta between a file download (Zeek files.log) and a subsequent outbound beacon from a new process. If this time delta falls into the 1st percentile (e.g., < 1 second), it indicates automated execution and is highly suspicious of a malware stager.",
              "Construct a real-time activity graph where nodes are processes, files, and network destinations, and edges are actions (e.g., 'downloads', 'creates', 'connects'). Use a graph neural network (GNN) trained to recognize malicious subgraphs. A subgraph pattern of [External_IP_A] -> (connects) -> [Process_A] -> (writes) -> [File_X.exe] -> (creates) -> [Process_B] -> (connects) -> [External_IP_B] (where IP_A != IP_B) would be classified as a high-risk multi-stage event."
            ]
          },
          {
            "description": "A single process initiates a high number of rapid, sequential outbound connection attempts to many unique external IP addresses across disparate ASNs or countries, with a high percentage of those connections resulting in failures (e.g., TCP resets) or having a very short duration (< 2 seconds).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5157"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Egress firewalls, Internet gateways and proxies",
            "action": [
              "Create a SIEM rule that triggers if a single process ID (from Windows Event ID 4688) is associated with more than 15 outbound connection attempts to unique IP addresses in a 60-second window, and where the ratio of failed connections (from Windows Event ID 5157 or Zeek conn.log `conn_state` of 'REJ', 'RSTO', 'RSTR') to successful connections is greater than 75%.",
              "For each process, compute the Shannon entropy of the set of destination IP addresses it attempts to connect to in a 5-minute sliding window. Compare this entropy score to a pre-computed baseline for legitimate applications (e.g., chrome.exe, svchost.exe). If a process exhibits an entropy score that is more than 3 standard deviations above the mean for its process name, or is in the 99th percentile for all processes, flag it as potential C2 domain/IP list cycling.",
              "Apply a density-based clustering algorithm (DBSCAN) to network connection logs. Use features such as source process name, destination country, destination ASN, and connection state/duration. The algorithm will group normal traffic into large clusters. Isolate the 'noise' points or small, sparse clusters that represent anomalous behavior. A cluster of points originating from a single non-browser process with short durations and high geographic/ASN dispersion is a strong indicator of C2 probing."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]