[
  {
    "information_requirement": "Is the adversary attempting to gain credentials via brute force?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1110",
        "name": "Brute Force",
        "evidence": [
          {
            "description": "Multiple failed authentication events (Windows Event ID 4625) originating from a source IP address or involving a user-agent string present on an active threat intelligence feed of known brute-force infrastructure within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN, OWA, RDP gateways), perimeter firewalls, web application firewalls",
            "action": [
              "Symbolic (IOC Match): For each failed authentication event (Windows Event ID 4625), query the source IP address against a threat intelligence feed of known malicious IPs, proxies, or botnet nodes. For web-based services, also match the user-agent string from Zeek http.log against a list of known malicious or brute-forcing tool user agents. Generate a high-severity alert on any match.",
              "Statistical: Calculate the rate of authentication failures per source IP over a 1-hour window. Compare this rate against the historical 95th percentile failure rate for all external source IPs. If an IP also belongs to an Autonomous System (AS) with a low reputation score (e.g., bottom 10% of all observed ASNs), flag it for investigation.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) using features such as source IP, ASN, country, time of day, and user-agent string. Label historical data using known malicious IPs from threat intelligence. Use the trained model to predict the probability that a new authentication attempt is part of a malicious brute-force campaign in real-time."
            ]
          },
          {
            "description": "Ten or more failed authentication attempts (Windows Event ID 4625) from a single source IP targeting a sequence of distinct, common administrative account names (e.g., 'admin', 'administrator', 'root', 'support') within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, authentication servers (e.g., RADIUS), Linux/UNIX servers, database servers, network device administration interfaces",
            "action": [
              "Symbolic (Dictionary Match): Monitor Windows Event ID 4625 for failed logins. Maintain a dictionary of common administrative and default usernames. For each source IP, if the number of failed attempts targeting usernames from this dictionary exceeds 10 within 5 minutes, trigger an alert.",
              "Statistical: For each source IP, calculate the ratio of failed logins against common admin accounts to total failed logins from that IP over a 1-hour window. Establish a baseline for this ratio across all source IPs. An IP whose ratio exceeds the 99th percentile of this baseline is a strong indicator of a dictionary attack.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) on the stream of usernames being attempted from a single source IP. Train the model on legitimate login attempt sequences. An anomalous sequence, characterized by a low probability score from the model and a high density of common admin names, indicates a dictionary attack."
            ]
          },
          {
            "description": "A high-velocity of failed login attempts (>20 within 10 minutes) against a single user account from one or a small number (<3) of source IPs.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing services (RDP, VPNs, webmail), Domain Controllers, user workstations with remote access enabled",
            "action": [
              "Symbolic (Rule-based Threshold): Create a stateful rule that triggers an alert when the count of failed logins (Windows Event ID 4625) for a single user account from a single source IP exceeds 20 events in a 10-minute window. Correlate with Zeek conn.log to confirm the destination port (e.g., 3389 for RDP, 443 for HTTPS).",
              "Statistical: For each user account, model the normal distribution of failed login counts per 10-minute interval using historical data. A new 10-minute interval where the failure count exceeds 3 standard deviations ($$ z > 3 $$) above the mean for that user indicates a probable brute-force attempt.",
              "Machine Learning: Apply time series forecasting (e.g., ARIMA) to the failed login count for each active user. If the observed number of failures in a given time window significantly exceeds the model's prediction interval (e.g., upper bound of the 95% confidence interval), classify the event as a brute-force anomaly."
            ]
          },
          {
            "description": "Authentication failures (Windows Event ID 4625) from a single source IP targeting a large number of unique user accounts (>50) where each account sees a low number of failures (1-3) within a 1-hour window.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud authentication services (e.g., Microsoft Entra ID, Okta), federated identity providers (e.g., ADFS), Domain Controllers, externally-facing web applications",
            "action": [
              "Symbolic (Rule-based Threshold): From a single source IP, if the count of unique user accounts with failed logins (Windows Event ID 4625) is > 50 and the failure count per account is < 4 within a 1-hour window, generate an alert for password spraying.",
              "Statistical: Group failed logins by source IP per hour. For each source IP, calculate the Shannon entropy of the set of targeted usernames. An entropy score that is anomalously high (e.g., exceeds the 98th percentile of the historical distribution of entropy scores for all source IPs) combined with a high distinct count of users indicates a password spraying attack.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on authentication failure events using features like source IP, number of unique target accounts, and failures per account. A dense cluster characterized by a single source IP, a high number of unique target accounts, and a low number of failures per account represents a password spraying attack."
            ]
          },
          {
            "description": "A successful login (Windows Event ID 4624) for a user account that was preceded by a statistically significant number of failed logins (Windows Event ID 4625) for the same account from the same source IP within the last 15 minutes.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, critical asset servers, VPN concentrators, privileged access workstations",
            "action": [
              "Symbolic (Stateful Rule): Create a stateful rule that looks for a successful logon (Windows Event ID 4624). Upon detection, search backwards 15 minutes for failed logons (Windows Event ID 4625) from the same source IP and for the same user account. If the count of failures is greater than 10, generate a high-priority alert for a successful brute-force.",
              "Statistical: For each user, establish a baseline distribution of the number of failed login attempts that precede a successful login from the same IP. A successful login (Event ID 4624) that follows a failure count (Event ID 4625) exceeding the 99th percentile of that user's specific baseline is flagged as a successful brute-force.",
              "Machine Learning: Train a classifier to distinguish 'normal' from 'post-brute-force' successful logins. Features can include count of preceding failures, time since last successful login, source IP reputation, and time of day. Score new successful logins for their likelihood of being the result of a brute-force attack."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]