[
  {
    "information_requirement": "Is the adversary collecting data from the network or systems using automated techniques? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1119",
        "name": "Automated Collection",
        "evidence": [
          {
            "description": "Execution of a process where the name or file hash matches a known automated collection tool or malware component.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints and servers, particularly file servers and domain controllers.",
            "action": "1. (Symbolic) Continuously match process names and file hashes from process creation events (Windows Event ID 4688, Sysmon Event ID 1) against a threat intelligence feed of known collection tool IOCs. Alert on any matches. 2. (Statistical) For each new process name, calculate its rarity across the enterprise over the last 30 days. Flag any unsigned process whose name falls in the bottom 1st percentile of prevalence for investigation. 3. (ML) Train a classification model (e.g., Random Forest) on features from process creation events (parent process, user context, command-line length, process name rarity) to predict if a new process is a malicious collection tool."
          },
          {
            "description": "Execution of a command-line or PowerShell script containing a sequence of commands for discovering, filtering, and archiving files, such as chaining 'Get-ChildItem -Recurse' with 'Compress-Archive'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints and servers, especially those with enhanced PowerShell logging enabled.",
            "action": "1. (Symbolic) Apply regular expressions to command-line logs (Windows Event ID 4688) and PowerShell script blocks (Windows Event ID 4104) to detect patterns chaining file discovery commands (`dir /s`, `gci -r`) with archival utilities (`tar`, `7z`, `Compress-Archive`). 2. (Statistical) Calculate the Shannon entropy of command lines and script blocks. Establish a baseline for normal administrative activity and alert when a script's entropy exceeds the 95th percentile, indicating potential obfuscation or complexity. 3. (ML) Use a pre-trained NLP model to classify a given script block or command line as 'benign', 'suspicious', or 'malicious collection' based on the sequence and structure of its commands."
          },
          {
            "description": "A single process performing an anomalously high number of file read operations across distinct directories within a short time frame, followed by a write operation to a single archive file (e.g., .zip, .rar, .tmp).",
            "data_sources_comment": "Requires enabling 'Audit File System' SACL on target directories for Windows Event ID 4663.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical file servers, SharePoint sites, and repositories of sensitive intellectual property or PII.",
            "action": "1. (Symbolic) Create a rule that triggers when a process ID generates >100 file read events (Windows Event ID 4663) from >10 unique directories within 60 seconds, and is immediately followed by a process creation event (Windows Event ID 4688) for a known archiver (e.g., 7z.exe, rar.exe). 2. (Statistical) For each process, track the rate of unique file paths accessed per minute. Flag any process where the access rate exceeds 3 standard deviations above the historical baseline for that process name. 3. (ML) Employ a time-series anomaly detection model (e.g., LSTM autoencoder) on the stream of file access events per host. The model learns the normal rhythm of file interactions and flags sudden, sharp spikes in access volume that deviate from the learned pattern."
          },
          {
            "description": "A non-interactive or anomalously-spawned process accessing an unusual number or variety of files with sensitive extensions (e.g., .docx, .xlsx, .pst) or in sensitive locations (e.g., user profiles, financial data shares).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations (specifically profiles and document folders), network shares containing HR or financial data, and code repositories.",
            "action": "1. (Symbolic) Create and monitor 'honeypot' files and directories (e.g., 'C:\\Secrets\\annual_passwords.xlsx'). Any access event (Windows Event ID 4663) on these objects should generate a high-priority alert. 2. (Statistical) Develop a 'sensitive file access score' by assigning weights to file paths and extensions. Sum the scores for all files a process accesses in a 5-minute window. Flag any process, especially non-interactive ones, that exceeds the 98th percentile of this score. 3. (ML) Use a graph-based analysis, modeling users, processes, and files as nodes. Apply a community detection algorithm to identify normal access patterns. A new access event that bridges disparate communities (e.g., a web server process accessing HR documents) would be flagged as a high-risk anomaly."
          },
          {
            "description": "A statistically significant increase in a host's outbound data volume to an external destination, temporally correlated with preceding on-host indicators of automated collection.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (firewalls, proxies), DNS servers, and all endpoints/servers.",
            "action": "1. (Symbolic) Create a SIEM correlation rule that triggers if a host-based 'Automated Collection' alert is followed within 15 minutes by a network connection (Zeek conn.log) from the same host to a new external IP (not seen in 30 days) with a data transfer >50MB. 2. (Statistical) For each host, create a time-series baseline of outbound bytes per 10-minute interval. Alert when outbound traffic exceeds the 99th percentile of its historical baseline. Enrich the alert with the destination domain's age and reputation from DNS logs (Zeek dns.log). 3. (ML) Implement a cross-domain sequence analysis model that ingests both host events (process creation) and network events (connection start, data transfer). The model learns valid event sequences and flags anomalous sequences, such as 'powershell.exe executes script -> large outbound connection to new IP', as likely collection and exfiltration."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]