[
  {
    "information_requirement": "Is the adversary attempting to gain account credentials using password spraying?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1110.003",
        "name": "Password Spraying",
        "evidence": [
          {
            "description": "One or more authentication failures (Windows Event ID 4625, 4771) or connection attempts (Zeek conn.log) originating from a source IP address on a high-confidence threat intelligence feed, or web authentication attempts (Zeek http.log) containing a User-Agent string associated with known password spraying tools.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4625",
              "Windows Event ID 4771",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Externally-facing web applications, Domain Controllers, VPN concentrators, Cloud Authentication Services (e.g., Azure AD, Okta)",
            "action": [
              "Continuously correlate source IP addresses from authentication failure logs (Windows Event IDs 4625, 4771) and connection logs (Zeek conn.log) against a CTI feed of known malicious IPs or anonymizing proxies. For web-based services, scan Zeek http.log for User-Agent strings associated with password spraying tools (e.g., 'ruler', 'ms-office', 'kerbrute'). Alert on any matches from high-confidence sources.",
              "Upon a symbolic match from a CTI feed, analyze events from the matched source IP over a 15-minute window. Calculate the Shannon entropy of the set of unique target usernames. Alert if this entropy score exceeds the 95th percentile of the baseline entropy distribution calculated for all external source IPs, indicating an unusually diverse set of target accounts.",
              "Develop a real-time classification model (e.g., Logistic Regression, Random Forest) to score each external authentication attempt. Engineer features for the source IP, including: CTI reputation score, ASN, geolocation, time of day, historical success/failure ratio for that IP, and User-Agent prevalence. Train the model on labeled data of past password spraying incidents and benign activity. An attempt classified as 'malicious' with high probability triggers an alert."
            ]
          },
          {
            "description": "A single source IP address generates a high number of Kerberos pre-authentication failures (Windows Event ID 4771 with Failure Code '0x18') across numerous distinct accounts within a short time window.",
            "data_sources": [
              "Windows Event ID 4771"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Create a rule to trigger an alert when a single source IP address generates Windows Event ID 4771 with Failure Code '0x18' for more than 10 distinct user accounts within a 5-minute window. This is a hard-coded threshold for a clear spraying pattern.",
              "Filter for Windows Event ID 4771 with Result Code '0x18' (Kerberos pre-authentication failed). Group by source IP and count distinct target accounts over a 10-minute sliding window. Calculate a baseline distribution of this count for all source IPs. Alert when a source IP's distinct account count exceeds the 99th percentile of the baseline, indicating an anomalously broad targeting pattern.",
              "Stream Kerberos failure events (Event ID 4771, Code '0x18') into a clustering model (e.g., DBSCAN). Use features such as source IP (converted to a numerical representation), timestamp, and target account (hashed). A dense cluster identified by the model, characterized by a single source IP and a high cardinality of unique target account hashes, represents a password spraying attack."
            ]
          },
          {
            "description": "A single source IP address is responsible for a high count of distinct user accounts failing authentication (Windows Event ID 4625 for NTLM, 4771 for Kerberos) within a defined time window, exhibiting a high ratio of unique failed accounts to total failure attempts from that IP.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4771"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, VPN concentrators, Any server accepting network logons",
            "action": [
              "Create a rule that alerts when a single source IP is responsible for failed authentications (Windows Event ID 4625) for more than 20 unique user accounts within a 15-minute period. This simple threshold can catch less stealthy spray attacks.",
              "For each source IP generating authentication failures (Event IDs 4625, 4771), calculate two metrics over a 30-minute rolling window: (1) the count of distinct target accounts, and (2) the ratio of distinct accounts to total attempts. Establish a baseline for both metrics. Alert when a source IP exceeds the 98th percentile for the distinct account count and has a ratio greater than 0.8, while also exceeding a minimum attempt threshold (e.g., 20 attempts) to reduce false positives.",
              "For each source IP, create a feature vector over a 15-minute window: count of 4625 events, count of unique accounts in 4625 events, count of 4771 events, count of unique accounts in 4771 events, and standard deviation of time between attempts. Feed this vector into an anomaly detection model (e.g., Isolation Forest) trained on normal network traffic patterns. Anomaly scores exceeding a predefined threshold indicate a high likelihood of password spraying."
            ]
          },
          {
            "description": "A successful authentication (Windows Event ID 4624) from a source IP address that, within the preceding M minutes, was the source of authentication failures (Windows Event ID 4625 or 4771) against N or more other accounts.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Windows Event ID 4771",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, VPN concentrators, Endpoints, Externally-facing web applications",
            "action": [
              "Create a stateful rule that triggers a high-severity alert when a source IP generates >10 failed logins (Event ID 4625/4771) across distinct accounts and then has a successful login (Event ID 4624) within 30 minutes. This directly identifies a successful spray attempt and the compromised account.",
              "Maintain a state table or watchlist of source IPs that have exceeded a statistical threshold for failed authentications in the last hour (e.g., 95th percentile of distinct failed accounts). When a successful authentication (Event ID 4624) occurs, check if the source IP is in this state table. If a match is found, escalate the event as a high-confidence successful password spray.",
              "Model authentication sequences per source IP using a sequence-aware algorithm like a Hidden Markov Model (HMM) or an LSTM-based autoencoder. The model is trained on benign sequences of authentication events (failures and successes). A sequence containing a high volume of failures across many accounts followed by a success will be flagged as a low-probability, anomalous sequence indicative of a successful spray."
            ]
          },
          {
            "description": "A statistically significant increase in the aggregate volume of authentication failures (Windows Event ID 4625, 4771) or failed connection attempts to authentication-related ports (e.g., 445, 389, 88, 3389) compared to a historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625",
              "Windows Event ID 4771"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Domain Controllers, VPN concentrators, Network backbone sensors",
            "action": [
              "Create a 'tripwire' rule that alerts if the total count of Windows Event ID 4625 and 4771 events across all domain controllers exceeds a high, fixed threshold (e.g., 5000 events in 1 hour) that is well above any normal business activity. This acts as a coarse, last-resort detector for a massive, noisy attack.",
              "Aggregate the count of authentication failure events (Event IDs 4625, 4771) across all relevant servers into hourly bins. Create a baseline model of this time series that accounts for seasonality (e.g., time of day, day of week). Alert if the current hour's count exceeds the forecasted value by more than 3 standard deviations of the model's error.",
              "Implement a time-series forecasting model (e.g., Prophet, SARIMA) on the aggregate count of authentication failures (Event IDs 4625, 4771) and/or failed connection attempts to authentication ports in Zeek conn.log. Train the model on at least 90 days of historical data. In production, forecast the expected volume for the next interval (e.g., 15 minutes) and alert if the observed volume falls outside the model's prediction interval (e.g., 99% confidence interval)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]