[
  {
    "information_requirement": "Is the adversary collecting sensitive data via screen capture? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1113",
        "name": "Screen Capture",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable's name or file hash matches an entry on a threat intelligence list of unauthorized screen capture utilities. Alternatively, a file transfer is detected where the filename or MIME type matches patterns associated with the output of these tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Virtual Desktop Infrastructure (VDI) instances, Network egress points (e.g., firewalls, proxies).",
            "action": [
              "1. Symbolic Match: Continuously monitor process creation events (Windows Event ID 4688, Sysmon EID 1) and network file transfers (Zeek files.log). Compare process hashes and names against a curated threat intelligence feed of known screen capture malware and unauthorized tools. Simultaneously, use regular expressions on Zeek file logs to match filenames and MIME types associated with these tools. Generate a high-priority alert on any match.",
              "2. Statistical Analysis: Calculate the enterprise-wide prevalence for each process hash observed over a 30-day window. If a process hash matches a known screen capture tool's name pattern but is not on an allowlist, and its prevalence is below a low threshold (e.g., present on <1% of endpoints), escalate the alert priority.",
              "3. Machine Learning Classification: Deploy a pre-trained binary classification model (e.g., Random Forest, Gradient Boosting) that ingests process metadata (e.g., parent process, user context, command-line arguments, entropy) to produce a 'malicious' or 'benign' score. Flag any process for review that receives a high malicious score and is associated with file I/O or API calls related to screen capture, even if its hash is unknown."
            ]
          },
          {
            "description": "A native Windows utility (e.g., psr.exe, snippingtool.exe) or a PowerShell script is executed with command-line arguments or script content indicative of automated, non-interactive, or hidden screen capture operations.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4104 (PowerShell Script Block Logging)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, especially those of privileged users or personnel handling sensitive data (e.g., finance, legal, R&D).",
            "action": [
              "1. Symbolic Match: Create detection rules that search process command lines (Sysmon EID 1, Windows Event ID 4688) and PowerShell script block logs (Windows Event ID 4104) for executions of psr.exe, snippingtool.exe, or PowerShell containing suspicious arguments (e.g., '/start', '/sc 1', '/gui 0', '/clip', '/silent') or .NET API calls like '[System.Drawing.Graphics]::CopyFromScreen'.",
              "2. Statistical Analysis: For each user and process (e.g., powershell.exe), profile the statistical distribution (mean, standard deviation) of command-line length and Shannon entropy. Calculate the Z-score for each new execution; flag instances where the Z-score exceeds a threshold (e.g., >3.0), indicating an abnormally complex command often associated with obfuscated scripts.",
              "3. Time-Series Analysis: Ingest execution timestamps for screen capture utilities per host. Apply a time-series analysis algorithm (e.g., Fast Fourier Transform, autocorrelation) to the event stream to identify strong periodic signals (e.g., execution every 300 seconds). A repeating pattern not associated with a known, legitimate scheduled task is a strong indicator of automated collection."
            ]
          },
          {
            "description": "A process running in a non-interactive context (e.g., as a service, under a system account) creates one or more files with common image extensions (.png, .jpg, .bmp) in a non-standard or temporary directory.",
            "data_sources": [
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 11 (Sysmon)",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint file systems (especially temp directories like C:\\Windows\\Temp\\, AppData\\Local\\Temp), Shared network drives, and staging servers.",
            "action": [
              "1. Symbolic Match: Implement a correlation rule that joins process creation events (Sysmon EID 1) with file creation events (Sysmon EID 11). Trigger an alert if a process with a non-interactive parent (e.g., services.exe, svchost.exe, taskhostw.exe) creates a file ending in .png, .jpg, .bmp, or .gif.",
              "2. Statistical Analysis: For all file creation events (Sysmon EID 11), build a frequency table of (process_name, parent_process_name, file_extension, target_directory) tuples over a 30-day baseline period. Flag any new file creation event whose tuple falls into the bottom percentile (e.g., <0.1%) of observed frequency as a statistical rarity for investigation.",
              "3. Machine Learning Anomaly Detection: Train an unsupervised anomaly detection model (e.g., Isolation Forest) on legitimate file creation events, using features such as process name, parent process name, user account, file extension, and directory path characteristics (e.g., depth, name entropy). Use the model to score new events in real-time and alert on those flagged as significant outliers from the learned norm."
            ]
          },
          {
            "description": "A screen capture utility is executed under a system-level account (e.g., NT AUTHORITY\\SYSTEM), from a non-interactive session, or spawned by a parent process not associated with direct user activity (e.g., a remote administration tool, a scheduled task engine).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution logs on all endpoints, particularly Domain Controllers and critical application servers where interactive GUI use is rare.",
            "action": [
              "1. Symbolic Match: Create a high-severity detection rule that alerts on any execution of a known screen capture utility (e.g., psr.exe, snippingtool.exe) where the user context is a system account (e.g., 'NT AUTHORITY\\SYSTEM') or the parent process is indicative of remote or non-interactive execution (e.g., wmic.exe, psexec.exe, svchost.exe).",
              "2. Statistical Analysis: For each child process name, maintain a frequency distribution of its parent processes across the enterprise. If a screen capture utility is spawned by a parent process that is not in its top 99% most frequent parents (a rare parent-child relationship), flag the event for investigation.",
              "3. Machine Learning Classification: Train a supervised classification model (e.g., Logistic Regression) to predict whether a process execution is 'interactive' or 'non-interactive' based on features like Session ID, User Account type, and Parent Process. Any execution of a screen capture tool that the model classifies as 'non-interactive' with high confidence should be treated as a high-fidelity alert."
            ]
          },
          {
            "description": "A statistically significant spike in the volume or count of outbound image files (e.g., PNG, JPG) is observed, where the destination IP is rare or has a poor reputation, and the activity is temporally correlated with on-host screen capture indicators.",
            "data_sources": [
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (monitoring Zeek sensors), DNS resolution logs, and endpoint process execution logs.",
            "action": [
              "1. Symbolic Correlation: Implement a correlation search that joins endpoint process execution logs (Sysmon EID 1) with network file transfer logs (Zeek files.log) by source IP and timestamp. Trigger an alert if a host executes a suspicious screen capture process (from previous evidence types) and, within a short time window (e.g., 5 minutes), transfers files with an 'image/*' MIME type to a destination IP known to have a poor reputation.",
              "2. Statistical Analysis: For each internal host, establish a 30-day rolling baseline (mean, standard deviation) of the hourly count and total volume of transferred files with 'image/*' MIME types using Zeek files.log. Generate an alert if a host's hourly activity for either metric exceeds 3 standard deviations above its historical mean.",
              "3. Time-Series Forecasting: Implement a time-series forecasting model (e.g., SARIMA, Prophet) to predict the expected total volume (bytes) of outbound 'image/*' MIME type traffic for the entire network, accounting for weekly and daily seasonality. If the actual observed volume exceeds the model's forecasted upper confidence interval, trigger a network-wide anomaly alert, potentially indicating coordinated exfiltration."
            ]
          },
          {
            "description": "Screen capture process executions occur with a consistent, machine-like periodicity (e.g., every 120 seconds), at times outside the user's typical working hours, or in a bursty pattern that deviates from normal user behavior.",
            "data_sources": [
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Endpoints assigned to privileged users (e.g., domain admins, executives)",
            "action": [
              "1. Symbolic Match: If active window title logging is available via an EDR, create a rule that alerts when a screen capture process is executed while the active window title contains sensitive keywords (e.g., 'password', 'mfa', 'secret', 'vpn').",
              "2. Statistical Analysis: For each user, establish a statistical profile of their logon/logoff activity hours over a 30-day period. Flag any screen capture executions that occur outside the user's typical working hours (e.g., >2 standard deviations from their mean activity time). Separately, for each host, calculate the time delta between consecutive screen capture events. A very low standard deviation in these deltas indicates machine-like periodicity and should be alerted.",
              "3. Machine Learning Clustering: Apply a density-based clustering algorithm (e.g., DBSCAN) to screen capture events from each user, using features such as hour_of_day, day_of_week, and process_name. The algorithm will group 'normal' activity into dense clusters. Any event classified as an outlier (noise) by the model represents a deviation from the user's established behavioral patterns and warrants investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]