[
  {
    "information_requirement": "Is the adversary collecting sensitive information via email?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1114",
        "name": "Email Collection",
        "evidence": [
          {
            "description": "A new email inbox rule is created, or an existing one modified, to automatically forward emails to an external domain. This is evidenced by `New-InboxRule` or `Set-InboxRule` events in M365 audit logs, or by a statistically significant volume of outbound emails with forwarding-specific SMTP headers like `X-MS-Exchange-Organization-AutoForwarded`.",
            "data_sources": [
              "Microsoft 365 Unified Audit Log",
              "Zeek smtp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Gateway (e.g., Exchange Online, On-prem Exchange), Network Egress Points, Webmail Application Servers",
            "action": [
              "Symbolic: Monitor Microsoft 365 Unified Audit Logs for `New-InboxRule` and `Set-InboxRule` operations where the `ForwardTo` or `ForwardingSmtpAddress` parameter contains a domain not on an approved allow-list. Correlate with Zeek smtp.log data, alerting when emails to these unapproved domains contain headers like `X-MS-Exchange-Organization-AutoForwarded:true`.",
              "Statistical: For each user, establish a 30-day rolling baseline of the daily count of auto-forwarded emails identified by headers in Zeek smtp.log. Alert when the daily count for a user exceeds the 95th percentile of their individual baseline, or if any forwarding to a previously unseen external domain is detected.",
              "Machine Learning: Train a classifier (e.g., Logistic Regression) using features from M365 audit logs for rule creation events. Features should include time of day, user role, target domain's TLD and age, and whether the IP is from a known corporate range. A high probability score from the model indicates a suspicious rule creation event."
            ]
          },
          {
            "description": "A process is created on a host not designated for mail administration, using PowerShell cmdlets for mailbox searching and exporting, such as `Search-Mailbox`, `New-MailboxExportRequest`, or interacting with Exchange Web Services (EWS) APIs.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Log Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Exchange Servers, Administrator Workstations, Domain Controllers, User Endpoints",
            "action": [
              "Symbolic: Create a detection rule for Windows Event ID 4688 or 4104 where the command line or script block contains `Search-Mailbox`, `New-MailboxExportRequest`, or `.Ews.ExchangeService`, and the execution occurs on a non-administrative host or by a non-administrative user account.",
              "Statistical: For each user, profile the historical usage of PowerShell cmdlets from Event ID 4104 logs. Calculate the rarity (inverse document frequency) of each cmdlet across the organization. Alert when a user executes a high-rarity, high-risk cmdlet like `New-MailboxExportRequest` for the first time.",
              "Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) on features from PowerShell execution events (Event ID 4104). Features should include script block length, script entropy, user context, host name, and the presence of sensitive cmdlet keywords. The model identifies anomalous combinations of these features indicative of malicious activity."
            ]
          },
          {
            "description": "An email archive file (e.g., .pst, .ost, .zip) is created in a temporary or user-controlled directory (e.g., `C:\\Windows\\Temp`, `Downloads`) by a process other than an approved email client, and is subsequently read by a process that initiates an outbound network connection within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, File Servers, Network Egress Points",
            "action": [
              "Symbolic: Correlate events in a SIEM: Trigger when (1) Windows Event ID 4663 shows file creation of `*.pst` or `*.zip` in a non-standard location; (2) Windows Event ID 4688 shows a non-email-client process reading this file; and (3) Zeek conn.log shows an outbound connection from the same host with a data volume (`orig_bytes`) similar to the file size.",
              "Statistical: For each user/host, establish a baseline for the daily count and total size of files with extensions `.pst` or `.zip` created outside of standard mail profile directories. Alert when the daily count exceeds the 99th percentile of the baseline, or when a subsequent outbound data transfer from Zeek conn.log exceeds the host's 99th percentile for daily outbound traffic.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA) on a host's outbound network traffic volume from Zeek conn.log. Feed file creation events (Event ID 4663 for `.pst` files) as an exogenous variable. A large residual error, where actual traffic significantly exceeds the predicted volume immediately after a `.pst` file event, signals potential exfiltration."
            ]
          },
          {
            "description": "A successful authentication to a corporate email service (e.g., OWA, MAPI, Azure AD) is associated with a combination of features that are statistically rare for the user account, such as a new geographic location, a rare user-agent, an unfamiliar ISP (ASN), or a novel client TLS fingerprint (JA3).",
            "data_sources": [
              "Windows Event ID 4624",
              "Microsoft 365 Unified Audit Log",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (Active Directory), Cloud Identity Provider (Azure AD), VPN Concentrators, Webmail Application Servers, Mail Gateway",
            "action": [
              "Symbolic: Alert on any successful email service authentication (e.g., Windows Event ID 4624 on Exchange, `UserLoggedIn` in M365 logs) where the source IP address is on a threat intelligence blocklist or is part of a real-time 'impossible travel' calculation (e.g., successful logins from different continents within an hour).",
              "Statistical: For each user, maintain a 90-day baseline of historical login attributes: source country, source ASN, user-agent string, and JA3 TLS fingerprint (from Zeek ssl.log). For each new login, calculate a risk score by adding points for each attribute that is new or rare for that user. Alert when the total risk score exceeds a dynamically tuned percentile threshold (e.g., 98th percentile).",
              "Machine Learning: Implement an unsupervised anomaly detection model (e.g., One-Class SVM or a variational autoencoder) on user login event vectors. The vector should include categorical features (user, country, ASN, user-agent) and numerical features (time since last login, hour of day). The model learns a 'normal' login profile for each user and flags any login that falls outside this learned multi-dimensional pattern."
            ]
          },
          {
            "description": "A process not on an approved email client allow-list (e.g., `powershell.exe`, `rundll32.exe`) reads a local email data file (e.g., `.pst`, `.ost`). This access is followed within 5 minutes by an outbound network connection from the same process or host to an external IP address.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "EDR process and network event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Network Egress Points, DNS Servers",
            "action": [
              "Symbolic: Create a rule that triggers when Windows Event ID 4663 shows a read access to a `*.pst` or `*.ost` file by a process not on the `outlook.exe`, `thunderbird.exe` allow-list. Correlate this with a subsequent outbound connection from the same host in Zeek conn.log within a 5-minute window to a destination IP not in a known-good IP range.",
              "Statistical: For each host, baseline the set of processes that normally access `.pst` or `.ost` files. Alert whenever a process that has never accessed these files before (a 'first-seen' access) performs a read. Additionally, calculate the baseline outbound data volume for each host and alert if a read event is followed by an outbound data transfer in Zeek conn.log that exceeds the host's 99th percentile.",
              "Machine Learning: Use a sequence-to-sequence model or Hidden Markov Model (HMM) trained on event logs (process, file, network events) to learn normal user activity sequences. An alert is generated when the model observes a low-probability sequence, such as `[powershell.exe starts] -> [powershell.exe reads user.pst] -> [powershell.exe connects to new external IP]`."
            ]
          },
          {
            "description": "A network connection to a known internal or external mail server on a standard mail port (e.g., 25, 143, 465, 587, 993, 995) is initiated by a process on a host (e.g., web server, user endpoint) that is not an approved email client or administrative tool.",
            "data_sources": [
              "Windows Event ID 5156",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "EDR process and network event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Gateway, User Endpoints, Application Servers, Internal Network Segments",
            "action": [
              "Symbolic: Using Windows Event ID 5156 (WFP Connection Permitted) or EDR network events, maintain an allow-list of process executables (e.g., `outlook.exe`) authorized to connect to mail server IPs on mail ports. Alert on any connection from a process not on this allow-list.",
              "Statistical: For each host, create a baseline of `(process_name, destination_port)` tuples observed over a 30-day period. Alert whenever a new tuple is observed where the port is a mail port and the process is not a known mail client. This detects 'first-time' anomalous connections.",
              "Machine Learning: Model your network as a graph where nodes are hosts (with assigned roles like 'workstation', 'web-server') and edges are connections (with attributes like port, protocol). Use a graph neural network (GNN) to learn normal communication patterns. Flag new or rare edges, such as an edge from a 'web-server' node to a 'mail-server' node on port 993, as high-scoring anomalies."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]