[
  {
    "information_requirement": "Is the adversary collecting data from the network or systems using automated techniques? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1119",
        "name": "Automated Collection",
        "evidence": [
          {
            "description": "Execution of a process where the name or file hash matches a known automated collection tool (e.g., rclone) or a custom script identified as malicious.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints and servers, particularly file servers, domain controllers, developer workstations, and CI/CD pipeline runners.",
            "action": [
              "Continuously match process names and file hashes from process creation events (Windows Event ID 4688) against a threat intelligence feed of known collection tool IOCs. Generate an alert on any match.",
              "Calculate the rarity of each new process name across the enterprise over a 30-day rolling window. Investigate any unsigned process whose name falls in the bottom 1st percentile of prevalence.",
              "Train a classification model (e.g., XGBoost, Random Forest) using features from process creation events, including parent process name, user context, command-line length and entropy, process name prevalence, and whether the executable is signed. Use the model to score new processes for their likelihood of being malicious collection tools."
            ]
          },
          {
            "description": "Execution of a command-line or PowerShell script that chains file discovery commands (e.g., dir /s, Get-ChildItem -Recurse), filtering (e.g., findstr, Where-Object), and archival (e.g., tar, Compress-Archive) in a single command or script block.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints and servers, especially those with enhanced PowerShell script block logging enabled.",
            "action": [
              "Apply regular expressions to command-line logs (Windows Event ID 4688) and PowerShell script blocks (Windows Event ID 4104) to detect patterns such as 'gci . -r -i *.docx | Compress-Archive -p out.zip' or 'dir /s /b *.xls* | findstr /v \"TEMP\"'.",
              "Calculate the Shannon entropy of command lines and script blocks to measure randomness, which can indicate obfuscation or packed commands. Establish a baseline for normal administrative activity and alert when a script's entropy exceeds the 95th percentile.",
              "Utilize a pre-trained NLP model (e.g., a transformer-based model) fine-tuned on security data to analyze token sequences and command co-occurrence. Classify each script block as 'benign administrative task', 'suspicious reconnaissance', or 'malicious collection'."
            ]
          },
          {
            "description": "A single process reads more than 500 files from at least 10 unique directories within a 5-minute window, followed by a write operation to a single archive file (e.g., .zip, .rar, .7z) or a temporary staging file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical file servers, SharePoint sites, and repositories of sensitive intellectual property or Personally Identifiable Information (PII).",
            "action": [
              "Enable 'Audit File System' SACL on critical directories, then create a rule that triggers when a single Process ID generates >500 file read events (Windows Event ID 4663) from >10 unique directories within 5 minutes, and is immediately followed by a process creation event (Windows Event ID 4688) for a known archiver (e.g., 7z.exe, rar.exe, tar.exe).",
              "For each process on high-value servers, track the rate of unique file paths accessed per minute. Using a 30-day baseline, flag any process where this access rate exceeds 3 standard deviations above the historical average for that specific process name or user context.",
              "Employ a time-series anomaly detection model (e.g., an LSTM autoencoder) on the stream of file access events (count per minute) for each high-value host. The model learns the normal rhythm of file interactions and flags sudden, sharp spikes in access volume that deviate significantly from the learned pattern."
            ]
          },
          {
            "description": "A non-interactive process (e.g., spawned by a service or scheduled task) or a process spawned from an unusual parent (e.g., winword.exe spawning powershell.exe) accesses more than 20 files with sensitive extensions (.docx, .xlsx, .pdf, .pst, .kdbx) from user profile directories or designated sensitive network shares within a 10-minute window.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations (specifically C:\\Users\\*\\Documents), network shares containing HR or financial data, and code repositories.",
            "action": [
              "Deploy and monitor 'honeypot' files and directories with enticing names (e.g., 'C:\\CorpData\\2026_M&A_Strategy.docx'). Configure high-fidelity alerting for any access event (Windows Event ID 4663) on these objects, as no legitimate process should ever touch them.",
              "Develop a 'sensitive file access score' by assigning weights to file paths (e.g., 'C:\\Users\\*\\Documents' = 5 points) and extensions (e.g., '.kdbx' = 10 points). Sum the scores for all files a process accesses in a 5-minute window. Flag any non-interactive process that accumulates a score exceeding the 98th percentile of all process scores network-wide.",
              "Construct a graph where nodes represent users, processes, and file paths, with edges representing historical access. Apply a community detection algorithm (e.g., Louvain Modularity) to identify normal clusters of activity. An edge created by a new access event that bridges two otherwise disconnected communities (e.g., a web server process accessing a file in the 'HR' community) indicates a high-risk anomaly."
            ]
          },
          {
            "description": "A statistically significant increase (>100MB) in a host's outbound data volume to a single external destination within a 30-minute window, which is temporally correlated (occurs within 1 hour) with preceding on-host indicators of automated collection from the same host.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (firewalls, proxies), DNS servers, and all endpoints/servers.",
            "action": [
              "Create a SIEM correlation rule that triggers if any host-based 'Automated Collection' alert is followed within 1 hour by a single network connection (Zeek conn.log) from the same host to a new external IP (not seen in 30 days) with a total outbound data transfer ('orig_bytes') greater than 100MB.",
              "For each internal host, establish a time-series baseline of outbound bytes per 10-minute interval using Zeek conn.log data. Alert when a host's outbound traffic exceeds the 99th percentile of its own historical baseline. Enrich the alert with the destination domain's age and prevalence from Zeek dns.log and its category from threat intelligence.",
              "Implement a cross-domain sequence analysis model (e.g., Hidden Markov Model or RNN) that ingests a combined stream of host and network events. Flag anomalous sequences that represent collection and exfiltration, such as 'powershell.exe script execution' -> 'high-volume file reads' -> 'DNS query for rare domain' -> 'large outbound connection to that domain's IP'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]