[
  {
    "information_requirement": "Is the adversary collecting sensitive information via email forwarding rules?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1114.003",
        "name": "Email Forwarding Rule",
        "evidence": [
          {
            "description": "An email is auto-forwarded to an external domain that is either present on a threat intelligence list or is not on an established allow-list of known business partners.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log",
              "Mail server logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Mail Gateway Servers, Cloud Mail Service Tenant (e.g., Microsoft 365, Google Workspace)",
            "action": [
              "Symbolic: From mail server logs or Zeek smtp.log, extract recipient addresses from messages with a forwarding header (e.g., `X-MS-Exchange-Organization-AutoForwarded: true`). Join these addresses with network flow data (Zeek conn.log) to identify the destination IP. Compare the recipient domain and destination IP against a threat intelligence feed of known malicious infrastructure and a curated allow-list of expected business partner domains. Alert on any match to the threat feed or any domain not on the allow-list.",
              "Statistical: For all external forwarding destinations, calculate the rarity of each destination domain across the organization over a 30-day baseline using frequency analysis. Flag any domain that appears for the first time and is the destination for more than one user's forwarding rule within a 24-hour period, especially if the domain has a low reputation score from a third-party service.",
              "Machine Learning: Develop a classification model trained on features of forwarded emails, such as destination domain TLD, domain age, and ASN information. The model should classify each forwarding event as 'benign' or 'suspicious'. A high-confidence 'suspicious' classification, especially when correlated with a new forwarding rule creation event, triggers an alert."
            ]
          },
          {
            "description": "A command is executed via PowerShell or command-line interface that creates or modifies an email inbox rule to forward, redirect, or attach-and-forward messages to an external email address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Exchange Servers (On-premise), Domain Controllers, Endpoint Devices, Cloud Mail Service Tenant (e.g., Microsoft 365, Google Workspace)",
            "action": [
              "Symbolic: From PowerShell script block logs (Windows Event ID 4104) and process command-line logs (Windows Event ID 4688), search for exact string matches of cmdlets like `Set-InboxRule`, `New-InboxRule`, and `Set-Mailbox` combined with parameters like `-ForwardTo`, `-ForwardingSmtpAddress`, `-RedirectTo`, or `-ForwardAsAttachmentTo`. Immediately alert if the target address is an external domain not on an approved partner list.",
              "Statistical: Establish a baseline of accounts that legitimately use mail-related PowerShell cmdlets (e.g., Exchange administrators). Calculate the entropy of command-line arguments for these cmdlets. A high entropy score, potentially indicating obfuscation, or the execution of these cmdlets by a non-privileged user for the first time, should be flagged. Alert if the Z-score for a user's execution frequency of these commands exceeds a threshold (e.g., > 3) in a 24-hour window.",
              "Machine Learning: Use an anomaly detection model (e.g., Isolation Forest) on features extracted from command execution events including the executing user, parent process, time of day, and command parameters. The model should identify executions that are outliers compared to the historical norm for the user and the organization. An anomalous execution that creates a forwarding rule is a high-fidelity alert."
            ]
          },
          {
            "description": "A new email forwarding rule is created, or the volume of forwarded emails from a specific account exceeds a statistically significant threshold compared to its historical baseline.",
            "data_sources": [
              "Microsoft 365 Unified Audit Log",
              "Zeek smtp.log",
              "Zeek conn.log",
              "Mail server logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Mail Service Tenant (e.g., Microsoft 365, Google Workspace), Network Egress Points, Mail Gateway Servers",
            "action": [
              "Symbolic: Monitor Microsoft 365 Unified Audit Logs for `New-InboxRule` and `Set-InboxRule` operations where the `ForwardTo` or `ForwardAsAttachmentTo` parameter is populated with an external address. Correlate this audit event with network logs (Zeek smtp.log) showing an immediate flow of forwarded emails to that new address. Alert on this correlation.",
              "Statistical: For each user, establish a daily baseline of forwarded email volume using a 30-day moving average and standard deviation from mail server or Zeek logs. Alert if a user's daily forwarded email count exceeds 3 standard deviations above their personal baseline. Additionally, flag any user who enables forwarding for the first time and forwards more than the 95th percentile of organizational forwarding volume on that first day.",
              "Machine Learning: Apply a time series forecasting model (e.g., ARIMA) to each user's daily forwarded email volume. An alert is generated when the actual observed volume significantly deviates from the forecasted volume, exceeding a predefined confidence interval. This method is effective at detecting sudden, sustained changes in forwarding behavior indicative of a compromised account."
            ]
          },
          {
            "description": "A process other than a standard email client (e.g., outlook.exe) or administrative script host (e.g., powershell.exe) modifies files or registry keys associated with email client rules.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 11",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoint Devices, Virtual Desktop Infrastructure (VDI) Servers",
            "action": [
              "Symbolic: Create a rule to look for file write events (Sysmon Event ID 11) or registry set events (Sysmon Event ID 13) to paths associated with Outlook rules (e.g., `.rwz` files, or registry keys under `...\\Outlook\\Profiles\\...`) where the process name is not `outlook.exe`. Alert on any such event.",
              "Statistical: Profile the set of processes that normally interact with email rule files and registry keys on endpoints. Maintain a frequency count of these processes. Alert if a process that has never or rarely been observed interacting with these assets (e.g., present in <1% of historical interactions) performs a write or modification action.",
              "Machine Learning: Train a decision tree classifier to predict whether a file or registry modification related to email rules is malicious. Features would include the process name, parent process name, command-line arguments, and user context. The model can be trained on known benign activity (e.g., `outlook.exe` modifications) and simulated malicious activity. Alerts are generated for modifications classified as malicious with high confidence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]