[
  {
    "information_requirement": "Is the adversary collecting sensitive information via video capture? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1125",
        "name": "Video Capture",
        "evidence": [
          {
            "description": "A process execution event where the process name or file hash matches a known indicator of malware with video capture capabilities.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, particularly those assigned to executives, developers, and system administrators.",
            "action": [
              "Symbolic: Query process creation events (Windows Event ID 4688) and join with Threat Intelligence feeds. Alert when ProcessName or an associated file hash matches a known malicious indicator associated with T1125 malware (e.g., FruitFly, Proton). [1]",
              "Statistical: For processes observed accessing video APIs or drivers, calculate the prevalence of the parent process across the enterprise. Flag parent processes that fall below a 5th percentile prevalence threshold, indicating they are rare and potentially suspicious launchers of camera-related activity.",
              "Machine Learning: Train a decision tree or random forest classifier on process execution features (e.g., parent process, command-line length, file path entropy, signature status, user context). Use a labeled dataset of known benign (e.g., teams.exe, zoom.exe) and malicious video capture processes to classify new, unseen processes as malicious or benign."
            ]
          },
          {
            "description": "A process creation event for a legitimate utility (e.g., powershell.exe, ffmpeg.exe) containing command-line arguments indicative of non-interactive video capture.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, particularly those belonging to high-value targets.",
            "action": [
              "Symbolic: Using process creation logs with command-line auditing (Windows Event ID 4688), search for regular expressions matching known malicious usage of legitimate tools. Examples include PowerShell invoking .NET classes like 'DirectShowLib' or command-line tools like 'ffmpeg.exe' with arguments specifying a video capture device (e.g., '-f dshow -i video=\"Integrated Camera\"') and an output file path.",
              "Statistical: For each command-line execution of known video-capable utilities (e.g., powershell.exe, ffmpeg.exe), calculate the Jaccard similarity between its arguments and a historical baseline of benign arguments for that user/host. Flag commands with a similarity score below a statistically determined threshold (e.g., 10th percentile) as anomalous.",
              "Machine Learning: Apply a Natural Language Processing (NLP) model, like a bag-of-words or TF-IDF vectorizer followed by a logistic regression classifier, to the command-line arguments. Train the model on labeled benign (e.g., GUI-initiated use) and malicious (e.g., scripted, non-interactive) command lines to predict the intent of new executions."
            ]
          },
          {
            "description": "A process, not present on an allowlist of approved video-conferencing applications, is observed creating a handle to a video capture device, especially if the process is unsigned or has a low prevalence across the enterprise.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints equipped with integrated or peripheral webcams.",
            "action": [
              "Symbolic: Monitor Sysmon Event ID 10 (ProcessAccess) for any process accessing a device object with a name like '\\Device\\Video0'. Compare the SourceImage (the process accessing the device) against a pre-defined allowlist of signed, legitimate video-conferencing applications (e.g., teams.exe, zoom.exe). Alert on any process not on the list.",
              "Statistical: For all processes accessing video devices, calculate their enterprise-wide prevalence (count of distinct hosts they run on). Use a percentile-based threshold (e.g., alert on processes in the bottom 5th percentile of prevalence) to identify rare and potentially unauthorized applications.",
              "Machine Learning: Develop an autoencoder neural network trained exclusively on feature sets from legitimate video-conferencing applications (e.g., process path, parent process, user context, signature status). Monitor new processes accessing video devices; a high reconstruction error from the autoencoder indicates the process behavior is anomalous and does not conform to the learned pattern of legitimate activity."
            ]
          },
          {
            "description": "A process creates one or more files with video or image extensions (.mp4, .avi, .jpg) in a non-standard directory (e.g., %TEMP%, %PUBLIC%), where the creating process is not an approved application and the filename exhibits high entropy.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Common staging directories on user endpoints, such as %APPDATA%, %TEMP%, C:\\Users\\Public, and temporary internet file locations.",
            "action": [
              "Symbolic: Monitor file creation events (Sysmon Event ID 11) for files with video or image extensions created by processes not on the video application allowlist. Define rules to flag creations in suspicious directories like '%APPDATA%\\Local\\Temp' or 'C:\\Users\\Public'.",
              "Statistical: For file creation events matching video/image types, calculate the Shannon entropy of the filename (excluding extension). Establish a baseline entropy score for legitimate files. Flag files with an entropy score exceeding a high threshold (e.g., > 3.5 bits per character), which often indicates programmatic or randomized naming to avoid detection.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on file creation events. Feature dimensions could include file size, creation directory, creating process name, and time between creations. A tight cluster of similarly-sized files created at regular intervals by an unusual process could represent periodic video/image captures and would be identified as a distinct, anomalous cluster."
            ]
          },
          {
            "description": "A significant increase in the volume of outbound network traffic from an endpoint, or the transfer of files with video/image MIME types, occurring within a short time window after a suspected video capture event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies) and the network interfaces of individual endpoints.",
            "action": [
              "Symbolic: Correlate a suspicious process execution alert (from other evidence) with network logs. Within 5 minutes of the alert, search Zeek files.log for any file transfers from the source host where the mime_type is 'video/*' or 'image/*' to a destination IP not on an allowlist of corporate or cloud services.",
              "Statistical: For each host, create a historical baseline of outbound data volume (orig_bytes in Zeek conn.log) per hour. Monitor for deviations from this baseline. Alert if the outbound data volume for a given hour exceeds the 99th percentile of that host's historical distribution, especially if it correlates with other suspicious host-based activity.",
              "Machine Learning: Implement a time series forecasting model (e.g., ARIMA or LSTM) for each host's outbound network traffic. Continuously forecast the expected traffic volume for the next interval. If the actual observed traffic significantly exceeds the forecasted volume (i.e., the residual error is anomalously high), flag it as a potential exfiltration event. Correlate this anomaly with preceding host-based alerts for T1125."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]