[
  {
    "information_requirement": "Is an adversary using the JamPlus build utility to evade defenses and execute malicious code? (TA0005 - Defense Evasion)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1127.003",
        "name": "JamPlus",
        "evidence": [
          {
            "description": "The file hash of an executed 'jam.exe' or 'JamPlus.exe' binary matches a known-bad hash from threat intelligence feeds, or a network connection initiated by the JamPlus process communicates with an IP address or domain on a C2 blocklist.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer Workstations, CI/CD Build Servers, Network Egress Points",
            "action": [
              "Symbolic (IOC Match): For each process creation event (Windows Event ID 4688) where the process name is 'jam.exe' or 'JamPlus.exe', compute the SHA256 hash of the executable. Alert if this hash matches any entry in a threat intelligence feed of known-malicious file hashes.",
              "Statistical (Frequency Analysis): Correlate JamPlus process executions (Windows Event ID 4688) with subsequent DNS queries (Zeek dns.log). Calculate the frequency of requested top-level domains (TLDs). Flag queries for TLDs that fall below the 1st percentile of usage across the enterprise (e.g., .xyz, .online), as these are frequently used for malicious campaigns.",
              "Machine Learning (Classification): Train a decision tree classifier on features from process execution events (Windows Event ID 4688) and associated network connections (Zeek conn.log). Features should include parent process name, command-line argument entropy, destination IP reputation (from a threat feed), destination port, and data volume transferred. Use the model to classify each JamPlus execution's network activity as benign or malicious."
            ]
          },
          {
            "description": "A 'jam.exe' or 'JamPlus.exe' process is executed from a file path outside of approved developer tool directories (e.g., '%PROGRAMFILES%\\Jam') or on a host not designated as a developer workstation or build server.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "General User Endpoints, File Servers, Domain Controllers",
            "action": [
              "Symbolic (Allowlist/Blocklist): Maintain an explicit allowlist of hosts and file paths where JamPlus execution is permitted. Create a SIEM rule to alert on any 'jam.exe' or 'JamPlus.exe' process creation (Windows Event ID 4688) that originates from a host or file path not on this allowlist, or from a path on a blocklist (e.g., C:\\Users\\Public\\, %TEMP%).",
              "Statistical (Rarity): For all 'jam.exe' or 'JamPlus.exe' executions, profile the execution directory path. Calculate the frequency of each unique path across the enterprise over a 30-day window. Alert on executions from a path that falls in the bottom 5th percentile of frequency, indicating an abnormally rare location for this tool to be run from.",
              "Machine Learning (Anomaly Detection): Use an isolation forest algorithm trained on legitimate JamPlus execution data (Windows Event ID 4688). Features should include the user account's department, host role (e.g., developer vs. finance), execution path, and parent process name. Use the trained model to identify anomalous executions that do not conform to the established profile of legitimate development activity."
            ]
          },
          {
            "description": "The parent process of 'jam.exe' or 'JamPlus.exe' is not a standard command shell ('cmd.exe', 'powershell.exe') or a known developer IDE ('devenv.exe', 'explorer.exe'); for instance, the parent is 'winword.exe', 'outlook.exe', or 'msedge.exe'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "General User Endpoints, Developer Workstations, CI/CD Build Servers",
            "action": [
              "Symbolic (Relationship Blocklist): Create a SIEM rule that triggers on the execution of 'jam.exe' or 'JamPlus.exe' (Windows Event ID 4688) where the parent process name is in a blocklist of suspicious parents, such as 'winword.exe', 'excel.exe', 'outlook.exe', 'wscript.exe', or 'mshta.exe'.",
              "Statistical (Frequency Analysis): Generate a baseline of all legitimate parent-child process relationships for 'jam.exe' and 'JamPlus.exe' over a 30-day period. Calculate the frequency of each unique parent process. Alert when a new execution occurs with a parent process whose frequency is below a 1% threshold, indicating a rare and potentially suspicious event.",
              "Machine Learning (Classification): Train a Naive Bayes classifier on process lineage data (parent, child). Features should be the names of the processes in the chain. Use the classifier to predict the probability that a given parent-child relationship (e.g., 'outlook.exe' -> 'jam.exe') is malicious. Alert on classifications with a high probability score."
            ]
          },
          {
            "description": "A 'jam.exe' or 'JamPlus.exe' process spawns a child process known to be used for malicious post-exploitation activity, such as 'powershell.exe', 'rundll32.exe', 'certutil.exe', or any process that is not a standard compiler or linker.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer Workstations, CI/CD Build Servers, General User Endpoints",
            "action": [
              "Symbolic (Child Process Blocklist): Monitor for process creation events (Windows Event ID 4688) where the parent process is 'jam.exe' or 'JamPlus.exe' and the child process name is on a watchlist of suspicious utilities (e.g., 'powershell.exe', 'cmd.exe', 'wscript.exe', 'certutil.exe', 'bitsadmin.exe', 'rundll32.exe').",
              "Statistical (Command-Line Entropy): For all child processes spawned by JamPlus, calculate the Shannon entropy of their command-line arguments. Establish a baseline entropy score for legitimate compiler/linker commands. Flag any child process whose command-line entropy exceeds the 95th percentile, which can indicate obfuscated or encoded commands often used by malware.",
              "Machine Learning (Clustering): Use a DBSCAN clustering algorithm on child processes spawned by JamPlus. Features should include the child process name, command-line length, and command-line entropy. Identify and investigate any processes that are labeled as noise or belong to small, sparse clusters, as they are outliers from the dense cluster of legitimate build activities."
            ]
          },
          {
            "description": "A network connection initiated by 'jam.exe', 'JamPlus.exe', or one of its direct child processes exhibits characteristics of C2 communication, such as a periodic 'heartbeat' pattern in connection timing or data transfer volumes inconsistent with legitimate activities.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, Developer Workstations",
            "action": [
              "Symbolic (IOC Match): Correlate process execution (Windows Event ID 4688) with network connections (Windows Event ID 5156, Zeek conn.log). Alert if the destination IP or domain (from Zeek dns.log) of a connection from JamPlus or its children matches a known-malicious entry on a threat intelligence feed.",
              "Statistical (Beaconing Detection): After a JamPlus execution, analyze the time delta between subsequent outbound connections (from Zeek conn.log) to the same destination IP. Calculate the standard deviation of these time deltas over a 15-minute window. A standard deviation below 1.0 second is indicative of a fixed-interval C2 beacon and should be investigated.",
              "Machine Learning (Time-Series Anomaly Detection): Apply an autoencoder to network flow data (from Zeek conn.log) associated with JamPlus processes. Features should include connection duration, total packets, total bytes, and destination port. After training on legitimate build-related network traffic, use the model to detect anomalies. Flows with a high reconstruction error are flagged as anomalous and potentially malicious C2 traffic."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]