[
  {
    "information_requirement": "Is the adversary using ClickOnce applications for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1127.002",
        "name": "ClickOnce",
        "evidence": [
          {
            "description": "A network connection or file transfer associated with a ClickOnce application (.application or .appref-ms) involves a URL, domain, IP address, or file hash that is present on a threat intelligence blocklist.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Internet Gateway/Proxy Servers, DNS Resolvers, SIEM/Threat Intelligence Platform",
            "action": [
              "Join network logs (Zeek http.log, dns.log) with file analysis logs (Zeek files.log) on the client IP and timestamp. For any HTTP request for a file ending in .application or .appref-ms, or any file with a corresponding MIME type, cross-reference the requested domain, server IP, and file hash (if available from files.log) against a threat intelligence feed. Generate an alert for any match.",
              "From Zeek dns.log and http.log, extract all domains serving .application or .appref-ms files. For each domain, enrich it with external data (domain age, registration details, Tranco rank) and internal data (first seen, last seen, request count). Calculate a risk score where new domains (<30 days old), unpopular domains (low rank), and domains rarely seen in the organization receive higher scores. Alert when a download occurs from a domain whose risk score exceeds the 99th percentile of all software-hosting domains observed.",
              "Develop a supervised classification model (e.g., Gradient Boosting) to predict malicious ClickOnce downloads. Extract features from Zeek http.log and dns.log, including URL length, URL entropy, number of query parameters, TLD, domain age, and domain popularity. Train the model using labeled data from threat intelligence and known-good sources. Deploy the model to score every new ClickOnce download event in real-time, generating an alert for any event classified as malicious with a confidence score above a set threshold (e.g., 0.9)."
            ]
          },
          {
            "description": "A process creation event is observed for rundll32.exe where the command line arguments include both 'dfshim.dll' and 'ShOpenVerbApplication'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers, Application Servers",
            "action": [
              "Create a high-severity alert that triggers on any process creation event (Windows Event ID 4688) where ProcessName is 'rundll32.exe' and CommandLine contains both 'dfshim.dll' and 'ShOpenVerbApplication'. This is a high-fidelity indicator of malicious ClickOnce execution.",
              "For all executions matching the symbolic rule, aggregate the parent process names over a 30-day baseline. Calculate the frequency of each parent process. Alert if the parent process (e.g., winword.exe, powershell.exe) for a new dfshim.dll execution is statistically rare, falling below the 5th percentile of observed parent processes for this specific command.",
              "Implement a process lineage analysis model. For each 'rundll32.exe dfshim.dll' execution, extract the parent-grandparent-great-grandparent process chain from correlated Windows Event ID 4688 events. Use a clustering algorithm (e.g., K-Means on feature vectors of the process chain) to group normal execution chains (e.g., explorer.exe -> cmd.exe -> rundll32.exe). Flag any execution whose process chain is flagged as an anomaly or falls into a new, small cluster, especially if the lineage includes suspicious parents like Office applications or scripting hosts."
            ]
          },
          {
            "description": "The trusted ClickOnce service process, dfsvc.exe, spawns a child process whose name or command line is not on an established organizational allowlist.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Servers with .NET applications, Virtual Desktop Infrastructure (VDI) environments",
            "action": [
              "Query all process creation events (Windows Event ID 4688) where the ParentProcessName is 'dfsvc.exe'. Build an allowlist of legitimate ProcessName children over a 30-day baseline period. Create a detection rule to alert on any new child process spawned by 'dfsvc.exe' that is not on the allowlist, with high severity for scripting engines (powershell.exe, cmd.exe, cscript.exe) or other LOLBAS.",
              "For each allowlisted child process of dfsvc.exe, calculate the baseline distribution of its command-line length and Shannon entropy over a 30-day period. For each new execution, compare its command-line length and entropy to the historical distribution for that process name. Alert if either metric exceeds the 98th percentile, indicating potentially obfuscated or anomalous parameters.",
              "Apply an unsupervised anomaly detection algorithm (e.g., Isolation Forest) to child processes of dfsvc.exe. Use features from Windows Event ID 4688 such as command-line length, count of special characters in the command line, and a one-hot encoded process name. Train the model on a baseline of normal activity. Flag any new process execution that receives a high anomaly score from the model for analyst review."
            ]
          },
          {
            "description": "A network download of a .application or .appref-ms file from a domain not on the corporate allowlist is followed within a short time window (e.g., 2 minutes) by the execution of dfsvc.exe or rundll32.exe with dfshim.dll on the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Proxy Servers, User Workstations, DNS Resolvers",
            "action": [
              "Maintain an allowlist of domains authorized to host ClickOnce applications. Correlate Zeek http.log (for requests to URIs ending in .application or .appref-ms) with Windows Event ID 4688 on the client IP address and a 2-minute time window. Generate an alert if a download from a non-allowlisted domain is followed by the execution of dfsvc.exe or rundll32.exe with dfshim.dll on the same host.",
              "From Zeek http.log, identify all external server IPs hosting ClickOnce files. For each server IP, count the number of distinct internal clients (id.orig_h) that have downloaded from it over the last 90 days. Calculate the distribution of this 'client count' across all servers. Alert when a download occurs from a server IP that is in the bottom 5th percentile (a 'long tail' server), as this indicates it is not a common software distribution point.",
              "Aggregate the count of ClickOnce file downloads (.application, .appref-ms) per hour from Zeek http.log. Train a time-series forecasting model (e.g., SARIMA) on this data to predict the expected volume of downloads. Generate an alert if the actual download count in any given hour exceeds the forecasted upper confidence bound by a significant margin, which could indicate a coordinated campaign."
            ]
          },
          {
            "description": "A file with a .appref-ms extension is created or modified within a user's Startup directory (%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Startup Folders on Endpoints, File System Audit Logs, Domain Controllers (for GPO-based monitoring)",
            "action": [
              "Enable file system object access auditing (SACL) for 'Write' actions on all user Startup folders. Create a high-severity alert for any Windows Event ID 4663 where the ObjectName is within a Startup folder path ('...\\Start Menu\\Programs\\Startup') and ends with '.appref-ms'. This is a direct indicator of persistence via this technique.",
              "Using an endpoint management tool or logon script, periodically collect an inventory of all .appref-ms files in user Startup folders across the enterprise. For each unique file (by hash), calculate its prevalence (the percentage of endpoints on which it appears). Alert on any .appref-ms file whose prevalence is below a threshold (e.g., <1% of the fleet) and is not part of a known, targeted software deployment.",
              "Create feature vectors for all files found in Startup folders, including file extension, file name entropy, file size, and whether the file is digitally signed. Apply an unsupervised clustering algorithm (e.g., DBSCAN) to group these files. Any .appref-ms file that is classified as a 'noise' point (an outlier) by the model should be flagged for immediate investigation, as it does not conform to the properties of common, legitimate startup items."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]