[
  {
    "information_requirement": "Is the adversary maintaining persistence by abusing Office Template Macros?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1137.001",
        "name": "Office Template Macros",
        "evidence": [
          {
            "description": "An Office template file (.dotm, .xltm) is created or modified, and its file hash matches a known-bad value from threat intelligence.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek files.log",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations (specifically %APPDATA%\\Microsoft\\Templates and %APPDATA%\\Microsoft\\Excel\\XLSTART), File servers hosting shared templates, Network egress points",
            "action": [
              "Create a detection rule that triggers when a file creation or write event (Windows Event ID 4663, Sysmon Event ID 11) occurs for a file with a .dotm or .xltm extension in a known Office template path, and the file's hash matches a malicious hash list from a threat intelligence feed.",
              "For each host, calculate the daily count of new or modified .dotm and .xltm files. Establish a 30-day rolling baseline of this count per host and per organizational unit. Alert if the daily count for a host exceeds the 95th percentile of its historical activity, or if the file extension is rare for that user (e.g., a user who has never created an .xltm file suddenly does).",
              "Train a supervised classification model (e.g., XGBoost) using a labeled dataset of benign and malicious Office template files. Engineer features from the file content itself, such as the presence and size of a VBA macro project, the number of suspicious API calls (e.g., CreateProcess, Shell), and the entropy of the macro code. Deploy the model to classify newly created template files, alerting on those classified as malicious."
            ]
          },
          {
            "description": "A modification is made to a Windows Registry key that controls Office template locations (e.g., GlobalDotName) or macro security settings (e.g., VBAWarnings), and the modification is performed by a process not associated with standard software installation or Group Policy updates.",
            "data_sources": [
              "Windows Event ID 4657",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Registry on all endpoints (user workstations and servers), Group Policy Objects on Domain Controllers",
            "action": [
              "Monitor for registry value set events (Windows Event ID 4657, Sysmon Event ID 13) for keys using wildcards like `HKCU\\Software\\Microsoft\\Office\\*\\Word\\Options\\GlobalDotName` or `HKCU\\Software\\Microsoft\\Office\\*\\*\\Security\\VBAWarnings`. Alert if the process performing the change is not in an approved allowlist (e.g., `gpupdate.exe`, `msiexec.exe`, `CcmExec.exe`) or if the new value for VBAWarnings is '1' (enables all macros).",
              "For the `VBAWarnings` and `GlobalDotName` registry keys, build a baseline of all observed values across the enterprise. Calculate the frequency of each value. Alert on any modification that sets a key to a value that has been seen on less than 1% of endpoints, indicating a rare and potentially unauthorized configuration change.",
              "Implement a one-class SVM model trained on legitimate registry modification events, using features like the modifying process name, the full registry key path, and the previous/new values. The model learns the boundary of normal administrative and user activity. Flag any new modification event that the model classifies as an outlier, as it falls outside the learned boundary of normal behavior."
            ]
          },
          {
            "description": "An Office application process (WINWORD.EXE, EXCEL.EXE, POWERPNT.EXE) spawns a suspicious child process, such as a command shell, scripting interpreter, or a known living-off-the-land binary (LOLBin).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, remote desktop servers, and virtual desktop infrastructure (VDI) endpoints",
            "action": [
              "Create a rule that triggers on a process creation event (Windows Event ID 4688, Sysmon Event ID 1) where the ParentProcessName is `WINWORD.EXE`, `EXCEL.EXE`, or `POWERPNT.EXE` and the ProcessName is one of: `cmd.exe`, `powershell.exe`, `wscript.exe`, `cscript.exe`, `mshta.exe`, `rundll32.exe`, `regsvr32.exe`, `bitsadmin.exe`, or `certutil.exe`.",
              "For each parent Office process, create a historical baseline of its child processes and the associated command-line arguments. Calculate the Shannon entropy of the command lines. Alert when an Office application spawns a child process that is statistically rare for that parent (e.g., <0.1% frequency) or when the command-line entropy is in the top 99th percentile, suggesting obfuscation or complexity.",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN) to group command-line arguments from child processes spawned by Office applications. The clusters will represent common, legitimate activity patterns. Flag any command line as an outlier if it does not belong to an existing cluster or forms a new, small cluster, indicating it is a novel and potentially malicious command."
            ]
          },
          {
            "description": "An Office application process initiates an outbound network connection to a destination FQDN/IP on a threat intelligence watchlist or exhibits other anomalous network characteristics.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, User workstations",
            "action": [
              "Correlate process (Sysmon Event ID 1) and network (Sysmon Event ID 3, Zeek conn.log) data. Alert when an Office process initiates a network connection to an IP address on a known Tor node list, a dynamic DNS provider domain, or a domain registered within the last 30 days (queried from Zeek dns.log).",
              "For each Office application, baseline its network behavior by destination countries, Autonomous System Numbers (ASNs), destination ports, and data volume (`orig_bytes` + `resp_bytes` in Zeek conn.log). Alert if a new connection is made to a country/ASN not seen in the last 90 days for that application, or if the total data transferred in a single session exceeds the 98th percentile of the historical baseline for that host.",
              "Apply a time-series forecasting model (e.g., Prophet or ARIMA) to the total outbound data volume (`orig_bytes`) from all Office processes on a per-host, per-hour basis. The model will predict the expected data volume. Alert if the actual observed data volume significantly exceeds the upper bound of the model's prediction confidence interval, which could indicate C2 communication or data exfiltration."
            ]
          },
          {
            "description": "A correlated sequence of events occurs on a single host within a short time frame: 1) an Office template file is created or modified, 2) the corresponding Office application is launched, and 3) the application then initiates a suspicious child process or an anomalous network connection.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, File servers storing templates, Network and DNS infrastructure",
            "action": [
              "Create a stateful correlation rule that triggers if, on the same host within a 5-minute window: (Event A) a file write event (Windows Event ID 4663) for `Normal.dotm` or a file in an `XLSTART` directory occurs, followed by (Event B) a process creation event (Sysmon Event ID 1) where the parent is the corresponding Office application and the child is `powershell.exe` or `cmd.exe`.",
              "Following a template file modification (Windows Event ID 4663), begin a 10-minute monitoring window for that host. Assign risk points for subsequent events: +10 for a rare child process, +15 for a network connection to a new ASN, +20 for a high-entropy command line. Sum the points. Establish a baseline for this risk score across all hosts. Alert if the cumulative score for a sequence exceeds 3 standard deviations above the mean host score.",
              "Train a Hidden Markov Model (HMM) on sequences of events from benign user sessions (e.g., file write -> app launch -> network connection to SharePoint). The model learns the normal transition probabilities between states. For each new sequence of events on a host, calculate its likelihood score under the trained HMM. A sequence with a very low likelihood score is anomalous and potentially malicious, indicating a deviation from normal operational patterns."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]