[
  {
    "information_requirement": "Has the adversary escalated privileges using SID-History Injection? (PIR)",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1134.005",
        "name": "SID-History Injection",
        "evidence": [
          {
            "description": "A process creation event is logged on a Domain Controller for a known SID-History injection tool, such as mimikatz.exe, with command-line arguments specific to SID manipulation like 'sid::add' or 'sid::patch'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SIEM/Log Aggregator",
            "action": [
              "Create a SIEM rule to alert when a process creation event (Windows Event ID 4688) on a Domain Controller contains command-line arguments matching known patterns for SID-History injection, such as 'sid::add', 'sid::patch', 'Invoke-SIDHistory', 'Add-DomainObjectSidHistory', or 'lsadump::dcsync /user:victim /patch_sid'.",
              "Calculate the Shannon entropy for command-line arguments in all process creation events (Windows Event ID 4688) on Domain Controllers. Establish a baseline distribution and alert on any command whose entropy score exceeds the 98th percentile, indicating potential obfuscation used to hide tool execution.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on a labeled dataset of command-line strings, differentiating malicious tool usage from benign administrative commands. Deploy the model to score new process creation events in real-time, flagging those with a high probability of being malicious for analyst review."
            ]
          },
          {
            "description": "A Directory Service Changes event (Windows Event ID 5136) or an LDAP Modify Request (Zeek ldap.log) shows a SID being added to the 'sIDHistory' attribute that is either a well-known privileged SID (e.g., Enterprise Admins 'S-1-5-domain-519') or belongs to the same domain as the target account, which is not standard practice for domain migrations.",
            "data_sources": [
              "Windows Event ID 5136",
              "Zeek ldap.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network segments containing LDAP traffic to Domain Controllers, SIEM/Log Aggregator",
            "action": [
              "Create a SIEM rule to alert on any Windows Event ID 5136 where the 'LDAP Display Name' is 'sIDHistory' and the 'Value' added contains a well-known privileged SID (e.g., S-1-5-domain-512 for Domain Admins, S-1-5-domain-519 for Enterprise Admins) or has the same domain identifier as the target account's primary SID.",
              "Establish a baseline for the rate of sIDHistory modifications (Windows Event ID 5136) per user over a 30-day period. Alert on any user account that has more than one modification in a 24-hour period, or whose modification frequency exceeds the 99th percentile of the established baseline, excluding known service accounts for domain migration.",
              "Deploy an unsupervised anomaly detection model (e.g., Isolation Forest) trained on features from sIDHistory modification events (source IP, source account, time of day, day of week, type of SID added). The model identifies rare and suspicious combinations of these features that deviate from benign migration activity."
            ]
          },
          {
            "description": "Within a 30-minute window, a user's 'sIDHistory' attribute is modified (Windows Event ID 5136), and this is immediately followed by a successful logon (Windows Event ID 4624) by that same user to a critical system (e.g., Domain Controller, primary database) where they have no history of prior access.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical servers (e.g., database servers, application servers), SIEM/Log Aggregator",
            "action": [
              "Implement a stateful correlation rule that triggers when a specific user's sIDHistory is modified (Event ID 5136) and is followed within 30 minutes by a successful logon (Event ID 4624, Logon Type 2, 3, or 10) from that same user to a system on a 'Critical Asset' watch list. The rule should exclude accounts on an approved migration allow-list.",
              "Maintain a historical baseline of user-to-host logon pairs. For any user whose sIDHistory is modified, calculate a rarity score for their subsequent logons based on historical frequency. A logon to a host where the user has a zero or near-zero historical logon frequency (e.g., a first-time logon) should trigger a high-severity alert.",
              "Develop a sequence analysis model (e.g., using a Hidden Markov Model or Recurrent Neural Network) trained on typical user activity sequences (logon, resource access, logoff). Flag any sequence containing 'sIDHistory modification -> logon to new critical asset -> privileged command execution' as a high-probability privilege escalation attack path."
            ]
          },
          {
            "description": "The aggregate count of Directory Service Changes events (Windows Event ID 5136) for the 'sIDHistory' attribute on a single Domain Controller exceeds a statistically determined threshold over a one-hour period.",
            "data_sources": [
              "Windows Event ID 5136"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SIEM/Log Aggregator",
            "action": [
              "Create a threshold-based rule that alerts if the count of Windows Event ID 5136 events with 'LDAP Display Name' of 'sIDHistory' exceeds a fixed number (e.g., 5) within a 1-hour window, which can indicate bulk changes.",
              "Apply a moving average calculation to the time series of sIDHistory modification event counts, aggregated per hour. Generate an alert when the current count exceeds three standard deviations above the moving average for that hour of the day and day of the week, adapting to normal fluctuations.",
              "Implement a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to monitor the volume of sIDHistory modification events. This model can account for seasonality (e.g., planned migrations) and trend, flagging statistically significant spikes that represent a departure from the established norm of near-zero activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by using SID-History Injection to access resources? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1134.005",
        "name": "SID-History Injection",
        "evidence": [
          {
            "description": "A Directory Service Changes event (Windows Event ID 5136) or LDAP Modify Request (Zeek ldap.log) for the 'sIDHistory' attribute originates from an account, IP address, or hostname not on an allow-list of approved administrative users or systems designated for domain migration tasks.",
            "data_sources": [
              "Windows Event ID 5136",
              "Zeek ldap.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative workstations, Network segments with LDAP traffic, SIEM/Log Aggregator",
            "action": [
              "Maintain an allow-list of authorized administrator accounts and source hostnames/IPs for domain migration. Create a SIEM rule to alert on any sIDHistory modification (Event ID 5136) where the 'Subject/Security ID' or source IP (from correlated logon events or Zeek ldap.log) is not on the allow-list.",
              "For every sIDHistory modification event, calculate the historical frequency of the source account and source IP performing this specific action. Flag any event where the combination of account and IP falls into the 1st percentile of historical frequency (i.e., is extremely rare) for this type of activity.",
              "Train a One-Class SVM model on features of legitimate sIDHistory modification events (e.g., source IP block, source account's group memberships, time of day). Deploy the model to identify any new modification events that fall outside the learned boundary of normal administrative behavior and flag them as anomalies."
            ]
          },
          {
            "description": "The 'sIDHistory' attribute is modified (Windows Event ID 5136) for a user account that has been dormant (no logon activity via Windows Event ID 4624 for > 90 days) or is a designated service account not involved in a domain migration.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4624",
              "PowerShell Get-ADUser output"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory User and Computer Objects, SIEM/Log Aggregator",
            "action": [
              "Create a rule that triggers on an sIDHistory modification (Event ID 5136) and joins the target account with a lookup table of dormant accounts (last logon > 90 days) and service accounts. Generate an alert if a modification targets an account in either of these categories and is not part of an approved change request.",
              "For every account, calculate the number of days since its last logon. When an sIDHistory modification occurs, treat the 'days since last logon' as a feature. Any modification where this value is in the 95th percentile or higher (i.e., the most dormant accounts) should be flagged for immediate review.",
              "Use K-Means clustering to group user accounts based on activity patterns (e.g., logon frequency, logon times, resources accessed, service principal name status). A sudden sIDHistory modification on an account within a 'dormant' or 'service account' cluster is a strong anomaly that can be detected as a shift in the account's behavior profile."
            ]
          },
          {
            "description": "An account with a populated 'sIDHistory' attribute performs a privileged action (e.g., adding a member to a privileged group via Event ID 4728) that is not authorized by its explicit group memberships.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4728",
              "Windows Event ID 4732"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Active Directory Group Objects, SIEM/Log Aggregator",
            "action": [
              "Create a SIEM rule that triggers when a user performs a privileged action (e.g., Event ID 4728, adding a member to 'Domain Admins') AND that user's account object has a populated sIDHistory attribute AND that user is NOT an explicit member of a group authorized for that action. This requires joining log data with periodic AD group membership snapshots.",
              "Deploy a UEBA system to profile user behavior. Alert when a user with a populated sIDHistory performs an action that is a statistical outlier (e.g., >3 standard deviations) compared to their own baseline and the baseline of their peer group (users with similar explicit permissions).",
              "Train a graph-based anomaly detection model on the Active Directory object graph and user access patterns. An injected SID creates an 'implicit' edge in the access graph. The model can detect when a user leverages this implicit edge to perform an action that is topologically distant or improbable based on their 'explicit' position in the graph."
            ]
          },
          {
            "description": "A periodic audit of Active Directory user objects identifies accounts with a non-empty 'sIDHistory' attribute, and the presence of these SIDs is not documented in change management records or associated with a known domain migration project.",
            "data_sources": [
              "PowerShell Get-ADUser output",
              "Change Management Records"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Database (ntds.dit), Change Management System/Ticketing System",
            "action": [
              "On a scheduled basis (e.g., weekly), execute a script to find all accounts with a populated sIDHistory attribute (`Get-ADUser -Filter * -Properties sIDHistory | Where-Object { $_.sIDHistory -ne $null }`). Compare this list against an allow-list of accounts from documented migration projects. Alert on any undocumented account.",
              "Track the total count of accounts with a populated sIDHistory attribute over time. A sudden increase in this count that does not correlate with a planned migration project's timeline is a statistical anomaly. Also, calculate the percentage of privileged vs. non-privileged accounts with a populated sIDHistory; a rising percentage in non-privileged accounts is suspicious.",
              "Use a Natural Language Processing (NLP) model to parse change management tickets and project documentation. The model extracts authorized user accounts and timeframes for migration. Automate the comparison of live AD state against the NLP model's output to continuously flag unauthorized or undocumented sIDHistory attributes."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]