[
  {
    "information_requirement": "Is the adversary communicating via command and control using non-standard encoding?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1132.002",
        "name": "Non-Standard Encoding",
        "evidence": [
          {
            "description": "A JA3/JA3S hash or HTTP header combination observed in network traffic matches an entry in a threat intelligence feed for C2 tools known to use non-standard encoding.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, Web proxies",
            "action": [
              "Symbolic: Query network logs (Zeek ssl.log, http.log) for JA3/JA3S hashes, User-Agent strings, or other HTTP header values that match a threat intelligence feed of known indicators for malware using non-standard encoding.",
              "Statistical: Calculate the frequency of JA3/JA3S hashes and HTTP header combinations across the enterprise. Identify and investigate combinations that are globally rare (e.g., seen on < 0.1% of hosts) but locally persistent for a single host, suggesting a non-standard client.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., K-Means) on features extracted from TLS handshakes (cipher suites, extensions) and HTTP headers to group similar clients. Investigate small clusters or outliers that do not conform to known legitimate application profiles."
            ]
          },
          {
            "description": "DNS queries exhibit fixed-length, high-entropy subdomains, or HTTP requests contain unusual, static custom headers, indicating a patterned, non-standard data channel.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Web proxies, Egress firewalls",
            "action": [
              "Symbolic: Search for the presence of specific, non-standard HTTP headers (e.g., 'X-Config', 'X-Data') known to be used by C2 frameworks in http.log records, especially when correlated with beaconing behavior in conn.log.",
              "Statistical: For each source IP, calculate the standard deviation of the length of requested DNS subdomains. A very low standard deviation combined with high average length and high entropy suggests a fixed-length data channel. Alert when the standard deviation is near zero and the average length exceeds a threshold (e.g., > 32 characters).",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to distinguish between legitimate and tunneled DNS traffic using features like query length, subdomain count, entropy, and character set distribution. Apply the model to live DNS logs to score and identify suspicious query patterns."
            ]
          },
          {
            "description": "A network session exhibits a data transfer ratio (bytes sent vs. received) that is a statistical outlier compared to the established baseline for that protocol and port, suggesting C2 data exfiltration or heartbeat activity.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, Internal network core switches",
            "action": [
              "Symbolic: Alert on any connection where the volume of data sent by the client is significantly larger than the data received (e.g., > 10:1 ratio) on ports not typically associated with uploads (e.g., TCP/53, TCP/80, TCP/443), especially if the destination is a low-reputation IP address from a CTI feed.",
              "Statistical: For each destination port and protocol, calculate a baseline of the mean and standard deviation for the ratio of originator bytes to responder bytes. Flag any connection where this ratio exceeds 3 standard deviations from the mean for its category.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) to predict the expected volume of outbound data per host over a given time window (e.g., one hour). Alert when the actual observed data volume significantly exceeds the forecasted upper confidence bound, indicating an anomalous bulk transfer."
            ]
          },
          {
            "description": "Data within specific protocol fields, such as HTTP URIs or DNS query names, has a calculated Shannon entropy score that is a statistical outlier compared to the field's established baseline, indicating non-textual, encoded data.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies, Internal DNS resolvers, Internet gateways",
            "action": [
              "Symbolic: Search for HTTP requests where the URI contains a string that appears to be Base64-encoded and exceeds a specific length (e.g., > 50 characters), and matches a regular expression like '^(?:[A-Za-z0-9+/]{4})*(?:[A-Za-z0-9+/]{2}==|[A-Za-z0-9+/]{3}=)?$'.",
              "Statistical: Calculate the Shannon entropy for specific fields (e.g., 'uri' in http.log, 'query' in dns.log, 'server_name' in ssl.log). Establish a baseline for each field by calculating the 95th percentile value over a 30-day period. Alert on any new value that exceeds this established percentile threshold.",
              "Machine Learning: Train a one-class Support Vector Machine (OC-SVM) on the entropy scores of known-good traffic for various protocol fields. Use the trained model to identify new traffic that falls outside the learned 'normal' distribution of entropy, flagging it as a potential anomaly."
            ]
          },
          {
            "description": "A network connection exhibiting characteristics of non-standard encoding (e.g., high entropy, asymmetric data flow) originates from a process image that is not on an allowlist of approved network-enabled applications or is executing from a non-standard file path (e.g., %TEMP%, %APPDATA%).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Critical application servers, Domain Controllers",
            "action": [
              "Symbolic: Correlate network connections (Windows Event ID 5156) to low-reputation IP addresses with the parent process (Windows Event ID 4688). Alert if the process name is a known suspicious executable (e.g., powershell.exe, wscript.exe) and the destination IP is found on a CTI blocklist.",
              "Statistical: Establish a baseline of processes that normally make network connections (from Event ID 5156) on endpoints. Calculate the rarity of each process making a connection. Alert when a statistically rare process (e.g., seen on <1% of endpoints) initiates an outbound connection, especially if the process path is in a temporary or user-writable directory.",
              "Machine Learning: Use a classification model (e.g., Gradient Boosting) trained on features from correlated process and network events (Process Name, Process Path, Parent Process, Destination IP, Destination Port, Data Volume). The model should classify each connection event as benign or suspicious. Investigate events classified as suspicious with a high confidence score."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]