[
  {
    "information_requirement": "Is the adversary maintaining persistence by creating local accounts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1136.001",
        "name": "Local Account",
        "evidence": [
          {
            "description": "A local account creation event (Windows Event ID 4720) occurs on a host within 24 hours of that host communicating with an IP address or domain present on a high-confidence threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4720",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Member Servers, Internet Gateway",
            "action": [
              "Create a SIEM rule to correlate Windows Event ID 4720 (User Account Created) with network connection logs (Zeek conn.log) and DNS logs (Zeek dns.log). Trigger an alert if a host creates a local account within 24 hours of communicating with an IP or domain on a known malicious threat intelligence list.",
              "For hosts communicating with IPs of low reputation (e.g., newly registered domains, known scanners), calculate the rate of local account creation. Flag hosts where this rate exceeds the 95th percentile of the historic baseline for that host or its peer group (e.g., other developer workstations).",
              "Use a trained classification model (e.g., Random Forest) that ingests features such as 'connection to known malicious IP', 'time since last malicious connection', 'account name entropy', and 'parent process name' to predict if a new account creation event is malicious. A high probability score from the model triggers an alert."
            ]
          },
          {
            "description": "A single process execution event (Windows Event ID 4688) contains command-line arguments for both creating a local user (e.g., 'net user /add') and adding that user to a privileged local group (e.g., 'net localgroup Administrators /add').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, User Workstations",
            "action": [
              "Create a detection rule that uses regular expressions to scan the command line field within Windows Event ID 4688 for the simultaneous presence of 'net user' with '/add' and 'net localgroup' with '/add' and a privileged group name (e.g., 'Administrators', 'Remote Desktop Users').",
              "Calculate the entropy of command-line arguments for all process creation events. Flag commands containing 'net user' that have an unusually high entropy score, which can indicate obfuscation or complex, scripted one-liners. Compare this score against the baseline entropy for similar commands across the environment.",
              "Develop a time-series anomaly detection model on the frequency of 'net localgroup' commands per host. An anomalous spike in these commands, especially when temporally clustered with 'net user' commands by the same parent process, indicates suspicious activity."
            ]
          },
          {
            "description": "A Windows Event ID 4720 (User Account Created) is followed within 60 seconds by a Windows Event ID 4732 (Member Added to a Security-Enabled Local Group) on the same host, where the new account name matches the member name being added to a privileged group.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4732"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations",
            "action": [
              "Implement a SIEM correlation rule that joins Windows Event ID 4720 and 4732 by hostname and username. Trigger an alert when the 'New Account Name' in 4720 matches the 'Member Name' in 4732, the time difference is less than 60 seconds, and the 'Group Name' in 4732 is 'Administrators' or 'Remote Desktop Users'.",
              "Establish a baseline of the typical time delay between account creation (4720) and group addition (4732) for legitimate administrative actions. An observed delay that falls below the 5th percentile of this baseline, indicating automated action, for a non-administrative parent process should be flagged as anomalous.",
              "Use a sequence analysis model (e.g., Hidden Markov Model) to learn common sequences of security events. Flag sequences where the state transition from 'account creation' (4720) to 'privileged group addition' (4732) is highly improbable based on historical data for the given host or user context."
            ]
          },
          {
            "description": "The first logon event (Windows Event ID 4624) for a newly created local account is a remote logon (Type 3 or 10), or the account's first process executions (Windows Event ID 4688) are common reconnaissance commands.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Member Servers, VPN Concentrators",
            "action": [
              "For each new account from Event ID 4720, monitor for the first corresponding Event ID 4624. Alert if the 'Logon Type' is 3 (Network) or 10 (RemoteInteractive). Additionally, monitor subsequent Event ID 4688 events from that logon session for a list of suspicious process names (e.g., 'whoami.exe', 'net.exe', 'ipconfig.exe', 'systeminfo.exe').",
              "For each new account, analyze its first 10 process executions. Calculate the Jaccard similarity between the set of executed processes and a set of known discovery tools versus a set of known administrative tools. A high similarity score to the discovery set, exceeding a statistically determined threshold (e.g., > 0.6), indicates suspicious initial activity.",
              "Train a clustering algorithm (e.g., K-Means, DBSCAN) on features of initial user sessions (first N commands, logon type, source IP geolocation). New user sessions that fall into a cluster characterized by remote logons and discovery commands, which is distinct from 'normal' new user clusters, should be flagged for investigation."
            ]
          },
          {
            "description": "A statistically significant anomaly in network egress traffic volume, connection frequency, or connection patterns (e.g., beaconing) is detected from a host, starting within one hour after a local account was created on it.",
            "data_sources": [
              "Windows Event ID 4720",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internet Gateway, Core Switches, Hosts with newly created accounts",
            "action": [
              "Upon detection of a Windows Event ID 4720, monitor the source host's network traffic in Zeek conn.log. Alert if the host initiates connections to external IPs not seen in the last 30 days or if the JA3/JA3S hash from Zeek ssl.log matches a known malicious signature.",
              "For a host where an account was just created, perform a time-series analysis on its outbound network data (bytes_out, connection count) from Zeek conn.log. Use a change-point detection algorithm to identify statistically significant increases in traffic volume or periodicity that start after the account creation event.",
              "Employ an autoencoder trained on normal host network behavior (features like connection duration, bytes transferred, protocol, port). After an account creation event, feed the host's subsequent network activity into the model. A high reconstruction error indicates a deviation from learned normality and suggests anomalous C2 or exfiltration activity."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]