[
  {
    "information_requirement": "Is an adversary using newly created or unauthorized cloud accounts to establish persistence within the on-premises or cloud environment? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1136.003",
        "name": "Cloud Account",
        "evidence": [
          {
            "description": "A successful inbound network connection (TCP state 'SF') from a known cloud provider IP address, which is also present on a high-confidence threat intelligence feed, to a non-publicly accessible internal asset (e.g., not a public-facing web server).",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Perimeter Firewalls, Internal Network Segments",
            "action": [
              "Symbolic: Create a rule to continuously filter Zeek conn.log for established connections (`conn_state` = 'SF') where `id.orig_h` belongs to a pre-compiled list of cloud provider IP ranges. Cross-reference `id.orig_h` against a high-confidence threat intelligence feed of known malicious IPs. Generate a critical alert if the destination host `id.resp_h` is not on a pre-approved list of public-facing servers.",
              "Statistical: For all inbound connections from cloud provider IP ranges, establish a baseline of historical connection frequency from each source IP to each destination port. Alert when a source IP, not seen in the last 30 days, connects to a high-value internal asset or a commonly exploited port (e.g., 3389, 22, 5985) and the event's rarity exceeds the 99th percentile of new connection frequencies.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled Zeek conn.log data, using features such as `duration`, `orig_bytes`, `resp_bytes`, `service`, `proto`, `conn_state`, and a binary feature indicating if the source IP is from a cloud provider. Use the model to score new inbound cloud connections in real-time. A high probability score indicating 'malicious' triggers an alert for analyst investigation."
            ]
          },
          {
            "description": "A successful interactive or network logon (Windows Event ID 4624, Logon Type 2, 3, or 10) to a Tier 0 or Tier 1 asset, where the authenticating account's Security Identifier (SID) matches the pattern for a cloud-synchronized account ('S-1-12-1-...') or the username follows a known cloud service principal or temporary naming convention (e.g., 'azuread_*', 'AAD_*', 'svc-*', 'tmp_*', 'gcp-sa-*').",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers hosting sensitive applications, Privileged Access Workstations (PAWs), Certificate Authority Servers",
            "action": [
              "Symbolic: Create a SIEM rule to monitor for Windows Event ID 4624 on critical assets (Tier 0/1). The rule triggers if `LogonType` is 2, 3, or 10 AND the `SecurityID` of the authenticating user matches the regex pattern '^S-1-12-1-.*' OR the `TargetUserName` matches patterns like 'AAD_*', 'svc-*', 'tmp_*', or 'gcp-sa-*'.",
              "Statistical: For each user account, establish a baseline of typical logon types and target systems. Calculate the rarity of a cloud-synchronized account (identified by SID or name) logging into a specific on-premises server. An event with a rarity score in the top 1% (e.g., first-time interactive logon to a domain controller) generates a high-severity alert.",
              "Machine Learning: Use an unsupervised learning algorithm, like Isolation Forest, on logon event features (LogonType, TargetUserName structure, TargetServer, time of day, source workstation name). Identify anomalous logons by cloud-characteristic accounts that deviate significantly from established clusters of normal activity for that user or their peers."
            ]
          },
          {
            "description": "A successful first-time logon (Windows Event ID 4624) to any on-premises system by a user account that has no corresponding creation or provisioning ticket in the organization's IT Service Management (ITSM) or HR systems within the preceding 72 hours.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "ITSM/HR provisioning logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN Concentrators, Identity and Access Management (IAM) systems, HR Information Systems (HRIS), IT Service Management (ITSM) platforms",
            "action": [
              "Symbolic: Perform a scheduled join of successful logon events (Windows Event ID 4624) with a watchlist of newly provisioned user accounts from HR/ITSM systems. Generate an alert for any successful logon where the `TargetUserName` does not appear on the 'newly provisioned' list from the last 72 hours.",
              "Statistical: Calculate a 30-day moving average and standard deviation for the number of first-time account logons per hour. Generate an alert when the number of first-time logons in a given hour exceeds three standard deviations above the moving average, indicating a statistically significant spike in new account activity.",
              "Machine Learning: Develop a 'First Logon Risk Score' using a supervised model (e.g., Logistic Regression) trained on historical first-logon events. Features must include source IP geolocation (from Zeek conn.log), time of day, day of week, target system role, and a binary feature indicating correlation with HR data ('provisioned' vs 'unprovisioned'). High-risk scores trigger immediate investigation."
            ]
          },
          {
            "description": "An account, identified by SID or name as cloud-native/hybrid, executes a high-privilege action for the first time or after a dormancy period exceeding 90 days. Examples include adding a member to a privileged group (Domain Admins, Enterprise Admins), modifying a Group Policy Object (GPO) linked to critical assets, or clearing a security event log.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4728",
              "Windows Event ID 4732",
              "Windows Event ID 4738",
              "Windows Event ID 4756",
              "Windows Event ID 1102"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Federation Services (ADFS) servers, Group Policy Management Servers",
            "action": [
              "Symbolic: Create a SIEM rule that triggers when a sensitive group membership change occurs (Event IDs 4728, 4732, 4756) AND the `SubjectUserName` performing the action is identified as a cloud or service account (by name pattern or SID) and is not on a pre-approved list of administrators. Also, alert on any instance of Event ID 1102 initiated by a cloud-native account.",
              "Statistical: For each user, create a baseline of privileged activities (by Event ID) performed over a 90-day rolling window. Calculate the Shannon entropy of actions for each user. Alert when a cloud-synced or dormant account performs a low-frequency privileged action (e.g., an action it has never performed before) or its activity entropy score suddenly spikes, indicating a significant change in behavior.",
              "Machine Learning: Use a peer group analysis model (e.g., K-Means clustering) to group users based on their vectors of privileged actions. An account identified as 'cloud-native' that suddenly performs actions characteristic of a 'Domain Administrator' peer group, without being a formal member of that group, is flagged as a high-risk anomaly."
            ]
          },
          {
            "description": "Inbound network traffic from a cloud provider IP, occurring within 10 minutes of a successful logon by a cloud-native account, exhibiting anomalous C2-like characteristics such as a high-entropy destination port, periodic connection intervals (beaconing), or an unusually high ratio of outbound to inbound data transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, DNS Servers, Internal Server Segments, Domain Controllers",
            "action": [
              "Symbolic: Join Zeek conn.log with Windows Event ID 4624 on timestamp and IP address. Alert if, within 10 minutes of a successful cloud account logon (identified by SID or username pattern), a connection is observed from the same source IP (`id.orig_h`) to an internal host over a port not on an approved-list of allowed ingress ports.",
              "Statistical: For each internal host, baseline the distribution of inbound ports and data transfer ratios (`resp_bytes` / `orig_bytes`) for connections from cloud IPs. Alert when a new connection's port has a frequency below the 1st percentile (is rare) or the data transfer ratio exceeds the 99th percentile of the historical baseline for that host, suggesting potential data exfiltration.",
              "Machine Learning: Apply time-series analysis to the `ts` (timestamp) field in Zeek conn.log for connections from a single cloud source IP to a single internal destination host. Use algorithms like Fast Fourier Transform (FFT) or Autocorrelation to detect periodic signals (beaconing) indicative of C2 communication. Flag any connection stream that exhibits a strong, repeating time interval."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]