[
  {
    "information_requirement": "Is the adversary maintaining persistence by creating cloud accounts? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1136.003",
        "name": "Cloud Account",
        "evidence": [
          {
            "description": "A successful inbound network connection (TCP state 'SF') from an IP address that is both within a known cloud provider's public IP range and present on a high-confidence threat intelligence feed of malicious IPs.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Perimeter Firewalls",
            "action": [
              "Symbolic: Continuously filter Zeek conn.log for established connections (`conn_state` = 'SF') where `id.orig_h` belongs to a pre-compiled list of cloud provider IP ranges. Cross-reference `id.orig_h` against a high-confidence threat intelligence feed of known malicious IPs. Generate a critical alert for any match.",
              "Statistical: For all inbound connections from cloud provider IP ranges, calculate the historical frequency of connections from each source IP to each destination port. Alert when a source IP, not seen in the last 30 days, connects to a high-value internal asset or a commonly exploited port (e.g., 3389, 22, 5985) and exceeds the 99th percentile of new connection frequencies.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled Zeek conn.log data, using features like `duration`, `orig_bytes`, `resp_bytes`, `service`, `proto`, and whether the source IP is from a cloud provider. Use the model to score new inbound cloud connections in real-time. A high probability score indicating 'malicious' triggers an alert for analyst investigation."
            ]
          },
          {
            "description": "A successful logon event (Type 3 or 10) on a Tier 0 or Tier 1 asset, where the authenticating account's Security Identifier (SID) matches the pattern for a cloud-synchronized account (e.g., 'S-1-12-1-...') or the username follows a non-standard naming convention (e.g., 'azuread_*', 'tmp_*').",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers hosting sensitive applications, Privileged Access Workstations (PAWs)",
            "action": [
              "Symbolic: Create a SIEM rule to monitor for Windows Event ID 4624 on critical assets. The rule should trigger if `LogonType` is 3 or 10 AND the `SecurityID` of the authenticating user matches the regex pattern '^S-1-12-1-.*' (Azure AD account) OR the `TargetUserName` matches patterns like 'AAD_*', 'svc-*', or 'temp-*'.",
              "Statistical: For each user, establish a baseline of typical Logon Types and target systems. Calculate the rarity of a cloud-synchronized account (identified by SID or name) logging into a specific on-premises server. An event with a rarity score in the top 1% (e.g., first-time logon to a domain controller) should generate a high-severity alert.",
              "Machine Learning: Use an unsupervised learning algorithm, like Isolation Forest, on logon event features (LogonType, TargetUserName structure, TargetServer, time of day, source workstation). Identify anomalous logons by cloud-characteristic accounts that deviate significantly from established clusters of normal activity."
            ]
          },
          {
            "description": "A successful first-time logon (Windows Event ID 4624) to any on-premises system by a user account that has no corresponding creation or provisioning ticket in the organization's IT Service Management (ITSM) or HR systems within the preceding 72 hours.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "ITSM/HR provisioning logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN Concentrators, Identity and Access Management (IAM) systems",
            "action": [
              "Symbolic: Join successful logon events (Windows Event ID 4624) with a watchlist of newly provisioned user accounts from HR/IT systems. Generate an alert for any successful logon where the `TargetUserName` does not appear on the 'newly provisioned' list from the last 72 hours.",
              "Statistical: Model the rate of new account first-logons over time. Use time-series analysis (e.g., ARIMA) to forecast the expected number of first-logons per hour. Alert when the observed count of first-logons from previously unseen accounts exceeds the 95% prediction interval, indicating a statistically significant spike.",
              "Machine Learning: Develop a 'First Logon Risk Score' using a supervised model trained on historical first-logon events. Features should include source IP geolocation (from Zeek conn.log), time of day, day of week, target system role, and correlation with HR data (binary feature: 'provisioned' vs 'unprovisioned'). High-risk scores trigger investigation."
            ]
          },
          {
            "description": "An account, identified by its SID or name as cloud-native/hybrid, executes a privileged action (e.g., adding a member to a privileged group like 'Domain Admins') for the first time in its history or after a dormancy period exceeding 90 days.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4732",
              "Windows Event ID 4728",
              "Windows Event ID 4738"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Federation Services (ADFS) servers",
            "action": [
              "Symbolic: Create a SIEM rule that triggers when a user account (`MemberSid` or `MemberName`) is added to a privileged group (e.g., `TargetUserName` = 'Domain Admins' in Event ID 4728) AND the `SubjectUserName` performing the action is a known cloud or service account, or is not on a pre-approved list of administrators.",
              "Statistical: For each user, create a baseline of privileged activities performed over a 90-day rolling window. Calculate the entropy of actions for each user. Alert when a cloud-synced or dormant account performs a low-frequency privileged action (e.g., an action it has never performed before) or its activity entropy score suddenly spikes, indicating a change in behavior.",
              "Machine Learning: Use a peer group analysis model to cluster users based on their privileged actions. An account identified as 'cloud-native' that suddenly performs actions characteristic of a 'Domain Administrator' peer group, without being a member of that group, is flagged as an anomaly."
            ]
          },
          {
            "description": "Inbound network traffic from a cloud provider IP, occurring within 10 minutes of a successful logon by a cloud-native account, exhibiting anomalous characteristics such as a high-entropy destination port, periodic connection intervals (beaconing), or an unusually high ratio of outbound to inbound data transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, DNS Servers, Internal Server Segments",
            "action": [
              "Symbolic: Join Zeek conn.log with Windows Event ID 4624 on timestamp and IP address. Alert if, within 10 minutes of a successful cloud account logon, a connection is observed from the same source IP to an internal host over a port not on an approved-list of allowed ingress ports.",
              "Statistical: For each internal host, baseline the distribution of inbound ports and data transfer ratios (`orig_bytes` / `resp_bytes`) for connections from cloud IPs. Alert when a new connection's port has a frequency below the 1st percentile (is rare) or the data transfer ratio exceeds the 99th percentile of the historical baseline for that host, suggesting data exfiltration.",
              "Machine Learning: Apply time-series analysis to the `ts` (timestamp) field in Zeek conn.log for connections from a single cloud IP to a single internal host. Use algorithms like Fourier Transform or Autocorrelation to detect periodic signals (beaconing) indicative of C2 communication. Flag any connection stream that exhibits a strong, repeating time interval."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]