[
  {
    "information_requirement": "Has the adversary escalated privileges using token impersonation/theft?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1134.001",
        "name": "Token Impersonation-Theft",
        "evidence": [
          {
            "description": "The command line of a created process contains specific substrings associated with known token manipulation tools or their functions, such as 'incognito', 'steal_token', 'make_token', or 'runas /savecred'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations), Critical application servers, Windows Server fleet",
            "action": [
              "Create a SIEM rule that scans the Process CommandLine field in Windows Event ID 4688 for case-insensitive string matches of known malicious token manipulation tool commands and arguments (e.g., 'incognito', 'steal_token', 'make_token', 'runas /savecred').",
              "For all process creation events, calculate the Shannon entropy of the command line argument string. Establish a baseline entropy for common processes (e.g., svchost.exe, powershell.exe). Flag instances where a command's entropy is a statistical outlier (e.g., exceeds the 99th percentile for that specific process name), which can indicate obfuscated commands.",
              "Train a supervised classification model (e.g., Logistic Regression, Random Forest) on a pre-labeled dataset of command lines (malicious/benign). Use features like character n-grams, keyword presence, and string length. Deploy the model to score new command lines from Windows Event ID 4688 in near real-time for their probability of being malicious."
            ]
          },
          {
            "description": "A parent process that typically holds privileged tokens and should not spawn interactive shells (e.g., lsass.exe, services.exe, winlogon.exe, csrss.exe) creates a child process such as cmd.exe or powershell.exe.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Windows Server fleet, Endpoint devices (workstations)",
            "action": [
              "Create a high-severity alert rule for any event where the ParentProcessName in Windows Event ID 4688 is in a watchlist ('lsass.exe', 'services.exe', 'winlogon.exe', 'csrss.exe') and the NewProcessName is an interactive shell or scripting engine ('cmd.exe', 'powershell.exe', 'pwsh.exe', 'rundll32.exe').",
              "Generate a baseline of all parent-child process relationships observed in the environment over a 30-day period. Calculate a rarity score for each pair (e.g., $$ 1 / \text{frequency} $$). Alert on any new process creation event where the parent-child pair has a rarity score exceeding a dynamic percentile threshold (e.g., 99.5th percentile), indicating a previously unseen or very rare relationship.",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN) on process creation events. Use features such as ParentProcessName, NewProcessName, and SubjectUserName. Investigate small, dense clusters that are separate from the large clusters representing normal system and user activity, as these often represent anomalous behavior."
            ]
          },
          {
            "description": "A handle with process duplication rights (access mask 0x40) is requested for a high-privilege process (e.g., lsass.exe) by a source process not on an established allowlist of legitimate security and system tools.",
            "data_sources": [
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical application servers, High-value user workstations",
            "action": [
              "After enabling object access auditing on critical processes (e.g., lsass.exe), create a SIEM rule to monitor Windows Event ID 4656 for events where the 'Accesses' field contains 'ProcessDupHandle' (or access mask 0x40) and the requesting 'ProcessName' is not on an approved allowlist of security or management tools.",
              "Profile the source processes that request handles to critical system processes like lsass.exe. Calculate the frequency distribution of each requesting 'ProcessName'. Alert when a handle request originates from a source process that is statistically rare (e.g., falls below a 0.5% frequency threshold), such as a browser or document editor.",
              "Train a One-Class SVM model on benign handle request events (Windows Event ID 4656) for lsass.exe. Use features such as the source process name, the user context of the requestor, and the requested access mask. Deploy the model to identify and alert on anomalous handle requests that do not conform to the established patterns of normal behavior."
            ]
          },
          {
            "description": "A process, within 60 seconds of a new primary token being assigned (Event ID 4696), successfully accesses a sensitive object (Event ID 4663) or process (Event ID 4656) for which it did not previously have rights.",
            "data_sources": [
              "Windows Event ID 4696",
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Windows Server fleet, High-value user workstations",
            "action": [
              "Create a correlation rule that triggers when a Windows Event ID 4696 (A primary token was assigned to process) is followed within 60 seconds by a Windows Event ID 4663 (An attempt was made to access an object) from the same Process ID, where the ObjectName is a sensitive system file (e.g., SAM, SYSTEM hive) and the access was successful.",
              "For each process after it receives a new token via Event ID 4696, track the number of subsequent privileged object accesses (e.g., write access to C:\\Windows\\System32) within a 5-minute window. Establish a baseline count for each process name. Alert when the count for a specific process instance exceeds a percentile threshold (e.g., 98th percentile) for that process type.",
              "Develop a time-series model (e.g., Hidden Markov Model) that analyzes the sequence of system calls or object accesses (e.g., file mods, registry access) performed by a process after a token assignment event (Event ID 4696). Compare the sequence against a model of normal post-token assignment behavior to detect anomalous sequences indicative of privilege escalation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using token impersonation/theft?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1134.001",
        "name": "Token Impersonation-Theft",
        "evidence": [
          {
            "description": "The command line of a created process contains strings highly indicative of Mimikatz pass-the-hash module, such as 'sekurlsa::pth', '/user:', '/domain:', '/ntlm:', and '/run:'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations), Windows Server fleet, Domain Controllers",
            "action": [
              "Create a high-fidelity SIEM rule to scan the Process CommandLine field of Windows Event ID 4688 for the presence of the string 'sekurlsa::pth' in combination with other arguments like '/ntlm:' or '/run:'.",
              "Analyze command-line arguments for patterns associated with credential theft tools. Calculate the Jaccard similarity between the set of arguments in a new command line and a known set of Mimikatz command variations. Alert when the similarity score exceeds a high threshold (e.g., $$ > 0.9 $$), indicating a close match even with minor obfuscation.",
              "Utilize a pre-trained Natural Language Processing (NLP) model, fine-tuned on cybersecurity threat intelligence, to classify command lines from Windows Event ID 4688. This can identify semantic similarities to known malicious commands like 'sekurlsa::pth' even if the exact strings are altered or obfuscated."
            ]
          },
          {
            "description": "The 'runas.exe' process is created with the '/savecred' argument, or it is spawned by a non-interactive parent process such as a web server worker process (w3wp.exe) or database service (sqlservr.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations), Windows Server fleet, Web servers, Database servers",
            "action": [
              "Create a SIEM rule to detect the use of 'runas.exe' where the command line contains '/savecred' in Windows Event ID 4688. Separately, create a rule to alert when the ParentProcessName for 'runas.exe' is a common service or non-interactive process.",
              "For each host and user, establish a baseline of 'runas.exe' execution frequency and parent process relationships. Alert when the daily count of 'runas' executions exceeds 3 standard deviations of the 30-day moving average for that entity, or when it is spawned by a parent process never before seen in that role.",
              "Train a classification model (e.g., Naive Bayes) to predict whether a 'runas' execution is benign or suspicious. Use features such as the parent process name, the user context, time of day, and the presence of specific command-line arguments. A process spawned by a service account outside of business hours would be flagged as highly suspicious."
            ]
          },
          {
            "description": "A process typically associated with interactive user sessions (e.g., explorer.exe, chrome.exe, winword.exe) is created where the SubjectUserName or Security ID corresponds to a high-privilege system account such as 'NT AUTHORITY\\SYSTEM' or 'S-1-5-18'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations), Critical application servers, Terminal servers",
            "action": [
              "Create a SIEM rule to alert when a NewProcessName on a watchlist (e.g., 'explorer.exe', 'outlook.exe', 'winword.exe', 'excel.exe', 'chrome.exe') is created (Windows Event ID 4688) with a SubjectLogonId of '0x3e7' or SubjectUserName of 'SYSTEM'.",
              "Maintain a baseline of the top 95% of user contexts (SubjectUserName) associated with each process name across the enterprise. Alert when a process is created with a user context that falls outside this established baseline, indicating a rare and potentially suspicious combination.",
              "Use an unsupervised anomaly detection algorithm like Isolation Forest on process creation events. Engineer features including the process name, parent process name, and user context (as a categorical feature). The model will isolate instances that are 'easiest to separate' from the normal data, such as a user-facing application running as SYSTEM."
            ]
          },
          {
            "description": "A process, within 5 minutes of receiving a new primary token (Event ID 4696), initiates network connections (Zeek conn.log) to internal administrative services (e.g., TCP/445, TCP/3389, TCP/5985) that are uncharacteristic for that process's typical network behavior.",
            "data_sources": [
              "Windows Event ID 4696",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter (e.g., firewall, IDS/IPS), Internal network sensors, Domain Controllers, Endpoint devices (workstations)",
            "action": [
              "Create a correlation rule that triggers when a process receives a new token (Windows Event ID 4696) and, within 5 minutes, the same process ID initiates a network connection (Zeek conn.log or Windows Event ID 5156) to a destination port on a watchlist (445, 3389, 5985, 5986) on a different internal system.",
              "For processes that receive a new token (Event ID 4696), monitor their subsequent network activity in Zeek conn.log. Calculate the Shannon entropy of the destination ports and destination IPs they connect to within a 10-minute window. Alert if the entropy for a given process instance is statistically anomalous compared to the baseline for that process name, which may suggest scanning or broad lateral movement.",
              "Develop a time-series anomaly detection model (e.g., LSTM) that learns the normal sequence of network connections (protocol and destination port) for a given process after a token assignment. Use the model to flag sequences that deviate significantly, such as a process that normally only uses HTTPS suddenly making SMB and RDP connections after receiving a new token."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]