[
  {
    "information_requirement": "Has the adversary escalated privileges by creating a process with a stolen or manipulated token?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1134.002",
        "name": "Create Process with Token",
        "evidence": [
          {
            "description": "A process is created whose name or command line arguments match a known token manipulation tool signature, and the new process's token is associated with a privileged account (e.g., SYSTEM) while the parent process's token is not.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrator Workstations, Critical Application Servers",
            "action": [
              "Symbolic: Create and maintain a watchlist of process names and command-line arguments associated with token manipulation tools (e.g., 'incognito.exe', 'psgetsys.exe', 'Invoke-TokenManipulation'). Query Windows Event ID 4688 for process creation events where the 'New Process Name' or 'Command Line' matches this list AND the 'Target User Name' is a privileged account (e.g., 'SYSTEM', 'Administrator') AND the 'Creator User Name' is a non-privileged account.",
              "Statistical: For every process creation event that results in a privileged token ('Token Elevation Type' = 'Type 1' or 'Target User Name' is privileged), calculate the enterprise-wide rarity of the 'Creator Process Name'. Flag instances where the creator process's frequency falls below a 5th percentile threshold, indicating it is an unusual process to be spawning privileged children.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on labeled historical process creation events. Use features such as 'Creator Process Name', 'New Process Name', 'Target User Name', 'Creator User Name', and command line argument patterns. Use the model to classify new process creation events as 'benign escalation' or 'suspicious escalation' based on learned patterns of token use."
            ]
          },
          {
            "description": "A typically non-interactive system process (e.g., lsass.exe, services.exe) spawns an interactive command shell (e.g., powershell.exe, cmd.exe) or other Living-Off-the-Land Binary (LOLBin), and the new process is created with an elevated token.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Standard User Endpoints, Web Servers",
            "action": [
              "Symbolic: Create a rule that alerts on any process creation event (Windows Event ID 4688) where the 'Creator Process Name' is a sensitive system process (e.g., 'lsass.exe', 'wininit.exe', 'winlogon.exe') and the 'New Process Name' is an interactive shell or script interpreter (e.g., 'cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe').",
              "Statistical: Profile normal parent-child process relationships for all systems. Calculate the historical frequency of each 'Creator Process Name' -> 'New Process Name' pair. Generate an alert when a rare pair (e.g., frequency below the 1st percentile) is observed, especially when the 'Target User Name' is privileged and different from the 'Creator User Name'.",
              "Machine Learning: Use an anomaly detection model (e.g., Isolation Forest) on process creation data. Features should include categorical information like parent/child process names and numerical data like the entropy of the command line. The model will learn normal process creation behavior and flag outliers, such as `services.exe` spawning `powershell.exe` with a long, encoded command line."
            ]
          },
          {
            "description": "A process is created with a token that grants it a higher integrity level (e.g., High or System) or a different, more privileged user context than its parent process, and the parent is not on an allow-list of legitimate privilege brokers (e.g., svchost.exe, consent.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: In Windows Event ID 4688, compare the 'Creator User Name' with the 'Target User Name'. Alert if 'Target User Name' is a privileged account (e.g., 'SYSTEM', 'Administrator') while 'Creator User Name' is not, AND the 'Creator Process Name' is not on a pre-defined allow-list of legitimate brokers (e.g., 'svchost.exe', 'consent.exe', 'runas.exe').",
              "Statistical: For each 'Creator Process Name', calculate the baseline set of 'Target User Name' accounts it typically creates processes for. Use Jaccard distance or a similar set-based comparison to measure the deviation when a new process is created. Alert when the new 'Target User Name' is highly dissimilar from the baseline set and is privileged.",
              "Machine Learning: Train a time-series anomaly detection model on the rate of privilege escalations per host. A sudden spike in the number of processes created with elevated tokens on a single machine, outside of known patching or software deployment windows, could indicate a compromised host where an adversary is actively using a stolen token."
            ]
          },
          {
            "description": "A process creation event involving an elevated token is followed within 1 to 5 minutes by an outbound network connection to a low-reputation IP address or an unusual port.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, DNS Servers, Network Egress Points",
            "action": [
              "Symbolic: Correlate Windows Event ID 4688 showing token escalation with Zeek conn.log data within a 5-minute window on the same host. Trigger an alert if the 'New Process ID' from the 4688 event initiates an outbound connection to an IP address on a threat intelligence feed or to a non-standard port (e.g., not 80/443).",
              "Statistical: For each process that is created with an elevated token, analyze the subsequent DNS requests (Zeek dns.log) and network connections (Zeek conn.log). Calculate the entropy of requested domain names or the percentile of the destination port's rarity. An alert is generated if a newly escalated process immediately makes requests for high-entropy domains or connects to a port in the 99th percentile of rarity.",
              "Machine Learning: Create a sequence analysis model that examines the sequence of events following a token escalation. A model (e.g., a Hidden Markov Model) can be trained to recognize legitimate sequences (e.g., escalation -> read config file -> bind to local port) versus malicious ones (e.g., escalation -> DNS query for dynamic DNS domain -> outbound connection to rare port -> data transfer)."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary bypassing defenses by creating a process with a stolen or manipulated token?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1134.002",
        "name": "Create Process with Token",
        "evidence": [
          {
            "description": "A process with a suspicious name or command-line signature is created with a token belonging to a legitimate, trusted system process (e.g., explorer.exe, svchost.exe), making it appear as a legitimate child process to evade detection.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Standard User Endpoints, Critical Application Servers",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for events where the 'Creator Process Name' is a commonly impersonated trusted process (e.g., 'explorer.exe', 'svchost.exe') but the 'New Process Name' or 'Command Line' matches a watchlist of suspicious tools or patterns.",
              "Statistical: Establish a baseline of all legitimate child processes for 'explorer.exe' and 'svchost.exe'. Calculate the frequency of each child process across the enterprise. Alert when one of these parents spawns a child process that is statistically rare (e.g., frequency below the 0.1st percentile) or has never been seen before.",
              "Machine Learning: Use a graph-based algorithm to model process relationships. Represent processes as nodes and parent-child relationships as edges. A newly created process that is spawned from a trusted parent but is disconnected from the main 'community' or cluster of legitimate software in the graph is a strong anomaly indicative of impersonation for evasion."
            ]
          },
          {
            "description": "A high-privilege system process (e.g., svchost.exe, lsass.exe, services.exe) spawns a child process that is unsigned, located in a non-standard directory (e.g., %APPDATA%, %TEMP%), or is otherwise uncharacteristic for that parent.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Core Infrastructure Servers (e.g., AD, DNS)",
            "action": [
              "Symbolic: Alert on any process creation event (Windows Event ID 4688) where the 'Creator Process Name' is in a list of critical system processes ('lsass.exe', 'wininit.exe', 'services.exe') and the 'New Process Name' is located in a user-writable directory (e.g., C:\\Users\\*, C:\\ProgramData\\*, C:\\Temp\\*). Always alert on any child process spawned from 'lsass.exe'.",
              "Statistical: For each critical parent process, profile the attributes of its typical children, including file path, signature status, and command-line length. Create a baseline using descriptive statistics (mean, median, mode, standard deviation). Alert when a new child process deviates significantly (e.g., >3 standard deviations) from the established baseline for any of these attributes.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) model on the attributes of legitimate child processes for high-privilege parents. Use features like file path entropy, signer status (present/absent), and parent-child process name pair. The model will create a boundary around normal behavior, flagging any new process that falls outside this boundary as anomalous."
            ]
          },
          {
            "description": "A process is created where the 'Creator Process ID' (the process that invoked the API) is different from the 'Parent Process ID' specified in the event logs, indicating a process is forcing another process to spawn a child on its behalf to break the chain of attribution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers with advanced audit logging enabled",
            "action": [
              "Symbolic: In Windows Event ID 4688, directly compare the 'Creator Process ID' and 'Parent Process ID' fields. Generate a high-priority alert for every instance where these two fields do not match, as this is a strong indicator of advanced evasion techniques like process injection or impersonation.",
              "Statistical: Calculate the enterprise-wide frequency of processes that appear as a 'Creator Process' but not a 'Parent Process'. While some legitimate software may do this, adversaries often use custom tools that will appear as statistically rare outliers in this analysis.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on process creation events where Creator ID differs from Parent ID. Benign instances (e.g., from specific EDR or management tools) will form dense clusters. Sporadic, un-clustered events are more likely to be unique, malicious tools and should be prioritized for investigation."
            ]
          },
          {
            "description": "A single non-interactive logon session (e.g., Logon Type 3 for Network, 5 for Service) is used to create multiple, functionally unrelated processes with different parent processes over a short period, suggesting a single stolen token is being reused for various tasks.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Multi-user Systems (e.g., Terminal Servers), Critical Servers, Domain Controllers",
            "action": [
              "Symbolic: Correlate Windows Event ID 4688 with Windows Event ID 4624 using the 'Logon ID'. Alert when a 'Logon ID' associated with a non-interactive 'Logon Type' (any type other than 2 or 10) spawns more than N (e.g., 5) distinct 'New Process Name's from more than M (e.g., 3) distinct 'Creator Process Name's within a T (e.g., 10 minute) window.",
              "Statistical: For each non-interactive 'Logon ID', calculate the rate and diversity of process creation. Establish a baseline for process creation count and parent process diversity per hour for each logon type and host. Use a percentile-based threshold (e.g., 99th percentile) to alert on sessions with an unusually high volume or variety of process creation activity.",
              "Machine Learning: Model the sequence of processes created within a logon session. Train a sequence-to-sequence autoencoder on legitimate process sequences. A logon session whose process creation sequence has a high reconstruction error is anomalous, suggesting the activity does not match any known legitimate workflow and may be an adversary reusing a token for disparate tasks."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]