[
  {
    "information_requirement": "Has the adversary gained initial access to the network via external remote services?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful login to an external remote service (e.g., VPN, Citrix) originates from a source IP address present on a threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Authentication Servers, Network Gateway, SIEM",
            "action": [
              "Symbolic: Join successful remote authentication events (Windows Event ID 4624 on RADIUS/VPN servers) with network connection logs (Zeek conn.log) on timestamp and IP addresses. Generate a high-severity alert if the source IP address of the successful login matches an IP address from a high-confidence threat intelligence feed of known C2, proxy, or TOR exit nodes.",
              "Statistical: For each successful external login, enrich the source IP with ASN and geolocation data. Calculate the historical frequency of logins from that specific ASN for the entire organization. Flag logins from ASNs that fall below the 5th percentile of frequency (i.e., are extremely rare for the organization) for further review, as this may indicate an unusual origin even if not on a known-bad list.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) on features of login events, including IP reputation score, ASN, country, time of day, and user role. Use the model to classify each new external login as 'benign' or 'suspicious', alerting on high-probability suspicious events."
            ]
          },
          {
            "description": "A successful login to an external remote service deviates from the user's established baseline across two or more behavioral dimensions simultaneously (e.g., time, location, device).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, User Workstations, SIEM",
            "action": [
              "Symbolic: For each successful external login, check for concurrent alerts for the same user within the last 24 hours, such as 'impossible travel' or 'credential stuffing' alerts. A confluence of these symbolic alerts with an external login significantly increases the confidence of a compromise and should trigger a high-priority investigation.",
              "Statistical: For each user, establish a 90-day baseline of login behavior including typical login hours, source countries/ASNs, and session durations using percentiles. For each new login, flag deviations where the login time is outside the user's typical 5th-95th percentile range or the source country is new for the user. An alert is generated if two or more of these statistical anomalies occur for a single login event.",
              "Machine Learning: Implement an unsupervised learning model (e.g., Isolation Forest) for each user, trained on a feature set of their historical login events (e.g., time-of-day, day-of-week, source ASN). Score each new login for its anomaly score. Logins identified as significant outliers by the model should be flagged for analyst review as a potential account compromise."
            ]
          }
        ]
      },
      {
        "technique_id": "T1190",
        "name": "Exploit Public-Facing Application",
        "evidence": [
          {
            "description": "Network traffic targeting an external remote service contains patterns, strings, or sequences matching known exploit signatures for that service's software.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ, Network Gateway, External-facing servers (VPN, Citrix, etc.)",
            "action": [
              "Symbolic: Deploy an IDS/IPS with signatures for known vulnerabilities (e.g., specific CVEs) in the organization's remote access solutions. Generate a critical alert on any signature match for traffic targeting the public IPs of these services.",
              "Statistical: For web-based remote services, analyze Zeek http.log to calculate the character entropy of URI paths and query parameters. Establish a baseline for normal entropy levels. Generate an alert when requests targeting these services exhibit entropy scores exceeding the 99th percentile of the baseline, which can indicate scanning or fuzzing attempts.",
              "Machine Learning: Use a time-series forecasting model (e.g., SARIMA) to predict the expected volume of connection attempts (new Zeek conn.log entries) to remote services on a per-port basis. Generate an alert when the observed volume significantly exceeds the predicted confidence interval, which could indicate a brute-force attack or pre-exploitation scanning."
            ]
          }
        ]
      },
      {
        "technique_id": "T1133",
        "name": "External Remote Services",
        "evidence": [
          {
            "description": "An external IP address initiates a connection and interacts with an exposed administrative service that should not be public, such as a Docker API port or Kubernetes API server.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ, Cloud Environment Subnets, Container Orchestration Platforms, Network Gateway",
            "action": [
              "Symbolic: Create a detection rule that alerts on any connection from an external IP address (not within a defined internal or trusted range) to known administrative ports associated with remote services like the Docker Engine API (2375, 2376) or Kubernetes API Server (6443, 8080).",
              "Statistical: Continuously monitor Zeek conn.log for any new listening services on hosts within the DMZ or cloud environments. Compare the list of observed open ports against an approved baseline list of ports for each host role. Generate an alert for any new, unexpected open port that deviates from the established baseline.",
              "Machine Learning: Train a classification model to distinguish between user-driven web traffic and API interaction traffic based on features from Zeek http.log like URI structure, user-agent strings, and presence of authorization headers. Flag traffic classified as 'API interaction' originating from external sources for review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using external remote services?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A user account, flagged as either a service account, a privileged account, or dormant for over 90 days, successfully authenticates to an external remote service for the first time.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, Domain Controllers, SIEM",
            "action": [
              "Symbolic: Maintain an explicit deny-list of service accounts and privileged accounts that are forbidden from using external remote access services. Trigger a critical alert on any successful remote login (Windows Event ID 4624 with Logon Type 10) by an account on this list.",
              "Statistical: For all user accounts, maintain a list of accounts that have not had a successful remote login in the past 90 days. Generate a medium-severity alert if an account from this 'dormant remote access' list successfully authenticates from an external IP address for the first time.",
              "Machine Learning: Classify user accounts into roles (e.g., 'Admin', 'Developer', 'Service Account') based on Active Directory group memberships. Train a model to predict the probability of a given role using remote access. Generate an alert when a user from a low-probability role (e.g., 'Service Account') successfully authenticates remotely."
            ]
          },
          {
            "description": "A remote access session, identified by correlating logon (Windows Event ID 4624) and logoff (Windows Event ID 4634) events, exhibits non-human characteristics such as a fixed, repeating connection interval (beaconing) or an abnormally long duration.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4634",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers, VPN Concentrators, Network Gateway, SIEM",
            "action": [
              "Symbolic: Query for remote access sessions (by correlating logon/logoff events or using Zeek conn.log durations) with exceptionally long durations (e.g., > 48 hours) or that reconnect with a precise, repeating interval (e.g., every 3600 +/- 5 seconds), which is indicative of automated beaconing.",
              "Statistical: For each user, calculate the mean and standard deviation of their remote session durations and the time between sessions over a 90-day period. Alert when a new session's duration or the time since the last login falls more than 3 standard deviations from the user's established baseline.",
              "Machine Learning: Apply a change-point detection algorithm to the time series of a user's remote connection frequency and duration. An alert is generated if the model detects a statistically significant shift from a sporadic, human-driven pattern to a regular, periodic one, suggesting the account is being used for automated persistence."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]