[
  {
    "information_requirement": "Is the adversary attempting to obfuscate command and control traffic using data encoding? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1132",
        "name": "Data Encoding",
        "evidence": [
          {
            "description": "A network connection is established with a known malicious C2 IP address or domain, and the associated data payload has a Shannon entropy score greater than 6.0, indicating a high degree of randomness typical of encoded or encrypted data.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, DNS resolvers, Proxy servers",
            "action": [
              "Symbolic: Join network connection logs (Zeek conn.log) and DNS logs (Zeek dns.log) with a threat intelligence feed of known C2 indicators. Alert on any connection or query to a matching IP address or domain.",
              "Statistical: For all outbound network connections, calculate the Shannon entropy of the data payload. Establish a baseline entropy level for traffic on a per-port, per-protocol basis. Generate an alert for any connection where the payload entropy exceeds the 99th percentile of the established baseline for that specific port/protocol.",
              "Machine Learning: Train a random forest classifier on labeled network traffic using features such as payload entropy, connection duration, bytes sent, bytes received, and destination port. Apply the trained model to live traffic to classify new connections as potentially malicious C2 using encoding."
            ]
          },
          {
            "description": "A DNS query contains a subdomain or TXT record with a string length greater than 50 characters composed almost exclusively of the Base64 character set ([A-Za-z0-9+/=]), or an HTTP request contains a User-Agent, cookie, or URI parameter with a similarly long, high-entropy string.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS resolvers, Web proxies, Application servers",
            "action": [
              "Symbolic: Apply regular expressions to DNS query names (Zeek dns.log 'query' field) and HTTP headers (Zeek http.log 'user_agent', 'uri', 'cookie' fields) to detect long strings (> 50 characters) that match Base64 encoding patterns `(^[A-Za-z0-9+/]+={0,2}$)`. Alert on any matches.",
              "Statistical: For each HTTP header field and for DNS queries, calculate the character frequency distribution. Compare the distribution against a pre-computed baseline for normal traffic using a Chi-squared goodness-of-fit test. Flag significant deviations, which can indicate the presence of an encoded character set instead of normal ASCII/UTF-8 text.",
              "Machine Learning: Use a one-class SVM (Support Vector Machine) trained on legitimate DNS query patterns and HTTP header values. Apply the model to new traffic to identify anomalous queries or headers that do not conform to the learned normal patterns, which may be indicative of encoded data."
            ]
          },
          {
            "description": "An outbound TCP or UDP data stream over a common port (e.g., 80, 443, 53) exhibits a Shannon entropy score above the 99th percentile of the historical baseline for that port, or its character distribution significantly deviates from the expected distribution for the associated protocol.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Core network switches, Servers hosting critical applications",
            "action": [
              "Symbolic: Define a static threshold for high entropy (e.g., Shannon entropy > 7.5 for an 8-bit character set) for traffic on non-standard or unexpected ports. Alert on any connection that exceeds this threshold, as it strongly suggests encrypted or compressed data where none is expected.",
              "Statistical: For each destination port, build a historical distribution of payload entropy scores over a 30-day rolling window. Calculate the 95th and 99th percentiles. Generate a low-severity alert for connections with entropy between the 95th and 99th percentile and a high-severity alert for connections exceeding the 99th percentile.",
              "Machine Learning: Use time series analysis (e.g., ARIMA) to forecast the expected volume and entropy of traffic for specific protocols or applications. Generate an alert when observed traffic contains anomalies (spikes in entropy or data volume) that fall outside the model's predicted confidence interval, suggesting a potential C2 channel."
            ]
          },
          {
            "description": "A series of DNS queries to the same domain where the query length is consistently greater than 100 bytes, or an HTTP session where the total bytes sent from the client ('orig_bytes') is more than three standard deviations greater than the mean for that destination server.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS resolvers, Web proxies, Endpoints making external connections",
            "action": [
              "Symbolic: Create a rule to alert on any single DNS query where the query length in `Zeek dns.log` exceeds 255 bytes, the maximum length for a FQDN, or where a TXT record query payload is larger than 512 bytes.",
              "Statistical: For each unique server IP, calculate the historical mean and standard deviation of the ratio of bytes sent to bytes received (`orig_bytes` / `resp_bytes` from Zeek conn.log). Alert when a new connection's ratio exceeds three standard deviations from the mean, indicating a significant asymmetry suggestive of data transfer or C2.",
              "Machine Learning: Apply k-means clustering to network connections based on features like `orig_bytes`, `resp_bytes`, `duration`, and `proto`. Analyze the resulting clusters to identify small, outlier clusters characterized by high `orig_bytes` and low `resp_bytes`, which represent anomalous communication patterns that may correspond to encoded C2."
            ]
          },
          {
            "description": "A process such as 'notepad.exe' or 'svchost.exe' running from a non-system directory (e.g., C:\\Users\\...\\AppData\\) initiates an outbound network connection, as identified by correlating Windows Event ID 5156 and Zeek conn.log data.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Domain controllers, Critical application servers",
            "action": [
              "Symbolic: Create a watchlist of processes that should not normally make network connections (e.g., 'calc.exe', 'notepad.exe', 'mspaint.exe'). Correlate Windows Event ID 5156 ('Application Name') with Zeek conn.log ('id.orig_h'). Generate a high-severity alert if a process on the watchlist initiates any external network connection.",
              "Statistical: For each process name on each host, establish a baseline of normal network behavior (e.g., destination ports, data volume, connection frequency). Use Z-scores to identify statistical deviations. For example, alert if `powershell.exe` connects to a destination port it has never connected to before or if the daily connection count for `svchost.exe` from a user profile path exceeds four standard deviations from its norm.",
              "Machine Learning: Train a graph-based model on parent-child process relationships from Windows Event ID 4688. Identify anomalous process chains (e.g., `WINWORD.EXE` -> `powershell.exe` -> `rundll32.exe`). When such a chain is detected and the final process in the chain initiates a network connection (via Event ID 5156), classify this event as high-risk C2 activity."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]