[
  {
    "information_requirement": "Is the adversary maintaining persistence using Office Template Macros?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1137.001",
        "name": "Office Template Macros",
        "evidence": [
          {
            "description": "An Office template file (.dotm, .xltm) hash matches a known-bad value from threat intelligence, or a network connection from an Office process (WINWORD.EXE, EXCEL.EXE) communicates with a destination IP/domain on a threat intelligence watchlist.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations (e.g., %APPDATA%\\Microsoft\\Templates), File servers hosting shared templates, Network egress points",
            "action": [
              "Create a detection rule that triggers when: (a) A file write event (Windows Event ID 4663) occurs in a known Office template path, and the file's hash matches a malicious hash list. OR (b) A network connection (Zeek conn.log) from a parent process of WINWORD.EXE or EXCEL.EXE (Windows Event ID 4688) has a destination IP or domain present in a C2 threat intelligence feed.",
              "For each host, calculate the daily count of new or modified .dotm and .xltm files. Establish a baseline count per host and per organizational unit. Alert if the daily count for a host exceeds the 95th percentile of its historical 30-day activity, indicating an unusual burst of template modifications.",
              "Use a supervised classification model (e.g., Random Forest) trained on features from both file and network events. Features could include file path entropy, process name, destination IP reputation, port number, and connection duration. The model will classify each template-related event sequence as benign or malicious, alerting on high-confidence malicious predictions."
            ]
          },
          {
            "description": "A modification to a Windows Registry key responsible for Office template locations (e.g., GlobalDotName) or macro security settings (e.g., VBAWarnings), where the change is not associated with a known software installation or Group Policy update.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Registry on user workstations, Group Policy Objects on Domain Controllers",
            "action": [
              "Create a detection rule that alerts on any modification (Windows Event ID 4657) to the registry keys `HKCU\\Software\\Microsoft\\Office\\<version>\\Word\\Options\\GlobalDotName` or `HKCU\\Software\\Microsoft\\Office\\<version>\\<app>\\Security\\VBAWarnings`, where the process performing the change is not `gpupdate.exe`, `msiexec.exe`, or another approved software deployment tool.",
              "Establish a baseline of all values ever observed for the `VBAWarnings` and `GlobalDotName` registry keys across the enterprise. Calculate the frequency of each value. Alert on any modification that sets a key to a value that is rare (e.g., observed on <1% of endpoints) or has never been seen before, especially if the new value for `VBAWarnings` is `1` (enable all macros).",
              "Develop a one-class SVM (Support Vector Machine) model trained on legitimate registry modification events. The model learns the boundary of normal activity, including the responsible processes and typical value changes. Any new modification event that falls outside this learned boundary is flagged as a potential anomaly for investigation."
            ]
          },
          {
            "description": "An Office application process (WINWORD.EXE, EXCEL.EXE) spawns a child process identified as a command shell, scripting interpreter, or living-off-the-land binary (LOLBin).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and terminal servers",
            "action": [
              "Create a detection rule that triggers when a process creation event (Windows Event ID 4688) shows a parent process of `WINWORD.EXE`, `EXCEL.EXE`, or `POWERPNT.EXE` and a child process of `cmd.exe`, `powershell.exe`, `wscript.exe`, `cscript.exe`, `mshta.exe`, `bitsadmin.exe`, or `certutil.exe`.",
              "For each parent Office process, build a historical baseline of all child processes it normally spawns. Calculate the frequency of each parent-child pair. Alert when an Office application spawns a child process that is statistically rare for that parent across the enterprise (e.g., a pair that occurs less than 0.1% of the time).",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN) on process command-line arguments for child processes spawned by Office applications. Cluster the arguments to identify common, legitimate patterns. Any command line that does not fit into an established cluster, or forms a new, small cluster, should be flagged as an outlier for analysis."
            ]
          },
          {
            "description": "An Office application process (WINWORD.EXE, EXCEL.EXE) initiates an outbound network connection with characteristics that are anomalous compared to its established baseline, such as connecting to a rare destination, using a non-standard port, or transferring an unusual amount of data.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS servers, User workstations",
            "action": [
              "Create a detection rule that triggers when an Office process (identified via correlation of Windows Event ID 4688 and Zeek conn.log) initiates a network connection to an IP address on a Tor node list or a newly registered domain (e.g., registered in the last 30 days).",
              "For each Office application, build a baseline of network activity including (a) destination countries, (b) destination Autonomous System Numbers (ASNs), and (c) destination ports. Alert if a connection is made to a country or ASN not seen in the last 60 days for that application, or to a port that falls outside the top 95% of historically used ports.",
              "Apply a time-series forecasting model (e.g., ARIMA or LSTM) to the volume of outbound data (`orig_bytes` in Zeek conn.log) from Office processes on a per-host basis. The model predicts the expected data volume for the next time interval. Alert if the actual observed data volume significantly exceeds the predicted amount plus a confidence interval, suggesting potential data exfiltration."
            ]
          },
          {
            "description": "A time-correlated sequence of events on a single host where: 1) an Office template file is modified, followed by 2) the corresponding Office application launching and 3) initiating anomalous child process or network activity.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, File servers, Network egress points",
            "action": [
              "Create a stateful correlation rule that triggers if, on the same host within a 24-hour window: (Event A) a file write event (Windows Event ID 4663) is logged for `Normal.dotm` or a file in `XLSTART`, followed by (Event B) a process creation event (Windows Event ID 4688) where the parent is the corresponding Office application and the child is `powershell.exe` or `cmd.exe`.",
              "For each host, create a baseline of activity following a template file modification (Windows Event ID 4663). Profile the typical child processes and network destinations that occur within 5 minutes of the next Office application launch. Use a scoring system: assign points for rare child processes, connections to new IPs, or high-entropy command lines. Alert if the cumulative score for a sequence exceeds a dynamically calculated threshold (e.g., 3 standard deviations above the host's mean score).",
              "Use a sequence analysis model, such as a Hidden Markov Model (HMM), to learn the probability of transitioning between different states (e.g., 'no activity', 'template write', 'normal app launch', 'anomalous process', 'anomalous network'). Train the model on benign event sequences. When a new sequence of events is observed, calculate its likelihood score under the trained model. A very low likelihood score indicates the sequence is anomalous and likely malicious."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]