[
  {
    "information_requirement": "Has the adversary escalated privileges using SID-History Injection?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1134.005",
        "name": "SID-History Injection",
        "evidence": [
          {
            "description": "A process creation event on a Domain Controller for a known SID-History injection tool (e.g., mimikatz.exe) with specific command-line arguments (e.g., 'sid::add').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule in the SIEM to trigger an alert when a process creation event (Windows Event ID 4688) on a Domain Controller contains command-line arguments matching known patterns for SID-History injection tools, such as 'sid::add', 'sid::patch', 'Invoke-SIDHistory', or 'Add-DomainObjectSidHistory'.",
              "Statistical: Analyze the entropy of command-line arguments for all processes created on Domain Controllers. Flag commands with an entropy score in the 95th percentile or higher, as this can indicate obfuscated or packed tool execution, and correlate with other suspicious account activity.",
              "Machine Learning: Train a supervised classification model (e.g., a random forest) on labeled command-line execution data (benign vs. malicious tool usage). Deploy the model to score new process creation events in real-time, alerting on those classified as high-probability malicious tool execution."
            ]
          },
          {
            "description": "A Directory Service Changes event (Windows Event ID 5136) or an LDAP Modify Request (Zeek ldap.log) shows a SID being added to the 'sIDHistory' attribute that is either a well-known privileged SID (e.g., Enterprise Admins) or belongs to the same domain as the target account.",
            "data_sources": [
              "Windows Event ID 5136",
              "Zeek ldap.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network segments containing LDAP traffic to Domain Controllers",
            "action": [
              "Symbolic: Create a SIEM rule to alert on any Windows Event ID 5136 where the 'LDAP Display Name' is 'sIDHistory' and the 'Value' added contains a well-known privileged SID (e.g., 'S-1-5-domain-512', 'S-1-5-domain-519') or has the same domain identifier as the target account's primary SID.",
              "Statistical: For each sIDHistory modification event, calculate the Jaccard similarity between the set of domain identifiers in the added SIDs and the account's primary domain. A similarity score of 1 (indicating a same-domain SID was added) is highly anomalous. Track the frequency of modifications per user; an account exceeding the 99th percentile of modification frequency warrants investigation.",
              "Machine Learning: Use an unsupervised anomaly detection model (e.g., Isolation Forest) trained on features from sIDHistory modification events, such as source IP, time of day, and the type of SID added (cross-domain vs. same-domain). The model can identify rare and suspicious combinations of these features that deviate from benign migration activity."
            ]
          },
          {
            "description": "A correlation of events within a defined time window (e.g., 30 minutes) shows a user's 'sIDHistory' attribute being modified (Windows Event ID 5136), immediately followed by a successful interactive or network logon (Windows Event ID 4624) by that same user to a critical system (e.g., Domain Controller) where they have not previously logged in.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical servers (e.g., database servers, application servers), SIEM/Log Aggregator",
            "action": [
              "Symbolic: Implement a stateful correlation rule that triggers when a specific user's SID history is modified (Event ID 5136) and is followed within 30 minutes by a successful logon (Event ID 4624) from that same user to a system tagged as 'critical'. The rule should exclude accounts belonging to the 'Domain Admins' group.",
              "Statistical: Maintain a historical baseline of which users log into which critical systems. For any user who has their sIDHistory modified, calculate a rarity score for their subsequent logons based on historical frequency. A logon to a system where the user has a zero or near-zero historical logon frequency should be considered highly suspicious and trigger an alert.",
              "Machine Learning: Develop a sequence analysis model (e.g., using a Hidden Markov Model) trained on typical user activity sequences (logon, resource access, logoff). An anomalous sequence, such as 'sIDHistory modification -> logon to new critical asset -> high-privilege command execution', would be flagged by the model as a likely privilege escalation path."
            ]
          },
          {
            "description": "The count of Directory Service Changes events (Windows Event ID 5136) for the 'sIDHistory' attribute on a Domain Controller exceeds a statistically determined threshold over a short time period (e.g., 1 hour).",
            "data_sources": [
              "Windows Event ID 5136"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Create a simple threshold rule that alerts if the count of Windows Event ID 5136 for the 'sIDHistory' attribute exceeds a fixed number (e.g., 5) within a 1-hour window. This is a low-fidelity but simple catch-all for bulk changes.",
              "Statistical: Apply a moving average calculation to the time series of sIDHistory modification event counts. Generate an alert when the current count exceeds 3 standard deviations above the moving average. This method adapts to slowly changing baselines and is more robust than a fixed threshold.",
              "Machine Learning: Use a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to monitor the volume of sIDHistory modification events. This model can account for seasonality and trend, flagging statistically significant spikes that represent a departure from the established norm of near-zero activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using SID-History Injection?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1134.005",
        "name": "SID-History Injection",
        "evidence": [
          {
            "description": "A Directory Service Changes event (Windows Event ID 5136) or an LDAP Modify Request (Zeek ldap.log) for the 'sIDHistory' attribute originates from a client IP, hostname, or process that is not on an approved allow-list of administrative workstations or domain migration servers.",
            "data_sources": [
              "Windows Event ID 5136",
              "Zeek ldap.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Administrative workstations, Network segments with LDAP traffic",
            "action": [
              "Symbolic: Maintain an allow-list of authorized administrator accounts, source hostnames/IPs for domain migration, and approved processes. Create a SIEM rule to alert on any sIDHistory modification (Event ID 5136) where the 'Subject/Security ID' or source IP (from correlated logon events or Zeek ldap.log) is not on the allow-list.",
              "Statistical: Profile the source IPs and accounts that perform LDAP modifications. Calculate the rarity of a source IP/account combination performing an sIDHistory modification. An event originating from a source that has never or rarely performed such an action should have a high anomaly score and be flagged for review.",
              "Machine Learning: Train a classifier (e.g., One-Class SVM) on features of legitimate sIDHistory modification events (e.g., source IP block, account group memberships, time of day). Deploy the model to identify any new modification events that fall outside the learned boundary of normal administrative behavior."
            ]
          },
          {
            "description": "The 'sIDHistory' attribute is modified (Windows Event ID 5136) for an account that has had no logon activity (Windows Event ID 4624) for an extended period (e.g., over 90 days) or is designated as a service account.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory User and Computer Objects, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Create a rule that joins sIDHistory modification events (Event ID 5136) with a lookup table of dormant accounts (last logon > 90 days) and service accounts. An alert is generated if a modification targets an account in either of these categories.",
              "Statistical: For every account, calculate the number of days since its last logon. When an sIDHistory modification occurs, treat the 'days since last logon' as a feature. Any modification where this value is in the top percentile (e.g., 95th percentile or higher) of all accounts should be flagged for review.",
              "Machine Learning: Use clustering algorithms (e.g., K-Means) to group user accounts based on their activity patterns (logon frequency, logon times, resources accessed). A sudden sIDHistory modification on an account in a 'dormant' or 'service account' cluster is a strong anomaly that can be detected as a shift in the account's cluster membership or as an outlier."
            ]
          },
          {
            "description": "An account with a populated 'sIDHistory' attribute is observed performing a privileged action (e.g., remote process creation on a Domain Controller via Event ID 4688) that its explicit group memberships do not authorize.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4735"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, SIEM/Log Aggregator",
            "action": [
              "Symbolic: First, enrich logon events (4624) with a flag indicating if the user has a populated sIDHistory. Then, create a correlation rule that alerts if a user with this flag performs a highly privileged action (e.g., creates a process on a DC, adds a user to a privileged group) that they are not explicitly authorized to do via their direct group memberships.",
              "Statistical: For each user, build a profile of normal behavior using User and Entity Behavior Analytics (UEBA). An alert is triggered when a user with a modified sIDHistory performs an action that is a statistical outlier (e.g., >3 standard deviations) compared to their own baseline and the baseline of their peer group (users with similar explicit permissions).",
              "Machine Learning: Train a graph-based anomaly detection model on the Active Directory structure and user access patterns. An injected SID creates an 'implicit' edge in the access graph. The model can detect when a user leverages this implicit edge to perform an action that is topologically distant or improbable based on their 'explicit' position in the graph."
            ]
          },
          {
            "description": "A periodic review of all Active Directory user objects reveals accounts with a non-empty 'sIDHistory' attribute, where the presence of these SIDs is not documented in change management records or associated with a known domain migration project.",
            "data_sources": [
              "Windows Event ID 5136"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Database (ntds.dit), Change Management System/Ticketing System",
            "action": [
              "Symbolic: On a weekly schedule, run a query for all unique users who have had Event ID 5136 for 'sIDHistory' in the past. Cross-reference this list with a manually maintained list of users involved in approved migration activities. Any user on the log-generated list but not on the approved list is flagged for investigation.",
              "Statistical: Track the total count of accounts with a populated sIDHistory attribute over time. A sudden increase in this count that does not correlate with a planned migration project is a statistical anomaly. Also, calculate the percentage of privileged vs. non-privileged accounts with a populated sIDHistory; a rising percentage in non-privileged accounts is suspicious.",
              "Machine Learning: Use natural language processing (NLP) to parse change management tickets and project documentation related to domain migrations. Create a model that can automatically extract authorized user accounts and timeframes for migration. Compare the log data of sIDHistory modifications against the model's output to automatically flag unauthorized or undocumented changes."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]