[
  {
    "information_requirement": "Is the adversary attempting to gather credentials using forced authentication?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1187",
        "name": "Forced Authentication",
        "evidence": [
          {
            "description": "An outbound SMB (TCP/445, TCP/139) or WebDAV (TCP/80, TCP/443) connection from an internal network asset to an external IP address or domain present on a CTI feed of known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, DNS resolvers, Perimeter firewalls",
            "action": [
              "Symbolic: Create a SIEM rule that joins Zeek conn.log with a threat intelligence feed of known malicious IPs. Alert when id.resp_p is 445 or 139 and id.resp_h matches an IP on the list, ensuring id.orig_h is from an internal subnet and id.resp_h is external.",
              "Statistical: Profile the Autonomous System Number (ASN) and country of destination IPs for all outbound SMB traffic over a 30-day baseline. Calculate the frequency distribution and alert on connections to ASNs or countries that are rare (e.g., bottom 5% of frequency) or have a known high-risk reputation.",
              "Machine Learning: Use a supervised classification model (e.g., Random Forest) trained on labeled historical data (benign vs. malicious connections). Features can include destination IP reputation, ASN, country, port, and whether the destination is a newly seen IP. Deploy the model to score new outbound SMB connections in real-time."
            ]
          },
          {
            "description": "The creation or modification of a file with a .lnk, .scf, or .url extension on an endpoint, where the file's content or properties contain a UNC path pointing to an external, non-corporate IP address or domain.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Shared network drives, Publicly accessible file shares, Terminal servers",
            "action": [
              "Symbolic: Search command-line logs (Windows Event ID 4688) for processes (e.g., cmd.exe, powershell.exe) creating files with .lnk, .scf, or .url extensions containing a UNC path (`\\\\`) followed by an external IP address. Correlate with file write events (Sysmon Event ID 11) to confirm file content.",
              "Statistical: Establish a baseline of common UNC paths found in .lnk files across the enterprise. Calculate the entropy of the server name portion of UNC paths in newly created files. Alert on files with unusually high entropy or paths pointing to servers that are statistical outliers (not in the top 99% of common destinations).",
              "Machine Learning: Train a text classification model (e.g., Naive Bayes) to distinguish between benign and malicious .LNK/.SCF file contents. Features can be derived from the target path (e.g., presence of external IP, use of non-standard share names, unusual icon paths). Scan new files (Sysmon Event ID 11) and alert on those classified as malicious."
            ]
          },
          {
            "description": "An Office document (.docx, .rtf) or HTML file is observed containing an embedded resource tag (e.g., <img>, <link>, OLE object) that references an external SMB share using a `file://` or similar URI scheme.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email gateways, Web proxies, Endpoint download directories",
            "action": [
              "Symbolic: Using Zeek's file extraction (files.log), scan the content of transferred documents and HTML files for the regex pattern `(file:|\\\\)\\\\\\\\[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}`. Alert when a match is found and enrich with the parent process (e.g., OUTLOOK.EXE) from endpoint logs (Sysmon Event ID 1).",
              "Statistical: Analyze all `file://` URIs extracted from documents over a 30-day period. Create a frequency distribution of the domains and IP addresses referenced. Alert when a document contains a `file://` URI pointing to a destination that is a statistical rarity (e.g., has not been seen before or is in the bottom 1% of occurrences).",
              "Machine Learning: Develop a document classifier using features extracted from file metadata and content. Train a model (e.g., Gradient Boosting) to predict the likelihood a document is malicious based on features like the presence and target of `file://` links, VBA macro presence, and file source. Score documents downloaded from the internet or received as email attachments."
            ]
          },
          {
            "description": "A statistically significant increase in the volume, frequency, or number of unique destinations for outbound SMB (TCP/445, TCP/139) or WebDAV (TCP/80, TCP/443) traffic from one or more internal hosts compared to an established baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internet gateways, Firewall logs",
            "action": [
              "Symbolic: Create a rule that triggers if a single internal host initiates more than 20 outbound SMB connections to distinct external IP addresses within a 10 minute window. Tune thresholds based on environmental norms.",
              "Statistical: For each internal host, model the hourly count of outbound SMB/WebDAV connections using a 30-day rolling baseline. Alert if the current hour's count exceeds 3 standard deviations above the historical mean for that same hour of the day and day of the week.",
              "Machine Learning: Apply time-series anomaly detection (e.g., using an LSTM autoencoder) to the aggregate outbound SMB/WebDAV traffic volume (bytes_out) and connection count. Train the model on historical data to learn the network's normal 'rhythm'. Alert when the reconstruction error for new data exceeds a dynamically learned threshold."
            ]
          },
          {
            "description": "An internal host, particularly a user workstation, initiates SMB (TCP/445) connections to an anomalously high number of other internal hosts within a short time period, deviating from established peer-to-peer communication baselines.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, VLANs for user workstations, Domain Controller security logs",
            "action": [
              "Symbolic: Alert when a source IP address from a workstation VLAN initiates SMB connections to more than 50 unique destination IPs in other workstation VLANs within 5 minutes, excluding known servers and printers.",
              "Statistical: Generate a graph of internal SMB communications to establish a baseline of normal traffic. For each source host, calculate the daily fan-out (number of unique destinations). Alert if a host's fan-out exceeds its 99th percentile, or if the overall network graph density for workstation-to-workstation SMB traffic increases by more than 2 standard deviations.",
              "Machine Learning: Use unsupervised clustering (e.g., DBSCAN) on host communication features (e.g., number of SMB connections, number of unique ports, protocol mix). Identify hosts that fall into sparse clusters or are classified as noise, as they represent anomalous behavior indicative of an internal pivot or forced authentication scan."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]