[
  {
    "information_requirement": "Has the adversary gained initial access via a compromised hardware supply chain? (PIR)",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1195.003",
        "name": "Compromise Hardware Supply Chain",
        "evidence": [
          {
            "description": "A TCP/UDP network connection originating from a newly provisioned asset (e.g., deployed within the last 30 days) to a destination IP address or domain matching a high-confidence threat intelligence feed for hardware implant command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Asset Inventory Database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Proxies)",
            "action": [
              "Correlate Zeek conn.log `id.resp_h` and Zeek dns.log `query` fields against a threat intelligence list of known hardware implant C2 indicators. Generate an alert for any match originating from a host flagged in the asset inventory as being deployed within the last 30 days.",
              "For each connection from a newly provisioned asset, enrich the destination IP with ASN and geolocation data. Calculate the 90-day baseline frequency for all destination ASNs and countries across the enterprise. Flag connections to ASNs or countries that fall below a rarity threshold (e.g., seen less than 0.01% of the time) for investigation, with a higher priority if also matched by the symbolic IOC check.",
              "Train a classification model (e.g., XGBoost, Random Forest) using connection features such as: destination port, protocol, JA3/JA3S hash, destination IP reputation, ASN rarity score, country rarity score, and a binary feature for 'newly provisioned asset'. Use the model to score each outbound connection from new assets, flagging those with a high probability of being C2 traffic for analyst review."
            ]
          },
          {
            "description": "A process creation event is observed, or a file is transferred over the network, where the file's cryptographic hash (e.g., SHA256) matches a known indicator of compromise for firmware-level malware or supply chain attack tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices (Workstations, Servers)",
            "action": [
              "Continuously compare the `ProcessHash` (from Windows Event ID 4688 or Sysmon Event ID 1) and `sha256` (from Zeek files.log) against a threat intelligence feed of malicious file hashes associated with supply chain attacks. Generate an alert on any match.",
              "For each unique file hash executed, calculate its prevalence (percentage of hosts where it is seen) across the enterprise. Flag executions of hashes that are extremely rare (e.g., seen on fewer than 3 hosts) and are also unsigned (requires Sysmon `IsSigned` field). Additionally, calculate the Shannon entropy of file paths; flag executions from paths with entropy scores in the top 5th percentile, as this may indicate polymorphic malware.",
              "Develop a file execution risk model using a classifier (e.g., Logistic Regression) that ingests features such as: hash prevalence, signer validity, entropy of the file name, entropy of the file path, and parent process details. Train the model on known benign and malicious file execution data to predict the likelihood that a newly executed file is malicious and alert on high-probability events."
            ]
          },
          {
            "description": "A series of outbound network connections from a single host exhibit strong beaconing characteristics (e.g., highly regular time intervals, consistent data volume) or utilize TLS fingerprints (JA3/JA3S) or DNS query patterns associated with known hardware implant C2 channels.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, SSL/TLS Inspection Points",
            "action": [
              "Match the `ja3` and `ja3s` fields from Zeek ssl.log and the `query` field from Zeek dns.log against curated watchlists of indicators specific to firmware implants and supply chain C2 frameworks. Generate an alert for any observed match.",
              "For each source-destination IP pair in Zeek conn.log over a 24-hour window, calculate the standard deviation of the time delta between connections and the standard deviation of the bytes sent (`orig_bytes`). Flag pairs exhibiting exceptionally low standard deviation for both metrics (e.g., in the bottom 1st percentile for the entire dataset), as this indicates non-human, automated communication. Correlate with JA3/JA3S rarity to increase confidence.",
              "Apply a Fast Fourier Transform (FFT) to the time series of connection counts and data volumes per host to detect strong periodic signals indicative of beaconing. Cluster hosts based on beaconing features (e.g., frequency, jitter, payload size, JA3) using an algorithm like DBSCAN to identify small groups of devices communicating in a similar, anomalous manner not attributable to legitimate applications."
            ]
          },
          {
            "description": "One or more network connections to an external, non-RFC1918 destination IP address are initiated from a host after a system boot event (e.g., Event Log service start) but before the first interactive user logon.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 6005",
              "Windows Event ID 4624",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Servers, Network Egress Points, Domain Controller Authentication Logs",
            "action": [
              "For each host, create a stateful rule that identifies the time window between a boot event (Windows Event ID 6005) and the first subsequent interactive logon (Windows Event ID 4624 with Logon Type 2 or 10). Generate an alert if any network connection to an external IP on a non-standard port (e.g., not 80, 443, 53, 123) occurs within this specific time window, using Zeek conn.log or Sysmon Event ID 3.",
              "Establish a baseline profile of normal pre-logon network activity for different asset groups (e.g., workstations, web servers). The profile should include typical destination ports, protocol counts, and data volumes. Use a Z-score to detect significant deviations; flag any host whose pre-logon data volume to external IPs exceeds 3 standard deviations above its group's mean.",
              "Train an autoencoder neural network on feature vectors representing normal pre-logon network sessions (e.g., a vector of destination ports, protocol counts, total bytes out, ASN counts). A high reconstruction error when processing a new pre-logon session indicates it is anomalous and does not conform to the learned pattern of legitimate pre-boot activity, warranting investigation."
            ]
          },
          {
            "description": "A boot integrity failure event is logged, such as a Secure Boot validation failure, a BitLocker recovery key access event, or a TPM hardware error, especially on a device with recently installed or replaced hardware components.",
            "data_sources": [
              "Microsoft-Windows-CodeIntegrity/Operational Event ID 3077",
              "Microsoft-Windows-BitLocker-Driver/Operational Event ID 24620",
              "System Log TPM Event ID 15"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Device Event Logs, Server Event Logs, Physical Asset Management Database",
            "action": [
              "Create a high-priority alert that triggers upon the detection of specific boot integrity failure event IDs, such as Secure Boot failure (CodeIntegrity Event ID 3077) or BitLocker recovery mode (BitLocker-Driver Event ID 24620). Automatically enrich the alert by querying the asset inventory to determine if the affected host had hardware changes within the last 90 days.",
              "Calculate the baseline rate of boot integrity errors across the enterprise, segmented by hardware model and OS version. Flag any individual host that exceeds the 99th percentile for these errors in a rolling 30-day window. Monitor the enterprise-wide daily count of these errors; a sudden spike exceeding 3 standard deviations from the weekly moving average may indicate a bad batch of hardware or a widespread attack.",
              "Apply a time-series anomaly detection algorithm (e.g., Seasonal Hybrid ESD) to the daily count of boot errors, with separate models for each major hardware model in the environment. This can identify statistically significant spikes in error rates for a specific model, providing an early warning of a targeted supply chain issue affecting that hardware type."
            ]
          },
          {
            "description": "A time-correlated sequence of events occurs on a single host within a short window (e.g., less than 10 minutes), comprising: (1) a boot integrity error, followed by (2) the execution of an unsigned process, and then (3) a network connection to a destination with a low reputation score or rare geolocation.",
            "data_sources": [
              "Microsoft-Windows-BitLocker-Driver Event ID 24620",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM/Log Aggregator, Endpoint Device Logs, Network Sensor Logs",
            "action": [
              "Implement a SIEM correlation rule that triggers if, for the same hostname, a boot integrity event (e.g., BitLocker-Driver 24620) is followed within 5 minutes by an unsigned process execution (Sysmon Event ID 1 where `Signed` is 'false'), which is then followed within 1 minute by a connection to an external IP present on a threat intelligence blocklist (via Zeek conn.log).",
              "Develop a composite risk scoring model. Assign points for suspicious events occurring on a single host within a 10-minute window (e.g., +15 for a boot error, +10 for an unsigned process execution, +10 for a connection to a rare destination country). If a host's cumulative score exceeds a dynamically determined threshold (e.g., the 99.9th percentile of all host scores), generate a high-fidelity alert for immediate investigation.",
              "Train a Hidden Markov Model (HMM) where the observed events are log entries (boot errors, process creations, network flows) and the hidden states represent the system's security posture (e.g., 'Benign Boot', 'Compromised Boot', 'C2 Active'). A sequence of observed logs that results in a high probability of transitioning into and through the 'Compromised Boot' and 'C2 Active' states should be flagged as a high-confidence hardware compromise incident."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]