[
  {
    "information_requirement": "Has the adversary gained initial access to the network via supply chain compromise? (PIR)",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1195",
        "name": "Supply Chain Compromise",
        "evidence": [
          {
            "description": "A process created within 24 hours of a software installation or update makes an outbound network connection to an IP address, domain, or URL present on a high-confidence threat intelligence feed categorized as C2 or associated with known supply chain attackers.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies), DNS Resolvers, All Endpoints and Servers",
            "action": [
              "Symbolic: Join process creation events (Windows Event ID 4688) with network connection logs (Zeek conn.log) on the host IP and timestamp. Compare the destination IP and FQDN (from Zeek dns.log) against a threat intelligence feed of known malicious indicators. Alert on any match.",
              "Statistical: For processes associated with recent updates, calculate the prevalence of their destination domains across the entire enterprise over the last 30 days. Flag connections to domains in the bottom 1st percentile of prevalence (i.e., the rarest domains).",
              "Machine Learning: Utilize a pre-trained classification model (e.g., a deep learning model for DGA detection) to score requested domains from Zeek dns.log. Investigate high-scoring domains originating from newly installed or updated processes."
            ]
          },
          {
            "description": "A software update process (e.g., update.exe) spawns a non-standard child process (e.g., powershell.exe), or a process is created with a signature that is either invalid, revoked, or absent, within minutes of a software installation.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Security Event ID 5038"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers, Software Distribution Servers",
            "action": [
              "Symbolic: Monitor for Windows Security Event ID 5038 (Code integrity determined that the image hash of a file is not valid). Correlate the timestamp and file path with recent software deployment logs or process creation events (Windows Event ID 4688) to identify the source package.",
              "Statistical: Build a baseline model of normal parent-child process relationships across the enterprise from Windows Event ID 4688 data. Calculate the frequency of each unique parent-child pair. Alert on the creation of statistically rare pairs (e.g., a pair seen less than 5 times in 90 days) where the parent is a known software updater.",
              "Machine Learning: Train a decision tree or random forest classifier on features from process creation events (e.g., parent process name, child process name, command line arguments). Use the model to classify new parent-child relationships as benign or suspicious, flagging those spawned by update processes that are classified as suspicious."
            ]
          },
          {
            "description": "A process associated with a recent software update exhibits one or more network anomalies: 1) periodic, fixed-interval outbound connections (beaconing), 2) communication over a non-standard port for the observed protocol, or 3) connections to domains with a low historical prevalence score.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies), DNS Resolvers, All Endpoints",
            "action": [
              "Symbolic: For processes created via software updates, monitor for connections using a well-known protocol on a non-standard port (e.g., DNS traffic over any port other than 53/UDP). Create a watchlist of such protocol/port mismatches from Zeek conn.log and alert on hits.",
              "Statistical: For each source-destination-port tuple in Zeek conn.log, calculate the time delta between consecutive connections. Analyze the standard deviation of these deltas; a value near zero indicates periodic beaconing. Separately, calculate the entropy of destination ports per source IP over a 1-hour window; an abnormally low entropy for a new process may indicate C2 tunneling.",
              "Machine Learning: Apply time-series analysis (e.g., ARIMA or FFT) to connection logs (bytes sent/received, connection counts) for a given host after a software update. Use the model to detect anomalous spikes or periodic patterns that deviate from the host's pre-update baseline behavior."
            ]
          },
          {
            "description": "A process created by a software update executes discovery commands (e.g., whoami, systeminfo), accesses credential stores (e.g., LSASS memory), or establishes a new persistence mechanism (e.g., new service, scheduled task).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows Event ID 4697",
              "Windows Event ID 4698"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers, Domain Controllers, High-Value Target Workstations",
            "action": [
              "Symbolic: Monitor for the creation of new services (Windows Event ID 4697) or scheduled tasks (Windows Event ID 4698) where the 'Service File Name' or 'Command' path points to a file recently installed by a software update. Correlate with process creation events (Windows Event ID 4688) to link the persistence to the update process.",
              "Statistical: Analyze the command-line arguments in process creation events (Windows Event ID 4688). Calculate the entropy of the command line string for processes spawned by software updaters. A high entropy score can indicate obfuscated commands. Also, track the frequency of sensitive file accesses (Windows Event ID 4663) by updater processes and alert when an updater accesses a file that is statistically rare for its process name.",
              "Machine Learning: Use an unsupervised learning algorithm (e.g., clustering like DBSCAN) on features extracted from host events (process creations, file modifications, registry changes, network connections) following a software update. Group hosts with similar post-update behavior. Investigate small, outlier clusters as potentially compromised by a targeted supply chain attack."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]