[
  {
    "information_requirement": "Is the adversary maintaining persistence using BITS jobs?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1197",
        "name": "BITS Jobs",
        "evidence": [
          {
            "description": "A BITS job is created to download a file where either the source URL/IP is on a threat intelligence feed, or the file designated for execution upon job completion has a known malicious hash.",
            "data_sources": [
              "Windows Event ID 4688",
              "Microsoft-Windows-Bits-Client/Operational Event ID 59",
              "Microsoft-Windows-Bits-Client/Operational Event ID 16391",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Internet Gateway",
            "action": [
              "Create a detection rule that parses process command lines (Windows Event ID 4688) for `bitsadmin.exe` and BITS operational logs (Event ID 59, 16391) to extract download URLs and executables specified via `/SetNotifyCmdLine`. Match the destination URLs/IPs against a threat intelligence feed of known malicious indicators. Separately, calculate the hash of any specified executable and match it against a database of known malware hashes.",
              "For each BITS download URL, analyze the public suffix and second-level domain. Establish a baseline of frequently used suffixes and domains within the organization. Alert on downloads from statistically rare TLDs (e.g., in the top 1% of rarest TLDs seen) or from domains registered within the last 90 days, especially if the domain has a low reputation score.",
              "Train a supervised classification model (e.g., Random Forest) to predict if a URL is malicious based on features like URL length, path depth, query parameter count, character entropy of the path, presence of hex characters, domain age, and domain reputation. Apply the trained model to all URLs extracted from BITS job creation events and alert on URLs classified as malicious with high confidence."
            ]
          },
          {
            "description": "A BITS job is configured via `bitsadmin.exe` or PowerShell to execute a specific program upon job completion or error, establishing a command-execution persistence mechanism.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Member Servers",
            "action": [
              "Create a detection rule for process command lines (Windows Event ID 4688) containing `bitsadmin.exe` and the `/SetNotifyCmdLine` parameter. Create a parallel rule for PowerShell script block logs (Event ID 4104) containing `Set-BitsTransfer` or `Start-BitsTransfer` cmdlets that include the `-NotificationCmdlet` parameter. Alert on all occurrences.",
              "Establish a per-host and per-user baseline for the daily frequency of `bitsadmin.exe` execution. Calculate the z-score for the daily count. Alert on any day where the command line includes persistence parameters (`/SetNotifyCmdLine`) and the execution count for that user or host exceeds a statistical threshold (e.g., z-score > 3.0).",
              "Use an anomaly detection model (e.g., an autoencoder or Isolation Forest) trained on tokenized sequences of command-line arguments for `bitsadmin.exe` and PowerShell BITS cmdlets. The model learns normal administrative patterns. Flag command sequences with a high anomaly score, which indicates a deviation from normalcy, such as the novel use of persistence parameters combined with unusual file paths."
            ]
          },
          {
            "description": "A BITS job is created with an abnormally long job lifetime or retry delay, especially when initiated by a non-SYSTEM user account.",
            "data_sources": [
              "Microsoft-Windows-Bits-Client/Operational Event ID 59",
              "Microsoft-Windows-Bits-Client/Operational Event ID 16391",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Member Servers",
            "action": [
              "Create a rule to alert on any BITS job creation event (Event ID 59, 16391) or `bitsadmin` command (Event ID 4688) where the job is created by a non-SYSTEM account and has a specified lifetime greater than the default of 90 days or includes the `/SetNotifyCmdLine` parameter.",
              "For all BITS job creation events, calculate the 95th percentile for job lifetime and retry delay values across the enterprise. Flag any new job whose lifetime or retry delay exceeds this statistical threshold, increasing the risk score if the job is created by a non-SYSTEM account or transfers a high-risk file type (`.exe`, `.dll`, `.ps1`).",
              "Apply a clustering algorithm (e.g., DBSCAN) to BITS job metadata, using features like creating user SID, job lifetime, retry delay, file count, and total transfer size. Small clusters or points classified as noise by the algorithm represent outlier jobs that are distinct from large, dense clusters of legitimate system activity and warrant investigation."
            ]
          },
          {
            "description": "A BITS job completion or error event is consistently followed within a short, fixed time window by the execution of a specific process, indicating a programmatic link.",
            "data_sources": [
              "Microsoft-Windows-Bits-Client/Operational Event ID 16387",
              "Windows Event ID 4688",
              "Windows Event ID 12"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical Servers",
            "action": [
              "Create a SIEM correlation rule that triggers when a BITS job completion/error event (Event ID 16387) is followed within a 60-second window by a process creation event (Windows Event ID 4688) for an unsigned executable or a process running from a user-writable directory (e.g., `%APPDATA%`, `%TEMP%`).",
              "For each host, analyze the time delta between BITS completion events (Event ID 16387) and subsequent process creations (Event ID 4688). A recurring, fixed time delta with low jitter (standard deviation of the delta is near zero) for a specific process is a strong statistical indicator of a programmatic link. Flag such correlated pairs, especially for rare processes.",
              "Utilize a sequence analysis model (e.g., Hidden Markov Model) trained on sequences of event logs from a host. The model learns the normal probability of transitions between system events. Flag event sequences where a BITS completion event is followed by a low-probability process creation, as this indicates a significant deviation from learned normal behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary using BITS jobs for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1197",
        "name": "BITS Jobs",
        "evidence": [
          {
            "description": "Network traffic associated with the BITS service (`svchost.exe`) connects to external destinations (IPs, domains) that are known to be malicious.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Egress Firewalls, DNS Resolvers",
            "action": [
              "Filter `Zeek http.log` for requests with a User-Agent string containing 'Microsoft BITS'. Extract the destination host, URL, and IP from these logs and their corresponding `conn.log` entries. Match these indicators against threat intelligence feeds of known malicious C2 servers, drop zones, and newly registered domains. Alert on any match.",
              "Baseline the geographic location (country) and Autonomous System Number (ASN) of destinations for all BITS traffic. Calculate a rarity score for the destination country and ASN of each new connection. Alert on traffic to destinations with a high rarity score (e.g., top 1% rarest), especially if the connection involves more data being uploaded than downloaded (`orig_bytes` > `resp_bytes` in `Zeek conn.log`).",
              "Train a supervised classification model (e.g., Gradient Boosting) on network connection features (destination IP/ASN/country, port, total bytes, bytes out vs. in ratio, JA3 hash) to distinguish between benign update traffic and malicious C2/exfiltration traffic. Apply this model in real-time to all connections identified as BITS traffic."
            ]
          },
          {
            "description": "A BITS job is configured with a custom User-Agent header to evade network signature detection, or its display name is crafted to masquerade as a legitimate system process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Member Servers, Internet Gateway",
            "action": [
              "Monitor `bitsadmin.exe` command lines (Windows Event ID 4688) for the `/SetCustomHeaders` parameter. Monitor PowerShell script block logs (Event ID 4104) for `Add-BitsFile -CustomHeaders`. In parallel, filter `Zeek http.log` for any HTTP requests where the User-Agent does not match the standard 'Microsoft BITS/7.x' pattern but the traffic originates from the BITS service process. Alert on all findings.",
              "Maintain a dictionary of legitimate BITS job display names observed in logs. For each new job name, calculate its Levenshtein distance to all names in the dictionary. Flag names that are very close but not identical (e.g., distance < 3) to a known good name, as these may be typosquatting attempts (e.g., 'Mircosoft Update'). Also flag job names with very low frequency across the enterprise.",
              "Use a Natural Language Processing (NLP) model to generate vector embeddings for BITS job display names. Train a one-class classifier (e.g., One-Class SVM) on embeddings of known-good job names. Apply the model to new job names and alert on any that are classified as outliers, indicating they are semantically different from legitimate update and system job names."
            ]
          },
          {
            "description": "A BITS job is used to transfer a file that is anomalous based on its type, size, or destination path, particularly when initiated by an interactive user rather than the SYSTEM account.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Microsoft-Windows-Bits-Client/Operational Event ID 59",
              "Microsoft-Windows-Bits-Client/Operational Event ID 60"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, File Servers, Internet Gateway",
            "action": [
              "Create a rule to alert when a BITS transfer completion event (Event ID 60) involves a file type not on an explicit allowlist (e.g., not `.cab`, `.msu`, `.dat`). Specifically look for transfers of high-risk types (`.exe`, `.dll`, `.ps1`, `.zip`) where the job owner is not SYSTEM and the destination path is a user-writable directory like `%APPDATA%` or `%PUBLIC%`.",
              "For all BITS file transfers observed in `Zeek files.log` or BITS logs, baseline the distribution of file sizes per MIME type. Use the interquartile range (IQR) method to detect outliers: flag any transfer with a size greater than Q3 + 1.5*IQR. Assign a higher risk score for outlier transfers of executable or script file types.",
              "Use a clustering model (e.g., K-Means) on features of BITS file transfers, including file MIME type, file size, source/destination context (internal/external), and the character entropy of the target directory path. Investigate small clusters that are distant from the large, central clusters representing legitimate update activity, as these represent anomalous transfer patterns."
            ]
          },
          {
            "description": "Network traffic from the BITS service exhibits 'low-and-slow' exfiltration patterns (periodic, small uploads) or Domain Generation Algorithm (DGA) characteristics (connections to many disparate, non-existent, or low-reputation domains).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Firewalls, Internet Gateway, DNS Resolvers",
            "action": [
              "Create a rule that alerts when a single internal host using the BITS service generates DNS requests for more than 20 distinct external second-level domains within a 5-minute window, where over 50% of those requests result in NXDOMAIN responses from the DNS server.",
              "For each host, analyze the time series of BITS upload volume (`orig_bytes` in `Zeek conn.log`). A pattern of small, periodic uploads with low variance in size and inter-arrival time is characteristic of 'low-and-slow' exfiltration. Separately, calculate the Shannon entropy of requested domain names in `Zeek dns.log` for BITS-related traffic over a rolling window; a sustained high entropy value is indicative of DGA.",
              "Apply a time series forecasting model (e.g., LSTM) to each host's BITS-related network connection metadata (bytes out, connection count per minute). The model learns the host's normal 'rhythm' of BITS activity. Generate an alert when observed activity significantly deviates from the model's forecast, indicating a potential C2 channel or exfiltration event that breaks the established pattern."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]