[
  {
    "information_requirement": "Has the adversary executed code on client systems via exploitation? (PIR)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1203",
        "name": "Exploitation for Client Execution",
        "evidence": [
          {
            "description": "A client application process, such as a browser or document reader, initiates an outbound network connection to a domain, IP address, or URL matching a known malicious indicator associated with exploit kits, malware distribution, or phishing campaigns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Forward proxy servers, DNS resolvers, User workstations",
            "action": [
              "Execute a search that joins network connection logs (Zeek conn.log) and web traffic logs (Zeek http.log) with a threat intelligence feed. Alert when a destination_ip or http.host field matches an indicator categorized as exploit kit, malware C2, or phishing.",
              "For all requested domains in Zeek dns.log, calculate their frequency over a 30-day rolling window. Identify domains in the long tail of the frequency distribution (e.g., below the 5th percentile of popularity). Flag connections from Zeek conn.log to these rare domains, especially if Zeek files.log shows a concurrent download of a high-risk file type (e.g., .pdf, .doc, .xls, .swf).",
              "Develop a per-user time-series model (e.g., Seasonal-ARIMA) to forecast the expected number of connections to newly observed domains (domains not seen in the prior 60 days for that user). An observed value that significantly exceeds the forecast's confidence interval, especially if correlated with a high-risk file download from Zeek files.log, indicates a potential drive-by compromise."
            ]
          },
          {
            "description": "A common client application (e.g., WINWORD.EXE, chrome.exe, AcroRd32.exe) spawns a command-line interpreter (cmd.exe, powershell.exe) or scripting host (wscript.exe), and the child process's command line contains obfuscated code or keywords for downloading/executing payloads.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Virtual Desktop Infrastructure (VDI) instances, Remote Desktop Session Hosts",
            "action": [
              "Create a detection rule that triggers when a Parent Process from a defined list of client applications ('WINWORD.EXE', 'EXCEL.EXE', 'POWERPNT.EXE', 'AcroRd32.exe', 'chrome.exe', 'msedge.exe') spawns a child process from a list of interpreters ('cmd.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe'). The rule should further filter for command-line arguments containing suspicious patterns via regex, such as '-enc', 'DownloadString', 'certutil -urlcache', 'bitsadmin /transfer', or long Base64 strings.",
              "For every parent-child process pair captured in Sysmon Event ID 1 (e.g., 'WINWORD.EXE' -> 'powershell.exe'), calculate the Shannon entropy of the command-line arguments. Establish a distinct baseline entropy distribution for each pair. Alert on any command line whose entropy exceeds the 99th percentile for its specific parent-child pairing, indicating probable obfuscation.",
              "Deploy a pre-trained transformer-based model (e.g., a fine-tuned BERT model) to classify command-line arguments as malicious or benign. Continuously feed all command lines from Sysmon Event ID 1 where the parent is a common client application into the model. An output classification of 'malicious' with a confidence score above 0.9 should generate a high-priority alert."
            ]
          },
          {
            "description": "A client application process (e.g., WINWORD.EXE) spawns a child process (e.g., ftp.exe) that is statistically rare or has never been observed originating from that parent process across the enterprise baseline.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Application servers (e.g., Citrix), DNS resolvers, Internet gateway",
            "action": [
              "Maintain a static list of explicitly forbidden parent-child process relationships originating from client applications (e.g., 'AcroRd32.exe' spawning 'regsvr32.exe', 'chrome.exe' spawning 'diskpart.exe'). Create a high-severity alert rule that triggers on any exact match from this list found in Sysmon Event ID 1 data.",
              "Using Sysmon Event ID 1 data, build a historical frequency table of all observed parent-child process pairs over a 30-day period. For each parent process, calculate the conditional probability P(Child | Parent). Alert when a new process creation event occurs where P(Child | Parent) is below a defined rarity threshold (e.g., <0.001 or first time seen), indicating a strong deviation from normal behavior.",
              "Represent all process creation events (Sysmon Event ID 1) as a directed graph where nodes are processes and edges are parent-child relationships. Apply a graph-based anomaly detection algorithm (e.g., GNN-based autoencoder) to identify anomalous edges (process creations) that have a high reconstruction error. Enrich findings by correlating the anomalous child process with any subsequent anomalous network connections (e.g., direct-to-IP, high entropy domain) identified in Zeek conn.log."
            ]
          },
          {
            "description": "A client application process (e.g., chrome.exe, WINWORD.EXE) creates a file where the file extension (.pdf) does not match the true file type identified by its magic bytes (e.g., PE executable), or writes a file with an executable extension (.exe, .dll, .ps1) to a user-writable, non-standard directory (e.g., C:\\Users\\Public\\Downloads).",
            "data_sources": [
              "Sysmon Event ID 11",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Network file shares, Web content filters",
            "action": [
              "Monitor Sysmon Event ID 11 (FileCreate) events. Alert when the Image process is a common client application and the TargetFilename has an executable extension (e.g., .exe, .dll, .scr, .ps1, .vbs, .hta, .bat) AND the file path matches a pattern for a suspicious, user-writable location (e.g., 'C:\\Users\\Public\\*', 'C:\\PerfLogs\\*', '%APPDATA%\\..\\Local\\Temp\\*').",
              "For each client application process monitored via Sysmon Event ID 11, build a baseline profile of common (process, target directory, file extension) tuples. Use frequency analysis to identify rare combinations. Alert on any file creation event where the (directory, extension) pair for a given process falls below the 1st percentile of observed frequency, indicating an unusual file write.",
              "For files extracted from network traffic (Zeek files.log) or created on disk (Sysmon Event ID 11), implement a file type classification model based on the file's first N bytes (magic bytes). Compare the model's predicted file type (e.g., 'PE Executable') with the file's extension (e.g., '.jpg'). Alert on any mismatch, prioritizing those written by browser or document reader processes."
            ]
          },
          {
            "description": "A process associated with a client application (e.g., chrome.exe) initiates an outbound network connection with anomalous characteristics, such as connecting to a raw IP address, using a non-standard port for the application, or communicating with a domain exhibiting high character entropy.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Internet gateway, Egress firewalls, DNS resolvers",
            "action": [
              "Using Sysmon Event ID 3, identify the process making a network connection. Correlate with Zeek logs. Alert when a client application process initiates a connection to a destination IP (dest_ip in conn.log) that has no corresponding DNS query (query in dns.log) from the same source IP in the preceding 5 minutes. Exclude private IP space and a pre-defined allow-list of services.",
              "For each client application process (identified via Sysmon Event ID 3), establish a baseline distribution of destination ports used from Zeek conn.log. Alert when a connection uses a port outside the 95th percentile of common ports for that specific application. Concurrently, calculate the Shannon entropy of all requested FQDNs in Zeek dns.log and alert on requests for domains with an entropy score > 4.0.",
              "For each user-and-process combination (e.g., 'user_A' on 'chrome.exe'), train an unsupervised anomaly detection model (e.g., Isolation Forest) using features from Sysmon Event ID 3 and Zeek conn.log (e.g., destination port, protocol, bytes_out, bytes_in, connection duration). The model learns a profile of normal network behavior for that specific context. Any connection flagged as a significant outlier by the model should be escalated for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]