[
  {
    "information_requirement": "Is the adversary maintaining persistence using socket filters?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1205.002",
        "name": "Socket Filters",
        "evidence": [
          {
            "description": "A single, inbound network connection is observed in Zeek conn.log with characteristics matching a 'magic packet' signature, defined by a combination of a non-standard destination port, specific TCP flags (e.g., URG+PSH+FIN), a small payload size (e.g., < 64 bytes), and a source IP address present on a threat intelligence feed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at internet egress/ingress points, Virtual network taps in cloud environments (e.g., VPC Traffic Mirroring), Core network switch SPAN ports",
            "action": [
              "Symbolic: Create a SIEM rule to alert when an inbound Zeek conn.log event shows `id.orig_h` matching a C2 threat intelligence list AND `id.resp_p` is a non-standard port (>1024) AND `conn_state` is 'S0', 'S1', or 'OTH', indicating a connection attempt with no or minimal data transfer.",
              "Statistical: For each destination host, establish a baseline of normal inbound connection characteristics (destination port, protocol, TCP flags, `orig_pkts`, `orig_ip_bytes`). Alert if an incoming connection's features are statistical outliers, such as a destination port with a frequency in the bottom 1st percentile for that host or a packet/byte count more than 3 standard deviations below the mean for established connections.",
              "Machine Learning: Deploy a trained anomaly detection model (e.g., Isolation Forest) on inbound connection features from Zeek conn.log (port, protocol, duration, byte counts, flags). The model should be trained on benign traffic. Flag any new connection identified as a significant anomaly (scoring below a predefined threshold) as a potential trigger packet."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) is observed where the `CommandLine` field contains strings indicative of raw socket or packet capture usage (e.g., 'pcap_setfilter', 'SO_ATTACH_FILTER', 'WinPcap', 'npf.sys'), and the `NewProcessName` path is located in a user-writable directory (e.g., `C:\\Users\\`, `C:\\ProgramData\\`, `C:\\Temp\\`).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint security logs from all workstations and servers, Centralized Windows Event Log collection system, Live memory analysis on suspicious hosts",
            "action": [
              "Symbolic: Write a detection rule that triggers on Windows Event ID 4688 where `CommandLine` contains 'pcap', 'libpcap', 'winpcap', 'setsockopt', or 'SO_ATTACH_FILTER' AND the `CreatorProcessName` is not a known network utility or security tool (e.g., Wireshark.exe, tcpdump.exe, Nmap.exe).",
              "Statistical: For each unique `NewProcessName`, calculate a baseline for the Shannon entropy of its `CommandLine`. Alert when a new process creation event has a command-line entropy score that exceeds the 99th percentile for that specific executable, indicating unusually complex or obfuscated arguments.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features from process creation events (parent process name, process path, command-line length, command-line entropy). Identify and investigate small, dense clusters that are far from the main clusters of normal activity, as these represent rare and potentially malicious execution patterns."
            ]
          },
          {
            "description": "A temporal correlation is observed where a host receives a single, anomalous inbound packet, and within a short time window (e.g., < 10 seconds), a new process is created (Windows Event ID 4688) or a new outbound network connection is initiated (Zeek conn.log) by a process that was previously dormant.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM capable of correlating endpoint and network logs, Data lake with host and network telemetry, Endpoint Detection and Response (EDR) platform logs",
            "action": [
              "Symbolic: Create a stateful SIEM rule that triggers when a host receives a network connection matching a 'magic packet' signature. The rule should then monitor that host's activity for the next 15 seconds. Alert if, within this window, the host generates a Windows Event ID 4688 for a command shell (cmd.exe, powershell.exe) or initiates a new outbound connection in Zeek conn.log to an external IP.",
              "Statistical: For each host, create a time-series baseline of its process creation rate. Alert if a single inbound packet with high entropy or from a rare source IP is immediately followed by a spike in the process creation rate that exceeds 3 standard deviations from the host's normal baseline.",
              "Machine Learning: Employ a sequence analysis model (e.g., a Hidden Markov Model or LSTM) trained on sequences of events (network connection in, process create, file write, network connection out). Alert when the model encounters a low-probability sequence, such as `[rare_inbound_conn] -> [spawn_cmd.exe] -> [outbound_conn_to_new_ip]`, which deviates significantly from learned normal operational sequences."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using socket filters?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1205.002",
        "name": "Socket Filters",
        "evidence": [
          {
            "description": "Inbound network traffic is observed in Zeek logs containing characteristics inconsistent with standard protocols to evade stateless firewalls. This includes packets with an IP protocol number other than 1 (ICMP), 6 (TCP), or 17 (UDP), an unusually low Time-To-Live (TTL) value (e.g., < 32), or IP fragmentation anomalies flagged in Zeek's weird.log.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at the internet border, Sensors monitoring traffic between internal network segments, Cloud provider network logs (e.g., AWS VPC Flow Logs, Azure Network Watcher)",
            "action": [
              "Symbolic: Create a detection rule to alert on any Zeek conn.log entry where the `proto` field is not 'tcp', 'udp', or 'icmp' and the destination is an internal host. Additionally, alert on any `weird.log` event with the name 'ip_fragmentation_anomaly' or 'possible_split_routing'.",
              "Statistical: For all inbound traffic, establish a baseline distribution of TTL values. Alert on any connection where the TTL value falls below the 5th percentile of observed values for traffic from a similar network origin (e.g., same ASN), as this could indicate a crafted packet designed to expire before reaching deeper inspection points.",
              "Machine Learning: Train a one-class SVM model on features of normal inbound traffic (protocol, TTL, packet size distribution, fragmentation flags) to define a boundary of normal behavior. Classify any inbound connection that falls outside this learned boundary as anomalous and potentially evasive."
            ]
          },
          {
            "description": "A Windows Event ID 5156 (WFP has permitted a connection) is logged for a legitimate process (e.g., svchost.exe). Correlating the `FilterID` from this event with Windows Event ID 5152 (WFP has permitted a filter to be added) reveals the filter was created by a process (identified by `ProcessID` in 5152) that is unsigned, running from a temporary location, or otherwise suspicious.",
            "data_sources": [
              "Windows Event ID 5156",
              "Windows Event ID 5152",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Key servers with Windows Firewall enabled, User endpoints with local firewalls, Centralized Windows Event Log repository",
            "action": [
              "Symbolic: Join Windows Event ID 5156 with Event ID 5152 on `FilterId`. From the resulting event, use the `ProcessId` from Event 5152 to find the corresponding process creation event (Event ID 4688). Alert if the process that created the filter (`NewProcessName` in 4688) is unsigned or located in a non-standard path (e.g., C:\\Temp\\, C:\\Windows\\Tasks\\).",
              "Statistical: Establish a baseline of common parent-child relationships for processes that create WFP filters (e.g., `services.exe` -> `svchost.exe` creating a filter). Use frequency analysis to identify and alert on rare filter-creating processes or parent-child pairs that fall below a 0.1% occurrence threshold across the enterprise.",
              "Machine Learning: Model WFP filter creation events as a graph where nodes are processes and edges represent filter creation. Use a community detection algorithm (e.g., Louvain Modularity) to find clusters of normal behavior. Flag any process that creates a filter but does not belong to a well-established community as a potential anomaly."
            ]
          },
          {
            "description": "Within a 5-minute window, a host receives a low-volume, high-entropy inbound network packet from a rare external source (seen in Zeek conn.log), which is immediately followed by a critical security event on the host, such as the Security Event Log being cleared (Windows Event ID 1102) or audit policies being disabled (Windows Event ID 4719).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 1102",
              "Windows Event ID 4719"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM with correlated data from Domain Controllers, endpoints, and network sensors, Security log archives",
            "action": [
              "Symbolic: Create a correlation rule that triggers an alert if a Windows Event ID 1102 or 4719 is generated on a host within 5 minutes after that same host received a connection recorded in Zeek conn.log where `history` contains '^d' (indicating inbound packet with no response) and `orig_ip_bytes` is less than 100.",
              "Statistical: For each host, calculate a moving average of the rate of critical security events (e.g., 1102, 4719). Alert if the rate spikes more than 3 standard deviations above the average immediately following the receipt of an inbound packet from a source IP not seen in the last 30 days.",
              "Machine Learning: Use a Bayesian network to model the conditional probability of critical host events given preceding network events. Train the model on historical data. A high posterior probability P(LogCleared | RareInboundPacket) for a given sequence of observations would generate a high-confidence alert, indicating a likely causal link."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary establishing command and control via socket filters?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1205.002",
        "name": "Socket Filters",
        "evidence": [
          {
            "description": "A single inbound packet is observed in Zeek conn.log from a source IP listed on a C2 threat intelligence feed. The packet targets a non-standard, high-numbered port (>1024) and has a minimal payload size (< 64 bytes), consistent with a 'knock' or trigger for a dormant C2 channel.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at internet perimeter, Threat Intelligence Platform integrated with SIEM, DNS server logs",
            "action": [
              "Symbolic: Create a high-priority alert in the SIEM for any Zeek conn.log event where `id.orig_h` is a member of a 'Known C2 IPs' reference set AND `id.resp_p` > 1024 AND `orig_pkts` == 1 AND `orig_ip_bytes` < 100.",
              "Statistical: For all inbound, single-packet connections, calculate the frequency of the destination port. Alert on connections to ports that are in the bottom 1% of usage frequency across the enterprise, especially if the source IP has a low reputation score or belongs to a rarely seen ASN.",
              "Machine Learning: Use a supervised classification model (e.g., Gradient Boosting) trained on labeled C2 and benign traffic. Features should include source IP reputation, destination port rarity, packet count, byte count, and TCP flags. The model will output a probability score that the connection is a C2 trigger; alert on scores above 0.95."
            ]
          },
          {
            "description": "Within 60 seconds of receiving a suspected trigger packet, the destination host initiates DNS queries (observed in Zeek dns.log) for a domain that exhibits DGA characteristics, such as high Shannon entropy (e.g., > 3.5), a high number-to-letter ratio, or an excessive length (> 25 characters).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring DNS traffic (port 53), Centralized SIEM correlating DNS logs with endpoint process logs, DNS resolver logs",
            "action": [
              "Symbolic: Create a rule to correlate a suspected trigger packet from Zeek conn.log with subsequent Zeek dns.log events from the same internal host (`id.orig_h`). Alert if, within 60 seconds, a DNS query is made for a domain matching a known DGA pattern (regex) or a domain on a threat intelligence blocklist.",
              "Statistical: For each DNS query, calculate the Shannon entropy of the queried domain name. Establish a baseline entropy for legitimate domains accessed by the organization. Alert on any DNS query where the entropy exceeds the 99th percentile of the baseline, especially if it follows a potential trigger packet.",
              "Machine Learning: Train a recurrent neural network (RNN) or LSTM on the character sequences of legitimate domain names. Use the trained model to score new domain queries. Domains that the model finds highly improbable (i.e., high perplexity score) are likely DGAs and should be flagged for investigation."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a command shell (cmd.exe, powershell.exe, sh, bash) is observed with command-line syntax indicative of a reverse shell (e.g., 'powershell -enc', 'bash -i >& /dev/tcp/'). This event occurs within 10 seconds of an inbound connection (Zeek conn.log) to the same host on a high-numbered port that does not correspond to a known listening service.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint EDR/sysmon logs from all hosts, Network sensors at key choke points, Centralized SIEM for correlation",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a Zeek conn.log event shows an inbound connection to a host on a non-standard port. Within 10 seconds, if a Windows Event ID 4688 occurs on that same host for `powershell.exe` with a command line containing '-nop -w hidden -enc', generate a critical alert.",
              "Statistical: Maintain a baseline of parent-child process relationships across the environment. Alert when a rare parent-child relationship occurs (e.g., an application server process spawning `cmd.exe`), especially if the child process has a command line length or entropy score in the 99th percentile. The alert priority is elevated if this occurs immediately after an anomalous inbound network connection.",
              "Machine Learning: Model process execution chains as graphs. Use a graph-based anomaly detection algorithm to identify new or rare subgraphs (e.g., a web server process spawning PowerShell which then makes a network connection). If such an anomalous subgraph is created immediately following a suspected C2 trigger packet, it is a strong indicator of a successful backdoor activation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]