[
  {
    "information_requirement": "Has an adversary achieved execution via user interaction with a malicious link? (PIR)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1204.001",
        "name": "Malicious Link",
        "evidence": [
          {
            "description": "An endpoint makes a DNS request or initiates a network connection to a domain or IP address present on a threat intelligence feed, or a URL exhibits structural properties indicative of maliciousness.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Web Gateway, DNS Resolvers, Firewall Egress Points",
            "action": [
              "Symbolic: Continuously correlate all requested domains (from Zeek dns.log) and destination IPs (from Zeek conn.log) against a high-confidence, machine-readable threat intelligence feed of known malicious indicators. Generate an alert upon a match.",
              "Statistical: For each requested URL in Zeek http.log, calculate the string entropy of the hostname and path, and measure its total length. Establish a baseline distribution for these metrics and alert on outliers that fall above the 95th percentile, as these may indicate use of DGAs or obfuscation.",
              "Machine Learning: Train a URL classification model (e.g., logistic regression or a deep neural network) using lexical features (length, character n-grams, keyword presence, number of special characters) to predict if a URL is malicious. Apply the model in real-time to traffic and flag URLs with a high probability score."
            ]
          },
          {
            "description": "A browser, email client, or document reader process spawns a command-line interpreter or living-off-the-land binary (LOLBin).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Remote Desktop Servers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Symbolic: Monitor for high-risk parent-child process relationships using Windows Event ID 4688. Alert when a parent process like 'outlook.exe', 'chrome.exe', or 'acrord32.exe' spawns a child process such as 'powershell.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe', or 'certutil.exe'.",
              "Statistical: Baseline all parent-child process relationships observed in the environment. Use frequency analysis to identify statistically rare pairs (e.g., those occurring less than 0.01% of the time). Additionally, calculate the entropy and length of command-line arguments for spawned interpreters and alert on values exceeding two standard deviations from the established norm for that process.",
              "Machine Learning: Use a classification model (e.g., random forest) trained on process creation event features (parent process name, child process name, command-line arguments, user context) to assign a risk score to each event. Chains with high cumulative scores are flagged as suspicious execution."
            ]
          },
          {
            "description": "A file is written to disk by a browser or email client and is subsequently executed by the user or an automated process within a short time interval.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Enterprise Web Gateway",
            "action": [
              "Symbolic: Correlate file creation events from network traffic (Zeek files.log) with process creation events on the destination host (Windows Event ID 4688). Generate an alert if the SHA256 hash of the downloaded file matches a known malicious hash from a threat intelligence feed and the file is executed.",
              "Statistical: For all instances where a downloaded file (identified via Zeek files.log) is executed (Windows Event ID 4688), calculate the time delta between the download and execution. Create a distribution of these deltas and alert on any events falling in the 1st percentile (e.g., under 30 seconds), indicating an immediate execution.",
              "Machine Learning: Apply a time-series anomaly detection model to the rate of 'download-then-execute' events per user and per host. A sudden, anomalous spike in this event rate for a single user or across the enterprise can indicate a targeted or widespread phishing campaign in progress."
            ]
          },
          {
            "description": "A process spawned by a browser or email client executes from a non-standard or user-writable directory, such as a temporary internet folder, AppData, or Downloads folder.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers",
            "action": [
              "Symbolic: Create and enforce a deny-list of execution paths for processes spawned by browsers and email clients. Alert whenever a child process of 'chrome.exe', 'msedge.exe', 'outlook.exe', etc., is observed executing from forbidden paths like '%APPDATA%', '%TEMP%', or '%USERPROFILE%\\Downloads\\'.",
              "Statistical: For each common parent process, build a baseline of all child process execution paths seen in the environment. Use frequency analysis to flag any execution from a path that has never been seen before or is in the bottom 1% of historical occurrences for that parent-child pair.",
              "Machine Learning: Employ a clustering algorithm (e.g., DBSCAN) on process execution events, using features such as the parent process name and the child process execution path directory. This will group normal behaviors into clusters; events that are classified as noise or outliers by the algorithm represent anomalous executions from unusual locations."
            ]
          },
          {
            "description": "A new process, spawned immediately following user web activity, initiates outbound network connections to an unknown or suspicious destination.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Firewall Egress Points, DNS Resolvers",
            "action": [
              "Symbolic: Correlate the process ID from a new process event (Windows Event ID 4688) with network connection events (Windows Event ID 5156 or Zeek conn.log). Check the destination IP and/or domain name (from Zeek dns.log) against a threat intelligence feed of known command-and-control (C2) servers. Alert on any match.",
              "Statistical: For new processes, analyze the characteristics of their first outbound network connection. Flag connections where the destination IP is from a country not typically associated with the user or organization. Analyze connection patterns over time for signs of beaconing by calculating the standard deviation of time intervals between connections; a low standard deviation indicates periodic, automated C2 traffic.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., LSTM Autoencoder) on network flow data (bytes out, packet count, connection frequency) originating from a newly created process. The model, trained on benign traffic, will flag anomalous patterns such as periodic, low-volume 'heartbeats' indicative of C2 communication."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]