[
  {
    "information_requirement": "Has the adversary gained initial access via unauthorized hardware additions? (TA0001 - Initial Access) (PIR)",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1200",
        "name": "Hardware Additions",
        "evidence": [
          {
            "description": "Immediately following a new hardware connection event, a new driver is installed (Windows Event ID 6416) or a service is created (Windows Event ID 7045) where the associated binary's file hash matches a known malicious signature or its signing certificate is on a deny list.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 6416",
              "Sysmon Event ID 6"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All corporate endpoint devices (laptops, desktops, servers), particularly those in sensitive areas like data centers or executive suites.",
            "action": [
              "Create a SIEM rule that correlates a new device installation (Windows Event ID 6416) or new service creation (Windows Event ID 7045) with file creation/modification events. Extract the driver or service executable's file hash and signer certificate. Alert if the hash matches a threat intelligence feed of known-bad hashes or if the certificate subject is on a curated deny list of untrusted or revoked Certificate Authorities.",
              "For all new driver files associated with hardware installations (Sysmon Event ID 6), calculate the file's entropy. Establish a baseline entropy distribution for all legitimate, signed drivers in the environment by calculating the mean and standard deviation. Flag any new driver file whose entropy value exceeds 3 standard deviations from the mean, as this may indicate a packed or encrypted malicious payload.",
              "Train a random forest classifier on features extracted from driver files, including file size, entropy, number and type of imported functions (e.g., networking, crypto APIs), presence and validity of a digital signature, and the reputation of the signer. Use the model to classify newly installed drivers as 'benign' or 'suspicious'. A 'suspicious' classification for a driver associated with a new hardware event triggers an alert for analyst review."
            ]
          },
          {
            "description": "Within 5 minutes of a new hardware device connection event, the host initiates network traffic to a destination IP/domain on a threat intelligence feed, or the TLS handshake uses a JA3/JA3S hash with a low prevalence score across the enterprise.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Windows Event ID 6416"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, and endpoint devices.",
            "action": [
              "Correlate a new device installation event (Windows Event ID 6416) on a host with subsequent network logs (Zeek conn.log, dns.log, ssl.log) originating from that host's IP address within a 5-minute window. Generate an alert if the destination IP (`id.resp_h`), requested domain (`query`), or TLS server name (`server_name`) matches a known-malicious indicator from an active threat intelligence feed.",
              "Following a device installation event, calculate the enterprise-wide prevalence (rarity) of the destination IP, requested domain, and JA3 hash observed from the host within a 5-minute window. A combination of rare values (e.g., destination IP seen for the first time, domain requested by < 0.1% of hosts, JA3 hash in the bottom 1% of prevalence) generates a high risk score and triggers an alert.",
              "Apply a time-series anomaly detection model (e.g., Seasonal-ARIMA) to the host's outbound network traffic volume (sum of `orig_bytes` from conn.log) aggregated in 1-minute intervals. An anomalous spike in traffic volume immediately following a hardware installation event (Windows Event ID 6416) triggers an alert for further inspection of the traffic content and destination."
            ]
          },
          {
            "description": "A new DHCP request is observed where the client MAC address vendor prefix (OUI) or the client hostname matches a known pattern for offensive security hardware (e.g., Hak5, Flipper, Pwnie Express).",
            "data_sources": [
              "Zeek dhcp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches, DHCP servers, and wireless network segments.",
            "action": [
              "Continuously monitor Zeek dhcp.log for new `mac` and `host_name` fields. Alert if the OUI (first 3 bytes of the `mac` address) or the `host_name` string matches a curated list of penetration testing hardware vendors and default names (e.g., Hak5, Ducky, Flipper Devices, LAN Turtle).",
              "Profile the distribution of OUIs and hostname syntax (e.g., length, character sets, presence of hyphens) across all DHCP requests. For each new DHCP request, calculate a rarity score based on its OUI and hostname structure. A request with a new OUI and a hostname syntax that deviates significantly from established patterns receives a high anomaly score.",
              "Train an isolation forest model on legitimate DHCP request features, including OUI, hostname length, and character distribution within the hostname. Use the model to identify outlier DHCP requests that do not conform to the learned 'normal' profile, indicating a potential unauthorized or malicious device."
            ]
          },
          {
            "description": "Within 10 seconds of a new Human Interface Device (HID) connection, a process is created (Windows Event ID 4688 / Sysmon Event ID 1) with command-line syntax characteristic of a keystroke injection payload, such as heavily obfuscated or encoded commands.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 6416",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All corporate endpoint devices, especially workstations in common areas or those used by privileged users.",
            "action": [
              "Correlate a new HID connection (identified via Windows PnP logs or Event ID 6416 with a relevant device class GUID) with a subsequent process creation (Windows Event ID 4688 / Sysmon Event ID 1) for powershell.exe, cmd.exe, cscript.exe, or wscript.exe within a 10-second window. Alert if the process command line contains high-risk substrings like `-enc`, `-w hidden`, `IEX`, `DownloadString`, or `FromBase64String`.",
              "For any command line spawned within 10 seconds of a new HID connection, calculate the entropy of the command-line string. Establish a baseline entropy distribution for normal interactive and scripted command-line usage. An entropy score in the 99th percentile (e.g., > 4.5 for PowerShell) suggests obfuscation like Base64 encoding and should be flagged for review.",
              "Utilize a pre-trained NLP model (e.g., a transformer-based classifier) fine-tuned on a labeled dataset of malicious and benign command-line strings. Classify the command line of any process spawned immediately after a HID connection. Generate an alert if the model classifies the command line as malicious with high confidence (> 0.9)."
            ]
          },
          {
            "description": "A new MAC address is observed in DHCP or network traffic logs that is not present in the authoritative asset management system (CMDB) or Network Access Control (NAC) allow-list.",
            "data_sources": [
              "Zeek dhcp.log",
              "Zeek conn.log",
              "Asset Management System Data (CSV/DB)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network infrastructure (DHCP servers, core switches), Asset Management Database, Network Access Control (NAC) systems.",
            "action": [
              "On a scheduled basis (e.g., every 15 minutes), extract the set of unique MAC addresses observed in Zeek dhcp.log and conn.log. Join this set against the list of approved MAC addresses from the asset management database. Alert on any MAC address present in the network logs but absent from the asset database.",
              "Track the hourly count of newly observed, unregistered MAC addresses. Establish a baseline and standard deviation for this metric using a 7-day moving average. Trigger an alert if the hourly count exceeds 3 standard deviations above the mean, which could indicate a mass device introduction or an adversary connecting multiple devices.",
              "Employ a time-series forecasting model (e.g., Prophet or LSTM) to predict the expected number of new, unregistered devices per day, accounting for historical trends and organizational seasonality (e.g., new hire onboarding cycles). Generate an alert when the actual count significantly exceeds the model's predicted upper confidence interval."
            ]
          },
          {
            "description": "Within 60 seconds of a new hardware device connection, a process is created with an anomalous parent-child relationship (e.g., `services.exe` spawning `cmd.exe`), or a legitimate system process initiates an uncharacteristic network connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Windows Event ID 6416",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All corporate endpoint devices, Security Information and Event Management (SIEM) system.",
            "action": [
              "Create a correlation rule that triggers when a new device connection (Windows Event ID 6416) is followed within 60 seconds by a process creation (Sysmon Event ID 1) where the ParentImage is not a standard interactive shell or system process (e.g., `services.exe` spawning `cmd.exe`).",
              "For each process on an endpoint, build a statistical profile of its typical parent process and network connection destinations. After a new hardware event, score any subsequent process activity (Sysmon Event ID 1, 3) for anomalous behavior. A high score is assigned if a process like `rundll32.exe` is launched by an unusual parent or makes a network connection for the first time to a non-corporate IP address.",
              "Use a graph-based anomaly detection model where nodes represent processes, files, and network connections. Train the model on graphs of normal system behavior. After a new hardware event, analyze the subgraph of subsequent activity. The model can identify anomalous sequences (e.g., a new device leading to a process that modifies a registry run key) that deviate from learned benign patterns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]