[
  {
    "information_requirement": "Is an adversary abusing the Microsoft Management Console (mmc.exe) for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.014",
        "name": "MMC",
        "evidence": [
          {
            "description": "Execution of mmc.exe with a console file (.msc) whose hash or name matches a known malicious indicator from threat intelligence.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: From process creation events (Windows Event ID 4688 where ProcessName ends in 'mmc.exe'), extract the full command line. Parse the command line to identify any .msc file paths. Compare the hash of the identified .msc file against a threat intelligence feed of known malicious file hashes. Alert on any match.",
              "Statistical: Maintain a list of all .msc files executed across the enterprise over a 30-day rolling window. Calculate the execution frequency for each unique .msc file path. Flag any .msc file execution that falls below the 5th percentile of frequency, as this represents a rare and potentially suspicious file.",
              "Machine Learning: Develop a classification model (e.g., Random Forest) trained on features extracted from .msc file paths (e.g., path depth, directory name entropy, presence of temp or user-writable paths, file name length). Use the model to score each new .msc execution as benign or suspicious. Escalate high-confidence suspicious predictions for analyst review."
            ]
          },
          {
            "description": "Execution of mmc.exe with command-line arguments indicative of abuse, such as '-Embedding', '/a', or those targeting system recovery snap-ins like 'wbadmin.msc delete catalog'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, Domain Controllers, Backup Servers",
            "action": [
              "Symbolic: Create a detection rule that inspects the command line of mmc.exe process creation events (Windows Event ID 4688) for the presence of the string '-Embedding' or regex patterns like `/(wbadmin\\.msc).*(delete\\s+catalog)/i`. Alert on any match.",
              "Statistical: For each host, establish a baseline of mmc.exe command-line arguments used over a 90-day period. Calculate the Shannon entropy of the arguments for each new execution. An execution with an entropy score greater than 2 standard deviations above the host's mean entropy for mmc.exe indicates an unusually complex or obfuscated command and should be flagged.",
              "Machine Learning: Use an unsupervised learning model, such as a one-class SVM or Isolation Forest, trained on a dataset of legitimate mmc.exe command lines. The model will learn the boundary of normal behavior. Apply the model to new command-line executions to detect anomalous patterns that deviate significantly from the learned norm."
            ]
          },
          {
            "description": "The mmc.exe process is created by a parent process not typically associated with administrative activity, such as a web browser, Microsoft Office application, or script interpreter.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers",
            "action": [
              "Symbolic: Monitor mmc.exe process creation events (Windows Event ID 4688) and check the parent process name. Alert if the parent process is in a deny-list of unusual parents, such as 'winword.exe', 'excel.exe', 'powerpnt.exe', 'outlook.exe', 'msedge.exe', 'chrome.exe', 'firefox.exe'.",
              "Statistical: Generate a frequency table of all parent-child process relationships involving mmc.exe across the environment over a 30-day period. Identify any parent-child pair that occurs less than a threshold number of times (e.g., < 5 occurrences) or represents a statistically rare combination (e.g., bottom 1% of all pairs). These rare pairs are highly suspicious.",
              "Machine Learning: Model the sequence of process creations on each host as a time series. Train a recurrent neural network (RNN) or LSTM model to predict the next process in a sequence. If the model does not predict 'mmc.exe' with high probability following a given parent process (e.g., 'wscript.exe'), flag the event as a temporal anomaly indicative of a malicious process chain."
            ]
          },
          {
            "description": "Execution of mmc.exe with a console file (.msc) located in a non-standard or user-writable directory, such as a user's profile, temporary folder, or network share.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, File Servers, Network Shares",
            "action": [
              "Symbolic: From mmc.exe process creation events (Windows Event ID 4688), extract the path of the .msc file from the command line. Use a regex rule to check if the path is not within the 'C:\\\\Windows\\\\System32\\\\' directory. Alert on any .msc file executed from locations like '%APPDATA%', '%LOCALAPPDATA%', '%TEMP%', '%PUBLIC%', or any network share path (e.g., `\\\\\\\\.*`).",
              "Statistical: For each user, calculate a baseline of directories from which they execute .msc files. Use a percentile-based approach: if a user executes an .msc file from a directory that is in the 99th percentile of rarity for that user's activity, flag it as anomalous. This helps distinguish legitimate admin scripts from adversary drop locations.",
              "Machine Learning: Train a decision tree classifier on file path features (e.g., is_system32, is_user_profile, is_temp, is_network_share, directory_depth). The model will learn to classify paths as 'standard' or 'non-standard'. Apply this model to new .msc file paths to automatically flag executions from suspicious locations."
            ]
          },
          {
            "description": "The mmc.exe process initiates one or more network connections, particularly to external IP addresses, which is atypical behavior for this process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Join process creation events (Windows Event ID 4688 where ProcessName ends in 'mmc.exe') with network connection logs (Zeek conn.log) on Host IP and timestamp. Create a rule to alert on any successful connection (`conn_state` is not 'S0', 'REJ', or 'RSTOS0') from a host where mmc.exe was recently launched, where the destination IP is external (not in RFC1918 space) and not on an allow-list of known Microsoft update/management IPs.",
              "Statistical: Aggregate all destination IPs and ports contacted by the mmc.exe process across the enterprise. Since legitimate network activity from mmc.exe is rare to non-existent, any destination IP that is not on a pre-approved allow-list and appears as a low-frequency outlier (e.g., contacted by only one host) should be considered highly suspicious and flagged for investigation.",
              "Machine Learning: Apply a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the volume of network traffic (bytes_out) originating from the mmc.exe process on a per-host basis. The expected baseline is zero or near-zero traffic. Any significant deviation or spike in this time series constitutes an anomaly and should trigger an alert, potentially indicating C2 communication or data exfiltration."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]