[
    {
        "information_requirement": "Is the adversary attempting to evade defenses using trusted tools?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1216.002",
                "name": "SyncAppvPublishingServer",
                "evidence": [
                    {
                        "description": "Network connection initiated by a process spawned from SyncAppvPublishingServer.vbs to a known malicious IP address or domain.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "First, identify executions of SyncAppvPublishingServer.vbs via wscript.exe or cscript.exe (Windows Event ID 4688). Trace the process lineage to any child processes (e.g., powershell.exe). Correlate the child process activity with network connection logs (Zeek conn.log) by timestamp and host. Inner join the destination IPs/domains from these connections with a high-confidence threat intelligence feed of known command and control (C2) servers or malicious endpoints (updated daily). Alert on any matches."
                    },
                    {
                        "description": "Execution of SyncAppvPublishingServer.vbs with command-line arguments matching the known abuse pattern for PowerShell proxying.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for process creation events (Windows Event ID 4688) where wscript.exe or cscript.exe executes SyncAppvPublishingServer.vbs. Use a regular expression to search the command line for the specific abuse pattern, such as 'SyncAppvPublishingServer.vbs \"n;' followed by PowerShell commands (e.g., 'Invoke-Expression', 'IEX', 'New-Object System.Net.WebClient'). This is a high-fidelity signature for malicious use of this script."
                    },
                    {
                        "description": "Anomalous process lineage where the SyncAppvPublishingServer.vbs script host (wscript.exe/cscript.exe) spawns unexpected or suspicious child processes like cmd.exe or powershell.exe.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor for process creation events (Windows Event ID 4688). Establish a baseline of normal child processes for wscript.exe and cscript.exe across the environment. Create a specific alert for any instance where a script host executing SyncAppvPublishingServer.vbs spawns powershell.exe or cmd.exe. Use frequency analysis and parent-child process relationship graphing to identify rare or anomalous process chains originating from script hosts."
                    },
                    {
                        "description": "Execution of the SyncAppvPublishingServer.vbs script from a non-standard file path, indicating it may have been copied or dropped for malicious use.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for executions of SyncAppvPublishingServer.vbs. The legitimate script resides in 'C:\\Windows\\System32\\'. Flag any execution where the script path is not 'System32', such as 'C:\\Users\\Public\\', 'C:\\Temp\\', or a user's 'AppData' folder. Use descriptive statistics on script paths to identify low-frequency, anomalous locations and establish a baseline of expected execution paths."
                    },
                    {
                        "description": "Unusual network activity, such as connections to external IP addresses or high-entropy domain names, originating from a process tree initiated by SyncAppvPublishingServer.vbs.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process execution of SyncAppvPublishingServer.vbs (Windows Event ID 4688) with subsequent network connections (Zeek conn.log) from the same host. Establish a baseline for normal network activity from wscript.exe. Flag any external connections as potentially suspicious for manual review. Further score suspicion by analyzing the destination: calculate the entropy of DNS queries (from Zeek dns.log) associated with the connection to detect Domain Generation Algorithms (DGAs), and check the age and reputation of the destination domain. A time series analysis of data transferred can also identify anomalous exfiltration patterns."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
