[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using system script proxies? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1216",
        "name": "System Script Proxy Execution",
        "evidence": [
          {
            "description": "A script proxy process (e.g., cscript.exe, pubprn.vbs) is created with a command line containing an atomic indicator (URL, IP, domain, hash) present in a high-confidence threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Application Servers, Jump Servers, Domain Controllers.",
            "action": [
              "Symbolic: For each process creation event (Windows Event ID 4688), parse the 'CommandLine' field to extract potential indicators (URLs, domains, IPs, file hashes). Join these extracted indicators against a real-time, high-confidence threat intelligence feed. Generate an alert for any match associated with a known script proxy parent process (e.g., cscript.exe, wscript.exe, forfiles.exe, pubprn.vbs, mshta.exe).",
              "Statistical: For command lines of script proxies that do not contain a known high-confidence IOC, calculate the enterprise-wide frequency of the domain or IP seen over the last 30-90 days. Flag any script proxy execution involving a domain or IP that falls below the 5th percentile of frequency, as this rarity is a strong signal of potential malicious activity.",
              "Machine Learning: Train a supervised classification model (e.g., Logistic Regression) to predict if a script proxy execution is malicious. Use features such as the presence of an IOC, the type of IOC (hash, domain, IP), the reputation score of the IOC from a threat feed, the script name, and user context. Alert on executions classified as malicious with a probability score above a defined threshold (e.g., > 0.85)."
            ]
          },
          {
            "description": "A script proxy process is created with a command-line structure matching a known malicious regular expression pattern, indicating the use of specific adversary toolsets or techniques.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Application Servers, and systems enforcing Application Control (e.g., AppLocker).",
            "action": [
              "Symbolic: Apply a library of curated regular expressions (regex) against the 'CommandLine' field of Windows Event ID 4688 events. These patterns should target known malicious command structures for T1216, such as 'pubprn.vbs' executing remote scripts via '...script:http://...' syntax. Generate a high-severity alert on any match.",
              "Statistical: For each script proxy command line, calculate the Shannon entropy of the argument string. Establish a dynamic baseline of normal entropy values for legitimate script executions across the environment. Flag command lines with entropy scores exceeding the 95th percentile, as high entropy often indicates obfuscated, encoded, or randomized commands used for evasion.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on a labeled dataset of command lines (malicious vs. benign). Use features derived from the command line, such as length, special character count, presence of URLs/IPs, argument count, and entropy score. Use the trained model to score new script proxy command lines in real-time and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A script proxy process (e.g., wscript.exe) creates a child process that deviates from an established baseline of normal behavior, such as spawning cmd.exe, powershell.exe, or an unsigned binary.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Jump Servers, and Development/Test Environment Servers where scripting is common.",
            "action": [
              "Symbolic: Create and maintain an explicit allow-list of common, legitimate child processes for known script proxies (e.g., cscript.exe, wscript.exe). Monitor Windows Event ID 4688 logs for any parent-child relationship where a script proxy spawns a process not on this list, particularly high-risk children like 'powershell.exe', 'cmd.exe', 'rundll32.exe', or processes running from temporary user directories. Alert on any deviation.",
              "Statistical: For each host, build a statistical baseline of parent-child process relationships involving script proxies. Calculate the historical frequency of each unique parent-child pair (e.g., 'wscript.exe' -> 'some_app.exe'). Alert when a script proxy spawns a child process that is rare for that specific host or for its peer group (e.g., other servers in the same application cluster), defined as a frequency below the 1st percentile.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) to group hosts based on their typical process relationship behaviors. Use features such as the set of child processes spawned by script interpreters, their file paths, and their signature status. Generate an alert when a host's behavior shifts, causing it to be labeled as an outlier or move to a new, smaller cluster, indicating a significant deviation from its established norm."
            ]
          },
          {
            "description": "A script proxy process, or its immediate child, initiates an outbound network connection to a destination IP address that is statistically rare for the enterprise or has a low reputation score.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies), DNS Resolvers, User Endpoints, and Internet-facing Servers.",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) with network connection logs (Zeek conn.log) using Process GUID and timestamp. Enrich with DNS query data (Zeek dns.log) to link connections to requested domains. Alert if the script proxy process or its immediate child connects to a destination IP or domain present on a C2 blocklist.",
              "Statistical: For every network connection initiated by a script proxy process, analyze the destination IP and domain in Zeek logs. Maintain a baseline of all destination FQDNs/IPs connected to by the enterprise. Calculate the enterprise-wide access frequency for the destination. Flag connections to destinations that fall in the lowest percentile (e.g., bottom 1%) of frequency, as these represent exceptionally rare communications.",
              "Machine Learning: Apply a time series anomaly detection model (e.g., Seasonal-Hybrid ESD) to the volume and diversity of outbound connections originating from script proxy processes. The model should learn the normal daily/weekly patterns of such traffic (e.g., bytes sent, connection duration, unique destinations). An alert is triggered when a statistically significant spike in the number of connections or the number of unique destination IPs is detected."
            ]
          },
          {
            "description": "A script proxy process executes a script from a file path considered unusual or high-risk, such as a temporary directory, user downloads folder, or a world-writable location (e.g., C:\\ProgramData).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Multi-user Servers (e.g., Citrix, RDS), and Network File Shares.",
            "action": [
              "Symbolic: From the command line in Windows Event ID 4688 events, extract the file path of the script being executed by the proxy. Apply a ruleset that flags any execution from high-risk directories, including but not limited to '%TEMP%', '%TMP%', '%APPDATA%', 'C:\\Users\\Public\\', user download folders, or any world-writable directory. Generate a high-severity alert for any match.",
              "Statistical: For each script execution path, calculate its Shannon entropy and its parent directory's enterprise-wide usage frequency. Establish baselines for these metrics. Flag executions where the path entropy exceeds the 95th percentile (indicating randomization) or the parent directory's usage frequency is below the 5th percentile (indicating rarity), as the combination is highly suspicious.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) model on features of legitimate script execution paths. Features should include path depth, directory name token counts, file extension, and whether the path contains environment variables. This model learns the boundary of 'normal' behavior. Use this model to classify new script executions in real-time. Any execution that falls outside the learned boundary is flagged as an anomaly."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]