[
  {
    "information_requirement": "Is the adversary collecting sensitive information from Confluence repositories?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1213.001",
        "name": "Data from Information Repositories: Confluence",
        "evidence": [
          {
            "description": "A successful login to Confluence originates from a source IP address on a threat intelligence feed or is performed by a user account known or suspected to be compromised.",
            "data_sources": [
              "Zeek conn.log",
              "Confluence Access Logs",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Confluence Server, Threat Intelligence Platform, Identity and Access Management System, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Correlate the source IP address from Zeek conn.log and Confluence access logs against a high-confidence threat intelligence feed of known malicious IPs. Separately, cross-reference the username from Confluence logs against an internal list of accounts flagged as compromised. Alert on any match.",
              "Statistical: Analyze the reputation of source Autonomous Systems (ASNs) accessing Confluence. Calculate the frequency of access from each ASN. Flag access from ASNs that are statistically rare for the organization (e.g., bottom 5th percentile of frequency) or have a low reputation score from a commercial feed.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) on labeled historical access data (malicious vs. benign) using features like IP reputation, ASN, time of day, and user role. Use the model to score new access events in real-time and alert on those classified as high-probability malicious."
            ]
          },
          {
            "description": "A user account executes an anomalously high number of search queries, especially for keywords indicative of sensitive information such as 'password', 'secret', 'key', 'config', or 'api_key'.",
            "data_sources": [
              "Confluence Access Logs",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Confluence Server Application Logs, Network Traffic Inspection Point",
            "action": [
              "Symbolic: Scan the URI field in Zeek http.log and the search query field in Confluence access logs for a watchlist of sensitive keywords (e.g., 'password', 'secret', 'api_key', 'network diagram'). Generate a high-severity alert for any match.",
              "Statistical: For each user, establish a baseline of their hourly search count over a 30-day rolling window. Calculate the mean and standard deviation. Generate an alert when a user's hourly search count exceeds 3 standard deviations above their personal mean or the 99th percentile of all users.",
              "Machine Learning: Apply Natural Language Processing (NLP) topic modeling (e.g., Latent Dirichlet Allocation) to the corpus of all user search queries to identify 'normal' search topics. Flag users whose search queries in a session deviate significantly from established topic clusters or have high Shannon entropy, indicating unfocused, exploratory searching."
            ]
          },
          {
            "description": "Access to Confluence is performed using an automated script or non-standard tool, identified by an anomalous User-Agent string or programmatic API interaction patterns with low time variance between requests.",
            "data_sources": [
              "Zeek http.log",
              "Confluence Access Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Confluence Server Web Logs, Network Egress Points",
            "action": [
              "Symbolic: Create a deny-list of User-Agent strings associated with common scripting libraries and command-line tools (e.g., 'curl', 'Wget', 'python-requests', 'Go-http-client'). Monitor Zeek http.log for any traffic to the Confluence server matching this list and generate a high-severity alert.",
              "Statistical: Profile all User-Agent strings accessing Confluence over 30 days. Calculate the frequency of each. Alert on any User-Agent that falls below a rarity threshold (e.g., seen in less than 0.1% of requests). Additionally, calculate the standard deviation of inter-request timing for each session; sessions with an abnormally low variance indicate scripting and should be flagged.",
              "Machine Learning: Train a classifier on User-Agent strings to distinguish between browsers and scripts. For API access, use a time-series anomaly detection model (e.g., LSTM) on the sequence of API endpoints called by a user to detect deviations from normal user workflow patterns."
            ]
          },
          {
            "description": "A single user account accesses a number of unique Confluence pages or downloads a volume of data that significantly exceeds their established individual or peer group baseline.",
            "data_sources": [
              "Confluence Access Logs",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Confluence Server, Network Flow Data Collectors, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Implement a threshold rule that triggers an alert if any user accesses more than 500 unique pages or downloads more than 1 GB of data from Confluence within a 1-hour window.",
              "Statistical: For each user, calculate a 30-day rolling baseline (mean and standard deviation) for unique pages visited per hour and total bytes downloaded per hour. Alert if a user's activity in any given hour exceeds 3 standard deviations from their personal baseline for either metric.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) to group users based on their access patterns (e.g., avg. pages/day, avg. data/day). Monitor for users who suddenly shift from a 'low-access' cluster to a 'high-access' cluster, which could indicate account compromise or insider threat activity."
            ]
          },
          {
            "description": "Access to Confluence is performed by a highly privileged account (e.g., Domain Administrator) that is not expected to use the platform, or by an account with no established history of accessing the platform.",
            "data_sources": [
              "Confluence Access Logs",
              "Windows Event ID 4624",
              "Active Directory security logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Confluence Server, Domain Controllers, Identity and Access Management System",
            "action": [
              "Symbolic: Maintain a static list of highly privileged user groups (e.g., 'Domain Admins') and service accounts. Create a high-priority alert every time an account from this list is observed authenticating to Confluence. This activity is a direct violation of principle of least privilege.",
              "Statistical: Track the first-ever access date to Confluence for every user. If a user accesses Confluence for the first time after their account has been active for over a year, or if an account is dormant for over 180 days and then accesses Confluence, flag the session for review as a statistically infrequent event.",
              "Machine Learning: Develop a 'First Time Access' model that predicts the likelihood of a user legitimately accessing a new resource like Confluence based on their department, role, and peer group activity. Alert when a user's first-time access is predicted by the model to be a low-probability event."
            ]
          },
          {
            "description": "A user account accesses a high number of Confluence pages or spaces that are historically infrequently visited by the general user population, indicating indiscriminate browsing.",
            "data_sources": [
              "Confluence Access Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Confluence Server Application Logs, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Manually tag specific Confluence spaces as 'Sensitive' or 'Critical' (e.g., 'Network Architecture', 'PCI Compliance'). Generate a high-priority alert whenever a user who is not a member of the designated access group for that space accesses it.",
              "Statistical: Calculate the popularity of every page in Confluence based on unique user visits over the last 90 days. Define pages in the bottom 10th percentile of accesses as 'cold' pages. Alert if a single user accesses more than 20 'cold' pages within a 24-hour period.",
              "Machine Learning: Use graph analytics to model relationships between users and the Confluence pages they access, identifying communities of practice. Flag a user as anomalous if their access pattern shows them traversing pages across multiple, distinct communities they are not a part of, suggesting non-work-related exploration."
            ]
          },
          {
            "description": "A user account performs suspicious Confluence collection activity, and shortly thereafter, the same account is used to log on to other internal systems where it has not previously been active.",
            "data_sources": [
              "Confluence Access Logs",
              "Windows Event ID 4624",
              "Windows Event ID 4648",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Confluence Server, Domain Controllers, Critical Servers, Workstations",
            "action": [
              "Symbolic: Create a correlation rule: IF a user triggers a 'Privileged Account Access to Confluence' alert AND that same user account is seen in a successful network logon (Windows Event ID 4624, Logon Type 3) to a new host within 60 minutes, THEN generate a 'Potential Credential Compromise and Lateral Movement' critical alert.",
              "Statistical: For each user, maintain a statistical profile of the hosts they typically log into. After a user performs a high-volume Confluence download (e.g., >95th percentile), monitor their subsequent logons. If they log into a host that is statistically rare for them (e.g., a host they have never logged into before), flag the event chain.",
              "Machine Learning: Employ a sequence analysis model to learn common chains of activity (e.g., 'accesses Confluence -> accesses JIRA'). Use this model to score observed event sequences. A sequence like 'High-volume Confluence download -> Successful RDP logon to database server' would be identified as a rare and high-risk sequence, triggering an alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]