[
  {
    "information_requirement": "Is an adversary abusing the ODBC configuration utility (odbcconf.exe) to proxy the execution of malicious code, thereby evading application controls or other defenses?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.008",
        "name": "Odbcconf",
        "evidence": [
          {
            "description": "An odbcconf.exe process loads a DLL module whose file hash (e.g., SHA256) is present on a threat intelligence feed of known malicious indicators.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Domain Controllers",
            "action": [
              "Symbolic: For each module load event (Sysmon Event ID 7) where the loading process Image is 'odbcconf.exe', compare the loaded module's HashSHA256 against a threat intelligence list of malicious file hashes. Generate a high-severity alert on a match.",
              "Statistical: For each unique DLL hash loaded by 'odbcconf.exe' across the enterprise, calculate its prevalence (count of unique hosts) over the last 90 days. Flag any DLL that falls below a rarity threshold (e.g., seen on fewer than 5 hosts or <0.1% of endpoints) for investigation, as adversary tools are often rare compared to legitimate system libraries.",
              "Machine Learning: Develop and apply a binary classification model (e.g., Gradient Boosting, Random Forest) trained on static and dynamic features of DLLs (e.g., file size, entropy, PE header info, imported/exported functions, string analysis). Use the model to score the probability that a DLL loaded by 'odbcconf.exe' is malicious."
            ]
          },
          {
            "description": "Execution of odbcconf.exe is observed with command-line arguments containing the '/A {REGSVR ...}' pattern used to register and execute a malicious DLL.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule that searches process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for ProcessName 'odbcconf.exe' and a CommandLine containing the case-insensitive regex '(?i)/A\\s+\\{REGSVR'. Treat any match as a high-confidence indicator of compromise and generate an immediate alert.",
              "Statistical: For all 'odbcconf.exe' executions, calculate the information entropy of the full command-line string. Establish a baseline of entropy scores for legitimate usage within the environment. Flag any execution where the command-line entropy exceeds a high percentile (e.g., the 99th percentile), as malicious commands often have higher entropy due to encoded payloads or randomized file paths.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on feature vectors derived from tokenized 'odbcconf.exe' command-line arguments. Features can include argument count, argument length, and presence of special characters. Identify clusters of common, legitimate usage and treat any execution flagged as noise or belonging to a very small, isolated cluster as anomalous and worthy of investigation."
            ]
          },
          {
            "description": "Odbcconf.exe is executed by a parent process not typically associated with legitimate software installation or system configuration, such as 'winword.exe', 'excel.exe', 'outlook.exe', 'powershell.exe', or a web browser process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Email Servers",
            "action": [
              "Symbolic: Create a detection rule that alerts when the ParentProcessName of 'odbcconf.exe' (from Windows Event ID 4688 or Sysmon Event ID 1) is in a watchlist of suspicious parents, including 'winword.exe', 'excel.exe', 'outlook.exe', 'powershell.exe', 'wscript.exe', 'cscript.exe', 'mshta.exe', and common browser executables.",
              "Statistical: For each host, build a frequency table of all parent-child process relationships observed over a 30-day baseline period. For any new 'odbcconf.exe' execution, calculate the rarity of its parent-child pair across the enterprise. Alert when a parent-child relationship occurs that is novel or has a prevalence below a set threshold (e.g., seen on fewer than 1% of hosts where odbcconf.exe has run).",
              "Machine Learning: Train an Isolation Forest model on legitimate parent-child process pairs involving 'odbcconf.exe' from across the enterprise. The features can be categorical representations of the parent and child process names. Use the trained model in real-time to score new executions; a score indicating an outlier signifies an anomalous parent-child relationship requiring investigation."
            ]
          },
          {
            "description": "A DLL file is written to a non-standard or user-writable directory (e.g., C:\\Users\\Public\\, %TEMP%, %APPDATA%) and is subsequently loaded by an odbcconf.exe process on the same host within a short time window (e.g., less than 5 minutes).",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 7",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Download/Temp Directories on Servers, Publicly Writable Shares",
            "action": [
              "Symbolic: Correlate file creation events (Sysmon Event ID 11) for files with a '.dll' extension in user-writable locations (e.g., C:\\Users\\, C:\\ProgramData\\, C:\\Perflogs\\, %TEMP%) with subsequent 'odbcconf.exe' process creations (Windows Event ID 4688) or module loads (Sysmon Event ID 7) that reference the same file path on the same host within a 5-minute window. Alert on any such correlated sequence.",
              "Statistical: Across the enterprise, calculate the typical time-to-live for DLLs in temporary directories before they are executed. Flag instances where 'odbcconf.exe' executes a newly-written DLL with a time delta between file-write and execution that is a statistical outlier (e.g., in the lowest 5th percentile), as adversaries often execute payloads immediately after dropping them to disk.",
              "Machine Learning: Use a sequence analysis model, such as a Long Short-Term Memory (LSTM) network, trained on legitimate event sequences (file creations, process creations, module loads) per host. Define a state for 'DLL write to temp dir' and 'odbcconf.exe loads DLL'. The model can predict the probability of the next event in a sequence; an unexpected 'odbcconf.exe' load following a temp-directory DLL write would be flagged as a high-risk anomaly."
            ]
          },
          {
            "description": "The odbcconf.exe process, or a DLL it loads, spawns a suspicious child process (e.g., cmd.exe, powershell.exe, wscript.exe), or the host initiates anomalous outbound network connections to a rare destination shortly after the odbcconf.exe execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Network Egress Points, DNS servers",
            "action": [
              "Symbolic: Create a rule that triggers if 'odbcconf.exe' is the parent process (Sysmon Event ID 1) of 'cmd.exe', 'powershell.exe', 'wscript.exe', or 'rundll32.exe'. Additionally, correlate 'odbcconf.exe' execution events with subsequent network connections (Zeek conn.log, Sysmon Event ID 3) from the same host to destination IPs or domains on a threat intelligence watchlist within a 5-minute window.",
              "Statistical: Following an 'odbcconf.exe' execution, monitor for a statistically significant spike in the number of net new destination IPs contacted by the host within the next hour (e.g., exceeding the 98th percentile of the host's hourly baseline). Further, analyze DNS queries (Zeek dns.log) originating from the host post-execution and flag domains with high entropy or those belonging to newly registered domains (NRDs).",
              "Machine Learning: Implement a time series anomaly detection model (e.g., Prophet or an autoencoder) on key network metrics per host (e.g., bytes out, unique destination ports, connection count). Following an 'odbcconf.exe' execution, feed the subsequent 15 minutes of network data into the model. If the model flags the post-execution period as anomalous compared to the learned seasonal and daily patterns, generate an alert for analyst review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]