[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using trusted system binaries?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218",
        "name": "System Binary Proxy Execution",
        "evidence": [
          {
            "description": "A system binary proxy (e.g., rundll32.exe, msiexec.exe) is executed with a command-line argument that references or loads a remote object (URL, UNC path) or a local file whose hash (SHA256) matches a known-bad indicator from a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Sysmon Event ID 1 (Process Creation)",
              "Sysmon Event ID 7 (Image Load)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers; Threat Intelligence Platform",
            "action": [
              "Symbolic (IOC Matching): Monitor for process creation events (Sysmon Event ID 1, Windows Event ID 4688) involving proxy binaries (e.g., rundll32.exe, regsvr32.exe, msiexec.exe). Extract command-line arguments and any referenced file paths or URLs. For each file, retrieve its hash (from file creation events or live lookup) and query against a threat intelligence feed via API. Alert on any hash or URL match.",
              "Statistical (IOC Context Scoring): For each IOC hit, calculate the enterprise-wide prevalence of the parent process and the user account context over the last 30 days. An IOC hit originating from a rare parent process (e.g., `winword.exe` vs `svchost.exe`) or a highly privileged account receives a higher risk score. Aggregate scores and alert on those exceeding a statistically-derived threshold (e.g., 99th percentile of all IOC risk scores) to prioritize high-quality alerts.",
              "Machine Learning (Alert Triage Classification): Train a classifier (e.g., Gradient Boosting) on historical IOC alerts that have been manually labeled as 'true positive' or 'false positive'. Use features surrounding the alert, such as process lineage, user context, time of day, host criticality, and prevalence of the parent process. Use the model to predict the likelihood of a new IOC alert being a true positive, allowing analysts to prioritize the most critical alerts."
            ]
          },
          {
            "description": "A system binary proxy executes and loads a file from a directory with low enterprise-wide prevalence, such as C:\\Users\\Public\\, C:\\PerfLogs\\, or a user's AppData\\Local\\Temp folder.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1 (Process Creation)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of all Windows Endpoints and Servers",
            "action": [
              "Symbolic (Rule-based Filtering): Using process creation logs (Windows Event ID 4688, Sysmon Event ID 1), create a rule that flags executions of proxy binaries (e.g., `rundll32.exe`, `mshta.exe`) where the command line contains a file path pointing to atypical or user-writable directories, including `\\AppData\\Local\\Temp\\`, `\\Users\\Public\\`, `C:\\PerfLogs\\`, or network shares not designated as software distribution points.",
              "Statistical (Prevalence Analysis): For each system binary proxy, build a historical model of all directories it has loaded files from, using the command line arguments. Calculate the prevalence (frequency) of each directory path across all endpoints over the last 90 days. Flag any execution that loads a file from a directory in the bottom 5th percentile of prevalence, marking it as a statistically rare location for that specific binary.",
              "Machine Learning (Clustering): Apply a clustering algorithm (e.g., DBSCAN) on features extracted from command lines, such as directory path strings, file extensions, and arguments. Analyze clusters with low membership counts as these represent anomalous execution patterns. New executions that are assigned to these sparse clusters or are classified as outliers by the algorithm should be flagged for immediate review."
            ]
          },
          {
            "description": "A system binary proxy (e.g., rundll32.exe) is created by a parent process that is statistically uncommon for that binary, such as winword.exe or excel.exe instead of a more typical parent like svchost.exe or explorer.exe.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1 (Process Creation)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, particularly those with Microsoft Office Suite or web browsers installed.",
            "action": [
              "Symbolic (Parent-Child Whitelisting): Create a detection rule that triggers when a known system proxy process (e.g., `rundll32.exe`, `mshta.exe`, `regsvr32.exe`) is created with a parent process of an Office application (`winword.exe`, `excel.exe`, `powerpnt.exe`, `outlook.exe`) or a web browser (`chrome.exe`, `firefox.exe`, `msedge.exe`).",
              "Statistical (Frequency Analysis): For each system proxy binary, generate a frequency distribution of its parent processes over a 30-day baseline period. Alert when a new, never-before-seen parent-child relationship is observed, or when an existing, rare relationship (e.g., one that constitutes less than 0.1% of all creations for that child process) is detected.",
              "Machine Learning (Graph Analysis): Model parent-child process relationships across the enterprise as a directed graph using Sysmon ProcessGUIDs. Apply a community detection algorithm (e.g., Louvain Modularity) to identify normal clusters of behavior (e.g., 'OS services', 'Office apps'). A process creation event that forms an edge between two distinct and typically disconnected communities should be scored as highly anomalous and flagged for investigation."
            ]
          },
          {
            "description": "A system binary proxy, such as cmstp.exe or regsvr32.exe, initiates an outbound network connection, or creates a file with an executable-style extension (.exe, .dll, .ps1, .bat), where such behavior is not part of its established baseline.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Windows Event ID 4663",
              "Sysmon Event ID 3 (Network Connection)",
              "Sysmon Event ID 11 (File Create)",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies) and All Windows Endpoints and Servers",
            "action": [
              "Symbolic (Behavioral Rule): Join process creation events (Sysmon Event ID 1) with network connection events (Zeek conn.log, Sysmon Event ID 3) on the process GUID and timestamp. Create a rule to alert when a proxy binary like `regsvr32.exe` or `cmstp.exe` initiates an outbound network connection to a non-RFC1918 IP address.",
              "Statistical (Entropy & Deviation): For each proxy binary, establish a baseline of its network behavior using Zeek conn.log or Sysmon Event ID 3. Calculate metrics like average bytes sent/received, connection duration, and the entropy of destination ports. Alert when an execution of a proxy binary is associated with a network connection where any metric exceeds a dynamic threshold, such as 3 standard deviations from its established baseline.",
              "Machine Learning (Malicious Connection Classification): Train a classification model (e.g., Random Forest) on labeled network connections from Zeek conn.log data. Use features such as connection duration (`duration`), bytes sent (`orig_bytes`), bytes received (`resp_bytes`), protocol (`proto`), connection state (`conn_state`), and destination port. Use the model to classify outbound connections from system binary proxies as 'benign' or 'suspicious', providing a confidence score for prioritization."
            ]
          },
          {
            "description": "A process execution chain is observed within a short time window (e.g., under 60 seconds) that follows the pattern: Office Application -> Scripting Host -> System Binary Proxy.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1 (Process Creation)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints, especially those used by front-office personnel or executives.",
            "action": [
              "Symbolic (Sequence Correlation): Using a SIEM, create a correlation rule that traces process lineage using parent process IDs (from Windows Event ID 4688) or ProcessGUIDs (from Sysmon Event ID 1). Alert when a sequence of creations occurs within a 60-second window that matches the pattern: Parent (`winword.exe`, `excel.exe`) -> Child (`cmd.exe`, `powershell.exe`, `wscript.exe`) -> Grandchild (`rundll32.exe`, `msiexec.exe`).",
              "Statistical (Process Chain Rarity): Continuously analyze process lineage trees of depth 3 or more from Sysmon Event ID 1 data. Calculate the frequency of every unique 3-process chain observed across the enterprise over the last 90 days. Flag any chain that is statistically rare (e.g., has occurred fewer than 5 times) and matches the generic pattern of 'User Application -> Scripting Host -> System Binary'.",
              "Machine Learning (Sequence Modeling): Represent process execution chains as sequences of process names or command lines. Train a sequence-based anomaly detection model, such as a Long Short-Term Memory (LSTM) autoencoder, on benign process chains observed over a 30-day period. A high reconstruction error for a newly observed process chain indicates a significant deviation from learned normal patterns and should be flagged as a high-priority anomaly."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]