[
  {
    "information_requirement": "Has the adversary executed code via InstallUtil for defense evasion? (TA0005 - Defense Evasion)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.004",
        "name": "InstallUtil",
        "evidence": [
          {
            "description": "The SHA256 hash of the .NET assembly file executed by InstallUtil.exe matches a known-bad hash from an integrated threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems and process logs on all Windows endpoints and servers, with heightened monitoring on developer workstations, build servers, and application servers where .NET is prevalent.",
            "action": [
              "For each process creation event (Windows Event ID 4688 or Sysmon Event ID 1) where the process is 'InstallUtil.exe', extract the target assembly's file path from the command line. Retrieve the file's SHA256 hash (provided in Sysmon Event ID 1 or calculated from the file). Compare this hash against a threat intelligence database of known malicious file hashes. Generate a high-severity alert upon a match.",
              "Maintain an enterprise-wide baseline of all assembly file hashes executed by InstallUtil.exe. Calculate the prevalence (count of executions) and rarity (number of unique hosts) for each hash. Flag any hash that is new to the environment or seen on only a single host (rarity = 1) for investigation, as this indicates non-standard software.",
              "Develop a static binary classification model (e.g., Gradient Boosting, Random Forest) trained on features extracted from .NET assemblies (e.g., file entropy, PDB path, imported functions, string analysis). Use this model to score newly observed assemblies executed by InstallUtil.exe that are not found in threat intelligence feeds. Isolate assemblies with a high maliciousness probability score for reverse engineering."
            ]
          },
          {
            "description": "InstallUtil.exe is executed with the '/u' or '/uninstall' switch, and the target .NET assembly's file path points to a non-standard or user-writable directory, such as C:\\Users\\*, C:\\ProgramData\\*, C:\\Windows\\Temp\\*, or a network share.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution logs on all Windows endpoints and servers, particularly those of non-developer users where software installation is infrequent.",
            "action": [
              "Create a detection rule for process creation events (Windows Event ID 4688, Sysmon Event ID 1) for 'InstallUtil.exe' where the command line contains '/u' or '/uninstall' and the target assembly's path matches a pattern for suspicious locations (e.g., 'C:\\Users\\*', 'C:\\ProgramData\\*', 'C:\\Windows\\Temp\\*', 'C:\\$Recycle.bin\\*').",
              "For all 'InstallUtil.exe' executions, parse the target file path and calculate its string entropy and depth. Establish baselines for path entropy and depth from legitimate software installations. Flag executions where the path entropy is in the top 95th percentile (indicating randomness) or the path depth deviates more than 2 standard deviations from the established norm.",
              "Train a logistic regression classifier using features derived from the process event, such as: presence of the '/u' switch, path location (e.g., user-writable, temp directory), parent process name, and user context. Use the model's output to assign a risk score to each 'InstallUtil.exe' execution and alert on high-scoring events."
            ]
          },
          {
            "description": "The parent process of InstallUtil.exe is an application not associated with legitimate software installation or development, such as Microsoft Office applications (winword.exe, excel.exe), web browsers (chrome.exe, msedge.exe), or script interpreters (wscript.exe, cscript.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process lineage data from all Windows endpoints and servers, with a focus on user workstations running common productivity software.",
            "action": [
              "Alert on any 'InstallUtil.exe' process creation event (Windows Event ID 4688, Sysmon Event ID 1) where the parent process name is in a predefined list of non-standard parents, including 'winword.exe', 'excel.exe', 'outlook.exe', 'powershell.exe', 'wscript.exe', 'mshta.exe', 'chrome.exe', 'msedge.exe'.",
              "Build and maintain a baseline of legitimate parent-child process relationships for 'InstallUtil.exe' across the environment over a 30-day rolling window. Calculate the frequency of each parent process. Trigger an alert if an execution occurs with a parent process never seen before in the baseline or whose enterprise-wide frequency is below a 1% threshold.",
              "Use a clustering algorithm (e.g., DBSCAN) on features derived from process creation events, including parent process name, grandparent process name, command-line arguments, and user account. Identify clusters of normal behavior and flag any 'InstallUtil.exe' execution that is classified as a noise point or falls outside these established clusters as an anomaly."
            ]
          },
          {
            "description": "Within a short timeframe (e.g., 60 seconds) of an InstallUtil.exe execution, the same host initiates an outbound network connection to a destination IP or domain that is either on a threat intelligence blocklist, has a poor reputation, or is statistically rare for the enterprise.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic logs from network security monitoring sensors (e.g., Zeek) at egress points, DNS server query logs, and process/network event logs from all Windows endpoints and servers.",
            "action": [
              "Correlate 'InstallUtil.exe' process creation events (Windows Event ID 4688, Sysmon Event ID 1) with subsequent network connection events (Sysmon Event ID 3, Zeek conn.log) from the same host within a 60-second window. Query the destination IP and/or domain (from Zeek dns.log) against a threat intelligence feed. Alert if the destination is a known command and control (C2) server or has a malicious reputation.",
              "For each network connection following an 'InstallUtil.exe' execution, calculate the enterprise-wide rarity of the destination IP, destination port, and requested domain. Use a scoring model where rare values contribute to a risk score (e.g., destination IP seen for the first time, non-standard port like 4444, domain in the 1st percentile of prevalence). Alert when the cumulative risk score exceeds a defined threshold.",
              "Apply a time-series anomaly detection model (e.g., ARIMA or LSTM) to key network metrics for each host, such as outbound byte count, connection frequency, and data beaconing patterns (from Zeek conn.log). Following an 'InstallUtil.exe' execution, monitor for a statistically significant deviation from the host's established network baseline that the model flags as anomalous."
            ]
          },
          {
            "description": "A .NET assembly is written to disk, originating from a network download, and is then executed by InstallUtil.exe within a short time window (e.g., under 5 minutes).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network file transfer logs from network security monitoring sensors (e.g., Zeek) and file system/process creation logs from all Windows endpoints and servers.",
            "action": [
              "Correlate file creation events (Sysmon Event ID 11, Zeek files.log) with subsequent process creation events (Windows Event ID 4688, Sysmon Event ID 1) on the same host. Trigger an alert when a file is created and then executed by 'InstallUtil.exe' within a 5-minute window, especially if the file originated from a web browser or email client process.",
              "For all observed download-then-execute sequences involving 'InstallUtil.exe', calculate the distribution of the time delta between the file write event and the process execution event. Flag any sequence where the time delta falls into the bottom 5th percentile (indicating immediate, automated execution) as highly suspicious.",
              "Model process, file, and network events as a directed graph where nodes represent entities (processes, files, IPs) and edges represent actions ('writes', 'executes', 'downloads_from'). Use a graph-based anomaly detection algorithm to identify and score rare event chains, such as 'powershell.exe' -> 'downloads' -> 'evil.dll' -> 'written_by' -> 'powershell.exe' -> 'executed_by' -> 'InstallUtil.exe'. Sequences with a high anomaly score warrant investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]