[
  {
    "information_requirement": "Is the adversary using legitimate remote access software for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1219",
        "name": "Remote Access Software",
        "evidence": [
          {
            "description": "Observed network connections (e.g., TCP/UDP sessions, DNS queries, TLS handshakes) from internal assets to external IP addresses, domains, or SSL certificate subjects that are present on a threat intelligence feed for known Remote Access Software C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), DNS resolvers",
            "action": [
              "Symbolic Logic: Using a SIEM, continuously inner-join network logs against a high-confidence threat intelligence feed of known malicious Remote Access Software C2 IPs, domains, and SSL subjects. Specifically, check Zeek conn.log destination IPs, Zeek dns.log queried domains, and Zeek ssl.log Server Name Indication (SNI) values. Generate a high-priority alert for any match.",
              "Statistical Method: For all outbound connections, calculate the Jaccard similarity or Levenshtein distance between observed SNIs/domains (from Zeek ssl.log and Zeek dns.log) and a list of known legitimate remote access service domains. Flag domains that are syntactically similar but not identical to legitimate ones (e.g., 'anydeesk.com' vs 'anydesk.com'), as this can indicate typosquatting C2 infrastructure. Alert on similarity scores below a defined threshold.",
              "Machine Learning: Implement a pre-trained domain generation algorithm (DGA) classifier. Feed all newly observed domains from Zeek dns.log that are not on an established allow-list into the model. Flag domains classified as algorithmically generated, as adversaries may use DGAs for resilient C2 communications associated with their remote access tool."
            ]
          },
          {
            "description": "A new service or registry key is created for a remote access application, particularly when accompanied by command-line arguments enabling unattended or silent access, and not associated with an authorized change request.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7045",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers), Domain Controllers (for Group Policy changes)",
            "action": [
              "Symbolic Logic: Monitor process creation events (Windows Event ID 4688) for common remote access executables (e.g., teamviewer.exe, anydesk.exe, tv_host.exe). Scan the command line for arguments enabling silent or unattended access (e.g., '--silent', '--unattended', '--pw'). Correlate within a 1-minute window with a service creation event (Windows Event ID 7045) or persistence-related registry modifications (Windows Event ID 4657) for the same executable. Alert if the activity is not tied to a valid change ticket.",
              "Statistical Method: Establish a baseline of common command-line arguments and parent processes for authorized remote access tools. Calculate the frequency of unique argument combinations seen across the enterprise. Flag any command-line execution whose combination of arguments has a low historical frequency (e.g., bottom 5th percentile) or involves a parent process never before seen launching that tool.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled process creation events (Windows Event ID 4688). Use features such as process name, parent process, command-line length, command-line entropy, and presence of specific keywords (e.g., 'install', 'silent', 'password'). Deploy the model to score new process creations for remote access software in real-time, alerting on those classified as 'malicious' or 'suspicious'."
            ]
          },
          {
            "description": "A process associated with remote access software is executed from a user-writable or temporary directory, has a filename mimicking a legitimate system binary, or is spawned by an atypical parent process (e.g., a web browser or office application).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers)",
            "action": [
              "Symbolic Logic: Create a SIEM rule that triggers on process creation (Windows Event ID 4688) where the parent process is an Office application (winword.exe, excel.exe), web browser (chrome.exe, msedge.exe), or script interpreter (powershell.exe) and the child process is a known remote access tool executable. Also, alert if a known remote access tool executable is launched from a non-standard path (e.g., not in 'C:\\Program Files\\' or 'C:\\Program Files (x86)\\').",
              "Statistical Method: For each host, build a baseline of (parent process, child process) pairs and calculate the probability of each pairing. Alert when a remote access tool is launched by a parent process with a historically low co-occurrence probability (e.g., < 1% probability). Additionally, monitor the file path entropy for executing processes; a high entropy score for a process in a common system directory can indicate a randomly named malicious binary.",
              "Machine Learning: Utilize a process execution clustering model (e.g., DBSCAN) on features from Windows Event ID 4688, including file path, parent process name, and command-line arguments. Identify clusters of remote access tool executions. Investigate small, outlier clusters as they may represent anomalous or malicious usage patterns distinct from legitimate administrative or user activity."
            ]
          },
          {
            "description": "Network traffic from an endpoint to a remote access service exhibits characteristics that deviate significantly from established baselines, including timing (off-hours), periodicity (C2 beaconing), or data volume (large, unexplained data egress).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, internal network sensor grid (e.g., core switch SPAN ports)",
            "action": [
              "Symbolic Logic: Filter Zeek conn.log for connections using default ports for common remote access tools (e.g., 5938/TCP for TeamViewer, 6568/TCP for AnyDesk). Alert if the connection originates from a server VLAN where such software is not authorized, or if the connection duration is excessively long (e.g., > 24 hours) without a known justification.",
              "Statistical Method: For each host, create a 30-day rolling baseline of network activity (bytes sent, bytes received, connection count) per destination service/port. Use descriptive statistics (mean, median, 99th percentile) on Zeek conn.log fields 'orig_bytes' and 'resp_bytes'. Generate an alert when a host's outbound data volume to a remote access service exceeds its 99th percentile, or when the ratio of bytes sent to bytes received is anomalously high (e.g., > 10:1) for a typically interactive session.",
              "Machine Learning: Apply a time-series anomaly detection model (e.g., ARIMA or LSTM) to the aggregated count of connections and total data volume per hour for known remote access services. The model should learn the typical daily and weekly business rhythm. Flag periods with significant positive anomalies (spikes) in activity, especially during non-business hours, as potential C2 activity."
            ]
          },
          {
            "description": "A sequence of events where remote access software is installed or executed immediately following initial access or execution activities, such as a user opening a malicious document or execution of a PowerShell download cradle.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers), Web proxy/gateway",
            "action": [
              "Symbolic Logic: Using a SIEM's correlation capabilities, define a rule that triggers when the following sequence of events occurs on a single host within a 5-minute window: 1) Process creation (Windows Event ID 4688) where parent process is an Office app, browser, or PDF reader and child is a script interpreter (powershell.exe, cmd.exe). 2) The script interpreter subsequently spawns a known remote access tool executable. This chained-process-event is a high-fidelity indicator of compromise.",
              "Statistical Method: Analyze the time delta between sequential process creation events on endpoints. Establish a baseline distribution of these time deltas. Unusually short time deltas between a script interpreter and the launch of a remote access tool (e.g., < 1 second), which is too fast for human interaction, suggest automated execution from a script. Flag sequences where the time delta falls below the 1st percentile of typical user-driven command sequences.",
              "Machine Learning: Develop a Hidden Markov Model (HMM) or other sequence-based model trained on known benign and malicious process execution sequences. The 'states' can represent process categories (e.g., 'Office App', 'Scripting Engine', 'Remote Access Tool', 'System Utility'). Feed real-time process event streams (Windows Event ID 4688) into the model. Alert when the model identifies a sequence with a high probability of belonging to the 'malicious' class, such as the Office App -> Scripting Engine -> Remote Access Tool transition path."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]