[
  {
    "information_requirement": "Is the adversary collecting sensitive data from Customer Relationship Management (CRM) software?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1213.004",
        "name": "Customer Relationship Management Software",
        "evidence": [
          {
            "description": "A successful network connection to CRM software or its backend database originates from a source IP address present on a threat intelligence feed of known malicious C2 servers, proxies, or anonymization services (e.g., TOR exit nodes).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress/ingress points, VPN concentrators, CRM application servers, CRM database servers",
            "action": [
              "Symbolic: Continuously monitor Zeek conn.log for connections to CRM application and database servers. Join the `id.orig_h` (source IP) field with a high-confidence, frequently updated Cyber Threat Intelligence (CTI) feed of known malicious IPs. Generate a high-priority alert for any match.",
              "Statistical: For all connections to CRM assets, aggregate source IPs by their Autonomous System Number (ASN). Establish a baseline of typical source ASNs. Alert when a connection originates from an ASN that is new or has a historically low frequency of connecting to the enterprise, especially if the ASN is commonly associated with cloud hosting or VPS providers not used for legitimate business.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) to predict connection malice. Use features from Zeek conn.log such as source/destination ports, protocol, connection duration, data volume transferred, and enriched data like source IP geolocation, ASN, and IP reputation score. A high probability score from the model indicates a suspicious connection."
            ]
          },
          {
            "description": "An HTTP request to a CRM web interface or API uses a User-Agent string associated with programmatic access (e.g., curl, wget, python-requests) rather than a standard web browser.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web application firewalls (WAFs), Reverse proxies, CRM web front-end servers",
            "action": [
              "Symbolic: Analyze the `user_agent` field in Zeek http.log for all requests to CRM URLs. Match the User-Agent against a curated deny-list of strings associated with command-line utilities (`curl`, `Wget`), scripting libraries (`Python-urllib`, `Go-http-client`), and security tools (`sqlmap`, `nmap`). Alert on any match.",
              "Statistical: For all requests to CRM assets, calculate the frequency of each unique User-Agent string over a 30-day window. Alert on any User-Agent that falls below a rarity threshold (e.g., seen in less than 0.01% of requests) and is not associated with a known health check or monitoring service.",
              "Machine Learning: Use clustering algorithms (e.g., DBSCAN) on HTTP request features (User-Agent string, request method, requested URI, referrer, number of headers). Identify clusters of activity and manually investigate outliers or small clusters that do not conform to the large, dense clusters representing normal browser behavior. These anomalous clusters may represent adversary scripting."
            ]
          },
          {
            "description": "A process for a database client or data export utility is created on a CRM server with command-line arguments indicating a bulk data export operation (e.g., 'SELECT *' or outputting to a file).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "On-premise CRM application servers, On-premise CRM database servers",
            "action": [
              "Symbolic: With command-line logging enabled, monitor Windows Event ID 4688 on CRM servers. Create a detection rule that searches for known database utility process names (`sqlcmd.exe`, `bcp.exe`, `mysqldump`, `pg_dump`) and command-line arguments containing patterns like `SELECT *`, `> *.sql`, `> *.csv`, or specific export-related flags.",
              "Statistical: Establish a baseline of normal command-line execution frequency and argument structure for processes on CRM servers. Alert when the execution frequency of a database utility significantly deviates from the norm (e.g., runs at an unusual time or more often than scheduled backups). Calculate the entropy of command-line strings; unusually high entropy can indicate obfuscation.",
              "Machine Learning: Train a classification model (e.g., an NLP-based text classifier) on command-line log data to distinguish between benign administrative commands and malicious data extraction commands. Features can be derived from the text using TF-IDF or word embeddings to capture semantic meaning beyond simple keyword matching."
            ]
          },
          {
            "description": "A user account authenticates to a CRM application or its host server with session characteristics that are anomalous for that specific user, such as an unfamiliar geographic origin, unusual time-of-day, or an impossible travel event.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory), VPN concentrators, Cloud identity providers, Network gateways",
            "action": [
              "Symbolic: For each successful user login (Windows Event ID 4624), correlate the timestamp and the source IP's geolocation (from Zeek conn.log). Compare with the user's previous login. If the time difference is too short to physically travel the distance between the two locations, trigger an 'Impossible Travel' alert.",
              "Statistical: For each user, build a multi-faceted baseline of normal login behavior including typical login times (hour of day, day of week), source countries/ASNs, and source device hostnames. Use a scoring system where deviations (e.g., rare country, login at 3 AM) add to a risk score. Alert when a login's cumulative risk score exceeds the 98th percentile of the user's historical scores.",
              "Machine Learning: For each user, train a one-class anomaly detection model (e.g., Isolation Forest or One-Class SVM) on a feature set representing their normal login patterns (e.g., time of day, day of week, source ASN, country). Feed each new login into the user's specific model; if the model classifies the login as an outlier, generate an alert for review."
            ]
          },
          {
            "description": "The volume of data transferred from a CRM server to a single client IP address during a session is a statistical outlier compared to the user's historical behavior or the behavior of their peer group.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network core switches, Network egress points, Firewalls, CRM application servers",
            "action": [
              "Symbolic: Monitor the `resp_bytes` field in Zeek conn.log for connections involving CRM servers. Generate a high-severity alert if the total data transferred in a single connection exceeds a large, static threshold (e.g., 1 GB), which may indicate a full database dump.",
              "Statistical: For each user, calculate a moving average and standard deviation of their daily data egress volume from CRM servers. Alert if a user's daily total exceeds a dynamic threshold, such as 4 standard deviations above their 30-day moving average. Also compare the user's egress to their functional peer group and flag if they are in the top 99th percentile.",
              "Machine Learning: Apply a time series forecasting model (e.g., SARIMA) to each user's data egress volume from the CRM. The model will learn their typical daily/weekly patterns, including seasonality. Generate an alert when the actual observed volume significantly exceeds the model's forecasted volume and its associated confidence interval."
            ]
          },
          {
            "description": "A non-interactive service account associated with the CRM application performs actions inconsistent with its programmed behavior, such as spawning an interactive shell or accessing an unusually high number or variety of database tables.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "CRM database servers, Active Directory (for service account object monitoring)",
            "action": [
              "Symbolic: On CRM database servers, create a rule to alert if a process running under the CRM service account's context spawns a child process associated with interactive use or reconnaissance, such as `cmd.exe`, `powershell.exe`, `whoami.exe`, or `net.exe` (via Windows Event ID 4688).",
              "Statistical: If using native database auditing or Windows Event ID 4663, profile the normal set of tables accessed by the CRM service account. Calculate the Shannon entropy of accessed table names per 5-minute window. A sharp increase in entropy compared to the historical baseline indicates broad table enumeration, deviating from normal, targeted application queries.",
              "Machine Learning: Model the sequence of actions (e.g., process executions, file accesses, network connections) performed by the CRM service account using a sequence analysis model like a Hidden Markov Model (HMM). Each new sequence of actions is evaluated by the model. If the sequence has a very low probability of occurring based on the learned model, it indicates anomalous behavior that should be investigated."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]