[
  {
    "information_requirement": "Is the adversary evading defenses by proxying execution through the signed Windows binary Regsvr32.exe? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1218.010",
        "name": "Regsvr32",
        "evidence": [
          {
            "description": "The regsvr32.exe process is executed with command-line arguments containing a URL or IP address matching a threat intelligence feed, or a file path to a DLL whose hash matches a known malicious signature.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers; Network Egress Points; DNS Servers",
            "action": [
              "Symbolic: Create a detection rule that triggers when a Windows Event ID 4688 log for 'regsvr32.exe' contains a command line with a URL, IP address, or domain that matches an entry in a high-confidence threat intelligence feed. Correlate with Zeek http.log or dns.log to confirm the network request. Additionally, trigger if the command line specifies a local file whose hash matches a known malicious signature from a malware database.",
              "Statistical: For all 'regsvr32.exe' executions containing URLs, calculate the historical frequency of each domain/IP observed across the enterprise over the last 90 days. Flag any execution where the target domain falls below the 5th percentile of frequency (i.e., is exceptionally rare). Enrich this by also flagging domains with high Shannon entropy scores in their naming structure, which can indicate DGA activity.",
              "Machine Learning: Develop a supervised classification model (e.g., Logistic Regression, Random Forest) trained on labeled datasets of benign and malicious 'regsvr32.exe' executions. Features should include: presence of URL, parent process name, command-line length, number of switches, presence of specific switches ('/s', '/i', '/n'), and reputation of the domain/IP. Deploy the model to score new 'regsvr32.exe' events in real-time, alerting on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "The regsvr32.exe process is executed with a command line containing a URL pointing to a scriptlet file (e.g., .sct), and the parent process is an Office application (winword.exe, excel.exe), a scripting engine (powershell.exe, wscript.exe), or a web browser.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations; Terminal Servers; Virtual Desktop Infrastructure (VDI) Environments",
            "action": [
              "Symbolic: Create a high-fidelity alert that triggers when a Windows Event ID 4688 shows 'regsvr32.exe' being spawned by a parent process from the set ['winword.exe', 'excel.exe', 'powerpnt.exe', 'outlook.exe', 'mshta.exe', 'wscript.exe'] and the 'regsvr32.exe' command line includes 'http' or '.sct'.",
              "Statistical: For each parent process type in the enterprise, establish a baseline of its common child processes. Calculate the probability P(child='regsvr32.exe' | parent=X) for all processes X. Generate a statistical alert if 'regsvr32.exe' is spawned by a parent for which this probability is historically less than 0.1%, indicating a rare parent-child relationship.",
              "Machine Learning: Use an anomaly detection model (e.g., Isolation Forest) on process lineage trees. Feed the model sequences of (parent, child, grandchild) processes. The model learns normal execution chains. Flag any chain involving 'regsvr32.exe' that is identified as a significant outlier, such as 'winword.exe' -> 'cmd.exe' -> 'regsvr32.exe'."
            ]
          },
          {
            "description": "The regsvr32.exe process is executed with the '/s' switch and the command line specifies a DLL path located in a user-writable directory (e.g., C:\\Users\\*, C:\\ProgramData\\*, C:\\Windows\\Temp\\*), which deviates from standard system directories (e.g., C:\\Windows\\System32\\).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, focusing on user profile directories and temporary folders",
            "action": [
              "Symbolic: Create a detection rule that triggers when Windows Event ID 4688 shows 'regsvr32.exe' execution with the '/s' switch and the DLL path in the command line matches patterns for user-writable locations, such as 'C:\\Users\\', 'C:\\ProgramData\\', 'C:\\Temp\\', or '%APPDATA%'. Exclude known good software paths via an allow-list.",
              "Statistical: Build a baseline of all DLL paths loaded by 'regsvr32.exe' across the environment over 30 days. For each new execution, calculate the Levenshtein distance between its DLL path and the centroid of the cluster of known-good paths (mostly System32). Flag any path with a distance in the top 5th percentile (i.e., highly dissimilar). Additionally, calculate the entropy of the directory name; unusually high entropy can indicate a randomized folder name used for staging.",
              "Machine Learning: Train a One-Class SVM (Support Vector Machine) model on features extracted from legitimate 'regsvr32.exe /s' executions. Features should include directory path depth, presence of numbers in the path, file extension, and parent process. The model will define a boundary of 'normal' behavior. Any new execution falling outside this boundary is flagged as a potential anomaly requiring investigation."
            ]
          },
          {
            "description": "The regsvr32.exe process (as a parent) spawns a child process (e.g., cmd.exe, powershell.exe), or initiates an outbound network connection to an external IP address, which are behaviors not associated with its legitimate registration function.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers; Network Egress Gateways",
            "action": [
              "Symbolic: Create a high-priority alert that triggers when Windows Event ID 4688 shows 'regsvr32.exe' as the parent process for any of the following child processes: 'cmd.exe', 'powershell.exe', 'pwsh.exe', 'wscript.exe', 'cscript.exe', 'rundll32.exe'. This behavior is almost always malicious.",
              "Statistical: Analyze Windows Event ID 5156 and Zeek conn.log to profile network connections made by processes. The baseline for 'regsvr32.exe' initiating outbound connections should be near zero. Alert on any 'regsvr32.exe' process that initiates a network connection. Further risk-score the connection based on the rarity of the destination port and the reputation of the destination IP address (e.g., using percentile rankings of historical connections).",
              "Machine Learning: Implement a time-series analysis model on network traffic volume (bytes_out) per host, aggregated per minute. After a 'regsvr32.exe' execution is detected on a host, monitor its network traffic pattern for the next 5 minutes. If the time-series model detects an anomalous spike in outbound traffic that deviates significantly from the host's established baseline, flag it as a potential C2 channel or data exfiltration activity initiated by the payload."
            ]
          },
          {
            "description": "The regsvr32.exe process is executed with a command line that contains both the '/n' and '/i:' switches simultaneously, a combination used to invoke an arbitrary export function within a specified DLL.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Create a critical-severity detection that triggers on any Windows Event ID 4688 log where the process is 'regsvr32.exe' and the command line contains both '/n' and '/i:' as arguments. This combination is a definitive indicator of malicious intent and should be escalated for immediate incident response.",
              "Statistical: While the symbolic rule is primary, maintain a statistical count of all 'regsvr32.exe' executions containing '/n' and '/i:'. The expected baseline frequency is zero. Any non-zero count is a severe anomaly. Track the prevalence of different DLLs or scriptlets used with this technique across the enterprise to identify a widespread campaign, calculating the frequency of each payload.",
              "Machine Learning: This specific behavior is better suited for a high-fidelity symbolic rule than a complex ML model due to its unambiguous nature. However, an ML model can be used for enrichment. Feed the features of the event (parent process, DLL path, username) into a threat-actor clustering model. The model, trained on historical attack data, can help attribute the activity to a known adversary group or campaign based on the TTPs used in conjunction with this execution."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]