[
  {
    "information_requirement": "Has the adversary collected sensitive data from information repositories? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1213",
        "name": "Data from Information Repositories",
        "evidence": [
          {
            "description": "A user session is associated with access to a sensitive information repository (e.g., SharePoint, Confluence, network share) and, within a 15-minute window, an outbound network connection from the same source host to a destination IP or domain on a threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5145",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint sites, Confluence spaces, and network file shares containing sensitive data (e.g., PII, financial, IP); Active Directory Federation Services (ADFS) servers; network egress points and DNS resolvers.",
            "action": [
              "Create a SIEM rule that joins repository access events (Windows Event ID 4663/5145) with network connection logs (Zeek conn.log) on the source host and username within a 15-minute window. Trigger an alert if the destination IP from Zeek conn.log matches an entry in a high-confidence threat intelligence feed categorized as 'malware C2' or 'dropzone'.",
              "For each user, establish a baseline of destination Autonomous System Numbers (ASNs) and countries they connect to. After a user accesses a sensitive repository, monitor new outbound connections. Alert if a connection is made to an ASN or country from which the user has never connected before, especially if the ASN is associated with commodity hosting providers rather than business services.",
              "Train a Gradient Boosting Classifier to score the risk of a session involving repository access followed by network egress. Features should include: time difference between repository access and egress, data volume transferred (Zeek orig_bytes), destination IP reputation score, destination ASN, whether the destination domain is newly registered (from Zeek dns.log and WHOIS data), and a one-hot encoded vector of the repository's sensitivity category."
            ]
          },
          {
            "description": "The execution of a database dump utility (e.g., sqlcmd, mysqldump) or a data transfer tool (e.g., rclone) on a server or endpoint, where the parent process is anomalous for such a utility (e.g., a web server process like w3wp.exe, tomcat.exe) or the command line arguments indicate output to a non-standard staging file.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Production and development database servers (e.g., SQL, Oracle, PostgreSQL); web servers with database connectivity; endpoints of DBAs, developers, and system administrators.",
            "action": [
              "Create a detection rule for process creation events (Windows Event ID 4688) where ProcessName is one of (`sqlcmd.exe`, `bcp.exe`, `mysqldump.exe`, `pg_dump.exe`, `rclone.exe`) AND ParentProcessName is NOT one of (`explorer.exe`, `cmd.exe`, `powershell.exe`, `SSMS.exe`). Also, alert if the CommandLine for these processes contains redirection ('>') to a suspicious path (e.g., `C:\\Users\\Public\\`, `C:\\Temp\\`, `C:\\Windows\\Temp\\`).",
              "For each user and database utility pair, maintain a historical profile of command-line arguments. For each new execution, tokenize the command line and calculate the Jaccard similarity score against the historical set of token sets for that user. An execution with a score below a threshold (e.g., 0.5) indicates an unusual command structure and should be flagged for review.",
              "Train a Logistic Regression or Random Forest model to classify command-line executions as malicious. Features should include: command-line string length, Shannon entropy of the command-line string, presence of output redirection characters, presence of IP addresses or FQDNs, a binary flag for execution from a webroot directory, parent process name, and user account name/type."
            ]
          },
          {
            "description": "A single user account accesses a number of distinct files or pages from an information repository that exceeds the 98th percentile of their individual 30-day baseline, or accesses repositories tagged for a department inconsistent with the user's Active Directory group membership.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5145",
              "Zeek http.log",
              "Application-specific audit logs (e.g., SharePoint, Confluence)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SharePoint Online tenant, Confluence server, network file shares categorized by data sensitivity and departmental ownership (e.g., 'Finance', 'HR', 'Engineering-SourceCode').",
            "action": [
              "Maintain an access control matrix mapping AD groups to authorized repository paths/sites. Create a rule that alerts when a file access event (Windows Event ID 5145 or application log) shows a user from Group A accessing a resource explicitly designated for Group B only.",
              "For each user, calculate a 30-day rolling baseline of daily distinct file/page access counts from sensitive repositories. Alert when a user's single-day count exceeds the 98th percentile of their own historical distribution. Enrich the alert with the specific files accessed.",
              "Implement a peer group analysis model using K-Means or DBSCAN to cluster users based on vectors of their repository access patterns (e.g., count of accesses to each repository category). For each user, calculate the cosine distance between their current activity vector and the centroid of their assigned cluster. A distance exceeding a dynamically calculated threshold (e.g., 95th percentile of distances within the cluster) indicates anomalous behavior relative to their peers and should be alerted."
            ]
          },
          {
            "description": "A user session on a host is associated with a high volume of file read operations (e.g., >1000 events) from a designated sensitive network share within a 30-minute window, immediately followed by a process creation event for a known compression utility (e.g., 7z.exe, rar.exe) writing to a single archive file.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network file shares containing intellectual property, PII, or financial records; user endpoints, particularly for privileged users, executives, and finance personnel.",
            "action": [
              "Create a stateful rule that triggers when a `(user, host)` tuple generates more than 1000 file read events (Windows Event ID 5145) from a sensitive share within 30 minutes. If this condition is met, the rule should then look for a subsequent process creation event (Windows Event ID 4688) by the same user/host for a compression tool (`7z.exe`, `rar.exe`, `tar.exe`, `zip.exe`) within the next 5 minutes.",
              "For each user-host pair, monitor the ratio of file read events (Event ID 5145) to file write events (Event ID 4663/5145 with write access) in 15-minute windows. Establish a baseline for this ratio. Alert when the ratio spikes dramatically (e.g., > 100:1) and the absolute count of read events is abnormally high (e.g., > 3 standard deviations above the user's mean).",
              "Use a Hidden Markov Model (HMM) to model the data staging process. Define states like 'Benign Activity', 'Mass File Read', 'Data Compression', and 'Exfiltration Prep'. The model's observations are sequences of system events (Event IDs 4688, 5145, 4663, etc.) from a single user session. An alert is generated when the model transitions with high probability from the 'Mass File Read' state to the 'Data Compression' state."
            ]
          },
          {
            "description": "An endpoint's total outbound data volume to a single external IP address over a 1-hour period exceeds its 30-day baseline by more than 3 standard deviations, where this behavior occurs within one hour of the same host accessing a known sensitive information repository.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5145",
              "Application-specific audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (firewalls, proxies), DNS resolvers, and the information repositories themselves (network shares, SharePoint servers) to enable correlation.",
            "action": [
              "Correlate repository access logs (e.g., Windows Event ID 5145) with network logs. If a host accesses a sensitive repository, monitor its subsequent outbound traffic for 1 hour. Alert if Zeek dns.log shows a request to a domain on a blocklist (e.g., dynamic DNS, anonymizing proxy, known cloud storage abused for exfil) and Zeek conn.log shows a corresponding connection with `orig_bytes` > 100MB.",
              "For each host, maintain a 30-day rolling baseline (mean and standard deviation) of hourly outbound data volume (`sum(orig_bytes)` from `Zeek conn.log`). Create a rule to alert if a host's hourly egress volume exceeds $$ \\mu + 3\\sigma $$. Enrich the alert by querying for any sensitive repository access from that host in the preceding hour.",
              "Apply a time-series decomposition and anomaly detection algorithm (e.g., Seasonal-Hybrid ESD, Prophet) to each host's outbound traffic volume, aggregated into 5-minute intervals. This model will learn the host's normal daily and weekly traffic patterns (seasonality). An alert is triggered when a spike in traffic is identified as an anomaly that cannot be explained by the learned seasonal patterns, especially if it correlates with recent repository access."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]