[
  {
    "information_requirement": "Is the adversary establishing command and control using remote desktop software? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1219.002",
        "name": "Remote Desktop Software",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host to an external IP address or domain that matches a known malicious C2 threat intelligence feed or a curated list of unsanctioned remote desktop services (e.g., AnyDesk, TeamViewer, RustDesk).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points (firewalls, proxies), DNS resolvers, network sensor grid",
            "action": [
              "Symbolic: Query Zeek dns.log for requests to domains and Zeek conn.log for connections to destination IPs found on curated threat intelligence feeds for known malicious C2 or lists of unsanctioned remote desktop software. Generate a high-severity alert for any match.",
              "Statistical: For domains associated with remote desktop services (e.g., *.teamviewer.com, *.anydesk.com), calculate the Shannon entropy of the subdomain portion of the FQDN in Zeek dns.log. Alert on hosts querying subdomains with an entropy score exceeding a dynamically calculated baseline (e.g., >99th percentile) or a static threshold (e.g., >3.5), which may indicate DGA usage.",
              "Machine Learning: Train a Random Forest classification model using labeled historical data from Zeek conn.log. Use features such as connection duration, orig_bytes, resp_bytes, protocol, destination port, and connection state. Use the model to classify new, long-lived connections to unknown external IPs and flag those classified as 'malicious' with a confidence score above 0.9."
            ]
          },
          {
            "description": "A process execution event (Windows Event ID 4688) where the process name matches a known remote desktop application (e.g., 'anydesk.exe') and is executed from a non-standard file path (e.g., not 'C:\\Program Files\\') or is spawned by an unusual parent process (e.g., 'wscript.exe').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Detection and Response (EDR) agents on workstations and servers, SIEM log collectors for Windows Event Logs",
            "action": [
              "Symbolic: Using Windows Event ID 4688 logs, create a rule that alerts when a process name from a predefined list of remote desktop tools (e.g., anydesk.exe, rustdesk.exe) is executed from a directory outside of 'C:\\Program Files\\*' or 'C:\\Program Files (x86)\\*'.",
              "Statistical: For each host, profile parent-child process relationships over 30 days to establish a frequency baseline. Alert when a remote desktop process is spawned by a parent that falls into a low-frequency percentile (e.g., <1st percentile) for that child process, such as 'wmiprvse.exe' spawning 'tv_w32.exe'.",
              "Machine Learning: Develop a one-class SVM model trained on legitimate remote desktop software executions, using features from Windows Event ID 4688 such as user context (SYSTEM vs. user), parent process name, tokenized file path, and command line length. Use the model to identify and alert on new executions that are classified as outliers."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a known remote desktop application containing command-line arguments indicative of silent installation, unattended access configuration, or password setting (e.g., '--silent', '--set-password', '--start-service').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints (workstations and servers) forwarding process creation logs (Event ID 4688)",
            "action": [
              "Symbolic: Create a SIEM rule using regular expressions to search the CommandLine field in Windows Event ID 4688 logs for flags associated with unattended remote desktop tool configuration (e.g., /S, --silent, --install, --set-password, --get-id, --start-with-win). Alert on any match.",
              "Statistical: For each authorized remote desktop application, calculate the enterprise-wide frequency of all observed command-line arguments. Identify and alert on the use of arguments or combinations of arguments that are statistically rare (e.g., appearing in <1% of all executions), especially those related to unattended access.",
              "Machine Learning: Apply Latent Dirichlet Allocation (LDA) to the tokenized command-line arguments from all process executions. Manually review the generated topics to identify any corresponding to malicious activity (e.g., a topic with high probabilities for terms like '--set-password', '--silent', 'wget'). Score new remote desktop process executions based on their command-line topic mixture and alert if they have a high probability of belonging to a malicious topic."
            ]
          },
          {
            "description": "A correlated sequence of events on a single host within a 15-minute window: 1) A file download of an executable from a domain associated with remote desktop software is logged. 2) A process creation event for that executable is logged. 3) A new outbound network connection to the remote desktop service's known IP infrastructure is logged.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Network egress points (firewall, proxy), DNS resolvers, EDR-enabled endpoints",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when, for a single host IP: a file with mime_type 'application/x-dosexec' is logged in Zeek files.log from a known remote desktop software domain; followed within 10 minutes by a Windows Event ID 4688 with a matching filename; followed by a new connection in Zeek conn.log to that service's known C2 IP ranges.",
              "Statistical: For each host, track the set of all executable files downloaded and subsequently executed. For a given host, flag the first-time observation of a download-execute-connect sequence involving a specific remote desktop tool. If this sequence has been seen on fewer than 1% of all endpoints organization-wide, elevate the event to an alert as it is rare for both the host and the enterprise.",
              "Machine Learning: Implement a sequence analysis model, such as a Recurrent Neural Network (RNN) or Hidden Markov Model (HMM), trained on benign and malicious event sequences from logs (network, process, file). Define the 'malicious RDP install' sequence as a target state. Feed real-time event streams from each host into the model and alert when the probability of a host being in the malicious state exceeds a defined threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "A network connection in Zeek conn.log to a known remote desktop service IP/port where the connection duration or total outbound bytes (orig_bytes) is a statistical outlier compared to the established baseline for the source host.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow collectors (e.g., Zeek sensors) at network egress points and internal network chokepoints",
            "action": [
              "Symbolic: Create a rule that alerts on any connection in Zeek conn.log where the destination IP is on a curated list of remote desktop services and the connection duration exceeds a static threshold (e.g., 24 hours), or if the 'history' field shows evidence of tunneling (e.g., 'ShADadFf').",
              "Statistical: For each host, establish a 30-day rolling baseline of normal outbound data volume (orig_bytes) and connection duration for remote desktop sessions. Calculate the 95th percentile for both metrics. Generate an alert when a new session from that host to a remote desktop service exceeds either of these thresholds.",
              "Machine Learning: Apply a time-series anomaly detection model, such as an LSTM autoencoder, to the byte-per-second and packet-per-second data streams within active remote desktop sessions (derived from Zeek conn.log). Train the model on benign session traffic. Alert when the model's reconstruction error for a live session spikes significantly, indicating a pattern deviation inconsistent with normal interactive use."
            ]
          },
          {
            "description": "A successful remote interactive logon (Windows Event ID 4624 with Logon Type 10) for a user account that is anomalous based on one or more factors: time-of-day, source workstation name, or source IP geolocation, when compared to the user's historical baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, RADIUS/authentication servers, and endpoint logs from user workstations and servers",
            "action": [
              "Symbolic: Maintain an explicit user-to-host allow-list for authorized remote access. Create a rule to alert on any remote interactive logon (Windows Event ID 4624, Logon Type 10) where the combination of 'Account Name' and 'Source Workstation Name' is not on this list.",
              "Statistical: For each user, create a historical profile of logon behavior (hour-of-day, source IP subnet, source hostname) from Windows Event ID 4624 logs over 30 days. Score new logons by adding points for deviations: logon outside of typical hours (e.g., >2 standard deviations from mean logon hour), source IP from a new/rare ASN (enriched from Zeek conn.log), or a source hostname never seen before for that user. Alert when the cumulative risk score exceeds a dynamically determined threshold.",
              "Machine Learning: Use a density-based clustering algorithm like DBSCAN on user logon events, using features such as hour-of-day, day-of-week, and source IP's ASN/geolocation. Identify clusters representing normal 'patterns of life' for each user. Classify new logon events that do not fall into any existing cluster as outliers (noise) and generate an alert, as this indicates a significant deviation from established behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]