[
  {
    "information_requirement": "Is an adversary leveraging remote document templates to execute malicious code for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1221",
        "name": "Template Injection",
        "evidence": [
          {
            "description": "An Office document process initiates a network connection to download a template from a URL, domain, or IP address present on a threat intelligence feed, or the hash of the downloaded template file matches a known malicious signature.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewall logs, Web proxy logs, DNS server logs, User workstations",
            "action": [
              "Symbolic: Continuously cross-reference destination URLs and server hostnames from Zeek http.log and dns.log, and destination IPs from Zeek conn.log, against a CTI feed of known malicious indicators. Alert on any match.",
              "Statistical: Calculate the rarity of the requested top-level domain plus one (TLD+1) using a percentile model based on the last 30 days of organizational web traffic. Flag connections to domains in the bottom 5th percentile of popularity that are initiated by Office applications (winword.exe, excel.exe, powerpnt.exe).",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) on features from network logs (URI length, query parameter entropy, user-agent string, domain age) to predict the likelihood a URL is malicious. Score all template download requests and investigate high-probability events."
            ]
          },
          {
            "description": "An Office application (e.g., winword.exe, excel.exe) spawns a child process whose command-line arguments contain patterns indicative of remote payload download and execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Terminal servers, Virtual Desktop Infrastructure (VDI) hosts",
            "action": [
              "Symbolic: Scan the command-line arguments of child processes spawned by Office applications (winword.exe, excel.exe, powerpnt.exe) for specific, high-confidence malicious strings and regular expressions, such as 'IEX(New-Object Net.WebClient).DownloadString', 'mshta.exe http', 'certutil -urlcache -f http', and 'rundll32.exe javascript:'. Alert on any matches.",
              "Statistical: Calculate the Shannon entropy of command-line arguments for processes spawned by Office applications. Establish a baseline of normal entropy values for common processes. Alert on processes where the command-line entropy exceeds a high percentile threshold (e.g., 98th percentile), which often indicates obfuscated or encoded commands.",
              "Machine Learning: Use a pre-trained or custom-trained NLP model (e.g., using a Bag-of-Words or TF-IDF approach with a Naive Bayes classifier) to classify command lines as benign or malicious. Feed all command lines from Office child processes into the model and investigate those classified as malicious with high confidence."
            ]
          },
          {
            "description": "An RTF file transferred over the network or found on an endpoint contains the '*\\template' control word referencing a remote resource via HTTP/S or a UNC path.",
            "data_sources": [
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Email gateway file attachments, User workstations' file systems",
            "action": [
              "Symbolic: Inspect the content of RTF files captured via Zeek files.log or endpoint file scans. Use a regular expression to search for the literal string '*\\template http' or '*\\template \\\\' to detect remote template injection attempts. Alert on any match.",
              "Statistical: Analyze the frequency of the '*\\template' control word across all RTF files in the environment. While legitimate use exists, a sudden spike in its occurrence, or its presence in files from external sources, is anomalous. Monitor the count of such files over time and alert on statistically significant increases (e.g., a 3-sigma deviation from the moving average).",
              "Machine Learning: Develop a file content classifier. Extract features from RTF files, such as the presence/absence of specific control words (like '*\\template http'), file size, and the ratio of control words to plain text. Train a model (e.g., SVM) to distinguish between benign and malicious RTF files based on known samples. Scan all new RTF files and flag suspicious ones."
            ]
          },
          {
            "description": "An Office application spawns an unexpected child process not associated with normal user activity, such as a command shell, scripting interpreter, or living-off-the-land binary (LOLBin).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Application servers, Terminal servers",
            "action": [
              "Symbolic: Create an explicit allow-list of all legitimate child processes for each Office application (e.g., winword.exe -> iexplore.exe for hyperlinks). Alert on any parent-child process relationship that is not on this pre-approved list, especially for processes like cmd.exe, powershell.exe, wscript.exe, mshta.exe, and certutil.exe.",
              "Statistical: For each host, build a frequency table of parent-child process relationships involving Office applications over a 30-day baseline period. Calculate the probability of each relationship. Alert when a rare relationship occurs (e.g., a process chain with a probability less than 0.01) on a given host or across the enterprise.",
              "Machine Learning: Use an unsupervised learning algorithm like one-class SVM or clustering (e.g., DBSCAN) on features representing process relationships (e.g., one-hot encoded parent-child pairs, user context, time of day). The model will learn the cluster of 'normal' activity. Flag any new process relationship that falls outside this cluster as an anomaly for investigation."
            ]
          },
          {
            "description": "An Office application process initiates an outbound SMB/WebDAV connection (TCP/445, TCP/80, TCP/443) to an external IP address or an unusual internal server not designated as a file share, indicating a potential forced authentication attempt.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewall logs, User workstations, Internal network segments",
            "action": [
              "Symbolic: Create a SIEM rule to alert on any SMB traffic (TCP port 445) from client workstation VLANs to an external, non-RFC1918 IP address. This traffic should be blocked by policy and is a high-fidelity indicator of malicious activity or misconfiguration.",
              "Statistical: Profile the SMB destinations for each user and host. Maintain a list of 'normal' file servers accessed by each user. Alert when an Office application on a user's host initiates an SMB connection to a server that is not on their historical baseline or is statistically rare for their department or role.",
              "Machine Learning: Apply time-series analysis to the volume of outbound SMB connection attempts from the entire network or specific subnets. Use a model like SARIMA or Prophet to forecast expected connection volumes. Alert when the observed volume significantly exceeds the forecasted upper confidence bound, which could indicate a widespread campaign."
            ]
          },
          {
            "description": "A correlated sequence of events is observed on a single host within a short time window: 1) An Office application makes a network connection to a statistically rare external domain, followed by 2) the spawning of a scripting interpreter or LOLBin by that same Office process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM correlation engine, User workstations, DNS server logs, Web proxy logs",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when, for a single host, an Office process (e.g., winword.exe) makes a network connection to a domain on a CTI blocklist, and within 60 seconds, the same process ID spawns a child process like powershell.exe or cmd.exe.",
              "Statistical: Develop a composite risk score. Assign points for each suspicious event: +10 for an Office app spawning cmd.exe, +20 for a network connection to a domain in the bottom 5% of popularity, +5 for the connection happening outside of business hours. Correlate these events by host and time, and alert if the cumulative score for a sequence exceeds a defined threshold (e.g., 30 points in 5 minutes).",
              "Machine Learning: Use a sequence-based anomaly detection model, such as a Long Short-Term Memory (LSTM) autoencoder. Train the model on sequences of normal user endpoint events (process creation, network connections, file modifications). Feed real-time event streams into the model and alert when the reconstruction error for a sequence is high, indicating the model has seen a novel and potentially malicious pattern of behavior."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage, Inc."
    ]
  }
]