[
  {
    "information_requirement": "Has the adversary modified Group Policy for privilege escalation?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1484.001",
        "name": "Group Policy Modification",
        "evidence": [
          {
            "description": "A file is written to a Group Policy Object path within SYSVOL, and the file's hash matches a known malicious tool on a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller SYSVOL Share (\\\\<DOMAIN>\\SYSVOL\\<DOMAIN>\\Policies\\*\\)",
            "action": [
              "Create a rule that triggers on a file write event (Windows Event ID 4663) where the Object Name contains a SYSVOL policy path. Upon trigger, hash the file and cross-reference the hash against a threat intelligence feed of known malicious binaries. Alert on any match.",
              "For each file written to the SYSVOL share (Windows Event ID 4663), calculate the Shannon entropy of the file. Establish a baseline entropy score for legitimate script and policy files. Alert if a new file's entropy score exceeds a high percentile (e.g., 95th percentile), as high entropy can indicate packed or encrypted malicious executables.",
              "Train a file-type classification model on features extracted from files typically found in SYSVOL (e.g., file extension, magic bytes, entropy, string patterns). Apply this model to all new files written to SYSVOL (Windows Event ID 4663). Alert on files classified as 'executable' or 'suspicious script' when they are not expected in that context."
            ]
          },
          {
            "description": "A process creation event is observed where the parent process is related to Group Policy application (e.g., gpscript.exe) and the command line contains syntax for privilege escalation, such as adding a user to a privileged local group.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Domain-joined Endpoints and Servers",
            "action": [
              "Monitor process creation events (Windows Event ID 4688) for command lines containing privilege escalation patterns (e.g., `net localgroup administrators /add`, `sc.exe create ... binPath=...`). Trigger an alert if the parent process is `gpscript.exe` or `gpupdate.exe`.",
              "Analyze command line arguments from processes spawned by GPO scripts (Windows Event ID 4688). Calculate the frequency of unique command line patterns over time. Alert when a rare or never-before-seen command line pattern associated with privilege escalation is executed, especially if it appears on multiple hosts in a short time frame.",
              "Use a pre-trained natural language processing (NLP) model to classify the intent of command lines executed by GPO scripts. Train the model to recognize categories like 'User Management', 'Service Creation', and 'Privilege Escalation'. Alert on any command classified as 'Privilege Escalation'."
            ]
          },
          {
            "description": "A directory service object modification event (Windows Event ID 5136) is recorded for a GPO, where the `nTSecurityDescriptor` attribute is changed to grant modification rights (e.g., `GenericWrite`, `WriteDacl`) to a user or group that is not a member of a standard administrative group.",
            "data_sources": [
              "Windows Event ID 5136"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers",
            "action": [
              "Create a rule that triggers on Event ID 5136 for objects with a class of `groupPolicyContainer`. Parse the `nTSecurityDescriptor` change and alert if write-related permissions are granted to any account not on an approved list of GPO administrators.",
              "Maintain a baseline of which user accounts and groups modify which GPOs. For each GPO modification event (Event ID 5136), calculate a rarity score for the (user, GPO) pair. Alert if the score exceeds a threshold, indicating a user is modifying a GPO they have never touched before.",
              "Use a peer group analysis or clustering algorithm to group users based on their GPO modification behavior. A user being clustered into a group of highly privileged admins when they are not one, or a user forming a new outlier cluster, indicates anomalous activity. Alert on users who deviate from their established cluster."
            ]
          },
          {
            "description": "A GPO modification event (Windows Event ID 5136) is followed by a user rights assignment event (Windows Event ID 4704) on member servers or endpoints, where a high-impact privilege (e.g., `SeDebugPrivilege`, `SeTcbPrivilege`, `SeEnableDelegationPrivilege`) is assigned by that GPO.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4704",
              "Windows Event ID 4672"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, All Domain-joined Endpoints and Servers",
            "action": [
              "Create a rule that correlates a GPO modification (Event ID 5136) with a subsequent User Right Assignment (Event ID 4704) on endpoints. Alert if the assigned privilege is on a watchlist of sensitive privileges (e.g., `SeDebugPrivilege`, `SeEnableDelegationPrivilege`).",
              "For each sensitive privilege, baseline which GPOs are authorized to assign it. Alert if a new, unauthorized GPO assigns a sensitive privilege, or if there is a statistically significant spike (e.g., > 3 standard deviations above the mean) in the number of machines receiving a specific privilege from any GPO.",
              "Develop a time-series model to forecast the expected number of sensitive privilege assignments (Event ID 4704) across the environment. An observed count that significantly exceeds the model's prediction interval, especially following a GPO modification event (Event ID 5136), indicates a potential widespread privilege escalation attempt."
            ]
          },
          {
            "description": "A new Group Policy Object is created (Windows Event ID 5137), followed by the creation of a new scheduled task (Windows Event ID 4698) or service (Windows Event ID 7045) on endpoints, where the task or service is configured to run with high privileges.",
            "data_sources": [
              "Windows Event ID 5137",
              "Windows Event ID 4698",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, All Domain-joined Endpoints and Servers",
            "action": [
              "Correlate a GPO creation event (Event ID 5137) with subsequent scheduled task creation (Event ID 4698) or service installation (Event ID 7045) events. Alert if the new task/service is configured to run as `SYSTEM` and the action/binary path points to a non-standard location.",
              "Baseline the rate of new scheduled task and service creation per organizational unit (OU). Following a GPO creation event (Event ID 5137), monitor for a statistically significant increase in the rate of task/service creation in the affected OUs that exceeds the 99th percentile of the historical baseline.",
              "Use an anomaly detection algorithm (e.g., Isolation Forest) on the properties of newly created scheduled tasks and services (e.g., account context, binary path, triggers, command arguments). Alert on any new task/service flagged as an outlier, especially if it appears across multiple machines after a GPO update."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary modified Group Policy for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1484.001",
        "name": "Group Policy Modification",
        "evidence": [
          {
            "description": "A GPO policy file (e.g., registry.pol, GptTmpl.inf) within the SYSVOL share is modified, and the changes include the addition or modification of registry keys or security template values known to disable or weaken security controls.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5136"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller SYSVOL Share (\\\\<DOMAIN>\\SYSVOL\\<DOMAIN>\\Policies\\*\\)",
            "action": [
              "Monitor file modification events (Windows Event ID 4663) for `registry.pol` and `GptTmpl.inf` in SYSVOL. Upon modification, scan the file content for a watchlist of strings corresponding to registry keys that disable security tools (e.g., `DisableAntiSpyware`, `TamperProtection`). Alert on any match.",
              "Establish a baseline of 'safe' or expected settings within critical security GPOs (a 'golden GPO' image). Periodically, and upon modification (Event ID 5136), perform a diff against the baseline. Alert if the number of changed settings exceeds a statistical threshold, or if the change frequency for a specific GPO is anomalous.",
              "Train a classification model to distinguish between benign and malicious GPO policy file changes. Features can include the specific settings being changed, the user making the change, and the time of day. Use the model to score each GPO modification (Event ID 5136) and alert on changes classified as high-risk."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) is observed on endpoints, initiated by a GPO script, containing command-line arguments designed to disable security services, clear event logs, or alter firewall rules.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Domain-joined Endpoints and Servers",
            "action": [
              "Monitor process creation events (Windows Event ID 4688) where the parent process is `gpscript.exe`. Alert if the command line contains patterns for defense evasion, such as `netsh advfirewall set currentprofile state off`, `wevtutil.exe cl`, or `Set-MpPreference -DisableRealtimeMonitoring $true`.",
              "For processes spawned by GPO scripts, calculate the frequency of different command-line utilities being used (e.g., `netsh.exe`, `wevtutil.exe`, `sc.exe`). Alert if a rarely used utility is executed, or if the usage frequency of a known defense evasion utility spikes above its 95th percentile across the environment.",
              "Use an unsupervised learning model (e.g., clustering) on the command line arguments of GPO-spawned processes. Identify clusters of normal administrative activity. Alert when a new process creates a new, small cluster or is a significant outlier from all existing clusters, as this indicates novel and potentially malicious behavior."
            ]
          },
          {
            "description": "A GPO is modified (Windows Event ID 5136) resulting in a configuration change that measurably weakens a security control, such as a Windows Firewall rule changing from 'Allow' to 'Any', a log source being disabled, or UAC's behavior level being lowered.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, Configuration Management Database (CMDB)",
            "action": [
              "Define a 'Golden GPO' template for critical security policies. After a GPO modification event (Event ID 5136), programmatically compare the changed GPO's settings against the template. Alert on any deviation that represents a security downgrade (e.g., `EnableFirewall` changing from `1` to `0`).",
              "Track the history of specific critical security settings within GPOs. For a given setting (e.g., UAC level), calculate the historical distribution of its values. Alert if a GPO modification changes a setting to a statistically rare or historically unseen insecure value.",
              "Use a regression model to predict a 'security score' for each GPO based on its settings. Train the model on GPOs that have been manually audited and scored. After a modification (Event ID 5136), re-calculate the score and alert if there is a statistically significant drop in the predicted score."
            ]
          },
          {
            "description": "Following a GPO modification event (Windows Event ID 5136), a statistically significant and sustained decrease in the volume of specific security logs (e.g., Security, Sysmon, PowerShell) is observed from the population of hosts affected by the GPO change.",
            "data_sources": [
              "Windows Event ID 5136",
              "SIEM Log Ingestion Metrics"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM / Log Aggregator Platform, Active Directory Domain Controllers",
            "action": [
              "Create a 'heartbeat' rule that alerts if a host or group of hosts fails to send any logs for a predefined period (e.g., 1 hour). Correlate this alert with any recent GPO modification events (Event ID 5136) that applied to the silent hosts.",
              "For each log source and per host group (OU), establish a baseline of log volume (events per minute). After a GPO modification event, alert if the volume drops more than a set number of standard deviations below the baseline for a sustained period.",
              "Implement a time-series forecasting model (e.g., ARIMA) for log ingestion volume from critical host groups. Use GPO modification events (Event ID 5136) as a regressor variable. Trigger an alert if the actual log volume falls significantly below the model's forecasted lower confidence bound."
            ]
          },
          {
            "description": "A file write or modification event (Windows Event ID 4663) occurs on a GPO file path within SYSVOL, and the access is initiated from a non-administrative workstation or by a process other than standard GPO management tools (e.g., `mmc.exe`, `dfsrcs.exe`).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5145",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller SYSVOL Share (\\\\<DOMAIN>\\SYSVOL\\), Administrator Workstations",
            "action": [
              "Create a rule that triggers on a file write (Event ID 4663) to a SYSVOL policy path. Alert if the `Process Name` is not in an allowlist (e.g., `mmc.exe`, `dfsrcs.exe`) OR if the source IP address from the correlated file share access event (Event ID 5145) does not belong to a designated administrative host.",
              "Profile the (Process Name, Source Hostname) pairs that access and modify files in SYSVOL. Calculate the frequency of each pair. Alert when a pair with a very low frequency (e.g., bottom 1st percentile) or a never-before-seen pair performs a write operation.",
              "Use a one-class SVM (Support Vector Machine) model trained on legitimate SYSVOL access events (features: process name, source IP subnet, user account). Apply the model to new access events in real-time. Alert on any event flagged as an anomaly by the model."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]