[
  {
    "information_requirement": "Is the adversary evading defenses using environmental keying?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1480.001",
        "name": "Environmental Keying",
        "evidence": [
          {
            "description": "A process executes a sequence of host-based discovery commands and subsequently initiates a network connection to a destination matching a known malicious C2 threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Domain Controllers, Network egress points (Firewall/Proxy)",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) that include discovery commands (e.g., `whoami`, `systeminfo`, `ipconfig`) with subsequent network connections (Zeek conn.log) from the same host. Alert if the destination IP or domain matches a high-confidence C2 threat intelligence feed.",
              "Statistical: For a given host, establish a baseline of parent-child process relationships and their associated network activity. Calculate the rarity of a new process spawning discovery tools and then making an external network connection to a newly seen IP address. Flag any process whose network destination falls into the top 1% of rarest destinations for that host or user.",
              "Machine Learning: Train a time-series model on host process and network activity. Use the model to predict expected network connections following process creation. Flag sequences where a burst of discovery commands is followed by a network connection to an unpredicted or anomalous destination IP, particularly one with a high threat score from an integrated intelligence platform."
            ]
          },
          {
            "description": "A process executes a specific, ordered sequence of system discovery commands within a short time window that matches command patterns used by known malware for environmental keying.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, Active Directory domain controllers",
            "action": [
              "Symbolic: Create and apply a detection rule that triggers when a specific sequence of commands (e.g., `wmic csproduct get uuid`, `getmac`, `nltest /domain_trusts`) are executed by the same process ID or parent process ID within a 30-second window. Source data from Windows Event ID 4688.",
              "Statistical: Calculate the transition probability between different command-line utilities for each user and host. For example, what is the probability of `ipconfig.exe` running immediately after `whoami.exe`? Flag command sequences with a joint probability below a 1st percentile threshold, indicating a rare chain of events.",
              "Machine Learning: Use a sequence-based anomaly detection model, like an LSTM autoencoder, trained on historical command-line execution sequences (from Windows Event ID 4688). Input new sequences of commands per user session and flag any sequence with a high reconstruction error, indicating it does not conform to learned normal behavior."
            ]
          },
          {
            "description": "A process executes an anomalous number and variety of system, network, or user discovery commands, deviating significantly from established host or user activity baselines.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, User workstations",
            "action": [
              "Symbolic: Alert when a single process executes more than 5 distinct discovery commands (e.g., `systeminfo`, `whoami`, `ipconfig`, `netstat`, `tasklist`, `hostname`) within a 60-second window.",
              "Statistical: For each host, calculate a rolling 5-minute window entropy score based on the command-line processes executed (Windows Event ID 4688). A sudden spike in entropy, exceeding 3 standard deviations from the host's baseline entropy, indicates an unusual variety of commands. Also, track the frequency of discovery commands per hour and flag users/hosts in the 99th percentile.",
              "Machine Learning: Develop a one-class SVM (Support Vector Machine) model for each host, trained on vectors representing normal command execution frequency and variety. Classify new activity vectors in real-time. Any vector classified as an anomaly suggests behavior outside the established norm, such as a burst of discovery activity."
            ]
          },
          {
            "description": "An unsigned or newly observed process terminates in an unusually short time (<2 seconds) immediately after creation, especially following host discovery checks, suggesting an environmental key mismatch.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4689"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers",
            "action": [
              "Symbolic: Identify processes that are not signed by Microsoft or a trusted publisher and that terminate within 2 seconds of creation (correlate Windows Event ID 4688 and 4689). If the process name is associated with a known malware family that uses environmental keying, escalate the alert.",
              "Statistical: For each process name on the network, calculate the mean and standard deviation of its execution duration from process start/stop events. Flag any instance of a process, particularly from an uncommon file path, that terminates in a duration less than 2 standard deviations below the mean for that process name, or under a 1-second absolute threshold if no baseline exists.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on process features including execution duration, parent process, command-line arguments, and file signature status. Isolate and analyze clusters of short-lived, unsigned processes that perform discovery actions to identify malicious patterns indicative of failed keying checks."
            ]
          },
          {
            "description": "A host performs anomalous network reconnaissance by querying an external DNS server for its own internal hostname or by connecting to public services to determine its external IP address.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, Network egress points (Firewall/Proxy)",
            "action": [
              "Symbolic: Create a rule to detect DNS queries (Zeek dns.log) from an internal IP to an external resolver where the query is for an internal FQDN. Also, create a rule to detect HTTP/S connections (Zeek conn.log) to domains known to provide public IP information (e.g., 'api.ipify.org', 'ifconfig.me', 'whatismyip.com').",
              "Statistical: For each host, baseline the domains it queries. Calculate the rarity of a host querying a 'what-is-my-ip' service. Flag any host whose frequency of such queries exceeds the 95th percentile for all workstations. Calculate the Shannon entropy of Top-Level Domains (.com, .org, .ru) requested by each host; a sudden change could indicate anomalous activity.",
              "Machine Learning: Train a classifier to distinguish between benign and malicious network reconnaissance traffic based on features from Zeek logs (e.g., destination port, protocol, connection duration, data volume, DNS query type). Use this model to score new network events, flagging connections that are classified as reconnaissance with high confidence and correlate with on-host discovery activity."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]