[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by checking for a pre-existing infection via mutual exclusion mechanisms? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1480.002",
        "name": "Mutual Exclusion",
        "evidence": [
          {
            "description": "A process creates a named pipe or is launched with a command-line argument that contains a name matching a known malicious mutex or pipe from threat intelligence.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 17",
              "Sysmon Event ID 18"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers",
            "action": [
              "Symbolic: Create a search that matches the `PipeName` field from Sysmon Event IDs 17 (Pipe Created) and 18 (Pipe Connected), and the `CommandLine` field from Windows Event ID 4688, against a threat intelligence list of known malicious mutex and pipe names. Alert on any direct match.",
              "Statistical: For each unique malicious pipe/mutex name from threat intelligence that is detected, count the number of distinct hosts on which it appears per hour. Alert if this count exceeds a statistical threshold (e.g., 95th percentile of historical counts for any single indicator) to identify widespread campaign activity.",
              "Machine Learning: Train a classification model (e.g., XGBoost) on Sysmon and Windows process events. Use features like `ProcessName`, `ParentProcessName`, `ImagePath`, presence of command-line arguments, and a binary feature indicating if the `PipeName` or `CommandLine` matches a known malicious indicator. Use the model to predict the probability that the event is malicious, flagging high-probability events for review."
            ]
          },
          {
            "description": "A process executes and terminates in an abnormally short duration (e.g., less than 2 seconds), particularly when launched from a common staging directory, which is indicative of a 'check-and-exit' mutex behavior.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4689",
              "Sysmon Event ID 1",
              "Sysmon Event ID 5"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Correlate process creation events (Sysmon Event ID 1) with process termination events (Sysmon Event ID 5) using the `ProcessGuid`. Alert if the calculated duration is less than 2 seconds and the `Image` path points to a high-risk directory (e.g., `%TEMP%`, `%APPDATA%`, `C:\\Users\\Public`).",
              "Statistical: For each unique `Image` path, calculate the historical distribution (e.g., 5th percentile) of execution durations by correlating start (Sysmon Event ID 1) and stop (Sysmon Event ID 5) events. Flag any new process instance whose duration falls below this established low-percentile baseline for that specific executable.",
              "Machine Learning: Deploy an anomaly detection model (e.g., Isolation Forest) trained on features including `execution_duration`, `Image` path, `ParentImage` path, and `User`. The model will identify rare combinations of these features, such as an uncommon process running from a temporary directory with an extremely short lifespan, which may not be flagged by simpler statistical rules."
            ]
          },
          {
            "description": "A process, whose image path is not on an allowlist of known security products, creates a named pipe with a name used by a legitimate security tool (e.g., EDR, AV) to evade detection.",
            "data_sources": [
              "Sysmon Event ID 17",
              "Sysmon Event ID 18",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints and servers with deployed security solutions (EDR, AV)",
            "action": [
              "Symbolic: Maintain an allowlist of legitimate security tool binary paths and a watchlist of their corresponding named pipe names. Create a rule that alerts when a `PipeName` from the watchlist is created (Sysmon Event ID 17) by a process whose `Image` path is not on the security tool allowlist.",
              "Statistical: For each named pipe on the security tool watchlist, build a historical baseline of the set of `Image` paths that legitimately create it. Alert when a new `Image` path (i.e., a process with a historical creation frequency of zero for that pipe) creates a pipe from the watchlist.",
              "Machine Learning: Train a binary classification model (e.g., Logistic Regression) to distinguish between legitimate and suspicious access to security tool pipes. Features should include `Image` path, `ParentImage` path, `User`, `CommandLine`, and the `PipeName` being accessed. The model will score each access event, allowing analysts to prioritize the most suspicious interactions."
            ]
          },
          {
            "description": "A process creates a file in a common staging directory (e.g., /tmp, %TEMP%) and, within a short time window, the same process initiates an outbound network connection. This sequence suggests the use of a file lock as a mutex mechanism before C2 communication.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Common staging directories (%TEMP%, %APPDATA%, C:\\Users\\Public, /tmp, /var/tmp), Network Egress Points",
            "action": [
              "Symbolic: Correlate file creation events in staging directories (Sysmon Event ID 11) with subsequent network connection events (Sysmon Event ID 3 or Zeek conn.log) on the same host within a 5-second window. Alert if the destination IP is on a threat intelligence blocklist or is not on an organizational allowlist of approved destinations.",
              "Statistical: For all filenames created in staging directories (from Sysmon Event ID 11), calculate the Shannon entropy. Flag files with entropy scores in the top 5% (95th percentile) of all created files in those locations. If the process that created a high-entropy file also initiates an outbound network connection (Sysmon Event ID 3) to a destination with a low reputation score, elevate the event's risk.",
              "Machine Learning: Apply a clustering algorithm (e.g., DBSCAN) to events that combine file and network features. The feature set should include `TargetFilename` path, `filename_entropy`, `DestinationIp`, `DestinationPort`, and `sent_bytes` (from Zeek conn.log or Sysmon Event ID 3). Identify and investigate clusters that form around high-entropy filenames and network connections to non-standard ports or uncategorized IP addresses."
            ]
          },
          {
            "description": "A process creates a named pipe with a name that appears algorithmically generated, indicated by high Shannon entropy or a structure matching common patterns like GUIDs.",
            "data_sources": [
              "Sysmon Event ID 17",
              "Sysmon Event ID 18",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Deploy regular expressions to search the `PipeName` field in Sysmon Event IDs 17 and 18, and the `CommandLine` in Windows Event ID 4688. Search for patterns indicative of dynamic generation, such as GUIDs (`{[0-9A-F]{8}-([0-9A-F]{4}-){3}[0-9A-F]{12}}`) or long, random-looking alphanumeric strings (`[a-zA-Z0-9]{20,}`).",
              "Statistical: For each `Image` path, baseline the typical Shannon entropy of the pipe names it creates. Alert when a process creates a pipe whose name has an entropy score that is a significant outlier (e.g., greater than 3 standard deviations above the mean) for that specific `Image` path.",
              "Machine Learning: Train a character-level Long Short-Term Memory (LSTM) autoencoder on a large corpus of legitimate pipe names from the environment. Use the model to calculate the reconstruction error for all new pipe names observed in Sysmon Event ID 17. A high reconstruction error indicates the name is anomalous and likely algorithmically generated."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]