[
  {
    "information_requirement": "Has the adversary encrypted data to impact system availability? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1486",
        "name": "Data Encrypted for Impact",
        "evidence": [
          {
            "description": "A process execution event is observed where the process hash matches a known ransomware binary, or a file creation event is observed for a file with a name or extension matching known ransomware patterns (e.g., ransom notes, encrypted file extensions).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4663",
              "Windows Event ID 11 (Sysmon)",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All endpoints, User workstations, File servers, Domain Controllers, Web servers",
            "action": [
              "Symbolic: Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) and file transfer logs (Zeek files.log) for matches against a threat intelligence feed of known ransomware file hashes. Separately, query file creation logs (Windows Event ID 4663, Sysmon Event ID 11) for file names matching common ransom note patterns (e.g., 'DECRYPT_INSTRUCTIONS.txt', 'RECOVER_FILES.html') or appended file extensions associated with ransomware families (e.g., '.lockbit', '.conti', '.crypt', '.zepto'). Trigger a high-severity alert for any match.",
              "Statistical: For file creation events (Sysmon Event ID 11, Windows Event ID 4663), calculate the Shannon entropy of filenames created by a single process within a 1-minute sliding window. Establish a baseline of typical filename entropy for common processes (e.g., svchost.exe, explorer.exe). Generate an alert when a process exhibits a filename entropy score that exceeds the 99th percentile of its historical baseline or a global high-watermark, suggesting randomized naming conventions used by some ransomware.",
              "Machine Learning: Train a Random Forest or Gradient Boosting classification model using features extracted from process creation events (Sysmon Event ID 1). Key features should include: parent process name, command-line argument length and entropy, PE header information, file hash reputation from threat intelligence, and process name characteristics (length, entropy). The model's purpose is to classify each process execution as benign or malicious (ransomware). Deploy the model to score new processes in near real-time and alert on high-probability classifications."
            ]
          },
          {
            "description": "A process executes commands to delete Volume Shadow Copies, disable Windows recovery mode, or clear system/security event logs, and is followed within a 10-minute window by a rate of file modification or creation events on the same host that is at least 3 standard deviations above the established baseline.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4663",
              "Windows Event ID 11 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (e.g., database, application), Domain Controllers, Backup servers, Administrator workstations",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process creation event (Windows Event ID 4688, Sysmon Event ID 1) containing command lines like `vssadmin.exe delete shadows`, `wbadmin.exe delete catalog`, `bcdedit.exe /set {default} recoveryenabled No`, or `wevtutil.exe cl Security` is observed from a host, and is followed within 10 minutes by more than 500 file write or create events (Windows Event ID 4663, Sysmon Event ID 11) from that same host.",
              "Statistical: For each host, establish a 30-day rolling baseline of hourly file write/create operations (count of Windows Event ID 4663/Sysmon Event ID 11). Monitor for the execution of recovery-disabling commands as defined in the symbolic action. If such a command is detected, monitor the host's file operation count for the next hour. Generate a high-severity alert if the file operation count exceeds 4 standard deviations above the host's established hourly baseline for that day of the week and time of day.",
              "Machine Learning: Implement a sequence analysis model, such as a Hidden Markov Model or an LSTM-based autoencoder, trained on sequences of process command lines from Sysmon Event ID 1 logs. Normal operational sequences (e.g., software installation, patching) are learned by the model. An alert is generated when a low-probability sequence is observed, such as the execution of `vssadmin.exe` or `bcdedit.exe` followed by an unknown or high I/O process, indicating a deviation from normal administrative behavior."
            ]
          },
          {
            "description": "A single, non-whitelisted user-land process generates a count of file write, rename, or creation operations exceeding 500 events in a 1-minute window, targeting a diverse set of file extensions commonly associated with user data (e.g., .docx, .pdf, .jpg).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 11 (Sysmon)",
              "Windows Event ID 23 (Sysmon)",
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User home directories, Shared network drives, Cloud storage synchronized folders (e.g., OneDrive, Dropbox), Document management system repositories",
            "action": [
              "Symbolic: Create a rule that triggers if a single process (identified by Process GUID in Sysmon or Process ID in Windows Events) performs more than 500 file write or create operations (Windows Event ID 4663, Sysmon Event ID 11) in a 1-minute window on files with extensions like .docx, .xlsx, .pdf, .jpg, .zip, .sql, .vmdk. Maintain and apply an explicit whitelist of known-good processes (e.g., backup agents, system indexers, software installers) to reduce false positives.",
              "Statistical: For each host, aggregate file modification events (Sysmon Event ID 11, Windows Event ID 4663) by process name and calculate the number of unique file extensions modified per minute. Establish a 30-day baseline for each process. Alert if a process modifies a number of unique file extensions that is more than 3 standard deviations above its normal behavior, indicating indiscriminate file targeting characteristic of ransomware.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., Seasonal-ARIMA or an LSTM autoencoder) for each host, using the rate of file modification events (Windows Event ID 4663, Sysmon Event ID 11) per minute as the input variable. The model will learn the normal rhythm of file I/O for that specific host. An alert is generated when the observed file modification rate sharply deviates from the forecasted range, indicating a sudden, high-volume file I/O burst typical of an encryption routine."
            ]
          },
          {
            "description": "A single source host initiates SMB file write or rename operations on more than 10 distinct destination hosts within a 5-minute window, indicating lateral movement and encryption across network shares.",
            "data_sources": [
              "Windows Event ID 5145",
              "Zeek smb_files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, Network Attached Storage (NAS) devices, SMB/CIFS shares",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers when a single source IP (`id.orig_h` in Zeek logs) is observed performing `SMB::FILE_WRITE` or `SMB::FILE_RENAME` actions (`action` field in `smb_files.log`) on more than 10 distinct destination IPs (`id.resp_h`) within a 5-minute window. This indicates a single host is rapidly encrypting files across multiple servers.",
              "Statistical: For each source host, create a 30-day rolling baseline of the number of distinct network shares it successfully writes to per hour (using `Share Name` from Windows Event ID 5145 or destination IP from Zeek `smb_files.log`). Alert when a host accesses and writes to a number of unique shares that exceeds the 98th percentile of its own historical behavior or the global 99th percentile across all similar hosts (e.g., all workstations).",
              "Machine Learning: Apply a graph-based anomaly detection algorithm to SMB connection data (Zeek conn.log and smb_files.log). Model hosts as nodes and SMB write/rename operations as directed edges. Normal activity forms stable community structures within the graph. An anomaly is detected when a node (host) rapidly creates a large number of new edges to nodes outside its typical community, a pattern characteristic of a ransomware worm spreading across the network. The PageRank algorithm can be used to identify nodes that suddenly become highly influential in terms of write activity."
            ]
          },
          {
            "description": "A file modification, rename, or deletion operation is logged for a file or directory explicitly designated as a 'honeyfile' or 'canary file', which has no legitimate business purpose and is monitored with high-sensitivity auditing.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 11 (Sysmon)",
              "Windows Event ID 23 (Sysmon)",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Designated canary file directories on high-value file shares, Hidden directories in user profiles, Root directories of mapped network drives, Bait directories with enticing names like 'Executive Salaries' or 'Passwords' on file servers",
            "action": [
              "Symbolic: Deploy canary files (e.g., `Financial_Projections_Q4.xlsx`) with specific System Access Control Lists (SACLs) to generate audit events (Windows Event ID 4663) upon any access attempt. Create a critical, zero-tolerance SIEM alert that triggers immediately upon the generation of Event ID 4663 for any of these specific file paths. The alert must trigger automated host isolation and include the source host, user, and process name.",
              "Statistical: While the primary detection is symbolic, statistically monitor read access attempts (ReadData/ListDirectory access masks in Event ID 4663) to the directories containing canary files. A sudden increase in read attempts from a single process, exceeding a low threshold (e.g., >10 reads in one minute) without any modification, can serve as a statistical early warning indicator of a reconnaissance phase before encryption begins.",
              "Machine Learning: Use the high-fidelity alert from a canary file modification as a definitive label (`is_ransomware=1`) for the associated process, host, and user. Feed this confirmed malicious event into other supervised machine learning models (e.g., the process classifier from Evidence 1) as a real-time training sample to improve their accuracy. This creates a feedback loop where a definitive detection helps refine and retrain behavioral models."
            ]
          },
          {
            "description": "A process modifies the desktop wallpaper, or a text or HTML file with a name consistent with a ransom note is created in multiple user-accessible locations.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4657",
              "Windows Event ID 11 (Sysmon)",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User desktops, Public and All Users directories, Web server root directories, Shared network drive root directories",
            "action": [
              "Symbolic: Create a SIEM rule to detect command-line execution (Sysmon Event ID 1) of `reg.exe add 'HKCU\\Control Panel\\Desktop' /v Wallpaper` or direct modification of that registry key (Windows Event ID 4657). Also, search for the creation (Sysmon Event ID 11, Windows Event ID 4663) of files with names matching patterns like `*DECRYPT*.*`, `*RECOVER*.*`, `*README.txt` in common directories like `C:\\Users\\*\\Desktop`.",
              "Statistical: For each host, baseline the rate of file creations per minute in top-level directories (e.g., C:\\, Desktop, Documents). An anomalous spike in the creation of `.txt` or `.html` files across many directories simultaneously by a single process, exceeding 3 standard deviations of the baseline, can indicate ransom note 'spamming'.",
              "Machine Learning: Train a Naive Bayes or similar text classification model to identify ransom notes. Scrape known ransom notes from public sources to build a corpus. The model should score the content of newly created `.txt` and `.html` files based on the frequency of keywords like 'encrypt', 'bitcoin', 'decrypt', 'private key', and 'payment'. A high score indicates a likely ransom note."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]