[
  {
    "information_requirement": "Has the adversary modified Group Policy for privilege escalation?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1484.001",
        "name": "Group Policy Modification",
        "evidence": [
          {
            "description": "A file creation or modification event occurs within a GPO policy directory on the SYSVOL share (e.g., ...\\Policies\\{GUID}\\...), and the file's hash matches an entry on a known-bad threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller SYSVOL Share (\\\\<DOMAIN>\\SYSVOL\\<DOMAIN>\\Policies\\*\\)",
            "action": [
              "Monitor for file write events (Windows Event ID 4663) where the object name contains a SYSVOL policy path. For each written file, compute its hash and query a threat intelligence feed. Alert on any matched hash.",
              "For each file written to the SYSVOL share (Windows Event ID 4663), calculate its Shannon entropy. Establish a baseline entropy distribution for legitimate policy and script files. Alert when a new file's entropy score exceeds a high percentile threshold (e.g., 95th percentile) of the baseline.",
              "Apply a file-type classification model, trained on features like file extension, entropy, and string patterns from known SYSVOL files, to all new files written to the share (Windows Event ID 4663). Alert when a file is classified as an unexpected type, such as 'executable' or 'obfuscated script'."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) is observed with a parent process of `gpscript.exe` or `gpupdate.exe`, and the process command line includes syntax for local privilege escalation (e.g., adding a user to 'Administrators').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Domain-joined Endpoints and Servers",
            "action": [
              "Monitor process creation events (Windows Event ID 4688) where the parent process name is `gpscript.exe` or `gpupdate.exe`. Alert if the command line contains patterns indicative of privilege escalation, such as `net localgroup administrators /add` or `sc.exe create`.",
              "For processes spawned by GPO scripts (parent `gpscript.exe` or `gpupdate.exe`), calculate the historical frequency of each unique command line pattern. Alert when a command line pattern is observed that is statistically rare (e.g., in the bottom 1st percentile of frequency) or has never been seen before.",
              "Apply a pre-trained NLP classification model to the command lines of processes spawned by GPO scripts. Alert on any command line classified with a high probability of 'Privilege Escalation' intent."
            ]
          },
          {
            "description": "A directory service object modification (Windows Event ID 5136) for a `groupPolicyContainer` object shows a change to the `nTSecurityDescriptor` attribute, granting write permissions (e.g., `WriteDacl`, `GenericAll`, `GenericWrite`) to a non-administrative user or group.",
            "data_sources": [
              "Windows Event ID 5136"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers",
            "action": [
              "Monitor for directory service modification events (Windows Event ID 5136) where the object class is `groupPolicyContainer`. Parse the security descriptor changes and alert if write-related permissions are granted to any subject (user/group) not on a pre-approved GPO administrators allowlist.",
              "Maintain a historical baseline of which subjects (users/groups) modify which GPOs. For each modification event (Event ID 5136), calculate a rarity score for the (Subject, GPO) pair. Alert if the score exceeds a dynamic threshold, indicating a user is modifying a GPO they do not typically manage.",
              "Employ a clustering algorithm (e.g., K-Means) to group users based on their GPO modification behaviors (e.g., frequency, types of GPOs modified). Alert when a user's activity causes them to shift to a different cluster (e.g., a standard user moving to an admin cluster) or form a new outlier cluster."
            ]
          },
          {
            "description": "A GPO modification (Windows Event ID 5136) is followed within a short time window by a user rights assignment (Windows Event ID 4704) on endpoints, granting a high-impact privilege (e.g., `SeEnableDelegationPrivilege`, `SeTcbPrivilege`) linked to that GPO.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4704",
              "Windows Event ID 4672"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, All Domain-joined Endpoints and Servers",
            "action": [
              "Correlate GPO modification events (Event ID 5136) with subsequent user right assignment events (Event ID 4704) occurring within a defined time window (e.g., 2 hours). Alert if the assigned privilege is on a watchlist of sensitive privileges, and the GPO name from Event 4704 matches the modified GPO from Event 5136.",
              "For each sensitive privilege, baseline which GPOs are authorized to assign it. Alert if a user right assignment event (Event ID 4704) shows an unauthorized GPO granting a sensitive privilege, or if the number of endpoints receiving the privilege assignment from any single GPO exceeds 3 standard deviations above the historical mean.",
              "Develop a time-series model (e.g., SARIMA) to forecast the expected number of sensitive privilege assignments (Event ID 4704) across the network. Alert if the observed count significantly exceeds the model's prediction interval, especially if the spike is temporally correlated with a GPO modification event (Event ID 5136)."
            ]
          },
          {
            "description": "A new GPO is created (Windows Event ID 5137), followed by the creation of a new scheduled task (Windows Event ID 4698) or service (Windows Event ID 7045) on endpoints, configured to execute from a suspicious path or with SYSTEM privileges.",
            "data_sources": [
              "Windows Event ID 5137",
              "Windows Event ID 4698",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, All Domain-joined Endpoints and Servers",
            "action": [
              "Correlate GPO creation events (Event ID 5137) with subsequent scheduled task (Event ID 4698) or service creation (Event ID 7045) events. Alert if the task/service is configured to run as `NT AUTHORITY\\SYSTEM` and the executable path is in a non-standard directory like `%APPDATA%` or `%TEMP%`.",
              "Baseline the rate of new scheduled task and service creation per Organizational Unit (OU). Following a GPO creation event (Event ID 5137), monitor for a statistically significant increase (e.g., >99th percentile of historical rates) in task or service creation within the OUs affected by the new GPO.",
              "Apply an anomaly detection algorithm (e.g., Isolation Forest) to the properties of newly created scheduled tasks and services (e.g., run-as account, executable path, command arguments, trigger type). Alert on any task or service flagged as an outlier, particularly if the anomaly appears on multiple machines shortly after a GPO update."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Has the adversary modified Group Policy for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1484.001",
        "name": "Group Policy Modification",
        "evidence": [
          {
            "description": "A GPO policy file (e.g., `registry.pol`, `GptTmpl.inf`) within a SYSVOL policy directory is modified to include settings known to disable or degrade security controls, such as disabling Windows Defender or modifying audit policy.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5136"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller SYSVOL Share (\\\\<DOMAIN>\\SYSVOL\\<DOMAIN>\\Policies\\*\\)",
            "action": [
              "Monitor file modification events (Windows Event ID 4663) for `registry.pol` and `GptTmpl.inf` files in SYSVOL policy paths. Scan the file content for a watchlist of strings corresponding to registry keys or security settings that disable security tools (e.g., `DisableAntiSpyware`, `EnableLsaAuditing`). Alert on any match.",
              "Establish a 'golden image' baseline for the settings in critical security GPOs. Upon a modification event (Event ID 5136), perform a diff between the new policy file and the baseline. Alert if the number of changed settings exceeds a statistical threshold or if the frequency of modifications for that GPO is anomalous.",
              "Apply a trained classification model to score GPO file changes for maliciousness. Use features like the specific setting changed, the user performing the change, and the context of other recent activities. Alert on any modification event (Event ID 5136 or 4663) that receives a high-risk score from the model."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) on an endpoint, initiated by a GPO script (`gpscript.exe`), contains command-line arguments to disable security services, clear event logs, or modify firewall rules.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Domain-joined Endpoints and Servers",
            "action": [
              "Monitor process creation events (Windows Event ID 4688) where the parent process is `gpscript.exe`. Alert if the command line contains patterns for defense evasion, such as `netsh advfirewall set`, `wevtutil.exe cl`, `sc.exe config ... start= disabled`, or `Set-MpPreference -Disable`.",
              "For processes spawned by GPO scripts, calculate the historical frequency of command-line utilities used (e.g., `netsh.exe`, `wevtutil.exe`). Alert if a rarely used utility is executed or if the usage of a known defense evasion utility spikes above its 95th percentile across the environment.",
              "Apply an unsupervised learning model (e.g., DBSCAN) to the command-line arguments of GPO-spawned processes to identify clusters of normal administrative activity. Alert when a new process is flagged as a noise point or forms a new, small cluster, indicating novel and potentially malicious behavior."
            ]
          },
          {
            "description": "A GPO file (e.g., GptTmpl.inf) or registry policy file (registry.pol) is modified, and the content change corresponds to the weakening of a specific security control, such as disabling the Windows Firewall or lowering the UAC level.",
            "data_sources": [
              "Windows Event ID 5136",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, Domain Controller SYSVOL Share (\\\\<DOMAIN>\\SYSVOL\\<DOMAIN>\\Policies\\*\\)",
            "action": [
              "Define a 'Golden GPO' template for critical security policies. Following a GPO file modification (Event ID 4663), programmatically compare the changed GPO's settings against the template. Alert on any deviation that represents a security downgrade (e.g., `EnableFirewall` changing from `1` to `0`).",
              "Track the historical values of critical security settings within GPOs. For a given setting (e.g., UAC `ConsentPromptBehaviorAdmin`), calculate the historical distribution of its values. Alert if a GPO modification changes a setting to a statistically rare or historically unseen insecure value.",
              "Use a regression model to predict a 'security score' for each GPO based on its settings, trained on manually audited GPOs. After a modification (Event ID 5136), re-calculate the score and alert if there is a statistically significant drop in the predicted score."
            ]
          },
          {
            "description": "Following a GPO modification (Windows Event ID 5136), a sustained and statistically significant decrease in the ingestion volume of a specific log type (e.g., Windows Security, Sysmon, PowerShell) is observed from the population of hosts affected by that GPO.",
            "data_sources": [
              "Windows Event ID 5136",
              "SIEM Log Ingestion Metrics"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM / Log Aggregator Platform, Active Directory Domain Controllers",
            "action": [
              "Create a correlation rule that links a GPO modification event (Event ID 5136) to a subsequent 'log source silent' alert for a host group affected by the GPO. A 'log source silent' alert triggers when a host group fails to send logs for a predefined period (e.g., > 1 hour).",
              "For each critical log source and per Organizational Unit, establish a baseline of log volume (events per minute/hour). After a GPO modification event, alert if the log volume from an affected OU drops more than 3 standard deviations below the baseline for a sustained period (e.g., 30 minutes).",
              "Implement a time-series forecasting model (e.g., Prophet, ARIMA) for log ingestion volume from critical host groups. Use GPO modification events (Event ID 5136) as an external regressor. Alert if the actual log volume falls significantly below the model's forecasted lower confidence bound post-modification."
            ]
          },
          {
            "description": "A file write or modification event (Windows Event ID 4663, 5145) on a GPO file path within SYSVOL is initiated by a non-standard process (not `mmc.exe` or `dfsrcs.exe`) or from a source host that is not a designated administrative workstation or Domain Controller.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller SYSVOL Share (\\\\<DOMAIN>\\SYSVOL\\), Administrator Workstations",
            "action": [
              "Monitor for file write events (Event ID 4663) on SYSVOL policy paths. Correlate with the file share access event (Event ID 5145) to get the source process and IP. Alert if the process name is not on an allowlist (e.g., `mmc.exe`, `dfsrcs.exe`, `powershell_ise.exe`) OR if the source IP does not belong to an approved administrative network zone.",
              "Profile the (Process Name, Source Hostname, User) tuples that modify files in SYSVOL. Calculate the frequency of each tuple. Alert when a tuple with a frequency in the bottom 1st percentile performs a write operation, indicating a highly unusual access pattern.",
              "Apply a one-class SVM model trained on legitimate SYSVOL write events (features: process name, source subnet, user account, time of day). Score new write events in real-time and alert on any event flagged as an anomaly by the model."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]