[
  {
    "information_requirement": "Has the adversary impacted data availability or integrity by deleting cloud storage data?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1485.001",
        "name": "Lifecycle-Triggered Deletion",
        "evidence": [
          {
            "description": "A cloud audit log (e.g., AWS CloudTrail) records an API call that modifies or creates a storage lifecycle policy with an immediate or short-term (e.g., 1 day) object deletion rule.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Log",
              "GCP Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Provider Management Plane, Log Aggregation Systems (SIEM)",
            "action": [
              "Symbolic: Create a detection rule for API calls such as 'PutBucketLifecycleConfiguration' (AWS), 'Set-AzStorageBlobInventoryPolicy' (Azure), or 'storage.buckets.patch' (GCP) where request parameters specify a lifecycle rule with an action of 'Delete' or 'Expiration' and a period of 1 day or less.",
              "Statistical: Profile the frequency of lifecycle policy modifications per user and role. Alert if a user who rarely performs this action (e.g., frequency is in the bottom 10th percentile) suddenly executes it. Separately, track the source IP geolocation for these API calls and alert if it originates from a country not seen in the last 90 days for that user account.",
              "ML: Train a classification model (e.g., Random Forest) on cloud audit log events to distinguish between benign administrative changes and malicious activity. Use features like user identity, source IP, time of day, user agent, and specific API parameters (e.g., expiration days, rule status 'Enabled'). Flag any lifecycle modification events with a high maliciousness score."
            ]
          },
          {
            "description": "A Windows Event ID 4688 log shows the execution of a cloud command-line interface (CLI) process (e.g., 'aws.exe') with arguments that configure a storage lifecycle policy with an expiration period of 1 day or less.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints of developers and cloud administrators, CI/CD pipeline servers, Virtual machine instances with cloud SDKs installed",
            "action": [
              "Symbolic: Create a detection rule for Windows Event ID 4688 events where `ProcessName` is 'aws.exe', 'az.exe', or 'gcloud.exe' and the `CommandLine` contains keywords like 'put-bucket-lifecycle-configuration', 's3api', 'lifecycle-configuration' AND parameters indicating immediate deletion (e.g., 'Days:1', 'Days:0', '\"Status\": \"Enabled\"').",
              "Statistical: For each user, establish a baseline of typical 'Days' values used in their historical lifecycle configurations. Alert if a user sets an 'Expiration' day value that falls into the bottom 1st percentile of all historically set values organization-wide, or if the value is more than two standard deviations below the user's own historical average.",
              "ML: Use an anomaly detection model (e.g., Isolation Forest) on a feature set derived from CLI executions: {user, source_host, command_type, is_off_hours, lifecycle_day_value}. Train the model on known-good administrative activity to identify executions that are outliers across multiple dimensions, such as a non-administrator account setting an unusually short lifecycle."
            ]
          },
          {
            "description": "A sequence of host-based events within a short time window (e.g., 30 minutes) shows a cloud CLI execution for storage reconnaissance (e.g., 'aws s3 ls') immediately followed by a CLI execution that modifies a lifecycle policy.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints of developers and cloud administrators, Network Egress Points (Firewalls/Proxies), Log Aggregation Systems (SIEM)",
            "action": [
              "Symbolic: Define a stateful detection rule that triggers when a specific source host executes a cloud storage 'list' or 'get' command (e.g., 'aws s3 ls', 'aws s3api get-bucket-lifecycle-configuration') followed within 30 minutes by a 'put-bucket-lifecycle-configuration' command.",
              "Statistical: Model command sequences using a Markov chain for each user role (e.g., developer, admin). Calculate the transition probability between reconnaissance commands ('list', 'get') and modification commands ('put-lifecycle'). Alert if a sequence with a transition probability below a defined threshold (e.g., less than 5%) occurs, indicating a deviation from normal administrative workflows.",
              "ML: Use a sequence-based anomaly detection model like a Recurrent Neural Network (RNN) or LSTM trained on sequences of CLI commands per user session. The model learns normal administrative 'sentences' of commands and flags sequences that are grammatically unusual or highly improbable, such as immediate reconnaissance followed by destructive modification without intervening steps."
            ]
          },
          {
            "description": "Network flow data (Zeek conn.log) shows a statistically significant drop in traffic volume to a known cloud storage destination, for which there is no corresponding change control or maintenance window, potentially indicating that data is no longer being written.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls/Proxies), Servers responsible for backups and log shipping, Application servers writing to cloud storage",
            "action": [
              "Symbolic: For critical backup processes, define a 'heartbeat' rule. If no connection is seen in Zeek conn.log from a known backup server to its cloud storage FQDN for a predefined interval (e.g., greater than 12 hours), generate a high-priority alert to investigate potential data flow interruption.",
              "Statistical: For each critical data flow to a cloud bucket, calculate a rolling 30-day baseline of traffic volume (bytes_out) per hour. Use descriptive statistics to define a normal range (e.g., mean +/- 3 standard deviations). Alert if the hourly traffic volume drops below this range for a sustained period (e.g., 3 consecutive hours).",
              "ML: Implement a time-series forecasting model (e.g., ARIMA or Prophet) for each major data flow to cloud storage. The model will predict the expected traffic volume for the next hour. Generate an alert if the actual observed traffic falls significantly outside the model's prediction confidence interval, indicating an unpredicted cessation of data flow."
            ]
          },
          {
            "description": "A network connection to a cloud API endpoint originates from a host not on a predefined list of administrative systems, or the connection occurs outside of that user's established working hours.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "AWS CloudTrail"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls/Proxies), Domain Controllers and Authentication Servers, Endpoints of developers and cloud administrators",
            "action": [
              "Symbolic: Maintain an explicit allowlist of host IP addresses and user accounts authorized to connect to cloud management API endpoints. Monitor Zeek conn.log and cloud audit logs for any connections to these endpoints originating from IPs or users not on the list and generate an alert.",
              "Statistical: For each administrative user, create a baseline profile of API connection times using Windows Event ID 4624 login times and Zeek conn.log timestamps. Use percentile analysis to define 'normal' working hours (e.g., 5th to 95th percentile of connection times). Alert if a connection to a management API occurs outside this established time window for that specific user.",
              "ML: Use a clustering algorithm (e.g., DBSCAN) on connection data features: {source_ip, destination_fqdn, user_agent, time_of_day, bytes_out}. This can automatically group normal administrative connection patterns. Any connection that does not fall into a known cluster is flagged as an anomaly, potentially indicating unauthorized activity from a new or compromised host."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]