[
  {
    "information_requirement": "Is an adversary actively destroying or overwriting data on critical systems to disrupt operations?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1485",
        "name": "Data Destruction",
        "evidence": [
          {
            "description": "A process is executed where the executable file's cryptographic hash (e.g., SHA256) matches a known data destruction tool or malware variant from a threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "EDR Process Creation Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, File Servers, Database Servers, Critical Application Servers, User Workstations",
            "action": [
              "For each process creation event (Windows Event ID 4688), calculate the file hash of the new process image. Compare the hash against a curated threat intelligence list of known data wiper malware (e.g., WhisperGate, CaddyWiper, NotPetya). Trigger a high-severity alert upon any match.",
              "Profile the rarity of process hashes across the enterprise. A process hash that is new or has been seen on fewer than 0.1% of endpoints and also matches a YARA rule for destructive malware families should have its risk score significantly increased. Alert if the combined risk score exceeds a dynamic threshold.",
              "Utilize a pre-trained machine learning classifier (e.g., a gradient-boosted model) that uses file metadata (PE header info, imports, entropy, size) and hash reputation as features to predict if a newly observed executable is malicious. A classification of 'wiper' or 'destructive' with a confidence score > 0.9 should trigger an automated incident response workflow."
            ]
          },
          {
            "description": "A legitimate system utility (e.g., sdelete.exe, cipher.exe, format.com) is executed with command-line arguments indicative of irreversible data wiping or disk formatting.",
            "data_sources": [
              "Windows Event ID 4688",
              "EDR Process Creation Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, File Servers, Critical System Partitions, User Workstations",
            "action": [
              "Monitor process creation events (Windows Event ID 4688) for specific command-line patterns using regular expressions. Alert on exact matches for destructive commands, such as 'sdelete.exe -p', 'cipher.exe /w:', 'format.com .* /p:', and 'wevtutil.exe cl'.",
              "Establish a baseline for command-line arguments used with common utilities. Calculate the frequency of specific argument combinations. A command execution whose argument combination falls below the 1st percentile of historical usage (i.e., is extremely rare), especially when executed by a non-administrative user or a web server process, should be flagged as anomalous.",
              "Train a sequence-based model (e.g., an LSTM) on historical command-line execution data to learn normal sequences of commands and arguments. An execution sequence that has a high anomaly score from the model, indicating a deviation from learned benign patterns, should be flagged for investigation."
            ]
          },
          {
            "description": "A single user or process generates a volume of file deletion or modification events on a host or network share that is a statistically significant outlier compared to its established baseline.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek files.log",
              "File Integrity Monitoring (FIM) Agent Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network File Shares (SMB/NFS), Document Management Systems, User Profile Directories, Source Code Repositories",
            "action": [
              "Create a rule that triggers an alert if a single Process ID generates more than 1000 file deletion events (Windows Event ID 4663 with Accesses containing 'DELETE') within a 60-second window on a critical file server.",
              "For each user and host, calculate a rolling 30-day baseline (mean and standard deviation) of file modifications or deletions per minute. Generate an alert when the current rate exceeds 4 standard deviations above the mean for a sustained period of more than 3 minutes.",
              "Apply a time-series anomaly detection model (e.g., Seasonal-ARIMA) to the stream of file operation counts per critical NAI. The model will learn the normal daily and weekly seasonality of file activity. An observation that falls outside the model's predicted confidence interval indicates an anomalous spike and should be investigated."
            ]
          },
          {
            "description": "A large number of files are modified in a short period, and the resulting files exhibit abnormally low or uniform Shannon entropy, indicating they have been overwritten with random or null data.",
            "data_sources": [
              "File Integrity Monitoring (FIM) Agent Logs",
              "EDR Telemetry",
              "Zeek files.log",
              "Zeek file_entropy.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Web Servers, File Servers, Database Servers",
            "action": [
              "Upon detection of a high-volume file write event, trigger a script to sample a small number of the modified files. If the file content consists entirely of a repeating byte (e.g., 0x00) or matches a known wiper's overwrite pattern (e.g., a specific image file), trigger a high-severity alert.",
              "For sampled files from a mass-modification event, calculate the Shannon entropy of the file content. Establish a baseline entropy range for common file types (e.g., docx: 7.5-7.9, jpg: 7.2-7.8). If the average entropy of the modified files falls significantly outside the expected range (e.g., < 2.0 for null bytes or > 7.99 for random data), flag the event as a wiping attempt.",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN) on file features including file type, size, and content entropy. Normal file operations will form distinct clusters. A sudden burst of new files that form a new, distant cluster characterized by low or uniform entropy is a strong indicator of a coordinated data destruction event."
            ]
          },
          {
            "description": "Deletion or modification attempts are made against critical system files, recovery partitions, or Volume Shadow Copies, specifically by non-system processes or using utilities like vssadmin.exe.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System Boot Partitions (EFI), C:\\Windows\\System32\\config\\ (SAM, SYSTEM hives), Volume Shadow Copy Storage Areas",
            "action": [
              "Create a high-priority alert that triggers on any process creation event (Windows Event ID 4688) where the command line contains suspicious arguments for utilities like 'vssadmin.exe delete shadows', 'wbadmin.exe delete catalog -quiet', or 'bcdedit.exe /deletevalue'. Additionally, create an alert for any 'DELETE' access attempt (Windows Event ID 4663) on files in a watchlist of critical OS files (e.g., boot.ini, ntds.dit) originating from a process other than trusted system processes like 'System' or 'lsass.exe'.",
              "Profile the parent-child process relationships for processes that modify critical system files. A process like 'vssadmin.exe' being spawned by an unexpected parent (e.g., 'w3wp.exe') is a statistical anomaly. Score the rarity of the parent-child relationship; a rare pairing involving a destructive command should trigger an alert.",
              "Develop a behavioral model for user accounts based on the types of processes they typically execute. Use a classification algorithm to label each user's activity. If a standard user account, previously classified as 'Business User', suddenly executes a chain of administrative commands (e.g., 'net group \"Domain Admins\"', 'vssadmin.exe delete shadows'), this constitutes a behavioral anomaly detection and should be flagged as a potential account compromise and destructive action."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]