[
  {
    "information_requirement": "Is an adversary attempting to inhibit system recovery capabilities to prevent restoration after an attack?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1490",
        "name": "Inhibit System Recovery",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable's file hash (e.g., SHA256) matches a known hash from a threat intelligence feed specifically categorized as ransomware or a wiper.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All domain-joined Windows endpoints and servers, especially critical application servers and domain controllers.",
            "action": [
              "Symbolic: Continuously monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1). For each new executable, calculate its SHA256 hash. Compare this hash against a curated threat intelligence feed of known malicious file hashes associated with ransomware or wiper malware. Generate a high-severity alert upon any match.",
              "Statistical: For all process creation events, analyze the prevalence of the file hash across the enterprise over a 30-day rolling window. Flag any hash that is extremely rare (e.g., seen on < 0.1% of endpoints) and is not signed by a trusted publisher. Assign a higher risk score if the process is unsigned and rare, indicating a potential custom or newly deployed malicious tool.",
              "Machine Learning: Utilize a supervised classification model (e.g., Gradient Boosting, Random Forest) trained on features extracted from process creation events (e.g., file hash prevalence, parent process, command line length, entropy of process name). Feed real-time process events into the model for scoring; investigate processes that receive a high probability score for being malicious."
            ]
          },
          {
            "description": "A process creation event is observed for a native Windows utility (vssadmin.exe, wmic.exe, wbadmin.exe, bcdedit.exe, diskshadow.exe) containing command-line arguments explicitly used to delete backups or disable recovery features (e.g., 'delete shadows /all', 'shadowcopy delete', 'delete catalog -quiet', 'recoveryenabled no').",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, file servers with Volume Shadow Copy enabled, and Windows servers hosting critical backups.",
            "action": [
              "Symbolic: Create detection rules that monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) for target utilities (vssadmin.exe, etc.). Use regular expressions on the command-line field to match specific malicious argument patterns like /(delete\\s+shadows\\s+\\/all)|(shadowcopy\\s+delete)|(delete\\s+catalog\\s+-quiet)|(recoveryenabled\\s+no)/i. Alert on any match.",
              "Statistical: For each of the target utilities, establish a baseline of normal command-line argument usage by user role (e.g., System Administrator vs. standard user). Calculate the frequency of different command-line patterns. Flag executions that deviate significantly from the established baseline, such as a user who has never run 'vssadmin.exe' before executing 'vssadmin.exe delete shadows', or an execution with a command-line entropy score in the 99th percentile.",
              "Machine Learning: Develop a time-series anomaly detection model for the frequency of these specific command executions across the environment. A sudden, sharp spike in the execution of 'vssadmin.exe delete shadows' across multiple hosts simultaneously, which deviates from the forecasted normal administrative activity, indicates a coordinated attack. Cluster hosts exhibiting this behavior to identify the scope of the incident."
            ]
          },
          {
            "description": "A high volume of file deletion or object access events targeting backup files (e.g., with .bak, .vhd, .vhdx extensions) or Volume Shadow Copy storage areas ('System Volume Information') originating from a single process or user account across one or more systems in a short time frame.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network file shares hosting backups, servers with local backup copies, and the 'System Volume Information' directory on all Windows hosts.",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a single process (linked by Process GUID/ID from Event 4688) generates a high number of file deletion events (Event 4663) for files with extensions like '.bak', '.vhd', '.vhdx', or paths containing 'System Volume Information' within a 1-minute window. Alert if the count exceeds a predefined threshold (e.g., >100 deletions).",
              "Statistical: For each host, establish a baseline of the rate of file deletions (Event 4663) per hour. Use a percentile-based threshold (e.g., 98th percentile) to detect abnormal spikes in deletion activity. Enrich alerts with the parent process name and user account, and assign a higher risk score if the activity occurs outside of business hours or is performed by a non-administrative account.",
              "Machine Learning: Use an unsupervised learning algorithm (e.g., DBSCAN) to cluster hosts based on behavioral features like file deletion rates, processes initiating deletions, and time of day. Identify clusters of hosts that exhibit synchronized, high-volume deletion activity, which is characteristic of a ransomware or wiper attack spreading across the network."
            ]
          },
          {
            "description": "Network connections from non-administrative workstations to hypervisor management interfaces (e.g., vCenter, ESXi) or cloud storage API endpoints, followed by a high volume of DELETE or REMOVE API calls targeting virtual machine snapshots, S3 object versions, or backup policies.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management network segment (vCenter, ESXi hosts), network egress points to public cloud providers (AWS, Azure, GCP), and cloud storage infrastructure (S3 buckets, Azure Blob Storage accounts).",
            "action": [
              "Symbolic: Maintain an allowlist of authorized administrative hosts and backup servers. Monitor Zeek conn.log for any TCP connections to backup infrastructure management ports (e.g., 443, 9443) originating from source IPs not on the authorized list. Generate an alert for any unauthorized connection attempt.",
              "Statistical: For authorized connections to backup APIs (identified in Zeek http.log or from cloud provider logs), profile the distribution of HTTP methods (GET, POST, DELETE). Establish a baseline ratio of destructive (DELETE, PUT with delete policies) vs. non-destructive (GET) calls. Alert when the ratio of destructive calls from a single source IP exceeds a statistical threshold (e.g., > 3 standard deviations above the mean) within a short time window.",
              "Machine Learning: Apply sequence analysis to API call logs for backup management. Train a model (e.g., an LSTM-based autoencoder) on normal administrative sequences (e.g., login -> list snapshots -> logout). Detect anomalous sequences, such as a login followed immediately by a 'delete all snapshots' command without any preceding 'list' or 'get' calls, which strongly indicates malicious intent."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]