[
  {
    "information_requirement": "Is the adversary attempting to disrupt network availability through a Network Denial of Service attack? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1498",
        "name": "Network Denial of Service",
        "evidence": [
          {
            "description": "A connection is established from an external source IP address that matches an entry on a high-confidence threat intelligence feed categorized as 'DDoS', 'botnet', or 'stresser'.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Firewall, Edge Routers, Public-facing server segments",
            "action": [
              "Continuously ingest and update threat intelligence feeds specializing in known DoS/DDoS infrastructure into a reference set. Create a rule that joins inbound traffic source IPs from Zeek conn.log and Windows Event ID 5156 against this reference set. Generate a high-severity alert for any match.",
              "For each source IP that matches a threat feed, calculate the total connection count and byte volume over the last hour. Rank the IPs by connection count and generate a summary report of the top 10 most active sources to prioritize blocking and response efforts.",
              "Train a supervised classification model (e.g., Random Forest) using labeled historical data. Use features from Zeek conn.log (duration, protocol, service, byte counts) and a binary feature indicating if the source IP is on a DoS threat list. Apply the model to new inbound connections to generate a real-time risk score, and alert when the score exceeds a predefined threshold."
            ]
          },
          {
            "description": "An HTTP/S session exhibits characteristics of an application-layer DoS attack, such as a user-agent string matching a known DoS tool, a connection duration exceeding 300 seconds with a data transfer rate below 100 bytes/sec, or an incomplete HTTP request.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Application Load Balancers, API Gateways",
            "action": [
              "Create a ruleset to scan the 'user_agent' field in Zeek http.log for strings matching known DoS tools (e.g., 'Slowloris', 'LOIC', 'RUDY', 'Hulk'). Generate an alert upon an exact match.",
              "For all connections to web ports (80, 443) in Zeek conn.log, calculate the transfer rate as (orig_bytes + resp_bytes) / duration. Establish a baseline for the 5th percentile of transfer rates. Alert on any connection with a duration greater than 300 seconds and a transfer rate below this percentile threshold.",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN) on features from Zeek conn.log and http.log, such as duration, total bytes, request body length, and response body length. Profile normal traffic into distinct clusters. Monitor for and alert on new data points that are identified as outliers or form new, anomalous clusters."
            ]
          },
          {
            "description": "A UDP-based transaction on a service known to be abusable for amplification attacks (e.g., DNS, NTP, CLDAP) shows an amplification factor (response bytes / request bytes) that exceeds 50x, suggesting the host is being used as a reflector.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ntp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public DNS Servers, NTP Servers, Misconfigured Memcached servers, Domain Controllers",
            "action": [
              "For DNS traffic in Zeek dns.log, create a rule to alert on queries of type 'ANY' or requests for large record types (e.g., DNSKEY, RRSIG) that originate from external IP addresses, as these are common methods for DNS amplification attacks.",
              "For each UDP session in Zeek conn.log on common amplification ports (53, 123, 389, 11211), calculate the amplification factor as 'resp_bytes / orig_bytes'. Establish a per-service baseline for the 99th percentile of this factor. Generate an alert when a session's amplification factor exceeds this threshold.",
              "Apply an anomaly detection model like Isolation Forest to UDP session data from Zeek conn.log. Use features such as destination port, amplification factor, packet count, and session duration. Train the model on baseline traffic and use it to identify and alert on sessions that are flagged as anomalies."
            ]
          },
          {
            "description": "A sustained increase in inbound traffic volume (bytes/sec or packets/sec) or new connection rate (connections/sec) to a specific host or service that exceeds dynamically established, time-aware baselines by over 300%.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dstats.log",
              "Windows Event ID 5157"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Choke Points (e.g., firewalls, core switches), Critical Application Servers, Entire Subnets",
            "action": [
              "Define static, high-watermark thresholds for key metrics (e.g., 10,000 connections/sec, 1 Gbps inbound traffic, 5,000 WFP blocks/min) on critical interfaces or servers. Generate a critical alert when these 'circuit breaker' thresholds are breached.",
              "Using Zeek dstats.log or aggregated conn.log data, create rolling time-window baselines (e.g., 5-minute intervals) for traffic volume (bytes, packets) and new connection rates, accounting for seasonality (e.g., hour-of-day, day-of-week). Generate an alert when current traffic exceeds 3 standard deviations above the mean for that time window.",
              "Implement a time-series forecasting model (e.g., ARIMA or Prophet) to predict expected traffic volume for the next 5 minutes. Continuously compare the actual observed traffic volume against the predicted volume and its confidence interval. Generate an alert when the actual traffic persistently exceeds the upper bound of the forecast."
            ]
          },
          {
            "description": "A measurable shift in network traffic characteristics within a 5-minute window, such as a drop in source IP address entropy below 0.5, a sudden spike in connections with SYN-only flags, or a rapid change in the UDP-to-TCP protocol ratio.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway/Firewall, Load Balancers, Any network segment receiving external traffic",
            "action": [
              "Create a rule to alert on unusual or illegitimate TCP flag combinations observed in the Zeek conn.log 'history' field, such as 'ShAD' or a packet with no flags set. These are highly irregular and warrant investigation.",
              "In 5-minute windows, calculate the Shannon entropy of source IP addresses for all inbound traffic. Establish a seasonal baseline (hour-of-day, day-of-week) for this entropy value. Generate an alert if the current entropy value deviates from the baseline by more than 3 standard deviations.",
              "Aggregate traffic metrics from Zeek conn.log over 5-minute intervals, creating vectors of features (e.g., protocol ratios, average packet size, source IP entropy). Apply Principal Component Analysis (PCA) to this data to establish a low-dimensional representation of the network state. Monitor the Mahalanobis distance of new data points from the centroid of normal activity and alert when this distance exceeds a statistically-defined threshold."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]