[
  {
    "information_requirement": "Is the adversary attempting to impact system availability or functionality via OS exhaustion? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1499.001",
        "name": "OS Exhaustion Flood",
        "evidence": [
          {
            "description": "A sustained rate of SYN or ACK packets from a single source IP, exceeding a threshold of 1,000 packets per second for over 60 seconds, where the source IP is present on an active threat intelligence feed for DoS activity or botnets.",
            "data_sources": [
              "Zeek conn.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Perimeter Firewalls, Core Routers",
            "action": [
              "Ingest CTI feeds of known DoS/botnet IPs into a watchlist. Create a rule to trigger an alert when a source IP from this watchlist is observed in Zeek conn.log sending traffic at a high rate to a critical asset.",
              "For each destination server, calculate a 5-minute rolling average and standard deviation of inbound SYN or ACK packets from all sources. Trigger an alert when the packet count from a single source IP exceeds 3 standard deviations above the rolling average for more than 60 seconds.",
              "Query the output of a time-series anomaly detection model (e.g., LSTM autoencoder) trained on historical Zeek conn.log data (features: packet count, byte count). Generate an alert when the model's reconstruction error for live traffic from a single source exceeds a dynamic threshold, indicating a significant deviation from normal traffic patterns."
            ]
          },
          {
            "description": "A high volume of inbound SYN or ACK packets from a single source where session characteristics are consistent with automated tooling, such as a Shannon entropy score for source ports below 2.0, a single static TTL value across all packets, or TCP window sizes fixed at a non-standard value.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Load Balancers, Targeted Web Servers",
            "action": [
              "Maintain and query a signature library of known DoS tool characteristics (e.g., specific TTL values, fixed TCP window sizes, unusual IP options). Scan high-volume inbound traffic flows identified in Zeek conn.log for matches against this signature library.",
              "For each high-volume source IP observed in Zeek conn.log, calculate the Shannon entropy of the source ports (`id.orig_p`) over a 1-minute window. Trigger an alert if the entropy drops below a baseline threshold (e.g., < 2.0), indicating non-random port selection characteristic of a flood tool.",
              "Query data against a pre-computed clustering model (e.g., DBSCAN) built on TCP session features from Zeek conn.log (source port, TTL, window size, packet inter-arrival time). Identify and alert on clusters that are anomalous compared to the main 'benign' traffic cluster, as these may represent coordinated attack traffic."
            ]
          },
          {
            "description": "The ratio of new TCP connections in a half-open state ('S0' in Zeek conn.log) to fully established connections ('SF') for a specific destination IP and port exceeds the 99th percentile of a 30-day baseline for at least 3 consecutive 1-minute intervals.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Application Servers, Authentication Servers, Database Servers",
            "action": [
              "Create a rule that triggers an alert when the count of connections in state 'S0' (SYN sent, no reply) in Zeek conn.log for a single destination IP exceeds a static threshold (e.g., >10,000 within a 1-minute window).",
              "For each critical server, calculate the ratio of 'S0' connections to 'SF' (established) connections over a 1-minute interval. Establish a baseline for this ratio from the last 30 days. Trigger an alert when the live ratio exceeds the 99th percentile of the historical baseline for more than 3 consecutive minutes.",
              "Apply a change point detection algorithm (e.g., Bayesian Change Point Detection) to the time series of 'S0' connection counts for critical assets. Trigger an alert when a statistically significant and abrupt increase is detected, indicating the onset of a SYN flood."
            ]
          },
          {
            "description": "A sustained rate of over 1,000 ACK packets per second from a single source IP that do not correspond to an active connection in the state table, identified by the absence of a matching 'uid' in recent Zeek conn.log entries or a match to a connection in a terminated state ('RSTO', 'RSTR', 'SH', 'SHR').",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Infrastructure Servers, Stateful Firewalls, VPN Concentrators",
            "action": [
              "Create a rule to identify ACK packets where the associated connection `uid` in Zeek conn.log does not exist or corresponds to a closed state ('RSTO', 'RSTR', 'SH', 'SHR'). Trigger an alert if a single source IP generates more than a threshold of such packets (e.g., >1,000 per second).",
              "For each destination IP, baseline the rate of out-of-state ACK packets. Trigger an alert when the rate from a single source IP exceeds a dynamic threshold, such as 3 standard deviations above the mean rate for that destination, for a sustained period.",
              "Deploy a pre-trained classifier (e.g., Random Forest) on labeled traffic data, using features like packet size, inter-arrival time, and connection state. Use the model to classify incoming streams of ACK packets in real-time as either 'benign' (part of a valid session) or 'malicious' (part of an ACK flood) and alert on malicious classifications."
            ]
          },
          {
            "description": "The generation of Windows Event ID 4227 (TCP/IP has reached the security limit imposed on the number of concurrent TCP connect attempts) or Event ID 2019/2020 (Nonpaged/Paged pool allocation failure) on a server, occurring within 5 minutes of a network-level alert for a high-volume packet flood targeting that server's IP address.",
            "data_sources": [
              "Windows Event ID 4227",
              "Windows Event ID 2019",
              "Windows Event ID 2020",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Critical Application Servers, Windows Server Fleet",
            "action": [
              "Create a high-severity alert that triggers immediately upon the detection of Windows Event ID 4227, 2019, or 2020 on any monitored server.",
              "Upon a symbolic alert for a relevant Windows Event ID, automatically query Zeek conn.log for the 5 minutes preceding the event. If the total volume of SYN packets or out-of-state ACK packets to that host in the preceding period is more than 3 standard deviations above the host's 7-day average, elevate the alert severity and flag as a correlated attack.",
              "Calculate the posterior probability of an OS Exhaustion Attack using a Bayesian network model that takes host and network events as inputs. Trigger a high-confidence alert if the probability exceeds a threshold (e.g., > 0.9) when given evidence of both a network flood alert and a host-level exhaustion event (e.g., Event ID 4227) occurring within a 5-minute window."
            ]
          },
          {
            "description": "The success rate for a monitored service (e.g., ratio of HTTP 2xx status codes to all codes in http.log) drops below the 1st percentile of its historical baseline, while the inbound packet rate to the service's host concurrently exceeds its 99th percentile.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "API Gateways, Customer-facing Web Portals, Internal DNS Resolvers",
            "action": [
              "Create a rule that alerts if the count of successful transactions (e.g., HTTP 200s in Zeek http.log) to a critical service drops by more than 75% compared to the previous 1-hour average while total requests remain high or have increased.",
              "For each critical service, establish a baseline of the success rate (e.g., ratio of HTTP 2xx codes to all HTTP codes). Trigger an alert when this rate drops below the 1st percentile of its historical distribution and, simultaneously, the inbound packet rate to the host exceeds its 99th percentile.",
              "Query a regression model that predicts the transaction success rate based on traffic volume. Trigger an alert if the actual observed success rate drops significantly below the model's predicted rate during a high-traffic event, indicating an anomalous impact consistent with a DoS attack."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]