[
  {
    "information_requirement": "Is an adversary attempting to inhibit system recovery capabilities to prevent restoration after an attack?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1490",
        "name": "Inhibit System Recovery",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable's file hash (e.g., SHA256) matches a known hash from a threat intelligence feed specifically categorized as ransomware or a wiper tool.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All domain-joined Windows endpoints and servers, especially critical application servers and domain controllers, and network egress points.",
            "action": [
              "Symbolic: Continuously monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) and network file transfers (Zeek files.log). For each new executable file, calculate its SHA256 hash. Compare this hash against a curated and up-to-date threat intelligence feed of known malicious file hashes associated with ransomware or wiper malware. Generate a critical-severity alert upon any match.",
              "Statistical: For all observed executable file hashes, calculate their prevalence across the enterprise over a 30-day rolling window. Identify hashes that are both extremely rare (e.g., seen on fewer than 5 hosts or < 0.01% of endpoints) and are not signed by a trusted publisher. Use a scoring model where rarity and lack of a valid signature increase the risk score. A score exceeding the 99th percentile of all newly observed files should trigger an investigation.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) using features from process execution events, including parent process name, command-line argument length and entropy, file signature status, and historical prevalence of the hash. Deploy the trained model to score new process executions in real-time. Processes that the model classifies as malicious with a high confidence score (>0.90) should be automatically queued for analyst review or endpoint isolation."
            ]
          },
          {
            "description": "A process creation event is observed for a native Windows utility (vssadmin.exe, wmic.exe, wbadmin.exe, bcdedit.exe, diskshadow.exe, REAgentC.exe) containing command-line arguments explicitly used to delete backups or disable recovery features, such as 'delete shadows /all', 'shadowcopy delete', 'delete catalog -quiet', or 'recoveryenabled no'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Windows Event ID 4104 (PowerShell Script Block Logging)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, file servers with Volume Shadow Copy enabled, Windows servers hosting critical backups, and all other Windows endpoints and servers.",
            "action": [
              "Symbolic: Deploy detection rules that monitor process creation events and PowerShell logs for the execution of 'vssadmin.exe', 'wmic.exe', 'wbadmin.exe', 'bcdedit.exe', 'diskshadow.exe', or 'REAgentC.exe'. Use regular expressions on the command-line or script block content to match argument patterns like /(delete\\s+shadows|shadowcopy\\s+delete|delete\\s+catalog|recoveryenabled\\s+no|bootstatuspolicy\\s+ignoreallfailures)/i. Generate a high-severity alert on any match.",
              "Statistical: For each of the target utilities, establish a baseline of normal command-line argument patterns and execution frequency per user and host. Calculate the information entropy of command lines. Alert when an execution's command-line entropy is in the top 5% for that specific utility, or when a user executes one of these commands for the first time, especially with arguments associated with deletion. Correlate with time of day, flagging executions outside of standard administrative windows.",
              "Machine Learning: Use a sequence analysis model to identify anomalous chains of command execution. Train the model on normal administrative command sequences. An alert should be triggered by an anomalous sequence, such as reconnaissance commands (e.g., 'vssadmin list shadows') immediately followed by a destructive command (e.g., 'vssadmin delete shadows /all') by a non-standard administrative account, which deviates from the learned normal behavior."
            ]
          },
          {
            "description": "A single process or user account generates more than 100 file deletion events within a 5-minute window targeting files with backup-related extensions (.bak, .vhd, .vhdx, .dmp, .bkf) or paths containing 'System Volume Information'.",
            "data_sources": [
              "Windows Event ID 23 (Sysmon)",
              "Windows Event ID 4663",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network file shares hosting backups, servers with local backup copies, and the 'System Volume Information' directory on all Windows hosts.",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a single ProcessGUID (from Sysmon) or user account initiates a high number of file deletions (Sysmon Event ID 23) or object access attempts with delete flags (Event ID 4663). If the count of deletions targeting files with extensions like '.bak', '.vhd', '.vhdx' or paths like 'System Volume Information' exceeds a threshold (e.g., >100 events in 5 minutes), generate a critical alert.",
              "Statistical: For each host and user, establish a baseline for the rate of file deletions per hour, segmented by file type and path. Use a percentile-based threshold (e.g., 99th percentile) to detect abnormal spikes in deletion activity. Enrich alerts by flagging activity from non-administrative accounts or processes that are unsigned and have low prevalence in the environment.",
              "Machine Learning: Employ an unsupervised clustering algorithm (e.g., DBSCAN) to group hosts based on real-time behavioral features, including file deletion rates, deletion of high-value backup file types, and process parent-child relationships. This can identify clusters of hosts exhibiting synchronized, high-volume deletion activity, which is a strong indicator of a widespread, automated attack like ransomware."
            ]
          },
          {
            "description": "A network connection from a non-administrative workstation or an unauthorized IP address to a hypervisor management interface (e.g., vCenter, ESXi) or cloud storage API endpoint is followed by API calls to delete virtual machine snapshots (e.g., 'snapshot.removeall'), S3 object versions, or backup policies.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 3 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Hypervisor management network segment (vCenter, ESXi hosts), network egress points to public cloud providers, and network boundaries between user and server segments.",
            "action": [
              "Symbolic: Maintain an explicit allowlist of IP addresses for administrative hosts and backup servers authorized to access hypervisor/cloud management interfaces. Monitor network connection logs (Zeek conn.log, Sysmon Event ID 3) for any TCP connections to management ports (e.g., 443, 902, 9443) from a source IP not on the allowlist. Generate a high-severity alert for any unauthorized connection.",
              "Statistical: For authorized connections to backup infrastructure, analyze the volume and type of activity. Establish a baseline for the number of destructive API calls (inferred from traffic volume to specific API paths if unencrypted, or from cloud audit logs) per user session. Alert when the count of destructive actions from a single source IP in a one-hour window exceeds 3 standard deviations above the established mean for that user or role.",
              "Machine Learning: Use an LSTM-based autoencoder trained on sequences of API calls from normal administrative sessions (mined from cloud audit logs or reconstructed from network traffic). Feed new sessions into the model to generate a reconstruction error. A session with a high reconstruction error, such as one involving an immediate 'deleteAllSnapshots' call after login without any preceding 'list' or 'get' calls, indicates a highly anomalous and potentially malicious sequence requiring immediate investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]