[
  {
    "information_requirement": "Is the adversary maintaining persistence on ESXi hypervisors using malicious vSphere Installation Bundles (VIBs)?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.006",
        "name": "vSphere Installation Bundles",
        "evidence": [
          {
            "description": "A VIB file (`.vib`, `.vgz`) is transferred over the network, and its SHA256 hash is present on a curated list of known malicious VIB hashes.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ESXi management network segments, vCenter server network interfaces, and network egress points.",
            "action": [
              "Symbolic: From Zeek files.log, extract file hashes (SHA256) for any transferred file with a `.vib` or `.vgz` extension. Compare these hashes against a threat intelligence feed of known malicious VIB hashes. Generate a high-severity alert upon a match.",
              "Statistical: For all VIB file transfers observed in Zeek files.log, calculate the frequency of source-destination IP pairs. Identify and investigate transfers from source IPs that fall below the 5th percentile of historical transfer frequency, indicating a rare and potentially unauthorized source system.",
              "Machine Learning: Train a classification model (e.g., decision tree) using features from Zeek files.log and conn.log (file size, source/destination subnet, protocol, MIME type). Use the model to classify VIB file transfers as 'benign' (from known management servers) or 'suspicious'. Flag transfers classified as suspicious for analyst review."
            ]
          },
          {
            "description": "Command-line execution on a vCenter or management host contains `esxcli` with arguments that reduce security settings or bypass signature validation, such as `software vib install --force`, `software vib install --no-sig-check`, or `software acceptance set --level=CommunitySupported`.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "vCenter servers, Windows-based administrative jump boxes, and Domain Controllers for authentication context.",
            "action": [
              "Symbolic: On management hosts, monitor Windows Event ID 4688 process creation logs for command lines containing `esxcli` and any of the following strings: `--force`, `--no-sig-check`, or `acceptance set --level=CommunitySupported`. Alert immediately on any match.",
              "Statistical: For each administrator account, establish a baseline of normal `esxcli` command usage, including frequency and argument patterns. Calculate the Z-score for the frequency of VIB-related commands (`software vib install`, `software acceptance set`) per user per day. Flag users whose activity exceeds 3 standard deviations from their own or their peer group's baseline.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) to analyze the order of `esxcli` commands. Train the model on benign sequences from change management records. A sequence like `acceptance set --level=CommunitySupported` -> `vib install --force` -> `acceptance set --level=PartnerSupported` would have a low probability under the benign model and should be flagged as anomalous."
            ]
          },
          {
            "description": "An ESXi host establishes a network connection to an external destination IP on a non-standard port or to a destination with low reputation, within one hour of a VIB installation command (`esxcli software vib install`) or system reboot event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "VMware vCenter event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ESXi host management interfaces (vmk0), network traffic to/from the virtualization subnet, and DNS server logs.",
            "action": [
              "Symbolic: Correlate Zeek conn.log with a threat intelligence feed of known command-and-control (C2) server IPs. Alert on any connection from an ESXi host IP to a malicious IP address. Additionally, alert if an ESXi host initiates a connection on a port commonly associated with backdoors (e.g., 4444, 6667, 8443).",
              "Statistical: For each ESXi host, create a baseline of destination ports, protocols, and connection durations from Zeek conn.log. Calculate the entropy of destination ports accessed by each host over a 5-minute window. A sudden spike in entropy may indicate port scanning. Also, flag any connection to a port that falls outside the 99th percentile of common ports for that host.",
              "Machine Learning: Apply time series analysis (e.g., ARIMA) to the volume of outbound data (`orig_bytes` in Zeek conn.log) from each ESXi host. Flag anomalies where the observed data volume significantly deviates from the forecasted model, especially if the anomaly occurs shortly after a VIB installation event is logged on a management server."
            ]
          },
          {
            "description": "A VIB file is transferred to an ESXi host from a source IP address that is not on an approved allowlist of vCenter servers, management hosts, or official VMware update repositories.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments containing management workstations, DMZ where update servers might reside, and firewall logs showing traffic to VMware domains.",
            "action": [
              "Symbolic: Maintain an allowlist of authorized IP addresses for VIB sources (internal vCenter servers, management hosts, external VMware repositories). In Zeek conn.log, monitor for connections to ESXi hosts on management ports (e.g., 443, 902) where a VIB file transfer is also seen in Zeek files.log. Alert if the source IP of the transfer is not on the allowlist.",
              "Statistical: Analyze the `User-Agent` string from HTTP traffic (in Zeek http.log) associated with VIB downloads. Establish a baseline of common user agents used by legitimate update tools. Flag downloads associated with rare user agents (e.g., `curl`, `wget`, `python-requests`) that fall below a 1% frequency threshold.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on network connection features from Zeek conn.log (source IP, destination IP, destination port, bytes transferred) for all VIB transfers. Benign transfers from a central management server should form a dense cluster. Identify and investigate outlier connections that do not belong to any cluster as anomalous transfer activity."
            ]
          },
          {
            "description": "An `esxcli software vib install` command is executed by a user account not in the 'ESXi Admins' Active Directory group, or the execution timestamp falls outside a defined maintenance window (e.g., Saturday 10 PM - Sunday 6 AM).",
            "data_sources": [
              "Windows Event ID 4688",
              "Active Directory security logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrative workstations, vCenter servers, and Domain Controllers.",
            "action": [
              "Symbolic: For every `esxcli software vib install` command detected in Windows Event ID 4688, cross-reference the associated user account against a maintained allowlist of authorized hypervisor administrators. Also, check if the event's timestamp falls within a scheduled maintenance window. Generate an alert if either condition is not met.",
              "Statistical: Model the login activity (Windows Event ID 4624) for hypervisor administrator accounts. Identify VIB installation commands (Event ID 4688) that are preceded by an anomalous login event, such as a login from a new geographic location (geolocated from source IP in Zeek conn.log) or at a time that is more than 2 standard deviations from the user's mean login hour.",
              "Machine Learning: Train a classification model to predict whether a VIB installation event is 'authorized' or 'unauthorized' based on features like: user account, source hostname, time of day, day of week, and whether it was preceded by a login from a rare location. Train the model on historical data labeled with information from a change management system. Use the model to score and flag new VIB installation events in real-time."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]