[
    {
        "information_requirement": "Is the adversary maintaining persistence via web shell?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1505.003",
                "name": "Web Shell",
                "evidence": [
                    {
                        "description": "Network traffic matching known web shell signatures, such as requests to specific malicious URLs or from IPs associated with web shell C2 infrastructure.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join source IPs and requested URIs from Zeek conn.log and Zeek http.log against a high-confidence, continuously updated threat intelligence feed of known malicious IPs, C2 servers, and web shell URLs. Alert on any matches and investigate the targeted web server for compromise."
                    },
                    {
                        "description": "HTTP requests containing common web shell parameter names or function calls, or the creation of files with common web shell filenames.",
                        "data_sources": [
                            "Zeek http.log",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Use regular expression matching on Zeek http.log data to search URI queries and POST request bodies for patterns indicative of web shell commands (e.g., 'cmd=', 'exec=', 'eval(', 'passthru('). Separately, monitor Windows Event ID 4663 for file creation events in web root directories where the filename matches a list of common web shell names (e.g., 'c99.php', 'r57.aspx', 'cmd.jsp'). Correlate findings to identify active web shells."
                    },
                    {
                        "description": "A web server process (e.g., w3wp.exe, httpd, nginx) spawning command-line interpreters or other unexpected child processes.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of legitimate child processes for all web server parent processes. Monitor Windows Event ID 4688 for any web server process (e.g., w3wp.exe) that spawns a child process not on the established allowlist. Pay special attention to the creation of command-line interpreters (cmd.exe, powershell.exe, pwsh.exe, bash), network reconnaissance tools (whoami.exe, ipconfig.exe, net.exe), or file transfer utilities. Use descriptive statistics on command-line arguments to find anomalous parameter usage for even allowed child processes."
                    },
                    {
                        "description": "Anomalous network activity originating from a web server, such as connections to internal hosts, outbound connections on non-standard ports, or statistically unusual request patterns to a specific web file.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for any connections initiated by a web server's IP to internal, non-web-server IP addresses or to external IPs on ports other than 80/443. Establish a baseline of normal outbound traffic from web servers and use time series analysis or outlier detection (e.g., IQR on bytes transferred or connection duration) to find anomalies. For a suspected web shell file, analyze its access patterns in Zeek http.log; calculate the entropy of source IPs, User-Agents, and request parameters. Unusually low entropy (single operator) or high entropy (botnet) compared to normal files can indicate malicious use."
                    },
                    {
                        "description": "Anomalous file modifications in web-accessible directories, such as files being created by the web server process itself or files with timestamps that deviate from standard deployment schedules.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor file creation and modification events (Windows Event ID 4663) in all web root and script directories. Correlate the Process ID from the event with process creation logs (Windows Event ID 4688) to confirm if the web server process itself (e.g., w3wp.exe) is writing executable files to its own directories, which is highly indicative of a web shell. Additionally, perform a correlation analysis of file creation timestamps against known software deployment schedules; flag files created outside these windows for review."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
