[
    {
        "information_requirement": "Is the adversary maintaining persistence on web servers using malicious IIS components?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1505.004",
                "name": "IIS Components",
                "evidence": [
                    {
                        "description": "Outbound network connections from the IIS worker process to IP addresses or domains on threat intelligence lists.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join destination IP addresses from Zeek conn.log (where the source IP is a known web server) with a high-confidence, up-to-date threat intelligence feed of malicious C2 IPs. Similarly, cross-reference domains from Zeek dns.log queries originating from the web server with malicious domain lists. Alert on any confirmed matches, as this is a strong indicator of a malicious IIS component communicating out."
                    },
                    {
                        "description": "Execution of `AppCmd.exe` or PowerShell IIS cmdlets with specific command-line arguments to install or configure malicious IIS modules, handlers, or extensions.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows PowerShell Event ID 4104"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for `AppCmd.exe` process creation and use regular expression matching on command lines to detect patterns like 'add module', 'install module', 'set config -section:system.webServer/modules'. Separately, monitor PowerShell Script Block Logging (Event ID 4104) for execution of cmdlets such as 'New-IISModule', 'Add-WebConfiguration', or 'Set-WebConfigurationProperty' that manipulate sensitive IIS configuration sections. Correlate these command executions with file creation events for new DLLs."
                    },
                    {
                        "description": "Anomalous modification of the `applicationhost.config` file or the unexpected addition of DLLs to directories used by IIS for modules and extensions.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal processes that modify `%windir%\\System32\\inetsrv\\config\\applicationhost.config` or write DLLs to key IIS directories (e.g., `%windir%\\System32\\inetsrv\\`, `\\wwwroot\\bin\\`). Monitor for write access (Event ID 4663) or file creation events (inferred from process execution via Event ID 4688) by unauthorized or rare processes (e.g., `w3wp.exe`, `cmd.exe`, `powershell.exe`). Use frequency analysis on the names of processes performing these actions to identify outliers."
                    },
                    {
                        "description": "Spawning of suspicious child processes, such as command shells or data reconnaissance tools, by the IIS worker process (`w3wp.exe`).",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create and maintain a strict baseline of legitimate and expected child processes spawned by the IIS worker process (`w3wp.exe`). Monitor Windows Event ID 4688 for any deviation from this baseline, alerting specifically on the creation of command shells (`cmd.exe`, `powershell.exe`), scripting engines (`cscript.exe`, `wscript.exe`), or utilities commonly used for reconnaissance (`whoami.exe`, `ipconfig.exe`, `net.exe`, `quser.exe`). Use descriptive statistics to establish the baseline and identify low-frequency, high-risk child processes."
                    },
                    {
                        "description": "Anomalous outbound network traffic originating from a web server that deviates from its established baseline of normal communication patterns.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each web server, establish a multi-faceted baseline of normal outbound traffic, including destination countries/ASNs, ports, protocols, data volume, and connection duration. Use time series analysis to detect significant spikes in connection counts or bytes transferred. Apply statistical methods like Inter-Quartile Range (IQR) and box plots to flag connections to rare destination geolocations or ports. Monitor Zeek dns.log for an increase in queries to non-standard or algorithmically generated domains (DGAs), which could indicate C2 from a malicious IIS component. Correlate anomalous network activity with recent file or configuration changes on the server."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
