[
  {
    "information_requirement": "Has the adversary identified our security software and configurations to inform their next actions? (PIR)",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1518.001",
        "name": "Security Software Discovery",
        "evidence": [
          {
            "description": "A process is created where the file hash of the executable matches a known malicious hash specifically associated with security software discovery tools.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Domain Controllers, Application Servers, Cloud Compute Instances",
            "action": [
              "Query Windows Event ID 4688 process creation events. For each new process, compare its file hash against a threat intelligence feed of known malicious hashes cataloged for T1518.001. Trigger a high-severity alert on any match.",
              "For each process creation event (Windows Event ID 4688) not matching a known malicious hash, calculate the prevalence of the file hash across the environment over the last 30 days. Flag any process whose hash prevalence is in the bottom 1st percentile and whose command line contains discovery-related keywords (e.g., 'antivirus', 'firewall', 'defender').",
              "Apply a pre-trained Random Forest classification model to features extracted from process creation events (Event ID 4688), including parent process, command-line arguments, user context, and hash prevalence. Flag any process classified as 'malicious' for analyst review, prioritizing those with command-line arguments containing security product names."
            ]
          },
          {
            "description": "Execution of native system utilities (e.g., tasklist, wmic, reg query, Get-Process) with command-line arguments known to query for security product processes, services, registry keys, or file paths.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Privileged Access Workstations, Enterprise Servers, Cloud Compute Instances",
            "action": [
              "From Windows Event ID 4688 logs, create a detection rule using regular expressions to match command-line arguments against a list of known security discovery commands. Examples include `wmic /namespace:\\\\root\\securitycenter2 path antivirusproduct get displayName`, `reg query HKLM\\SOFTWARE /s /f 'symantec'`, or `tasklist | findstr /i 'cb.exe'`. Trigger an alert on any match.",
              "For each `cmd.exe` and `powershell.exe` execution (Event ID 4688), calculate the Shannon entropy of its command-line string. Establish a baseline of entropy scores for these processes per user or host. Flag executions where the entropy exceeds the 95th percentile of the baseline and the command also contains discovery keywords like 'av', 'edr', or 'defender'.",
              "Deploy a pre-trained NLP model to analyze command-line strings from Event ID 4688. The model should be fine-tuned to classify the intent of commands. Flag any command line classified with high confidence as 'Security Software Discovery', even if it uses obfuscation or non-standard syntax."
            ]
          },
          {
            "description": "A single process generates a high volume of file system or registry read access events within a short time frame, targeting directories or registry hives associated with security software.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, Application Servers, Standard User Workstations, Domain Controllers",
            "action": [
              "Create a rule that triggers when a single Process ID generates more than 500 object access events (Windows Event ID 4663) in under 60 seconds where the Object Name path includes `C:\\Program Files\\`, `C:\\ProgramData\\`, or `HKLM\\SOFTWARE\\`. This acts as a simple tripwire for enumeration.",
              "On a per-host basis, profile the rate of file/registry read events (Event ID 4663) per process name. Generate a statistical alert if a process's event rate exceeds 3 standard deviations above its historical average for that host. Increase alert severity if the accessed object names contain keywords like 'Agent', 'Security', or 'EDR'.",
              "Apply a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) to the stream of file and registry read events (Event ID 4663) aggregated per host. The model will learn the normal rhythm of system activity. Trigger an alert when the model identifies an anomalous spike in enumeration activity that significantly deviates from the forecasted behavior."
            ]
          },
          {
            "description": "A known discovery utility (e.g., tasklist.exe, wmic.exe) is spawned by a parent process not typically associated with system administration, such as an Office application, browser, or PDF reader.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Terminal Servers",
            "action": [
              "Create a high-priority rule to alert on any process creation event (Event ID 4688) where the Parent Process Name is one of `WINWORD.EXE`, `EXCEL.EXE`, `POWERPNT.EXE`, `OUTLOOK.EXE`, `chrome.exe`, `msedge.exe`, `firefox.exe`, `AcroRd32.exe` AND the New Process Name is one of `tasklist.exe`, `wmic.exe`, `reg.exe`, `powershell.exe`, `cmd.exe`.",
              "Continuously profile all parent-child process relationships observed in Event ID 4688 logs across the enterprise to build a frequency table. Flag for review any execution of a discovery utility (e.g., `tasklist.exe`) where the parent-child pair is observed in less than 0.1% of all process creation events, indicating a rare and suspicious lineage.",
              "Utilize a graph-based anomaly detection model on process lineage data from Event ID 4688. Model processes as nodes and parent-child relationships as directed edges. The model learns common process execution chains (subgraphs). Trigger an alert when a new process chain, such as `OUTLOOK.EXE -> powershell.exe -> tasklist.exe`, forms a subgraph that is structurally rare."
            ]
          },
          {
            "description": "A sequence of on-host security software discovery commands followed within a short time window by a new network connection to an external address or a DNS query for a non-standard domain.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, Host Network Interfaces, Cloud VPC Flow Logs",
            "action": [
              "Create a correlation rule that triggers when a host generates a security discovery alert (based on command-line matching in Event ID 4688) and, within 5 minutes, the same host's IP initiates a connection (from Zeek conn.log) to an external IP address present on a threat intelligence blocklist.",
              "On a per-host basis, identify a cluster of 3 or more discovery commands (from Event ID 4688) within a 2-minute window. If this activity is followed within 5 minutes by a DNS query (from Zeek dns.log) for a domain that is either newly registered (e.g., < 30 days old) or has a DGA-like high entropy score, significantly increase the host's risk score.",
              "Implement a sequence analysis model (e.g., LSTM) on time-sorted, aggregated host (Event ID 4688) and network (Zeek conn.log, dns.log) events per host. Train the model to recognize legitimate event sequences. Flag sequences as anomalous when on-host discovery process executions are followed by network behaviors that deviate from the learned norm, such as direct-to-IP connections on non-standard ports."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]