[
    {
        "information_requirement": "Is the adversary maintaining persistence by implanting internal images?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1525",
                "name": "Implant Internal Image",
                "evidence": [
                    {
                        "description": "A container, deployed from an internal image, initiates network connections to IP addresses or domains on a threat intelligence feed of known command and control (C2) infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify the IP address space of container host nodes. Continuously filter Zeek conn.log and dns.log for all traffic originating from this IP space. Inner join the destination IP addresses and queried domain names with a high-confidence C2 threat intelligence feed (updated at least daily). Alert on any matches and investigate the specific host and container responsible for the communication."
                    },
                    {
                        "description": "A process launched within a newly deployed container executes commands matching patterns of known malicious activity, such as reverse shells, downloading remote scripts, or invoking cryptomining tools.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On container hosts, monitor Windows Event ID 4688 for new process creation events. Correlate these events with recent container deployments. Scan the 'CommandLine' and 'ProcessName' fields for specific, high-fidelity patterns of malicious activity, including reverse shell syntax (e.g., 'bash -i >& /dev/tcp/...'), use of 'curl' or 'wget' to download files from unusual URLs, process names associated with cryptominers (e.g., 'xmrig', 'kinsing'), or suspicious encoded PowerShell commands. Maintain and use regular expressions against a library of these malicious command-line patterns."
                    },
                    {
                        "description": "An internal image registry receives an image push from an unusual source, by an anomalous user account, or at a time that deviates from established CI/CD pipeline behavior.",
                        "data_sources": [
                            "Zeek http.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal image push activity by profiling source IPs of known build servers, authorized user/service accounts, typical times/days of activity, and average image upload sizes. Monitor Zeek http.log for registry API calls indicating image pushes (e.g., 'POST /v2/.../blobs/uploads/', 'PUT /v2/.../manifests/...'). Correlate source IPs with authentication logs (Windows Event ID 4624) to identify the user account. Use statistical methods like IQR or percentile analysis to flag pushes from rare source IPs, by unusual users, at anomalous times, or with outlier data sizes."
                    },
                    {
                        "description": "A newly deployed container exhibits anomalous network or process behavior when compared to its own historical baseline or the baseline of similar applications, indicating a malicious implant.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For a given application/image, establish a baseline of normal runtime behavior, including typical processes executed (from Event ID 4688) and typical network connections (destinations, ports, protocols in Zeek conn.log). After an image update and new deployment, monitor for significant deviations. Flag the creation of unexpected child processes, outbound connections to new or rare external IP addresses, connections on non-standard ports, or attempted lateral movement to other internal systems. Use correlation analysis to link a specific image modification event with the onset of anomalous behavior. Calculate the entropy of destination ports or IPs from a container over time to detect erratic or scanning-like behavior."
                    },
                    {
                        "description": "An entity interacts with the internal image registry in a manner indicative of reconnaissance, such as listing all repositories or numerous tags, without performing a typical image pull or push operation.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek http.log for API calls to the internal image registry. While pushes and pulls are normal, profile the frequency and source of discovery-related API calls (e.g., 'GET /v2/_catalog', 'GET /v2/.../tags/list'). A high volume of these calls from a single source, especially from a user workstation IP rather than a known build or orchestration server, is anomalous. Use frequency analysis and source IP profiling to detect such reconnaissance behavior, which may precede an image implant attempt."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
