[
  {
    "information_requirement": "Has an adversary stolen an application access token to gain unauthorized access to cloud, SaaS, or containerized resources? (PIR)",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1528",
        "name": "Steal Application Access Token",
        "evidence": [
          {
            "description": "An API request using a stolen Bearer token is made from a source IP address known to be malicious, associated with an anonymizing proxy, or inconsistent with the user's or application's established geographic profile.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, API Gateways, Cloud Access Security Brokers (CASB)",
            "action": [
              "Symbolic: For all inbound HTTP requests containing an 'Authorization: Bearer' header identified in Zeek http.log, join the source IP from Zeek conn.log and compare it against a threat intelligence feed of known malicious IPs, TOR exit nodes, and anonymous proxies. Generate an alert upon a match.",
              "Statistical: For each user or application token, build a historical profile of source countries and Autonomous System Numbers (ASNs). Calculate the frequency of requests from each country/ASN. Generate an alert if a request originates from a country or ASN that falls below a 5% frequency threshold for that specific entity, indicating a rare location.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) with features such as IP reputation score, ASN, geolocation, time of day, and User-Agent. Use the model to classify each authenticated API request as either benign or suspicious. Investigate requests classified as suspicious with a high confidence score."
            ]
          },
          {
            "description": "A process on a host executes commands to query a cloud metadata service (e.g., 169.254.169.254) or reads local files known to store application tokens.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IaaS virtual machines (e.g., Azure VMs, EC2 instances), container hosts, CI/CD pipeline runners, developer workstations",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for command lines containing IOCs for token theft, such as 'curl http://169.254.169.254/metadata' or 'Invoke-RestMethod -Uri http://169.254.169.254'. Also, monitor for User-Agent strings in Zeek http.log associated with known token-stealing frameworks. Generate an alert on any match.",
              "Statistical: For each host, establish a baseline of the daily count of accesses to the metadata service IP (169.254.169.254). Calculate the mean and standard deviation of this daily count. Alert if a host's daily access count exceeds three standard deviations above its historical mean, indicating an anomalous level of interaction.",
              "Machine Learning: Employ a sequence analysis model to detect a chain of suspicious events within a 5-minute window: 1) A non-standard process (e.g., PowerShell, not a cloud agent) accesses the metadata service, 2) this is followed by the creation of an archive file (e.g., .zip, .rar), and 3) a subsequent outbound network connection to a low-reputation domain is made. A model can be trained to score the likelihood of this sequence being malicious."
            ]
          },
          {
            "description": "A high volume of OAuth consent grants for a new or unusual application occurs within a short time frame, originating from a single or multiple users, indicating a consent phishing campaign.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "AzureAD AuditLogs (SignInLogs, AuditLogs)",
              "Microsoft 365 Unified Audit Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Identity and Access Management (IAM) systems (e.g., Azure AD, Okta), SaaS application administration portals, network egress points",
            "action": [
              "Symbolic: Maintain a watchlist of OAuth applications requesting high-risk delegated or application permissions (e.g., Mail.ReadWrite, Directory.ReadWrite.All, full_access_as_user). Generate an alert whenever a user grants consent to a new application that is requesting permissions from this watchlist.",
              "Statistical: For each new OAuth application, calculate the Shannon entropy of the display names of users granting it consent within the first 24 hours of its appearance. A very low entropy value suggests the name might be auto-generated or follow a simple pattern. Also, alert if the number of consent grants for any single application in one hour exceeds the 99th percentile of hourly grants for all applications.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., SARIMA) to forecast the expected number of total OAuth consent grants per hour across the organization. Generate an alert when the observed number of grants significantly exceeds the forecasted value, indicating a potential widespread consent phishing attack."
            ]
          },
          {
            "description": "A single application access token is used from geographically disparate locations in a time-frame that would be impossible to travel ('impossible travel'), or the token's usage pattern deviates significantly from its established baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "AWS CloudTrail",
              "Azure Monitor Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "API Gateways, Cloud Service Provider (CSP) control planes, SaaS application backends, web application firewalls (WAF)",
            "action": [
              "Symbolic: For each token, cache the timestamp and geolocation of its last use. Upon a new request, calculate the time elapsed and distance from the last location. If the required travel speed exceeds a threshold (e.g., 600 mph), generate an 'impossible travel' alert.",
              "Statistical: For each token, profile its typical behavior across multiple dimensions: hours of activity, data volume transferred per session, and types of API endpoints accessed. Use a scoring system where deviations (e.g., activity at 3 AM for a 9-5 user, data transfer 10x the average, access to admin-only endpoints) increment a risk score. Alert when a token's cumulative risk score surpasses a dynamically adjusted threshold.",
              "Machine Learning: Use an unsupervised clustering algorithm like DBSCAN on API request features (source IP subnet, User-Agent, API endpoint category, hour of day). Periodically retrain the model to define 'normal' clusters of activity. Requests that are flagged as noise or outliers by the model represent anomalous token usage that requires investigation."
            ]
          },
          {
            "description": "A non-standard process on a cloud instance makes a network connection to the instance metadata service (169.254.169.254), followed by an outbound connection to an external, non-corporate IP address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud virtual machines (IaaS), container runtime environments, network traffic logs at the virtual network (VNet/VPC) level",
            "action": [
              "Symbolic: Create a detection rule that triggers when a network connection to 169.254.169.254 (from Sysmon Event ID 3 or Windows Event ID 5156) is initiated by a process image that is not on a pre-defined allowlist of cloud agents and system tools (e.g., not 'waagent.exe', 'cloud-init.py').",
              "Statistical: Baseline the normal parent-child process relationships on cloud instances. Monitor process creation events (Windows Event ID 4688) where a common shell (powershell.exe, cmd.exe) or scripting engine spawns a network utility (curl.exe, Invoke-RestMethod) that connects to the metadata service. Alert if this sequence is rare for the specific host or user context, based on historical frequency analysis.",
              "Machine Learning: Train a classifier to identify malicious exfiltration sequences. Features would include: process name making metadata call, time delta between metadata call and external connection, reputation of the external IP, and volume of data sent in the external connection. The model would output a risk score for the sequence, with high scores triggering an alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]