[
  {
    "information_requirement": "Has the adversary attempted to remove user account access? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1531",
        "name": "Account Access Removal",
        "evidence": [
          {
            "description": "An account modification or deletion event (e.g., password change, account disablement, deletion) is initiated by a user account or from a source host present on a watchlist of suspicious or compromised entities.",
            "data_sources": [
              "Windows Event ID 4723",
              "Windows Event ID 4724",
              "Windows Event ID 4726",
              "Windows Event ID 4738",
              "Windows Event ID 4740"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Federation Services (ADFS) Servers, Member Servers, User Workstations",
            "action": [
              "Symbolic: Maintain a dynamic watchlist of suspicious or confirmed compromised user accounts and hostnames. Create a rule that triggers an alert when the 'SubjectUserName' or 'Client Address' in account modification event logs (4723, 4724, 4726, 4738) matches an entry on this watchlist.",
              "Statistical: For events matching the watchlist, calculate the rarity of the specific action (e.g., deletion vs. lockout) performed by that actor. If a high-risk actor performs a low-frequency, high-impact action (e.g., a user from a compromised workstation deleting an admin account), assign a higher risk score. Alert when the score exceeds a predefined percentile (e.g., 95th percentile) of all scored events.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on labeled historical data to predict if an account modification is malicious. Features should include: if the source is on a watchlist, the type of modification, target account privilege level, and time of day. Deploy the model to score live events and alert on high-probability malicious modifications."
            ]
          },
          {
            "description": "Process execution events show the use of command-line utilities or PowerShell cmdlets with specific arguments used to delete, disable, or modify user account credentials.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Privileged Access Workstations (PAWs), Management Servers, User Workstations",
            "action": [
              "Symbolic: Monitor process creation events (4688) for command lines containing specific patterns via regular expressions. Alert on matches for `net user .* /delete`, `net user .* /active:no`, `dsmod user .* -disabled yes`, `Remove-LocalUser`, `Disable-LocalUser`, `Set-ADAccountPassword`, and `Disable-ADAccount`.",
              "Statistical: Establish a baseline of normal parent-child process relationships for commands like `net.exe` and `powershell.exe`. Calculate the frequency of parent processes that execute account modification commands. Alert when a rare parent process (e.g., `svchost.exe`, a web server process) is observed, specifically if its frequency falls below the 5th percentile of all observed parent processes for these commands.",
              "Machine Learning: Utilize a Natural Language Processing (NLP) model to analyze command-line arguments. Fine-tune the model to classify the intent of a command line as 'Benign Admin Task' or 'Malicious Account Removal'. This can detect obfuscated or novel variations of commands that regular expressions might miss."
            ]
          },
          {
            "description": "The rate of account deletion, disablement, or lockout events in a given time window exceeds a statistically established baseline by a significant margin.",
            "data_sources": [
              "Windows Event ID 4726",
              "Windows Event ID 4738",
              "Windows Event ID 4740"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Centralized Log Aggregator (SIEM), Active Directory Servers",
            "action": [
              "Symbolic: Implement a simple threshold rule: alert if the count of account deletion events (4726) exceeds 5 in a 10-minute window, or if the count of account lockout events (4740) exceeds 50 in a 10-minute window across the domain.",
              "Statistical: For each event type (4726, 4738, 4740), create a time series of event counts in 5-minute intervals. Calculate a moving average and standard deviation over a 24-hour rolling window. Alert when the current count in an interval exceeds the moving average by more than 3 standard deviations (Z-score > 3).",
              "Machine Learning: Train a time-series anomaly detection model (e.g., ARIMA, LSTM Autoencoder) on historical event counts. The model will learn the normal rhythm of these events, including daily and weekly seasonality. Deploy the model to predict the expected count for the next interval and alert when the observed count is a significant outlier compared to the model's prediction."
            ]
          },
          {
            "description": "An account modification action is performed by a source that deviates from established patterns, such as a non-administrative user, a service account outside its typical function, or from an unusual network location or time.",
            "data_sources": [
              "Windows Event ID 4723",
              "Windows Event ID 4724",
              "Windows Event ID 4726",
              "Windows Event ID 4738",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN Concentrators, Management Servers, Cloud Identity and Access Management (IAM) Systems",
            "action": [
              "Symbolic: Create and maintain an explicit list of authorized administrator accounts and management subnets. Generate an alert if an account modification event (4723, 4724, 4726, 4738) is initiated by a 'SubjectUserName' not on the admin list or from a 'Client Address' not within the defined management subnets.",
              "Statistical: For each user, profile their typical activity hours and source IP geolocation (enriched from Zeek conn.log). Assign a high score if an action occurs outside the user's 95th percentile of activity hours or from a country they have never logged in from before. Sum the scores for multiple anomalous features; alert if the total score exceeds a threshold.",
              "Machine Learning: Use a clustering algorithm like DBSCAN on historical account modification events, using features like (Source_User_Role, Target_User_Role, Source_ASN, Time_Of_Day_Category). Benign administrative activity will form dense clusters. The model will flag events that fall outside these clusters as outliers (anomalies) requiring investigation."
            ]
          },
          {
            "description": "A correlated spike of authentication failures for specific user accounts is observed within a short time window immediately following modification or deletion events for those same accounts.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4771",
              "Windows Event ID 4724",
              "Windows Event ID 4726",
              "Zeek rdp.log",
              "Zeek smb_mapping.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network TAPs/SPANs monitoring server segments, Application Servers, File Servers",
            "action": [
              "Symbolic: For each account deletion (4726) or password reset (4724) event, trigger a stateful detection rule that monitors for authentication failures (4625, 4771) where the 'TargetUserName' matches the account from the initial event. If a failure is detected within 15 minutes, generate a high-severity alert.",
              "Statistical: In 1-minute intervals, count the number of distinct users who experienced both an account modification event (4724, 4726, 4738) and at least one subsequent authentication failure (4625, 4771). Establish a baseline for this count. Alert if the count exceeds the 99th percentile of the historical baseline.",
              "Machine Learning: Apply a Granger causality test to determine if the time series of account modification events is statistically predictive of the time series of authentication failures. Use this causality score, along with other features (e.g., number of affected accounts), as input to a classifier to determine if a sequence of events constitutes a coordinated attack."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]