[
  {
    "information_requirement": "Has the adversary attempted to remove user account access? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1531",
        "name": "Account Access Removal",
        "evidence": [
          {
            "description": "An account modification event (Windows Event IDs 4723, 4724, 4726, 4738, 4740) is observed where the initiating subject user or source client address is present on a threat intelligence watchlist of known malicious or compromised entities.",
            "data_sources": [
              "Windows Event ID 4723",
              "Windows Event ID 4724",
              "Windows Event ID 4726",
              "Windows Event ID 4738",
              "Windows Event ID 4740"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Federation Services (ADFS) Servers, Member Servers, User Workstations",
            "action": [
              "Maintain a dynamic watchlist of suspicious or confirmed compromised user accounts and host IP addresses. Create a SIEM rule that generates a high-priority alert when the 'SubjectUserName' or 'Client Address' field in account modification event logs (4723, 4724, 4726, 4738, 4740) matches an entry on this watchlist.",
              "For each event matching the watchlist, calculate a risk score. Assign weights based on the action type (e.g., deletion=10, password change=5, disablement=7) and the source's reputation. Calculate the frequency of this specific action being performed by any watchlist entity over the last 30 days. Alert if a high-risk actor performs a low-frequency, high-impact action, placing the event in the 95th percentile of all scored events.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on labeled historical data to predict if an account modification is malicious. Features must include: 'source_on_watchlist' (boolean), 'modification_type' (categorical), 'target_account_privilege_level' (e.g., admin, standard), 'time_of_day', and 'day_of_week'. Deploy the model to score live events and alert on those with a predicted probability of being malicious above 0.9."
            ]
          },
          {
            "description": "Process execution logs show command-line utilities or PowerShell scripts being used with arguments indicative of account deletion, disablement, or password modification.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Privileged Access Workstations (PAWs), Management Servers, User Workstations, Exchange Servers",
            "action": [
              "Monitor process creation events (4688) and script block logs (4104) for command lines or script content containing regular expression patterns matching: `net user .* (/del|/active:no)`, `dsmod user .* -disabled yes`, `Remove-LocalUser`, `Disable-LocalUser`, `Set-ADAccountPassword`, `Disable-ADAccount`, or `esxcli system account remove`. Alert on any match.",
              "Profile the parent-child process relationships for `cmd.exe`, `net.exe`, and `powershell.exe`. Calculate the entropy of the parent process name that spawns commands matching the symbolic logic patterns. Alert when a process with an unusually high-entropy or low-frequency parent (e.g., a web server process like `w3wp.exe`) is observed, particularly if that parent process falls below the 5th percentile of historical frequencies.",
              "Develop a command-line analysis model using an NLP technique like a bag-of-words or TF-IDF representation combined with a classifier (e.g., Logistic Regression). Train the model on a labeled dataset of benign administrative commands and known malicious commands. The model should classify the intent of a command line as 'Benign Admin Task' or 'Malicious Account Removal', allowing detection of obfuscated or novel command variations that regex might miss."
            ]
          },
          {
            "description": "The aggregate count of account deletion (4726), disablement (4738), or lockout (4740) events across the enterprise within a defined time window significantly exceeds a dynamically established baseline.",
            "data_sources": [
              "Windows Event ID 4726",
              "Windows Event ID 4738",
              "Windows Event ID 4740"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Centralized Log Aggregator (SIEM), Active Directory Servers",
            "action": [
              "Implement a sliding window rule that alerts if the count of distinct users affected by account deletion events (4726) exceeds 5 in a 10-minute window, or if the count of distinct users affected by account lockout events (4740) exceeds 50 in a 10-minute window across the domain.",
              "For each event type (4726, 4738, 4740), ingest event counts into a time series database in 5-minute intervals. Calculate a 24-hour rolling average and standard deviation. Generate an alert when the current count in an interval exceeds the moving average by more than 3 standard deviations (a Z-score greater than 3), indicating a statistically significant spike.",
              "Train a time-series anomaly detection model (e.g., an LSTM Autoencoder) on historical event counts for each event type. The model will learn the normal patterns, including daily and weekly seasonality. Deploy the model to predict the expected count for the next interval and alert when the residual (the difference between observed and predicted count) is a significant outlier based on the model's learned error distribution."
            ]
          },
          {
            "description": "An account modification action is performed by a source user or from a source host that deviates from established behavioral baselines, such as being performed by a non-administrative user, a service account, or from an unusual network location or at an anomalous time.",
            "data_sources": [
              "Windows Event ID 4723",
              "Windows Event ID 4724",
              "Windows Event ID 4726",
              "Windows Event ID 4738",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, VPN Concentrators, Management Servers, Cloud Identity and Access Management (IAM) Systems, DNS Servers",
            "action": [
              "Define and maintain lists of authorized administrator accounts, service accounts, and privileged management subnets. Generate an alert if an account modification event (4723, 4724, 4726, 4738) is initiated by a 'SubjectUserName' not on the admin list, or is initiated by a service account, or originates from a 'Client Address' not within the defined management subnets.",
              "For each user, create a historical profile of their account management activity, including typical hours, source subnets, and source Autonomous System Numbers (ASNs) from Zeek conn.log IP enrichment. For a new event, calculate a risk score based on deviations: score +1 for activity outside of 9-5, +2 for activity outside of the user's typical 95th percentile of hours, +3 for activity from a new ASN. Alert if the cumulative score exceeds a threshold of 4.",
              "Use an unsupervised clustering algorithm (e.g., DBSCAN or Isolation Forest) on historical account modification events. Use features such as 'Source_User_Privilege_Level', 'Target_User_Privilege_Level', 'Source_ASN', 'Time_Of_Day_Category', and 'Is_Service_Account' (boolean). Benign administrative activity will form dense clusters. The model will flag events that are classified as noise or outliers, indicating anomalous behavior that requires investigation."
            ]
          },
          {
            "description": "A temporal correlation is detected between account modification or deletion events (e.g., 4724, 4726) and a subsequent spike in authentication failures (e.g., 4625, 4771) for the same user accounts, indicating an immediate impact on access.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4771",
              "Windows Event ID 4724",
              "Windows Event ID 4726",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Zeek smb_mapping.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network TAPs/SPANs monitoring server segments, Application Servers, File Servers, VPN Gateways",
            "action": [
              "For each account deletion (4726) or password reset (4724) event, trigger a stateful detection rule. The rule should monitor for authentication failures (4625, 4771) where the 'TargetUserName' matches the account from the initial event. If more than 3 failures for that user are detected from any source within 15 minutes, generate a high-severity alert.",
              "In 1-minute intervals, count the number of distinct users who experienced both an account modification event (4724, 4726, 4738) and at least one subsequent authentication failure (4625, 4771). Establish a baseline for this correlated count over a 30-day period. Alert if the current count exceeds the 99th percentile of the historical baseline, indicating a widespread coordinated action.",
              "Use a sequence pattern mining algorithm (e.g., GSP or PrefixSpan) on event logs to discover common temporal patterns of events. A frequent pattern such as `(Event 4724: User A) -> (Event 4625: User A)` occurring within a short time window across multiple users can be flagged. Train a classifier on these discovered patterns to distinguish between benign sequences and malicious sequences indicative of a coordinated attack."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage, Inc."
    ]
  }
]