[
  {
    "information_requirement": "Has the adversary exfiltrated data by transferring it to another cloud account?",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1537",
        "name": "Transfer Data to Cloud Account",
        "evidence": [
          {
            "description": "A cloud resource sharing event (e.g., AWS ModifySnapshotAttribute, Azure Get Snapshot SAS URL) targets a cloud account ID or domain present on a threat intelligence feed or not on an organizational allow-list of approved sharing partners.",
            "data_sources": [
              "AWS CloudTrail logs",
              "Azure Activity Logs",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud management plane (e.g., AWS/Azure consoles and APIs)",
            "action": [
              "Symbolic: Create and maintain an allow-list of approved external cloud account IDs and domains for data sharing. Ingest threat intelligence feeds of known malicious cloud accounts/domains. Write a SIEM rule to alert whenever a cloud sharing event (e.g., AWS CloudTrail `ModifySnapshotAttribute`, Azure `Microsoft.Storage/storageAccounts/listkeys/action`) targets an account ID or domain not on the allow-list or present on the block-list.",
              "Statistical: For each user, establish a baseline of the set of external accounts they share resources with. Calculate the Jaccard similarity between the set of accounts a user shares with in a 24-hour window and their historical set of partners. An alert is generated if the similarity score is below a tuned threshold (e.g., < 0.1), indicating sharing with a novel set of accounts.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on historical cloud sharing events. Use features such as user role, source IP reputation, time of day, resource type being shared, and the historical frequency of the target account ID. The model should predict a 'malicious_share_probability' score for each event, flagging high-scoring events for analyst review."
            ]
          },
          {
            "description": "A command-line process is executed (e.g., `aws`, `az`) containing arguments for sharing resources (e.g., `modify-snapshot-attribute --attribute createVolumePermission`, `az storage blob sas generate`) with an external account.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer workstations, Administrator jump boxes, and CI/CD pipeline servers",
            "action": [
              "Symbolic: Using Windows Event ID 4688 (Process Creation) logs, create a detection rule that triggers on process command lines containing cloud CLI binaries (`aws.exe`, `az.cmd`) and specific sharing-related strings like `modify-snapshot-attribute`, `put-bucket-policy`, `copy-object --acl public-read`, or `storage blob sas generate --permissions r`.",
              "Statistical: For each host, profile the frequency of different cloud CLI commands executed. Calculate the Shannon entropy of the command distribution per host over a rolling 30-day window. A sudden, sharp decrease in entropy may indicate repetitive execution of a specific malicious command. Alert when the daily entropy for a host drops more than 2 standard deviations below its historical average.",
              "Machine Learning: Apply Natural Language Processing (NLP) techniques, like a pre-trained transformer model, to the command-line arguments from Event ID 4688. Fine-tune the model to classify commands into categories like 'benign-read', 'benign-write', and 'suspicious-share'. Flag commands classified as 'suspicious-share' for investigation."
            ]
          },
          {
            "description": "The total volume of data egressing to known cloud provider IP address ranges from a single internal host over a 24-hour period exceeds the 99th percentile of the host's historical 30-day baseline.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (firewalls, proxies) and VPN concentrators",
            "action": [
              "Symbolic: Define a static threshold for data exfiltration, such as 'alert if any single host sends more than 10GB of data to a cloud storage provider's IP range in one hour'. This rule acts as a simple, high-volume tripwire.",
              "Statistical: For each internal host, maintain a 30-day rolling baseline of hourly data egress volume (sum of `orig_bytes` in Zeek conn.log) to cloud provider IP ranges. Generate an alert if the volume in any given hour exceeds 3 standard deviations (Z-score > 3) above the host's historical mean for that same hour of the day.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA or LSTM) trained on each host's historical egress data volume from Zeek conn.log. The model predicts the expected data volume for the next hour. If the actual observed volume significantly exceeds the model's prediction interval (e.g., the upper bound of the 99% confidence interval), flag it as a volumetric anomaly."
            ]
          },
          {
            "description": "A cloud data sharing API call or CLI command is initiated by a user or from a host that is not part of a pre-defined group of authorized users/hosts (e.g., 'Cloud Administrators' group, 'ETL Servers' host group).",
            "data_sources": [
              "Windows Event ID 4688",
              "AWS CloudTrail logs",
              "Azure Activity Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory domain controllers, Cloud IAM service, and general user workstations",
            "action": [
              "Symbolic: Maintain an explicit allow-list of user accounts and hostnames authorized to perform cloud data sharing actions. Create a SIEM rule that cross-references the user/host from a sharing event (e.g., from CloudTrail `userIdentity` or process execution logs) against this list and alerts on any mismatch.",
              "Statistical: For each user, create a baseline profile of source IPs and hosts they typically use to initiate cloud API calls. Calculate the historical frequency of each user-host or user-IP pair. If a sharing action is initiated from a pair with a frequency below a certain threshold (e.g., seen less than 1% of the time for that user), flag it as a rare source anomaly.",
              "Machine Learning: Use an unsupervised learning algorithm like Peer Group Analysis or Clustering (e.g., k-means) on user activity data. Group users into clusters based on their behavior (e.g., 'Developers', 'Finance', 'Cloud Admins'). If a user executes a data sharing action that is typical of a different cluster, flag it as a behavioral deviation."
            ]
          },
          {
            "description": "A data resource is shared with an external cloud account ID that has never been seen before in the organization's historical cloud logs (e.g., across 180 days of CloudTrail logs).",
            "data_sources": [
              "AWS CloudTrail logs",
              "Azure Activity Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud management plane and Internet gateways",
            "action": [
              "Symbolic: Maintain a stateful list of all external cloud account IDs that have ever been the target of a sharing event. Generate a high-priority alert the first time a resource is shared with a new, previously unseen account ID.",
              "Statistical: Analyze the frequency of all destination account IDs in sharing events over the past 90 days. Calculate the inverse document frequency (IDF) for each account ID. An alert is triggered when a sharing event targets an account ID with a very high IDF score, indicating it is statistically rare.",
              "Machine Learning: Model the relationship between internal users and external sharing partners as a bipartite graph. Use a link prediction algorithm (e.g., based on Adamic-Adar index) to score the likelihood of a new sharing link being legitimate. A new sharing event that has a very low predicted likelihood score is flagged as anomalous."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]