[
  {
    "information_requirement": "Is an adversary leveraging a compromised internal account for lateral movement via internal spearphishing? (TA0008 - Lateral Movement) (PIR)",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1534",
        "name": "Internal Spearphishing",
        "evidence": [
          {
            "description": "An internal host communicates with a known malicious destination (IP, domain) or transfers a file with a known malicious hash, where the communication is associated with an email or chat application.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal DNS Resolvers, User Endpoints",
            "action": [
              "Symbolic Logic: Join Zeek conn.log destination IPs and Zeek dns.log query names against a threat intelligence feed of known malicious C2, phishing, and credential harvesting sites. Alert on any matches originating from internal IP space.",
              "Statistical Method: Calculate the rarity of requested domains in Zeek dns.log across the enterprise. Flag internal hosts connecting to domains in the bottom 5th percentile of popularity (long-tail analysis) that are also newly registered (e.g., within the last 30 days based on WHOIS data enrichment).",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) using features from Zeek logs (destination IP, port, domain reputation, query type, request headers) to predict the likelihood of a connection being malicious. Alert when the model flags a high-probability malicious connection originating from an internal host."
            ]
          },
          {
            "description": "An email client, browser, or office productivity application (e.g., OUTLOOK.EXE, WINWORD.EXE, CHROME.EXE, MSTEAMS.EXE) spawns a script interpreter or shell process (e.g., powershell.exe, cmd.exe, wscript.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Virtual Desktop Infrastructure (VDI), Application Servers",
            "action": [
              "Symbolic Logic: Create a detection rule to alert when a parent process from a watchlist (e.g., OUTLOOK.EXE, WINWORD.EXE, EXCEL.EXE, POWERPNT.EXE, MSTEAMS.EXE) spawns a child process from a watchlist (e.g., powershell.exe, cmd.exe, wscript.exe, cscript.exe, mshta.exe).",
              "Statistical Method: Analyze the command-line arguments of spawned processes (from Windows Event ID 4688) for high entropy strings. Calculate the Shannon entropy of command lines and flag those exceeding a baseline threshold (e.g., > 4.0), especially for script interpreters spawned by office or collaboration applications.",
              "Machine Learning: Train a decision tree or random forest classifier on historical process creation events (Windows Event ID 4688), using features like parent process name, child process name, command-line length, command-line entropy, and user context. Use the trained model to classify new process creation events as benign or suspicious in real-time."
            ]
          },
          {
            "description": "An email sent between internal accounts exhibits anomalous characteristics, such as a mismatch between the 'From' and 'Reply-To' headers, the presence of URL shorteners, or the inclusion of rare or high-risk attachment types (e.g., .iso, .lnk, .html).",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Mail Transfer Agents, Network Segments with Email Servers",
            "action": [
              "Symbolic Logic: From Zeek smtp.log, create a rule to flag any email where the 'from' and 'reply-to' fields are different, especially when the 'from' address is internal. Also, flag emails containing known URL shortener domains (e.g., bit.ly, t.co).",
              "Statistical Method: Perform a frequency analysis on file attachment MIME types or extensions seen in Zeek smtp.log or files.log for internal-to-internal email. Establish a baseline of common types (e.g., .pdf, .docx, .xlsx). Alert when an email contains a statistically rare attachment type (e.g., .iso, .vhd, .lnk, .html) that falls below the 1st percentile of frequency.",
              "Machine Learning: Develop a logistic regression model to score the risk of an email based on features extracted from Zeek smtp.log. Features can include: presence of attachments, header mismatches (binary), URL count, subject line length, and whether the sender-recipient pair is new. A high probability score from the model indicates a potentially malicious email."
            ]
          },
          {
            "description": "A sequence of events occurs on a single host within a short time window: 1) User clicks a link in an email or chat, leading to a network connection. 2) A suspicious process is created. 3) The new process makes outbound network connections or attempts to access other internal resources.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, File Servers, Network Egress Points, DNS Resolvers",
            "action": [
              "Symbolic Logic: Create a correlation rule that triggers when, for a single host, a DNS query for a non-categorized or newly registered domain (Zeek dns.log) is followed within 5 minutes by a suspicious process creation (Windows Event ID 4688, e.g., WINWORD.EXE -> powershell.exe), which is then followed within 5 minutes by an attempted network share access (Windows Event ID 5145).",
              "Statistical Method: For each user, establish a baseline of commonly accessed network shares (from Windows Event ID 5145). Following a potential phishing click (e.g., connection to a low-reputation domain from Zeek logs), flag any subsequent access to a statistically rare share for that user (e.g., a share they have never accessed or access less than 1% of the time).",
              "Machine Learning: Use a sequence analysis model (e.g., a Hidden Markov Model) trained on event logs (DNS, process, file access) to identify anomalous sequences of user/host behavior. The model learns normal 'chains' of activity and flags deviations that match the pattern of a successful phish followed by lateral movement attempts."
            ]
          },
          {
            "description": "An internal user account sends an abnormally high volume of emails to other internal users, where the emails share highly similar subject lines or content, deviating from the account's established sending patterns.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Mail Transfer Agents, Network Segments with Email Servers",
            "action": [
              "Symbolic Logic: Create a rule that triggers if a single internal source IP sends emails to more than 100 unique internal recipients within a 1-hour window, where the subject line is identical.",
              "Statistical Method: For each internal sender, calculate a 30-day rolling baseline (mean and standard deviation) for (a) emails sent per hour and (b) unique recipients per hour, using Zeek smtp.log. Alert when a sender exceeds 3 standard deviations above the mean for both metrics in the same hour.",
              "Machine Learning: Use clustering algorithms (e.g., DBSCAN) on email metadata from Zeek smtp.log. Cluster emails based on features like subject line (using TF-IDF or embeddings), number of recipients, and sender. A dense cluster of emails from a single sender in a short time frame, which is not typical for that sender based on historical data, indicates a potential internal spearphishing campaign."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]