[
  {
    "information_requirement": "Is the adversary maintaining persistence using component firmware?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1542.002",
        "name": "Component Firmware",
        "evidence": [
          {
            "description": "A record of an outbound network connection (TCP/UDP/ICMP) from an internal host to an external IP address, or a DNS query for a domain, that is present on a threat intelligence feed specifically tracking indicators of compromise (IOCs) for firmware-level malware.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, internet gateways), DNS resolvers",
            "action": [
              "Correlate destination IPs from Zeek conn.log and requested domains from Zeek dns.log against a high-confidence threat intelligence feed of C2 servers associated with known firmware implants (e.g., LoJax, CosmicStrand). Generate a high-priority alert upon any match.",
              "For hosts communicating with non-categorized or newly observed domains, calculate the Shannon entropy of the requested subdomains in Zeek dns.log. A consistently high entropy score (e.g., > 3.5) for a single host's DNS requests may indicate the use of Domain Generation Algorithms (DGA), a common feature of advanced implants.",
              "Train a time-series anomaly detection model (e.g., ARIMA or LSTM) on the daily volume of outbound connections per host. A sudden, unexplained spike in connections that does not correlate with patching or software updates, especially to destinations not seen before, could indicate implant activation."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) for a known firmware update utility where the command line contains high-risk arguments (e.g., force flash, silent install), the process is executed from a non-standard directory (e.g., user profile temp folders), or the parent process is unexpected (e.g., outlook.exe, winword.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (e.g., domain controllers, database servers), executive workstations, administrator workstations",
            "action": [
              "Create a detection rule that monitors Windows Event ID 4688 for executions of known firmware flashing utility executables (e.g., fwupdmgr.exe, vendor-specific names). Alert if the command line contains suspicious flags like '/force', '/silent', or arguments for writing firmware to a file, or if the parent process is not explorer.exe, services.exe, or cmd.exe.",
              "For each host, establish a baseline of parent-child process relationships for firmware update utilities. Calculate the rarity of a given parent process (e.g., powershell.exe) launching an update utility. An execution from a parent process that falls below the 1st percentile of historical frequency should be flagged for investigation.",
              "Use a classification model (e.g., Random Forest) trained on legitimate and malicious process execution features. Features should include: process name, parent process name, command-line argument patterns, user context (admin vs. standard user), and execution path. Classify new firmware utility executions as benign or suspicious based on this model."
            ]
          },
          {
            "description": "A discrepancy where outbound network traffic is observed in network flow logs (Zeek conn.log) but a corresponding network connection creation event (Windows Event ID 5156) with an associated Process ID is absent on the source host within a tight time window.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, endpoint Windows Filtering Platform (WFP) logs",
            "action": [
              "On a per-host basis, join Zeek conn.log records with Windows Event ID 5156 records by source IP and timestamp (+/- 1 second). Create an alert for any outbound Zeek connection that has no corresponding Windows event, filtering out expected broadcast/multicast traffic.",
              "For each host, calculate the ratio of 'unattributed' network flows (flows without a matching host event) to 'attributed' flows over a rolling 24-hour window. A host whose ratio exceeds 3 standard deviations from its own baseline or the network-wide average indicates a high probability of 'ghost' network activity.",
              "Develop a time-series model to forecast the expected volume of unattributed traffic for each host (which should normally be near zero). Anomaly detection algorithms can then flag any significant, unexplained deviation from this forecast, which could signal the activation of a firmware-based implant."
            ]
          },
          {
            "description": "A documented series of service control manager events (e.g., Windows Event IDs 7000, 7026) or disk errors (Windows Event IDs 7, 11) for the same hardware component (e.g., a specific NIC or disk controller) on a host that persists across multiple re-imaging or rebuild procedures.",
            "data_sources": [
              "Windows Event ID 7000",
              "Windows Event ID 7026",
              "Windows Event ID 7",
              "Windows Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint and server system event logs, IT service management/ticketing system for re-imaging history",
            "action": [
              "Create a rule to alert when a specific host generates more than a set threshold (e.g., 5) of driver or disk-related error events (Event IDs 7, 11, 7000, 7026) for the same device in a 24-hour period. Cross-reference the host against asset management records to see if it has been recently re-imaged; if so, escalate the priority.",
              "For each device class (e.g., 'Intel NICs', 'Samsung SSDs'), calculate the mean and standard deviation of error event frequency across the enterprise. Flag any individual host whose error rate for a specific component exceeds 3 standard deviations above the mean for its class.",
              "Use a clustering algorithm (e.g., DBSCAN) on hosts, with features being the count of different error event IDs over time. Identify clusters of 'unhealthy' hosts and investigate if failures persist post-remediation (re-imaging), which strengthens the firmware compromise hypothesis."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using component firmware?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1542.002",
        "name": "Component Firmware",
        "evidence": [
          {
            "description": "A network connection whose protocol fields or data payload contains a byte sequence that matches a known signature for a firmware implant's C2 protocol. This could manifest in non-standard DNS query types, specific ICMP message content, or unique TCP/UDP header manipulations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network taps at key aggregation points, network security monitoring (NSM) sensor grid",
            "action": [
              "Deploy and continuously update IDS/NSM signatures (e.g., for Zeek or Suricata) that are specifically designed to detect hardcoded patterns, magic values, or protocol structures used by known firmware implants. Trigger a high-severity alert on any signature match.",
              "Calculate the frequency distribution of DNS record types (A, AAAA, TXT, etc.) requested per host from Zeek dns.log. A host making an unusually high proportion of non-standard requests (e.g., NULL, CNAME for exfiltration) compared to its baseline or peer group (e.g., >95th percentile) should be investigated for DNS tunneling.",
              "Train a sequence-based model (e.g., an LSTM autoencoder) on the byte-level content of packet payloads for common protocols like DNS and ICMP. Payloads that have a high reconstruction error are anomalous and may contain covert channel data, warranting deeper inspection."
            ]
          },
          {
            "description": "A correlated sequence of events on a single host within a short time window (e.g., < 5 minutes) consisting of: 1) A 'Service Stop' event (Windows Event ID 7036) for a primary security agent (AV, EDR). 2) A process creation event (Windows Event ID 4688) for a firmware update utility.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 4688",
              "Windows Event ID 1001"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint and server security and system event logs, SIEM correlation engine",
            "action": [
              "Implement a SIEM correlation rule that triggers an alert when, on a single host, Event ID 7036 (service stop) for a process name matching a known security tool is followed within 5 minutes by Event ID 4688 for a process name matching a known firmware utility.",
              "Establish a baseline for the mean time between a security service stopping and restarting during normal update cycles. An instance where a security service stops and a firmware utility is run, and the service remains stopped for a duration greater than 3 standard deviations from the update baseline, is highly suspicious.",
              "Use a sequence analysis model (e.g., Hidden Markov Model) to learn common event log sequences. Define 'security tool disabled' and 'firmware tool executed' as states. An observed transition between these states that has a very low probability under the trained model should be flagged as a potential attack chain."
            ]
          },
          {
            "description": "A recurring pattern of application crash events (Windows Event ID 1001) for security scanning tools (e.g., chkdsk.exe, AVScanner.exe) or disk corruption errors (Windows Event ID 55) that prevent full system scans, suggesting interference at the storage controller level.",
            "data_sources": [
              "Windows Event ID 55",
              "Windows Event ID 137",
              "Windows Event ID 1001"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint and server system and application event logs, hosts with high-value data",
            "action": [
              "Create a detection rule that alerts when Windows Event ID 1001 (Application Error) is generated for a process name associated with a disk integrity checker or antivirus scanner, and this event is preceded by disk-related errors like Event ID 55 (Bad Block) within the last hour on the same host.",
              "Track the completion rate of scheduled antivirus and integrity scans across the enterprise. Use outlier detection to identify hosts that consistently fail to complete scans, or whose scan completion rate is a statistical outlier (e.g., below the 5th percentile) compared to hosts with similar hardware.",
              "Train a classification model to predict scan failure based on features like host hardware model and recent error counts. If the model predicts a low probability of failure but the scan fails anyway, it suggests an unmodeled factor, such as malicious firmware, is at play."
            ]
          },
          {
            "description": "Network traffic from a host exhibiting statistically significant deviations from normal protocol usage. Examples include: DNS queries with abnormally high subdomain entropy, TCP connections with non-standard flag combinations, or HTTP traffic where image file sizes have low variance.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic captures at internet gateways, internal network core, and DMZ segments",
            "action": [
              "Implement a rule to detect specific covert channel methods, such as DNS queries where the subdomain is a long hex-encoded string, or ICMP echo request packets where the payload size is consistently non-standard (e.g., > 64 bytes), suggesting data tunneling.",
              "For each host, calculate the Shannon entropy of its requested DNS subdomains in Zeek dns.log over a 1-hour window. Flag any host whose average entropy exceeds a high threshold (e.g., > 4.0), which is a strong indicator of DGA or DNS tunneling.",
              "Use an unsupervised learning model like an autoencoder on feature vectors derived from network flows (e.g., from Zeek conn.log: duration, protocol, service, byte counts, TCP flags). Flows with high reconstruction error are flagged as anomalies, potentially indicating covert channels that deviate from normal statistical properties."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]