[
  {
    "information_requirement": "Is the adversary maintaining persistence using XDG Autostart entries?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1547.013",
        "name": "XDG Autostart Entries",
        "evidence": [
          {
            "description": "An XDG autostart .desktop file is created or modified, and its file hash or the hash of its referenced executable in the 'Exec=' line matches a known malicious indicator from threat intelligence.",
            "data_sources": [
              "Sysmon for Linux Event ID 11",
              "Sysmon for Linux Event ID 1",
              "Linux Auditd"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux workstations and servers running desktop environments (e.g., GNOME, KDE), specifically monitoring user-specific and system-wide autostart directories.",
            "action": [
              "Symbolic: Continuously monitor file creation events (e.g., Sysmon for Linux Event ID 11) in `/etc/xdg/autostart` and `~/.config/autostart` directories. Upon creation of a `.desktop` file, hash the file and any executable referenced in its 'Exec=' line. Correlate these hashes against a threat intelligence feed of known malicious file hashes and alert on any match.",
              "Statistical: Analyze the prevalence of file hashes for all `.desktop` files and their referenced executables across the enterprise. A hash that is new and appears on only one or a small number of systems (e.g., <1st percentile of prevalence) should have its alert severity increased, even without a direct threat intelligence match.",
              "Machine Learning: Develop a classification model trained on features of `.desktop` files (e.g., file size, entropy, referenced paths, command structure) and their associated executables. Use this model to score newly created autostart entries, flagging those classified as 'malicious' with high confidence, especially when correlated with a threat intelligence hit or low statistical prevalence."
            ]
          },
          {
            "description": "An XDG autostart .desktop file is created or modified to contain a suspicious 'Exec=' line, characterized by invocation of an interpreter on a file in a non-standard location or the use of obfuscation techniques.",
            "data_sources": [
              "Sysmon for Linux Event ID 11",
              "Linux Auditd"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux workstations and servers running desktop environments, focusing on the contents of newly created or modified `.desktop` files.",
            "action": [
              "Symbolic: Parse the 'Exec=' line of newly created or modified `.desktop` files (from Sysmon for Linux Event ID 11 or Auditd logs). Use regular expressions to flag commands that invoke interpreters (e.g., sh, bash, python, perl) on scripts in world-writable directories like `/tmp`, `/var/tmp`, or `/dev/shm`, or that contain known obfuscation patterns like `base64 --decode` or `| sh`.",
              "Statistical: Establish a baseline of legitimate 'Exec=' command line lengths and Shannon entropy scores for all `.desktop` files in the environment. Calculate the 95th percentile for both metrics. Alert on any new or modified autostart entry where the command line length or entropy exceeds this statistical threshold, indicating potential obfuscation or unusual complexity.",
              "Machine Learning: Use a Natural Language Processing (NLP) model, such as a one-class SVM or an autoencoder, trained on the command strings from legitimate `.desktop` files. Process new 'Exec=' lines through the model to calculate a reconstruction error or anomaly score. High scores indicate a significant deviation from normal command structures and should be flagged for investigation."
            ]
          },
          {
            "description": "An XDG autostart .desktop file is created with a 'Name=' field value that closely mimics a legitimate application but points to a different executable path or has anomalous file permissions.",
            "data_sources": [
              "Sysmon for Linux Event ID 11",
              "Linux Auditd"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux workstations and servers running desktop environments, comparing metadata of new `.desktop` files against a baseline of known-good applications.",
            "action": [
              "Symbolic: Maintain a dictionary mapping legitimate 'Name=' field values (e.g., 'GNOME Terminal') to their expected 'Exec=' paths (e.g., '/usr/bin/gnome-terminal'). Upon creation/modification of a `.desktop` file, check if the 'Name=' exists in the dictionary but the 'Exec=' path does not match. Alert on any mismatch, which indicates potential masquerading.",
              "Statistical: For each new 'Name=' field in a `.desktop` file, calculate the Levenshtein distance against all known legitimate application names. Flag entries where the distance is small but non-zero (e.g., a distance of 1 or 2), suggesting a typo-squatting attempt (e.g., 'Gnome Termanal' vs 'Gnome Terminal').",
              "Machine Learning: Develop a clustering model (e.g., K-Means or DBSCAN) using features extracted from `.desktop` files, including the 'Name=' field, 'Exec=' path, and file permissions. Legitimate applications from the same software suite should form distinct clusters. Identify outliers that do not belong to any established cluster as potentially malicious masquerading attempts."
            ]
          },
          {
            "description": "A process launched via an XDG autostart entry establishes a network connection to a statistically rare external destination or deletes its source .desktop file immediately after execution.",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "Sysmon for Linux Event ID 3",
              "Sysmon for Linux Event ID 23",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux workstations and servers with desktop environments; network egress points (e.g., firewalls, proxies) where Zeek sensors are deployed.",
            "action": [
              "Symbolic: Correlate process creation events (Sysmon for Linux ID 1) whose parent process is a desktop environment component with subsequent network connections (Zeek conn.log, Sysmon for Linux ID 3). Join the destination IP address and domain against a threat intelligence feed of known C2 servers. Alert on any match.",
              "Statistical: For each process spawned from an autostart entry, analyze its network connections. Establish a baseline of destination countries, ASNs, and port numbers for legitimate autostart processes. Using frequency analysis, flag connections to destinations that fall outside the top 99% most common (i.e., are rare) for that application or for all autostart processes in general.",
              "Machine Learning: Implement a sequence analysis model to detect the specific pattern: user login -> autostart process create (Sysmon ID 1) -> network connection (Sysmon ID 3) -> source `.desktop` file delete (Sysmon ID 23) within a short time window (e.g., 60 seconds). A match to this behavioral sequence is a strong indicator of anti-forensic activity."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting privilege escalation using XDG Autostart entries?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1547.013",
        "name": "XDG Autostart Entries",
        "evidence": [
          {
            "description": "A process launched from a system-wide XDG autostart directory (`/etc/xdg/autostart`) establishes a network connection to a known malicious C2 infrastructure or a statistically rare destination.",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "Sysmon for Linux Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System-wide configuration directories on all Linux servers and workstations (e.g., `/etc/xdg/autostart`); network egress points with Zeek sensors.",
            "action": [
              "Symbolic: Monitor for process creation events (Sysmon for Linux ID 1) where the process image path originates from a `.desktop` file in `/etc/xdg/autostart`. Correlate these processes with network connection events (Zeek conn.log, Sysmon for Linux ID 3) and match the destination IP/domain against a C2 threat intelligence feed. Alert on any match.",
              "Statistical: For all processes originating from `/etc/xdg/autostart`, profile their network behavior. Calculate the prevalence of each destination IP, domain, and port. Alert when a process connects to a destination that is statistically rare (e.g., seen for the first time, or in the bottom 1st percentile of connection frequency across the enterprise), as system-wide autostart processes should have highly predictable network traffic.",
              "Machine Learning: Train a time-series anomaly detection model on the network beaconing characteristics (e.g., connection frequency, payload size, interval regularity using Fourier analysis) of legitimate processes from `/etc/xdg/autostart`. A process exhibiting a highly regular, 'heartbeat'-like connection pattern that deviates from the learned baseline is a strong candidate for a C2 agent."
            ]
          },
          {
            "description": "A process launched from a system-wide XDG autostart directory executes a command containing known privilege escalation tools, exploits, or suspicious syntax.",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "Linux Auditd"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System-wide configuration directories on all Linux servers and workstations (e.g., `/etc/xdg/autostart`), monitoring for process command-line arguments.",
            "action": [
              "Symbolic: From process creation logs (Sysmon for Linux ID 1, Auditd `execve`), inspect the command line of any process launched from `/etc/xdg/autostart`. Use regular expressions to search for explicit privilege escalation commands or tools such as `sudo`, `pkexec`, `chmod u+s`, `setcap`, or calls to known local exploit scripts. Alert on any match.",
              "Statistical: Analyze the command lines of processes originating from `/etc/xdg/autostart`. Calculate the distribution of commands and arguments used. Flag any command whose structure has a low probability score based on a baseline model of legitimate system-wide autostart commands. For example, a command with an unusually high number of arguments or special characters would be anomalous.",
              "Machine Learning: Use a pre-trained NLP transformer model fine-tuned on malicious and benign shell commands. Classify the command line string of each process launched from `/etc/xdg/autostart`. Alert when the model classifies a command as 'malicious' or 'privilege escalation' with a high confidence score."
            ]
          },
          {
            "description": "A system-wide XDG autostart directory (`/etc/xdg/autostart`) or a `.desktop` file within it is created or modified by an unauthorized (non-root) user account.",
            "data_sources": [
              "Sysmon for Linux Event ID 11",
              "Linux Auditd"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File system ACLs and audit logs for the `/etc/xdg/autostart/` directory on all Linux hosts.",
            "action": [
              "Symbolic: Configure file integrity monitoring (via Auditd watches or Sysmon rules) for the `/etc/xdg/autostart/` directory. For every file creation or modification event (e.g., Sysmon for Linux Event ID 11), inspect the User field. Trigger a high-severity alert if the user is not `root` (or the associated UID is not 0).",
              "Statistical: Create a baseline of user accounts that legitimately modify files in `/etc/xdg/autostart`. This list should almost exclusively contain `root` and system package management accounts. Monitor the frequency of modification events per user. An alert should be generated if a user not on the baseline list performs a modification, or if the frequency of modifications by a legitimate user exceeds a statistical threshold (e.g., > 3 standard deviations from their own historical mean).",
              "Machine Learning: Train a one-class SVM or isolation forest model on legitimate file modification events in `/etc/xdg/autostart`. Features should include the user account, source process, time of day, and day of week. Use the model to score all new modification events. Events that are flagged as anomalous (e.g., a modification by a user process at 3 AM) should be alerted on as potential unauthorized privilege escalation."
            ]
          },
          {
            "description": "A process launched from a system-wide XDG autostart directory writes a file to a sensitive system location or modifies a critical configuration file not part of its normal behavior.",
            "data_sources": [
              "Sysmon for Linux Event ID 1",
              "Sysmon for Linux Event ID 11",
              "Linux Auditd"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux servers and workstations, monitoring process activity and file system modifications in sensitive directories like `/etc`, `/bin`, `/sbin`, `/usr/bin`, `/usr/sbin`, and user `cron` or `bash` profile locations.",
            "action": [
              "Symbolic: Correlate process creation events (Sysmon ID 1) from `/etc/xdg/autostart` with subsequent file creation/modification events (Sysmon ID 11) by the same process. Maintain a deny-list of sensitive system directories (e.g., `/etc/`, `/bin/`, `/usr/sbin/`, `/root/`) and configuration files (e.g., `/etc/passwd`, `/etc/sudoers`). Alert if a process from a system autostart entry writes to any of these locations.",
              "Statistical: For each process launched from `/etc/xdg/autostart`, track the file paths it writes to. Build a baseline of 'normal' write locations for legitimate system autostart processes. Calculate the rarity of each write path. Alert when a process writes to a path that has never been seen before or is in the lowest percentile of write frequency, indicating deviation from established behavior.",
              "Machine Learning: Develop a graph-based anomaly detection model where nodes are processes and files, and edges represent interactions (e.g., 'writes to'). Train the model on legitimate system behavior following login. A process originating from `/etc/xdg/autostart` that creates an edge to a sensitive file node, where such an edge is not present in the baseline graph, represents a structural anomaly and should trigger an alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]