[
  {
    "information_requirement": "Has the adversary established persistence by modifying component firmware?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1542.002",
        "name": "Component Firmware",
        "evidence": [
          {
            "description": "An outbound network connection (TCP/UDP/ICMP) or a DNS query from an internal host to an external destination IP address or domain that matches a known indicator of compromise (IOC) specifically associated with firmware-level malware C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, internet gateways), DNS resolvers, network security monitoring sensor grid",
            "action": [
              "Join Zeek conn.log and dns.log records with a threat intelligence feed of known firmware implant C2 domains and IPs (e.g., associated with LoJax, CosmicStrand). Generate a critical alert for any connection or query that matches an indicator on this high-confidence feed.",
              "For each host, compute a rolling 1-hour average of the Shannon entropy of requested DNS query names from Zeek dns.log. Flag hosts where the average entropy exceeds a dynamically calculated 99th percentile across all hosts, or a static threshold of 4.0, indicating potential Domain Generation Algorithm (DGA) activity.",
              "Develop a multivariate time-series anomaly detection model (e.g., VAR, LSTM) for each host, using features from Zeek conn.log such as total outbound bytes, unique destination IPs, connection duration, and protocol mix. An anomaly score that spikes without a corresponding known business reason (e.g., software update) indicates potential implant activation."
            ]
          },
          {
            "description": "A process creation event for a known firmware update utility where the execution context is anomalous. Anomalies include the use of high-risk command line arguments, execution from a non-standard directory, or being launched by an unexpected parent process.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (e.g., domain controllers, database servers), executive workstations, administrator workstations, endpoint detection and response (EDR) logs",
            "action": [
              "Create a SIEM rule to alert on Windows Event ID 4688 where `ProcessName` matches a list of known firmware flashing utilities (e.g., fwupd.exe, AFUWIN.exe) AND (`CommandLine` contains risky flags like '/force' or '/p /b /n /k') OR (`ParentProcessName` is not explorer.exe, services.exe, cmd.exe, or a known admin tool). Correlate with PowerShell logs (Event ID 4104) for suspicious script-based execution.",
              "For each known firmware flashing utility, build a historical frequency table of its parent processes across the enterprise. Alert if a utility is launched by a parent process that falls in the bottom 5th percentile of historical frequency, indicating an anomalous execution chain.",
              "Train a supervised classification model (e.g., Gradient Boosting) to predict malicious firmware utility executions. Features should include: process name, parent process name, command-line argument length and entropy, user context (SYSTEM vs. Admin), execution path rarity, and time-of-day. The model will classify each new execution as suspicious or benign."
            ]
          },
          {
            "description": "A discrepancy where outbound network traffic is observed in network flow logs but a corresponding network connection creation event with an associated Process ID is absent on the source host within a tight time window (e.g., +/- 2 seconds).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, endpoint Windows Filtering Platform (WFP) logs on all servers and workstations",
            "action": [
              "On a per-host basis, perform a left join from Zeek conn.log (outbound connections) to Windows Event ID 5156 (network connection creation) on `source IP`, `destination IP`, `destination port`, and `timestamp` (within a +/- 2-second window). Alert on any record from Zeek conn.log that has no matching host event, after filtering expected unattributed traffic like network broadcasts.",
              "Calculate a daily ratio of unattributed-to-attributed network connections for each host. Flag any host where this ratio exceeds 3 standard deviations above its own 30-day rolling average, indicating a significant increase in network traffic not associated with an OS-reported process.",
              "Implement a univariate time-series forecasting model (e.g., Prophet) for the count of unattributed network connections per host per hour. An actual count that falls outside the model's 99% confidence interval is flagged as an anomaly, potentially signaling a firmware implant's network activity."
            ]
          },
          {
            "description": "A host exhibits a recurring pattern of critical driver or disk-related error events for the same hardware component that persists even after the host's operating system has been re-imaged.",
            "data_sources": [
              "Windows Event ID 7000",
              "Windows Event ID 7026",
              "Windows Event ID 7",
              "Windows Event ID 11",
              "Windows Event ID 55"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint and server system event logs, IT service management/ticketing system for re-imaging history, asset management database",
            "action": [
              "Create a SIEM rule that triggers when a host logs more than 10 critical disk or driver-related errors (e.g., Event IDs 7, 11, 55, 7000, 7026) in 24 hours. The alert should automatically query the asset management database to check if the host's `lastReimagedDate` is within the last 7 days; if so, escalate the alert priority.",
              "For each hardware model in the asset inventory, establish a baseline error rate (errors per day) for relevant event IDs. Flag any individual host whose daily error count for a specific component exceeds the 98th percentile for its hardware model class.",
              "Apply a clustering algorithm (e.g., DBSCAN) to hosts based on a feature vector of normalized error counts (Event IDs 7, 11, 55, etc.) over a 30-day period. Investigate clusters of 'unhealthy' hosts. If a host remains in an unhealthy cluster after a re-imaging event, it strongly suggests a hardware or firmware-level issue, potentially malicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by operating from component firmware?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1542.002",
        "name": "Component Firmware",
        "evidence": [
          {
            "description": "Network traffic whose protocol fields or data payload contains a byte sequence, structural anomaly, or cryptographic fingerprint (e.g., JA3/JA3S hash) matching a known signature for a firmware implant's C2 protocol.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log",
              "Zeek weird.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network taps at key aggregation points, network security monitoring (NSM) sensor grid, internet gateways",
            "action": [
              "Implement Zeek/Suricata signatures that match on known byte patterns, unusual protocol field values, and structures associated with firmware implant C2 channels. Additionally, join Zeek `ssl.log` with a threat intelligence feed of JA3/JA3S hashes of known implants and alert on matches. Monitor `weird.log` for protocol anomalies.",
              "For each host, calculate the ratio of TXT/NULL/CNAME queries to A/AAAA queries from Zeek dns.log over a 1-hour window. Flag any host where this ratio exceeds the 99th percentile of all hosts, indicating potential use of DNS for C2 or data exfiltration.",
              "Train a 1D Convolutional Neural Network (CNN) or LSTM autoencoder on the raw byte payload of DNS and ICMP packets from a baseline period. Feed live traffic through the model and flag any packet with a reconstruction error above a dynamically determined threshold, indicating a payload that is structurally anomalous."
            ]
          },
          {
            "description": "A correlated sequence of events on a single host where a primary security agent (e.g., AV, EDR) is stopped or disabled, immediately followed by the execution of a firmware update utility or installation of a suspicious new service.",
            "data_sources": [
              "Windows Event ID 7036",
              "Windows Event ID 4688",
              "Windows Event ID 4697",
              "Windows Event ID 1001"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint and server security and system event logs, SIEM correlation engine, EDR platform alerts",
            "action": [
              "Create a SIEM correlation rule that alerts when, on a single host, Event ID 7036 (service stop) for a known security agent is followed within 5 minutes by Event ID 4688 (process creation) for a firmware utility OR Event ID 4697 (service installation) with a suspicious service name.",
              "For normal security agent update cycles, calculate the 95th percentile for the duration the service is stopped. Alert if a service stop event is followed by a firmware utility execution, and the service remains stopped for a duration exceeding this percentile.",
              "Model host event log sequences using a Hidden Markov Model (HMM). Define states like 'Nominal Operation', 'Security Service Disabled', and 'Suspicious Utility Executed'. Flag any observed sequence of state transitions that has a very low probability under the trained model as a potential multi-stage attack."
            ]
          },
          {
            "description": "A host exhibits a recurring pattern of application crashes for security scanning tools or disk corruption errors that prevent full system scans, suggesting malicious interference at the storage controller or hardware level.",
            "data_sources": [
              "Windows Event ID 55",
              "Windows Event ID 137",
              "Windows Event ID 1001"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint and server system and application event logs, hosts with high-value data, EDR/AV management consoles",
            "action": [
              "Create a SIEM rule to alert when Event ID 1001 (Application Error) for a process name matching a security scanner (e.g., `MsMpEng.exe`, `chkdsk.exe`) is preceded within 1 hour on the same host by disk corruption events (e.g., Event ID 55, 137). Escalate if this pattern repeats.",
              "Maintain a rolling 30-day average of scan completion rates for all endpoints from the EDR/AV console. Flag hosts whose completion rate falls more than 3 standard deviations below the average for their specific hardware model and OS version, indicating a potential targeted issue.",
              "Use a logistic regression model to predict the probability of a scheduled scan failure based on features like host age, hardware model, and recent non-critical error counts. A scan failure on a host that the model predicted had a very low probability of failure (e.g., < 5%) suggests an unmodeled, potentially malicious, causal factor."
            ]
          },
          {
            "description": "Outbound network traffic from a host exhibits characteristics of C2 beaconing, such as highly periodic connections with low jitter and consistent data volumes, that are not attributable to any known legitimate application.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic captures at internet gateways, internal network core, and DMZ segments",
            "action": [
              "Implement a rule to detect specific covert channel methods, such as DNS queries where the subdomain is a long hex-encoded string, or ICMP echo request packets where the payload size is consistently non-standard (e.g., > 128 bytes), suggesting data tunneling.",
              "For each source-destination IP pair in Zeek conn.log, analyze the time deltas between connections over a 24-hour period. Calculate the standard deviation of these deltas (jitter). A connection pair with a jitter below a low threshold (e.g., < 1 second) and more than 10 connections indicates highly regular, machine-generated beaconing.",
              "Use an unsupervised learning model like an isolation forest on feature vectors derived from Zeek conn.log sessions. Features should include: `duration`, `orig_bytes`, `resp_bytes`, `proto`, `service`, `missed_bytes`, and TCP flag counts. Sessions identified as strong anomalies are candidates for covert channels used by firmware implants that evade signature-based detection."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]