[
  {
    "information_requirement": "Is the adversary maintaining persistence by modifying or creating shortcuts?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1547.009",
        "name": "Shortcut Modification",
        "evidence": [
          {
            "description": "A newly created or modified shortcut (.lnk) file's target path resolves to an executable with a known malicious hash, or contains a command-line argument referencing a known malicious C2 domain or IP address.",
            "data_sources": [
              "Windows Sysmon Event ID 1",
              "Windows Sysmon Event ID 11",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User profile directories (%APPDATA%), Common startup folders (%ALLUSERSPROFILE%), Endpoint download folders, Network gateway traffic logs",
            "action": [
              "Symbolic Logic: Upon .lnk file execution (Sysmon Event ID 1), extract the target executable path. Hash the target file and join against a threat intelligence feed of malicious file hashes. Separately, parse command-line arguments for domains/IPs and join against a C2 indicator feed. Alert on any match.",
              "Statistical Analysis: Correlate processes spawned from .lnk files with subsequent network connections (Zeek conn.log). For each destination IP, calculate its global rarity (how many other hosts connect to it). Flag connections to IPs in the bottom 1st percentile of prevalence across the enterprise, suggesting a non-standard or dedicated C2 server.",
              "Machine Learning: Implement a supervised classification model that scores the maliciousness of a .lnk execution. Features include: target file hash presence in threat feeds (binary feature), command-line argument domain/IP reputation score, target file signature status (signed/unsigned), and network connection features (port, protocol). Train the model on known malicious and benign .lnk execution data."
            ]
          },
          {
            "description": "A shortcut (.lnk) file is created or modified in a persistence location (e.g., Startup folder) to execute a Living-off-the-Land Binary (LOLBAS) with arguments indicative of malicious execution, such as encoded commands, no profile flags, or script downloads.",
            "data_sources": [
              "Windows Sysmon Event ID 1",
              "Windows Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User-specific startup folders (%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup), System-wide startup folders (C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp), User Desktop folders",
            "action": [
              "Symbolic Logic: Create a rule to detect process creation events (Sysmon Event ID 1) where the ParentImage is 'explorer.exe' and the Image is a known LOLBAS (e.g., powershell.exe, mshta.exe, wscript.exe) and the CommandLine contains suspicious patterns like '-e', 'IEX', 'DownloadString', '.hta', or 'rundll32.exe ... javascript:'. Correlate with a preceding file creation (Sysmon Event ID 11) of a .lnk file in a startup folder within a short time window.",
              "Statistical Analysis: For all processes launched from .lnk files targeting LOLBAS, calculate the entropy of the command-line arguments. Establish a per-LOLBAS baseline for argument entropy. Flag any execution where the argument entropy exceeds the 98th percentile of the established baseline for that specific LOLBAS, indicating likely obfuscation or encoding.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from LOLBAS executions originating from .lnk files. Features should include: target process name, command-line length, argument entropy, and the presence of specific keywords ('http', 'powershell', 'script'). Identify and investigate outlier clusters representing anomalous usage patterns."
            ]
          },
          {
            "description": "A process tree originating from a newly created startup shortcut (.lnk) exhibits anomalous behavior, such as unexpected child processes (e.g., discovery commands) or network connections to rare external destinations.",
            "data_sources": [
              "Windows Sysmon Event ID 1",
              "Windows Sysmon Event ID 11",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process execution logs, Network egress points, DNS resolvers, User and system startup folders",
            "action": [
              "Symbolic Logic: Define a rule that triggers when a process launched from a startup .lnk file (identified by parent-child relationship and file path) spawns a child process from a list of sensitive binaries (e.g., whoami.exe, net.exe, ipconfig.exe, powershell.exe, cmd.exe) within 60 seconds of execution.",
              "Statistical Analysis: For each process launched from a startup .lnk, build a profile of its typical child processes and network connections (destination ports, protocols, data volume). Use a multi-metric scoring system where deviations from the baseline (e.g., new child process, connection to a port not in the top 95% of common ports for that process, data upload volume > 3 standard deviations from the mean) contribute to a risk score. Alert on high cumulative scores.",
              "Machine Learning: Use a time-series model (e.g., ARIMA or LSTM) to forecast the expected number of new .lnk files created in startup folders per day/hour. An alert is generated when the actual count significantly exceeds the forecasted value with its confidence interval, indicating a potential mass deployment of persistence mechanisms."
            ]
          },
          {
            "description": "A shortcut (.lnk) file is created with metadata properties inconsistent with its purported function, such as an icon pointing to a common application (e.g., explorer.exe) while the target path points to a script interpreter (e.g., powershell.exe), or an unusually large file size.",
            "data_sources": [
              "Windows Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User profile directories, Temporary file directories, Email attachment sandboxes, Endpoint file systems",
            "action": [
              "Symbolic Logic: Upon .lnk file creation (Sysmon Event ID 11), parse the file's metadata. Create a rule that alerts if the icon path belongs to a set of commonly impersonated applications (explorer.exe, chrome.exe, iexplore.exe) AND the target path points to a script interpreter or LOLBAS (powershell.exe, wscript.exe, mshta.exe, cmd.exe).",
              "Statistical Analysis: Establish a baseline for normal .lnk file sizes. Monitor for new .lnk files (Sysmon Event ID 11) and flag any file whose size exceeds the 99th percentile of all .lnk files in the environment (e.g., > 1 MB), which may indicate padding to evade size-based detection.",
              "Machine Learning: Train a classifier to detect masquerading .lnk files. Features would include: a binary feature for icon/target mismatch, file size, target path entropy, presence of a Zone.Identifier alternate data stream indicating download from the internet, and the rarity of the icon/target pair across the environment. The model would output a probability score of the file being malicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has the adversary modified shortcuts to achieve privilege escalation?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1547.009",
        "name": "Shortcut Modification",
        "evidence": [
          {
            "description": "A shortcut (.lnk) in a system-wide privileged location (e.g., Public Desktop) is modified to target an executable with a known malicious file hash.",
            "data_sources": [
              "Windows Sysmon Event ID 1",
              "Windows Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System-wide startup folders (C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp), Public Desktop folder, Administrative Tools folder",
            "action": [
              "Symbolic Logic: Monitor for file modification or creation events (Sysmon Event ID 11) on .lnk files in privileged directories (e.g., C:\\ProgramData\\*). Upon detection, parse the .lnk to get the target path, hash the target executable, and join against a threat intelligence feed of malicious hashes. Alert on any match.",
              "Statistical Analysis: Baseline the hashes of all executables targeted by .lnk files in privileged locations. Monitor for any change in the target path or the hash of the target executable. Calculate the rarity of the new hash across the enterprise. Alert if a privileged shortcut is modified to point to a target that is unique or present on fewer than 5 other machines.",
              "Machine Learning: Use an anomaly detection model on the sequence of events related to privileged shortcuts. A normal sequence is 'Installer process -> Creates .lnk'. An anomalous sequence might be 'wscript.exe -> Modifies .lnk in Admin Tools'. A sequence-based model like an LSTM autoencoder can learn normal event chains and flag deviations."
            ]
          },
          {
            "description": "A shortcut (.lnk) in a privileged location is modified to prepend a LOLBAS command (e.g., 'cmd.exe /c') to the original target path, hijacking the execution flow to run malicious code before the legitimate application.",
            "data_sources": [
              "Windows Sysmon Event ID 1",
              "Windows Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Administrative Tools folder, Control Panel items, System-wide Start Menu programs folder",
            "action": [
              "Symbolic Logic: Monitor process creation events (Sysmon Event ID 1) where the command line matches a regex pattern like `^(cmd.exe /c|powershell.exe -c).*\\.(exe|com)` and the process is running with high integrity or as SYSTEM. This pattern indicates a LOLBAS launching another program, a common hijacking technique.",
              "Statistical Analysis: Baseline the command-line patterns for all shortcuts in privileged locations. For each execution, calculate the Jaccard similarity between the observed command line and the established baseline for that shortcut. Alert if the similarity score falls below a threshold (e.g., 0.5), indicating significant modification.",
              "Machine Learning: Train a classifier on process command lines originating from privileged shortcuts. Features would include the presence/absence of LOLBAS strings, argument count, argument length, and the number of file paths in the command line. The model learns to distinguish between simple `app.exe` targets and hijacked `cmd.exe /c malicious.bat && app.exe` targets."
            ]
          },
          {
            "description": "A process launched from a shortcut in a privileged context (e.g., run as Administrator) spawns unexpected child processes or initiates network connections, behaviors inconsistent with the shortcut's intended benign function.",
            "data_sources": [
              "Windows Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application Servers, Administrator workstations, Network egress points",
            "action": [
              "Symbolic Logic: Create a rule that alerts when a process running with high integrity (e.g., elevated token) AND launched from a known benign shortcut path (e.g., Administrative Tools) spawns a child process like 'net.exe', 'whoami.exe', or makes any external network connection.",
              "Statistical Analysis: For each privileged shortcut, establish a baseline of normal network behavior (e.g., 99% of connections are to internal RFC1918 addresses). Alert when an execution of that shortcut generates a network connection (Zeek conn.log) to a non-RFC1918 address, which is a statistical outlier from its baseline.",
              "Machine Learning: Use graph-based anomaly detection. Model normal process trees (parent-child relationships) originating from privileged shortcuts. A new execution that generates a process graph with a different structure (e.g., new nodes like 'powershell.exe', new edges to network activity) would be flagged as a structural anomaly."
            ]
          },
          {
            "description": "Execution of a modified privileged shortcut is followed within a short time window by events indicating privilege escalation, such as the creation of a new administrative account or a new logon session with elevated privileges.",
            "data_sources": [
              "Windows Security Event ID 4688",
              "Windows Security Event ID 4624",
              "Windows Security Event ID 4672",
              "Windows Security Event ID 4720",
              "Windows Security Event ID 4732"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller security logs, Local Security Authority Subsystem Service (LSASS) process monitoring, Endpoint security event logs",
            "action": [
              "Symbolic Logic: Correlate a process creation event (Event ID 4688) from a modified privileged shortcut with a subsequent user/group modification event (Event ID 4720, 4732) or a new logon event (Event ID 4624, Type 2/10) by the same Process ID or User SID within 5 seconds. This chained sequence is a strong indicator of privilege escalation.",
              "Statistical Analysis: Monitor the rate of special privilege assignment (Event ID 4672) following process launches. Establish a baseline rate. Alert if the rate of 4672 events following a process launch from a privileged shortcut exceeds the 99th percentile of the baseline rate, indicating an unusual attempt to gain privileges.",
              "Machine Learning: Use a sequence mining algorithm to discover common event patterns. Flag rare or unseen sequences of events, such as: {LNK Modification Event -> Process Launch from LNK (4688) -> Member Added to Administrators Group (4732)}. The rarity of this sequence makes it highly suspicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]