[
    {
        "information_requirement": "Is the adversary establishing persistence using port monitors?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1547.010",
                "name": "Port Monitors",
                "evidence": [
                    {
                        "description": "A DLL file written to a print monitor path or a value written to a print monitor registry key matches the hash or name of a known malicious port monitor implant.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Sysmon Event ID 11",
                            "Sysmon Event ID 1"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for file creation (Sysmon Event ID 11) in C:\\Windows\\System32. For each new DLL, calculate its file hash. Cross-reference the file hash and name against a cyber threat intelligence (CTI) feed of known malicious port monitor DLLs. Concurrently, monitor registry modifications (Windows Event ID 4657) to the 'Driver' value within any key under HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors and check the specified DLL path/name against the same CTI feed. Alert on any matches."
                    },
                    {
                        "description": "A new subkey is created under the HKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Monitors registry key, pointing to a recently created DLL file.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Sysmon Event ID 11"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of legitimate keys under 'HKLM\\...\\Print\\Monitors'. Monitor for the creation of any new subkeys using Windows Event ID 4657. For any new key, inspect its 'Driver' value to identify the target DLL. Correlate the timestamp of the registry key creation with file creation events (Sysmon Event ID 11) for the specified DLL. A tight temporal correlation (e.g., within 1-2 minutes) between the file drop and registry modification is a strong pattern indicator of this technique outside of legitimate software installations."
                    },
                    {
                        "description": "The Print Spooler service (spoolsv.exe) loads a DLL from an unusual file path not associated with legitimate print drivers or system operations.",
                        "data_sources": [
                            "Sysmon Event ID 7"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for image load events (Sysmon Event ID 7) where the loading process is `spoolsv.exe`. Establish a baseline of legitimate DLL paths (e.g., C:\\Windows\\System32, C:\\Program Files\\...). Flag any DLLs loaded by `spoolsv.exe` from anomalous locations such as user profiles (C:\\Users\\...), temporary directories (C:\\Windows\\Temp), or program data folders. Use frequency analysis and entropy measures on DLL paths across the enterprise to identify rare and suspicious load locations for `spoolsv.exe`."
                    },
                    {
                        "description": "The Print Spooler service (spoolsv.exe) initiates an outbound network connection to an external IP address, particularly after a system boot or a new port monitor installation.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Sysmon Event ID 3"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for network connection events originating from `spoolsv.exe` (Sysmon Event ID 3). Correlate the host-based event with network logs (Zeek conn.log) to analyze the destination IP, port, and data volume. Establish a baseline of expected network activity for `spoolsv.exe` (e.g., connections to local network printers on standard ports). Flag all outbound connections to external, non-private IP addresses, especially those to known malicious destinations identified via threat intelligence. Use correlation analysis to link the first occurrence of this network activity to a recent port monitor installation event (registry modification or DLL drop)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary attempting privilege escalation using port monitors?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1547.010",
                "name": "Port Monitors",
                "evidence": [
                    {
                        "description": "A known privilege escalation exploit tool, identified by file name or hash, is executed and subsequently creates a DLL and modifies print monitor registry keys.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Sysmon Event ID 1",
                            "Sysmon Event ID 11",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for process creation (Windows Event ID 4688, Sysmon Event ID 1) matching file names or hashes of known privilege escalation tools that leverage port monitors (e.g., PrintSpoofer, Juicy Potato variants). Upon detection, correlate this execution with subsequent file creation (Sysmon Event ID 11) of a DLL in a system directory and a registry modification (Windows Event ID 4657) to add a new port monitor. A sequence of these specific events within a short time window (e.g., under 1 minute) is a high-fidelity indicator of a successful exploit."
                    },
                    {
                        "description": "A process running with standard user privileges directly or indirectly causes the modification of the HKLM\\...\\Print\\Monitors registry key.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for registry key modifications under `HKLM\\...\\Print\\Monitors` (Windows Event ID 4657). For each modification, extract the Process ID from the event and use process creation logs (Windows Event ID 4688) to identify the process name and its security context (e.g., user account, integrity level). Flag any instance where the modification originates from a process running in a standard user security context (i.e., not SYSTEM, Local Service, or an explicit administrator). This pattern of a low-privilege process modifying a SYSTEM-level registry hive is a core artifact of the privilege escalation technique."
                    },
                    {
                        "description": "A process not typically associated with software installation (e.g., cmd.exe, powershell.exe, an Office application) spawns a child process that writes a DLL and modifies port monitor registry keys.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Sysmon Event ID 11",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze the parent-child process relationships for processes that modify port monitor registry keys (Windows Event ID 4657) or drop the associated DLLs (Sysmon Event ID 11). Create a baseline of legitimate parent processes for these actions (e.g., `msiexec.exe`, `svchost.exe`, authorized software deployment tools). Use descriptive statistics and frequency analysis on parent process names to identify anomalous process lineages. Flag any modification to port monitors that traces back to a non-standard parent process, such as an interactive shell or a document-based application."
                    },
                    {
                        "description": "The Print Spooler service (spoolsv.exe) loads a new, non-standard DLL immediately following suspicious user-level activity, such as the execution of reconnaissance commands or interaction with LSASS.",
                        "data_sources": [
                            "Sysmon Event ID 7",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for `spoolsv.exe` loading new or rare DLLs (Sysmon Event ID 7), especially those not seen before on the host or across the environment. Correlate the timestamp of the DLL load event with other suspicious user-level events occurring within a preceding time window (e.g., 5 minutes). Suspicious preceding events could include command-line execution of `whoami /all`, `net user`, or `systeminfo` (Windows Event ID 4688), or evidence of credential dumping attempts. Use correlation analysis to link the system-level DLL load by `spoolsv.exe` to preceding user-level enumeration, suggesting the DLL load is the culmination of a privilege escalation chain."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
