[
    {
        "information_requirement": "Has the adversary successfully escalated privileges, indicated by subsequent malicious activity from a macOS host?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1548.004",
                "name": "Elevated Execution with Prompt",
                "evidence": [
                    {
                        "description": "Network connections from a macOS host to external IP addresses or domains known to be associated with command and control (C2) infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate destination IP addresses from Zeek conn.log and queried domains from Zeek dns.log, for all traffic originating from macOS hosts, against a high-confidence threat intelligence feed. Generate an alert for any match, as this could indicate a compromised host establishing a C2 channel after a successful privilege escalation."
                    },
                    {
                        "description": "Traffic patterns from a macOS host matching signatures of known macOS post-exploitation tools or specific lateral movement command execution against Windows systems.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek http.log for specific User-Agent strings, URI patterns, or POST request structures associated with macOS C2 frameworks (e.g., Mythic, Sliver). Monitor Zeek conn.log for traffic to Windows hosts on SMB/WinRM ports (445, 5985/5986) and inspect payload data (if available/unencrypted) for patterns indicative of remote command execution tools like `impacket` or `evil-winrm` being run from a non-Windows source."
                    },
                    {
                        "description": "A macOS host initiating remote service connections (e.g., RDP, SMB, WinRM) to internal Windows servers, especially administrative servers or servers it has not previously communicated with.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal host-to-host communication patterns. Monitor Zeek conn.log for new connections from macOS host IPs to internal Windows systems on ports 445, 3389, 5985, 5986. Correlate with Windows Event ID 4624 (Logon Type 3 or 10) on the target server. Use correlation analysis and frequency analysis to flag 'first-time' access from a macOS host to a Windows server, or access to an unusually high number of servers in a short period, which may indicate lateral movement following privilege escalation."
                    },
                    {
                        "description": "Anomalous volume or characteristics of data being transferred from a macOS host, particularly to external destinations or internal file shares, suggesting data staging or exfiltration.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Model the typical data transfer behavior (volume, frequency, protocol) for macOS hosts using historical Zeek conn.log data. Use time series analysis (e.g., ARIMA) to detect statistically significant spikes in outbound traffic volume from a macOS host. Analyze Zeek files.log to profile typical file transfer types and sizes; alert on transfers of large archives (.zip, .rar, .tgz) or an unusually high count of files to external destinations or sensitive internal shares, which could indicate data collection after a privilege escalation event."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary evading defenses, indicated by anomalous activity from a macOS host after potential privilege escalation?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1548.004",
                "name": "Elevated Execution with Prompt",
                "evidence": [
                    {
                        "description": "DNS queries from a macOS host for domains known to host defense evasion tools, anonymization services (proxies, VPNs), or dynamic DNS services often used for covert C2.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Zeek dns.log for all queries originating from macOS hosts. Correlate the queried domains against multiple CTI feeds categorizing domains associated with hacking tools, anonymizers, and dynamic DNS providers (e.g., no-ip, duckdns). An alert should be generated for matches, as this may indicate an adversary is preparing to hide their subsequent activity after gaining elevated privileges."
                    },
                    {
                        "description": "Execution of specific commands on remote Windows systems originating from a macOS host, intended to disable security controls, stop logging, or clear forensic evidence.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 1102",
                            "Windows Event ID 4719"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On key Windows servers, monitor for specific events where the source workstation is a macOS host's IP/hostname. Specifically, look for: Process Creation (Event ID 4688) with command lines containing `net stop`, `sc config`, `netsh advfirewall`, `wevtutil cl`; Audit Log Cleared (Event ID 1102); and System Audit Policy Changed (Event ID 4719). Correlate the timing of these events with a preceding successful remote logon (Event ID 4624) from the macOS host. This pattern strongly indicates defense evasion activity."
                    },
                    {
                        "description": "A macOS host initiating encrypted network traffic with anomalous characteristics, such as connections to non-standard ports, use of self-signed certificates, or high data entropy, to evade network-based detection.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek ssl.log",
                            "Zeek x509.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Baseline typical SSL/TLS traffic from macOS hosts. Monitor Zeek conn.log for SSL/TLS traffic on non-standard ports (i.e., not 443). Analyze Zeek ssl.log for unusual JA3/JA3S hashes that do not match common browsers/applications, or for sessions with empty SNI fields. Examine Zeek x509.log for the use of self-signed certificates or certs with unusual issuers. Use entropy measures on encrypted payload sizes over time; unusually high and consistent entropy can indicate custom encryption or tunneling to evade inspection."
                    },
                    {
                        "description": "Creation of new services or scheduled tasks on remote Windows systems originating from a macOS host, using credentials potentially acquired through privilege escalation.",
                        "data_sources": [
                            "Windows Event ID 7045",
                            "Windows Event ID 4698"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows servers for the creation of new services (Event ID 7045) or scheduled tasks (Event ID 4698) where the creating user/process is tied to a remote logon from a macOS host's IP address. Correlate this activity with the logon event (Event ID 4624). Use frequency analysis to identify macOS hosts that are creating persistence mechanisms on Windows systems, which is highly anomalous behavior and a form of defense evasion (hiding as a legitimate system process)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
