[
    {
        "information_requirement": "Is the adversary maintaining persistence using Image File Execution Options?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1546.012",
                "name": "Image File Execution Options Injection",
                "evidence": [
                    {
                        "description": "Modification of an IFEO registry key where the 'Debugger' value points to an executable with a known malicious hash or a file path associated with known malware.",
                        "data_sources": [
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4657 for modifications to the 'Debugger' value under any subkey of 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\'. Extract the new value (the path to the debugger executable). Calculate the file hash of the specified executable and compare it against a threat intelligence feed of known malicious file hashes. Also, match the file path against a list of known malicious paths/filenames. Alert on any match and correlate with the process that made the change."
                    },
                    {
                        "description": "Modification of an IFEO 'Debugger' value for a common application to point to an executable in a non-standard or user-writable directory.",
                        "data_sources": [
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4657 for 'Debugger' value modifications under 'HKLM\\...\\Image File Execution Options\\'. For any modification, parse the executable path in the 'New Value'. Flag any path that points to a non-standard location for executables, such as user profile directories, temporary folders, or ProgramData folders (e.g., C:\\Users\\, C:\\Temp\\, C:\\ProgramData\\). Use correlation analysis to check if the new debugger executable was recently created or downloaded."
                    },
                    {
                        "description": "Execution of the GFlags tool (gflags.exe) with command-line arguments to create or modify an IFEO 'Debugger' value.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events where the process name is 'gflags.exe'. Analyze the command-line arguments for patterns such as '/i <ImageFileName> /p /enable' used to set IFEO debuggers. Any usage of gflags.exe by non-administrative users or outside of planned software debugging/testing activities is highly suspicious and should be investigated using frequency analysis to identify rare execution patterns."
                    },
                    {
                        "description": "A common application (e.g., notepad.exe, services.exe) unexpectedly spawns a child process that is not typical for its normal operation, such as a command shell or a script interpreter.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 4688 process creation logs to establish a baseline of normal parent-child process relationships across the environment. Alert on new or rare relationships, particularly where a common Windows application (the parent) spawns an interactive shell (cmd.exe, powershell.exe), a script interpreter (wscript.exe, cscript.exe), or an executable from a temporary/user-writable location. Use frequency analysis and entropy measures on parent-child process pairs to detect significant deviations from the established norm."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Has the adversary escalated privileges using Image File Execution Options?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1546.012",
                "name": "Image File Execution Options Injection",
                "evidence": [
                    {
                        "description": "IFEO 'Debugger' value for a high-integrity system process (e.g., services.exe, consent.exe) is set to an executable with a known malicious hash or a path associated with known privilege escalation tools.",
                        "data_sources": [
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4657 for 'Debugger' value modifications under IFEO keys for processes that typically run as SYSTEM (e.g., services.exe, taskhostw.exe, consent.exe). Extract the debugger executable path, calculate its hash, and compare it against a CTI feed of malicious hashes, specifically flagging those associated with privilege escalation tools. Match the file path against patterns of known hacking tools and alert on any match."
                    },
                    {
                        "description": "Modification of the IFEO 'Debugger' value for an accessibility application (e.g., sethc.exe, utilman.exe, osk.exe) to point to an interactive command shell.",
                        "data_sources": [
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a high-priority alert to monitor Windows Event ID 4657 for any modification to the 'Debugger' value within the 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\' keys for 'sethc.exe', 'utilman.exe', 'osk.exe', 'Magnify.exe', or 'Narrator.exe'. Specifically check if the 'New Value' is set to 'C:\\Windows\\System32\\cmd.exe' or another shell. Any such modification is a strong indicator of a privilege escalation attempt."
                    },
                    {
                        "description": "An interactive command shell (cmd.exe, powershell.exe) is created with SYSTEM privileges with a parent process of an accessibility application launched from the secure desktop or logon screen.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation). Correlate process creation events with logon events (Windows Event ID 4624, Logon Type 2 or 10) to identify activity on the logon screen. Alert when 'cmd.exe' or 'powershell.exe' is created with SYSTEM-level integrity and the parent process is 'winlogon.exe', 'logonui.exe', or an accessibility tool like 'utilman.exe' or 'sethc.exe'. Calculate the frequency of such events; any occurrence is highly suspicious and warrants immediate investigation."
                    },
                    {
                        "description": "An IFEO 'Debugger' value is set for any process that typically runs with high integrity, where the specified debugger is an unsigned executable or located in a user-writable directory.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4657 for modifications to IFEO keys for a curated list of high-integrity system processes. For any new 'Debugger' value, trigger a check on the specified executable. Validate its digital signature and file path. Flag any instance where the debugger is unsigned, has an invalid signature, or is located in a world-writable or user-profile directory (e.g., C:\\Windows\\Temp, C:\\Users\\Public). Use linear regression to determine if these events correlate with other suspicious system activities, such as anomalous network connections from the host."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
