[
  {
    "information_requirement": "Has the adversary escalated privileges using Setuid/Setgid?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1548.001",
        "name": "Setuid and Setgid",
        "evidence": [
          {
            "description": "A process creation event is observed where the executed file has SUID/SGID permissions and its hash is listed in a known-malicious threat intelligence feed.",
            "data_sources": [
              "Sysmon for Linux Event ID 1 (Process Creation)",
              "auditd logs (type=EXECVE)",
              "File hash threat intelligence feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux endpoints and servers, particularly internet-facing systems and critical application servers.",
            "action": [
              "Symbolic: Create a SIEM rule to alert when a process creation event (Sysmon for Linux EID 1, auditd EXECVE) shows a process running with an effective UID of 0, but the executing user is non-root, AND the file hash of the executed binary matches a list of known malicious hashes.",
              "Statistical: For processes spawned from SUID/SGID binaries, calculate the entropy of the command-line arguments. Alert on executions where the entropy score exceeds a baseline threshold (e.g., > 95th percentile), which could indicate obfuscated or randomized exploit strings.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on features of SUID/SGID executions (user, parent process, binary name, command-line patterns) to identify clusters of anomalous activity that deviate from established normal clusters."
            ]
          },
          {
            "description": "Process creation events show the execution of file system search utilities (`find`) with permission-based arguments (`-perm -4000`, `-perm -2000`) or permission modification utilities (`chmod`) with arguments to set SUID/SGID bits (`+s`, `4755`).",
            "data_sources": [
              "Sysmon for Linux Event ID 1 (Process Creation)",
              "auditd logs (type=EXECVE)",
              "bash_history logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux endpoints and servers, especially multi-user systems and developer workstations.",
            "action": [
              "Symbolic: Create a SIEM rule that triggers on process creation events for `find` or `chmod` where the command line contains strings like '-perm', '+s', '4755', '2755'. Prioritize alerts where the target of `chmod` is a shell (`bash`, `sh`) or is located in a world-writable directory (`/tmp`, `/var/tmp`, `/dev/shm`).",
              "Statistical: Establish a baseline for the frequency of `find` and `chmod` commands with SUID/SGID-related arguments per user and per host. Use a statistical measure (e.g., Z-score) to alert when the frequency for a user or host exceeds 3 standard deviations from their historical norm.",
              "Machine Learning: Apply time-series analysis (e.g., ARIMA or Seasonal-Trend decomposition) to the aggregate count of SUID/SGID discovery/modification commands across the environment. Alert on anomalous spikes that deviate significantly from the predicted forecast, indicating a potential widespread campaign."
            ]
          },
          {
            "description": "A process executed by a non-root user from a legitimate SUID binary (e.g., `pkexec`, `passwd`) spawns a child process that is a shell (e.g., `sh`, `bash`, `zsh`) and is running with an effective UID of 0 (root).",
            "data_sources": [
              "Sysmon for Linux Event ID 1 (Process Creation)",
              "auditd logs (type=EXECVE, type=SYSCALL)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers, critical infrastructure servers, and standard user endpoints with SUID-vulnerable software installed.",
            "action": [
              "Symbolic: Construct a query to identify process trees where a non-root user executes a known SUID binary, and its child or descendant process is a shell (`sh`, `bash`, etc.) with an effective UID of 0. Correlate parent process ID (PPID) with child process ID (PID) from process creation logs.",
              "Statistical: Profile the parent-child process relationships for all legitimate SUID binaries. Create a frequency table of normal child processes. Alert when a rare or never-before-seen child process (e.g., `sh` being a child of `passwd`) is spawned, treating it as a high-confidence statistical anomaly.",
              "Machine Learning: Train a graph-based anomaly detection model on process execution trees. Model normal SUID binary execution flows as graphs and identify any execution that results in a graph structure deviating significantly from the learned normal patterns, especially those resulting in a root shell node."
            ]
          },
          {
            "description": "A process, running with an effective UID of 0 (root) that was spawned via SUID/SGID abuse, initiates an outbound network connection to an external IP address.",
            "data_sources": [
              "Sysmon for Linux Event ID 1 (Process Creation)",
              "Sysmon for Linux Event ID 3 (Network Connection)",
              "Zeek conn.log",
              "auditd logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (firewalls, proxies), DNS servers, and all Linux hosts capable of initiating outbound connections.",
            "action": [
              "Symbolic: Join process creation logs with network connection logs on the process ID (PID). Alert when a process with an effective UID of 0, whose parent process was run by a non-root user, makes a network connection (Sysmon EID 3) to a destination IP found on a threat intelligence blocklist or not on an organizational allowlist.",
              "Statistical: For all network connections originating from root-level processes spawned via SUID, analyze the destination port and IP address using Zeek conn.log. Use frequency analysis to identify connections to rare ports or IP addresses with low prevalence across the enterprise. Calculate the prevalence of destination ASN and flag connections to ASNs seen in less than 1% of traffic.",
              "Machine Learning: Use a time-series model to analyze the volume of outbound data (e.g., `orig_bytes` from Zeek conn.log) for connections associated with SUID-spawned root processes. Alert on significant deviations from the established baseline, which could indicate data exfiltration following a privilege escalation event."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses using Setuid/Setgid?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1548.001",
        "name": "Setuid and Setgid",
        "evidence": [
          {
            "description": "A file on the filesystem has SUID/SGID permissions and its SHA256 or MD5 hash matches a known indicator of compromise (IOC) for a malicious tool, backdoor, or cryptominer.",
            "data_sources": [
              "File integrity monitoring (FIM) logs",
              "Endpoint Detection and Response (EDR) file scan results",
              "Threat intelligence feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Filesystems of all Linux servers and endpoints, with a focus on executable paths (/bin, /sbin, /usr/bin) and temporary directories (/tmp, /var/tmp).",
            "action": [
              "Symbolic: On a scheduled basis, run a script (e.g., using `find / -perm /6000 -type f -exec sha256sum {} +`) to find all SUID/SGID files and calculate their hashes. Compare the resulting hashes against a continuously updated threat intelligence database. Generate a high-severity alert for any match.",
              "Statistical: Enrich file hash IOCs with prevalence data (e.g., from VirusTotal). Prioritize alerts for hash matches that are also statistically rare globally, as common malware might generate excessive noise.",
              "Machine Learning: Use a file classifier model (e.g., trained on ELF header features, string features, and imports) to scan SUID/SGID files. Flag any file classified as 'malicious' or 'suspicious', even if its hash is not yet in an IOC database, providing a proactive detection capability."
            ]
          },
          {
            "description": "A file with SUID/SGID permissions is identified that is not on a pre-approved allowlist, is an unusual file type (e.g., script, text file), or is located in a non-standard directory (e.g., /tmp, /dev/shm, user home directories).",
            "data_sources": [
              "File integrity monitoring (FIM) logs",
              "EDR file scan results",
              "Configuration Management Database (CMDB) baseline"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Filesystems of all Linux servers and endpoints, particularly world-writable directories and user home directories.",
            "action": [
              "Symbolic: Maintain an allowlist of known-good SUID/SGID binaries and their expected paths. Periodically scan all filesystems and generate an alert for any SUID/SGID file whose path and name combination is not on the allowlist. Pay special attention to script files (e.g., `.sh`, `.py`) with SUID/SGID bits.",
              "Statistical: For all SUID/SGID files found, calculate the prevalence of their location (directory path) across the enterprise. Alert on files found in statistically rare locations (e.g., present on <1% of hosts or in a directory seen for the first time).",
              "Machine Learning: Train a logistic regression model to classify SUID/SGID files as 'benign' or 'suspicious' based on features like file path, file name, file type (from the `file` command), and age. This can automatically flag suspicious new SUID files that deviate from the established 'benign' profile."
            ]
          },
          {
            "description": "A file creation event is followed within a short time window by a permission modification event (`chmod`) that sets the SUID or SGID bit on that same file.",
            "data_sources": [
              "Sysmon for Linux Event ID 11 (File Create)",
              "Sysmon for Linux Event ID 1 (Process Creation)",
              "auditd logs (type=SYSCALL, key=perm_mod)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux endpoints and servers, monitoring filesystem activity in real-time.",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a file creation event (Sysmon EID 11) is followed by a `chmod` process creation event (Sysmon EID 1) with `+s` or `4[0-9]{3}`/`2[0-9]{3}` arguments targeting the same file path within a 60-second window.",
              "Statistical: Analyze the time delta between file creation and SUID/SGID permission modification. While legitimate package installations may do this, they often occur in batches. Isolate events that are statistical outliers in terms of timing or that occur outside of approved maintenance windows.",
              "Machine Learning: Use a sequence analysis model (e.g., a Hidden Markov Model) to learn normal sequences of file operations during software installation. Flag sequences where a file is created (e.g., by `wget` or `curl`) and then immediately made SUID as an anomalous, non-standard installation sequence."
            ]
          },
          {
            "description": "A SUID/SGID binary is executed by a user or service account that has no documented business need for its use, or the execution frequency of a specific SUID binary by a user is a statistical outlier.",
            "data_sources": [
              "Sysmon for Linux Event ID 1 (Process Creation)",
              "auditd logs (type=EXECVE)",
              "User role/identity management system data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Linux hosts, with a focus on systems hosting sensitive applications or data.",
            "action": [
              "Symbolic: Create a list of high-risk SUID binaries (e.g., `nmap`, `pkexec`, `mount`) and pair them with user accounts that should never execute them (e.g., service accounts like `www-data`, `apache`). Create a SIEM rule to alert on any such execution.",
              "Statistical: For each user-binary pair, establish a baseline of execution frequency over a 30-day period. Use a moving average and standard deviation to calculate a Z-score for daily execution counts. Alert when the Z-score for a user executing a specific SUID binary exceeds a threshold (e.g., 3.0).",
              "Machine Learning: Use a peer group analysis approach. Group users by role (e.g., 'developers', 'sysadmins', 'web-services'). For each role, model the normal SUID/SGID binary usage. Flag any user whose execution behavior significantly deviates from the behavior of their peer group, indicating potential account compromise or insider threat."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]