[
  {
    "information_requirement": "Is the adversary maintaining persistence via Active Setup?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1547.014",
        "name": "Active Setup",
        "evidence": [
          {
            "description": "An Active Setup 'StubPath' registry value contains a command, filename, or hash that matches a known malicious indicator.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Sysmon Event ID 13",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows workstations and servers, particularly Active Directory domain controllers and critical application servers.",
            "action": [
              "Symbolic: Monitor for registry value modifications (Windows Event ID 4657, Sysmon Event ID 13) to any 'StubPath' under 'HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\'. Compare the full 'StubPath' string, the executable filename, and the file hash (if available from endpoint tooling) against a threat intelligence feed of known malicious commands, filenames, and hashes. Alert on any match.",
              "Statistical: Analyze the frequency of all unique 'StubPath' values across the enterprise over a 30-day rolling window. Calculate the prevalence of each value and flag any 'StubPath' that exists on a statistically insignificant number of endpoints (e.g., fewer than 0.1% of the total fleet or < 5 machines), as legitimate software is typically more widespread.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features extracted from 'StubPath' values, such as string length, character entropy, file path depth, and the presence of keywords (e.g., 'powershell', 'temp', 'public'). Use the model to classify newly created or modified 'StubPath' entries as 'benign' or 'malicious' in near real-time."
            ]
          },
          {
            "description": "A new Active Setup entry is created where the 'StubPath' value executes a scripting interpreter or an executable from an uncommon or user-writable directory.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Sysmon Event ID 13",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows workstations and servers, particularly those with standard user configurations where execution from user-writable paths is unexpected.",
            "action": [
              "Symbolic: Use regular expressions to monitor registry modification events for 'StubPath' values that invoke scripting interpreters (e.g., powershell.exe, cmd.exe, wscript.exe, mshta.exe) or point to executables located in user-writable directories such as '%APPDATA%', '%TEMP%', 'C:\\Users\\Public\\', or '%USERPROFILE%'.",
              "Statistical: For each host, establish a baseline of common execution directories for processes originating from Active Setup. Calculate the entropy of the directory path string in new 'StubPath' values. Flag any path with unusually high entropy or any path that is a statistical outlier (e.g., not in the top 98% of most frequently used paths for that host profile).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) to group Active Setup executions based on features like the executable path, parent process, and command-line arguments. Legitimate entries will form dense clusters, while malicious entries will likely appear as noise or in very small, new clusters. Investigate any such outliers."
            ]
          },
          {
            "description": "A statistically rare or previously unseen process is executed shortly after user login, with a parent process consistent with Active Setup execution (e.g., runonce.exe, explorer.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices of all users, with a focus on privileged accounts (developers, system administrators) and executives.",
            "action": [
              "Symbolic: Create a whitelist of known, legitimate processes, including their full paths and parent processes, that are expected to launch within two minutes of a user logon event (Windows Event ID 4624). Alert on any process creation event (Sysmon Event ID 1) within that timeframe that is not on the whitelist.",
              "Statistical: For each user or user group, establish a baseline of normal login process activity. Use a frequency analysis or percentile ranking to identify processes that are new or rare outliers for that user's login sequence. Flag any process whose execution frequency is in the bottom 5th percentile for that user's role and investigate its origin.",
              "Machine Learning: Apply a sequence analysis model, such as a Recurrent Neural Network (RNN), to the series of process creation events that occur after each login. Train the model on benign login sequences to learn the normal order and types of processes. The model can then detect and score anomalies, such as the injection of a malicious process into the expected sequence."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary escalating privileges via Active Setup?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1547.014",
        "name": "Active Setup",
        "evidence": [
          {
            "description": "The Active Setup 'StubPath' value contains command-line arguments or points to a file whose name or behavior is characteristic of a known UAC bypass technique.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Sysmon Event ID 13",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows workstations, especially those running versions of Windows susceptible to known UAC bypass techniques.",
            "action": [
              "Symbolic: Monitor 'StubPath' modifications and resulting process command lines. Use a ruleset to match against known UAC bypass patterns, such as 'fodhelper.exe' being executed alongside registry modifications to 'HKCU\\Software\\Classes\\ms-settings\\', or 'cmstp.exe' being called with the '/s' switch and a malicious INF file.",
              "Statistical: Analyze the command-line arguments passed to legitimate system binaries that can be abused for UAC bypass (e.g., 'sdclt.exe', 'eventvwr.exe', 'computerdefaults.exe'). Calculate the length and character entropy of these arguments across the environment. Flag any instance where the argument length or entropy exceeds 3 standard deviations from the established baseline for that binary.",
              "Machine Learning: Train a supervised learning model to classify the usage of auto-elevating binaries as either benign or malicious. Features can include the parent process name, the full command line, and whether the execution was preceded by a recent 'StubPath' registry modification. This model can detect novel or obfuscated bypass techniques missed by static signatures."
            ]
          },
          {
            "description": "A sequence of events is observed where a new Active Setup 'StubPath' key is created, followed by the execution of an auto-elevating system binary that reads from an attacker-controlled location.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Sysmon Event ID 13",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System-wide registry hives (HKLM, HKCU) and process execution logs on all Windows endpoints.",
            "action": [
              "Symbolic: Create a stateful detection rule that triggers when Event A (Registry key 'StubPath' created) is followed within 5 minutes by Event B (Process creation of an auto-elevating binary like 'fodhelper.exe' or 'sdclt.exe') and Event C (The new process reads a registry key or file path specified by the attacker).",
              "Statistical: Model the parent-child process relationships for all known auto-elevating system binaries. Calculate the conditional probability P(Child | Parent) based on historical data. A parent process of 'runonce.exe' or 'explorer.exe' spawning a binary like 'fodhelper.exe' immediately after login is a statistically rare event and should be flagged for investigation.",
              "Machine Learning: Use a graph-based anomaly detection model where processes are nodes and relationships (parent-child, file access, registry access) are edges. Analyze the subgraph of activity originating from a logon event. The model can identify anomalous subgraphs that represent a UAC bypass sequence, which deviates structurally from benign activity graphs."
            ]
          },
          {
            "description": "A process launched via Active Setup at user login subsequently performs high-privilege actions, such as creating a system service, modifying protected registry locations, or writing to system directories.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657",
              "Windows Event ID 4663",
              "Windows Event ID 7045",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Protected system directories (e.g., C:\\Windows\\System32), critical registry hives (e.g., HKLM\\SYSTEM), and service control manager logs on all Windows endpoints.",
            "action": [
              "Symbolic: Chain events to detect a suspicious sequence. First, identify a rare process spawned at login. Then, using its Process ID, hunt for subsequent privileged actions performed by that process, such as service creation (Windows Event ID 7045), modification of HKLM run keys (Windows Event ID 4657), or writing an executable to 'C:\\Windows\\System32' (Sysmon Event ID 11).",
              "Statistical: For each user account, create a baseline of privileged operations performed. Assign a risk score to actions like service creation or modification of protected registry keys. If a process spawned by Active Setup performs an action that is statistically rare for that user account (e.g., a standard user's process creating a service), increment a session risk score. Alert when the score exceeds a dynamic threshold based on the 99th percentile of risk scores.",
              "Machine Learning: Employ a time-series anomaly detection model on the stream of system events (registry, file, service, process) generated by a process after its creation. Train the model on event sequences from benign login processes. A process originating from Active Setup that generates a sequence of events flagged as anomalous (e.g., a rapid succession of registry writes to HKLM followed by a service creation) indicates likely privilege escalation."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]