[
    {
        "information_requirement": "Is the adversary establishing or maintaining persistence by creating or modifying Windows services?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1543.003",
                "name": "Windows Service",
                "evidence": [
                    {
                        "description": "Creation of a Windows service where the associated executable file hash or service name is a known indicator of compromise (IOC).",
                        "data_sources": [
                            "Windows Event ID 4697",
                            "Windows Event ID 7045"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "From service creation events (Windows Event ID 4697, 7045), extract the service executable path (`ServiceFileName`) and the `ServiceName`. On the host, calculate the hash of the executable file. Continuously correlate the extracted file hash and the service name against high-fidelity cyber threat intelligence feeds of known malicious file hashes and service names (e.g., 'PSEXESVC'). Trigger an immediate high-priority alert on any match."
                    },
                    {
                        "description": "A Windows service is created with a binary path pointing to a legitimate system utility often abused for execution (LOLBAS), such as rundll32.exe or regsvr32.exe, with suspicious command-line arguments.",
                        "data_sources": [
                            "Windows Event ID 4697",
                            "Windows Event ID 7045",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor service creation events (Windows Event ID 4697, 7045) for binary paths (`ServiceFileName`) that point to known Living-Off-the-Land Binaries and Scripts (LOLBAS). Analyze the full command line from the service's `ImagePath` value or the parent process creation event (Windows Event ID 4688) for suspicious arguments like URLs, UNC paths, encoded commands, or script file extensions (.sct, .js). Maintain and use a curated list of suspicious LOLBAS usage patterns specifically for service creation and alert on matches."
                    },
                    {
                        "description": "A new Windows service is created with its executable located in an unusual directory, such as a temporary folder, user profile directory, or a world-writable location.",
                        "data_sources": [
                            "Windows Event ID 4697",
                            "Windows Event ID 7045"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "From service creation events (Windows Event ID 4697, 7045), extract the `ServiceFileName`. Analyze the directory path of the executable. Establish a baseline of standard service executable locations (e.g., `C:\\Windows\\System32\\`, `C:\\Program Files\\`). Flag any service whose executable resides in a non-standard, high-risk directory (e.g., `C:\\Users\\*`, `C:\\Windows\\Temp\\`, `C:\\ProgramData\\`, `C:\\Perflogs\\`). Use frequency analysis and descriptive statistics on service binary parent directories across the enterprise to identify rare and suspicious locations as outliers."
                    },
                    {
                        "description": "A newly created service, especially one set to auto-start, does not correlate with known software installations, patch deployments, or other legitimate administrative activity.",
                        "data_sources": [
                            "Windows Event ID 4697",
                            "Windows Event ID 7045"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Collect all service creation events (Windows Event ID 4697, 7045) and filter for those with an automatic start type (`StartType` = 0x2). Correlate the timestamps of these events with logs from change management systems, software deployment tools (e.g., SCCM), and patch management systems. Investigate any 'unexplained' auto-start service creations as potential persistence mechanisms. Use linear regression to model the expected rate of legitimate service creation and flag time periods with a statistically significant increase in unexplained service installations."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary attempting to escalate privileges by modifying or creating Windows services?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1543.003",
                "name": "Windows Service",
                "evidence": [
                    {
                        "description": "The executable file associated with an existing, privileged Windows service is replaced or modified with a file whose hash is a known indicator of compromise (IOC).",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for modifications to the `ImagePath` registry value for existing services (HKLM\\SYSTEM\\CurrentControlSet\\Services\\* via Windows Event ID 4657). Also monitor for write access to service executable files (Windows Event ID 4663). Upon detection of a change to a privileged service's binary path or executable, immediately hash the new/modified file and correlate it against CTI feeds of known malicious file hashes. Alert on any matches indicating a service hijack with a known malicious payload."
                    },
                    {
                        "description": "An existing, privileged Windows service is reconfigured (e.g., ImagePath modification) by a process running under a non-administrative user context, indicating exploitation of weak service permissions.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 4688",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for registry modifications to `ImagePath` values of services that run with high privileges (e.g., LocalSystem) via Windows Event ID 4657. Correlate the modification event with the process that performed it (via Windows Event ID 4688) and the user context of that process (via associated logon session in Windows Event ID 4624). Alert when a privileged service's configuration is modified by a standard user account, as this is a classic pattern for privilege escalation via insecure service permissions."
                    },
                    {
                        "description": "A legitimate service process (e.g., svchost.exe, services.exe) spawns an unusual child process, such as a command shell or a LOLBAS, or initiates an unexpected network connection.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a process parent-child baseline for all legitimate Windows services. Monitor process creation events (Windows Event ID 4688) and alert on deviations, especially the spawning of interactive shells (`cmd.exe`, `powershell.exe`) or reconnaissance commands (`whoami.exe`, `net.exe`, `ipconfig.exe`) from a service process. Correlate these process events with Zeek conn.log to detect subsequent outbound network connections from the host, which is highly anomalous for most services. Use entropy measures on command-line arguments of child processes to detect unusual complexity or obfuscation, which could indicate privilege abuse."
                    },
                    {
                        "description": "A service that is normally disabled or manually started is programmatically reconfigured to auto-start and/or started, immediately followed by anomalous system activity.",
                        "data_sources": [
                            "Windows Event ID 4657",
                            "Windows Event ID 7036",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Baseline the `Start` type for all services on critical systems. Monitor for registry modifications (Windows Event ID 4657) that change a service's `Start` type from disabled/manual to automatic. Also monitor for service start events (Windows Event ID 7036) for services that are baselined as disabled or manual. Correlate these change/start events with subsequent anomalous process activity (Windows Event ID 4688) or network connections within a short time window (e.g., 1-5 minutes). Use correlation analysis to link the service state change to the potentially malicious follow-on actions, indicating service hijacking for privilege escalation."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
