[
  {
    "information_requirement": "Is the adversary establishing persistence by manipulating screensaver configurations?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1546.002",
        "name": "Screensaver",
        "evidence": [
          {
            "description": "A process creation log (Windows Event ID 4688) indicates a new process with an image path ending in '.scr' whose file hash matches a known malicious indicator from a threat intelligence source.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process execution logs on all Windows workstations and servers.",
            "action": [
              "Symbolic: Query for process creation events (Windows Event ID 4688) where the 'NewProcessName' field ends with '.scr'. For each resulting event, retrieve the file hash of the executable and cross-reference it against a threat intelligence feed of known malicious hashes. Generate a high-severity alert upon a positive match.",
              "Statistical: Aggregate all '.scr' file executions by their SHA256 hash across the enterprise over a 30-day baseline. Calculate the execution frequency for each hash. Flag any execution of a hash that falls below the 5th percentile of frequency, identifying it as an abnormally rare screensaver that warrants investigation.",
              "Machine Learning: Train a supervised classification model (e.g., XGBoost) using features from process creation events such as file path entropy, parent process name, command-line arguments, and user context. Apply the trained model to score all new '.scr' executions, alerting on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "A registry modification log (Windows Event ID 4657) shows the value of 'HKCU\\Control Panel\\Desktop\\SCRNSAVE.exe' being set to a path outside of '%SystemRoot%\\System32\\' or '%SystemRoot%\\SysWOW64\\', or shows 'HKCU\\Control Panel\\Desktop\\ScreenSaverIsSecure' being set to '0'.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint registry monitoring logs on all Windows workstations.",
            "action": [
              "Symbolic: Monitor registry write events (Windows Event ID 4657) where the 'ObjectName' is '\\REGISTRY\\USER\\...\\Control Panel\\Desktop\\SCRNSAVE.exe'. Trigger an alert if the new 'Data' value for the write does not start with 'C:\\\\Windows\\\\System32\\\\' or 'C:\\\\Windows\\\\SysWOW64\\\\'. Additionally, create a rule to alert on any write event to '...\\ScreenSaverIsSecure' where the new value is '0'.",
              "Statistical: For all modifications to screensaver-related registry keys, baseline the modifying processes (e.g., 'explorer.exe', 'rundll32.exe'). Alert when a process not in the established 95th percentile of common modifying processes performs a write. Additionally, calculate the Shannon entropy of the file path written to the 'SCRNSAVE.exe' value; flag paths with entropy scores greater than 2 standard deviations above the mean for legitimate screensaver paths.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA) on the count of screensaver-related registry modifications per host, aggregated in 1-hour windows. Generate an alert when the observed count of modifications exceeds the model's predicted forecast interval, indicating a statistically significant spike in activity."
            ]
          },
          {
            "description": "A process creation log for an executable ending in '.scr' (Windows Event ID 4688) is temporally correlated within 60 seconds with a network connection log (Zeek conn.log) from the same host IP address to an external destination.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process execution logs on all Windows hosts and network traffic logs from core network sensors or egress points.",
            "action": [
              "Symbolic: Join process creation events (Windows Event ID 4688 where 'NewProcessName' ends in '.scr') with network connection logs (Zeek conn.log) using the host's IP address and a timestamp difference of less than 60 seconds. Generate a high-severity alert for any such correlation, as legitimate screensavers should not initiate external network connections.",
              "Statistical: For any network connection initiated by a '.scr' process, enrich the destination IP with threat intelligence and geolocation data. Calculate a risk score based on factors like IP reputation, ASN rarity (e.g., ASN not in the top 90% of those contacted by the enterprise), and destination port uncommonness. Alert if the cumulative risk score exceeds a predefined threshold.",
              "Machine Learning: Train a one-class SVM or Isolation Forest model on features of benign network traffic from the enterprise (e.g., destination port, protocol, bytes sent/received, connection duration). Apply this model to score all network connections initiated by '.scr' processes and flag any connection identified as an outlier, indicating it does not conform to the established profile of normal network activity."
            ]
          },
          {
            "description": "A process creation log (Windows Event ID 4688) shows an executable with a '.scr' extension being run from a non-standard, user-writable directory, such as 'C:\\Users\\', '%APPDATA%', '%TEMP%', or 'C:\\ProgramData\\'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process execution logs on all Windows hosts, with a focus on file paths originating from user-writable directories.",
            "action": [
              "Symbolic: Create a detection rule that triggers on process creation events (Windows Event ID 4688) where the 'NewProcessName' path ends with '.scr' AND the path string contains 'Users', 'AppData', 'Temp', 'Downloads', or 'ProgramData'. Exclude known-good paths like 'C:\\\\Windows\\\\System32' to reduce false positives.",
              "Statistical: Across the enterprise, build a frequency distribution of all parent directories from which '.scr' files are executed. Any execution from a directory that falls in the bottom 5th percentile of frequency (i.e., a rare location) should be flagged. Additionally, calculate the Shannon entropy of the filename (excluding the extension); filenames with high entropy suggest randomization and should be investigated.",
              "Machine Learning: Represent '.scr' execution paths as vectors (e.g., using TF-IDF on directory name tokens and path depth). Apply a density-based clustering algorithm like DBSCAN to group these vectors. Flag any data points classified as noise or belonging to very small clusters, as they represent execution locations that are anomalous compared to the dense clusters of legitimate system screensavers."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary elevating privileges through the execution of a malicious screensaver?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1546.002",
        "name": "Screensaver",
        "evidence": [
          {
            "description": "A process creation log (Windows Event ID 4688) shows a parent process with an image path ending in '.scr' spawning a child process whose file hash is a known indicator of a privilege escalation tool (e.g., Mimikatz, BadPotato).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process lineage data from all Windows hosts.",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688). For any event where the 'ParentProcessName' ends in '.scr', retrieve the hash of the child process executable ('NewProcessName'). Compare this hash against a curated IOC list of privilege escalation tools. Generate a critical alert on a match.",
              "Statistical: Establish a baseline of all parent-child process relationships where the parent is a '.scr' file. Calculate the conditional probability of each child process name given a screensaver parent. Flag any relationship where the probability is below a low threshold (e.g., < 0.1%), indicating a highly unusual and suspicious process chain.",
              "Machine Learning: Model process execution chains as graphs. Train a graph-based anomaly detection model on benign process trees. Apply the model to any process tree originating from a '.scr' execution. Flag trees that contain anomalous nodes (e.g., a rare child process) or anomalous structures (e.g., unexpected depth) as suspicious."
            ]
          },
          {
            "description": "A process creation log (Windows Event ID 4688) shows a legitimate screensaver executable (e.g., 'scrnsave.scr') being launched with command-line arguments that are anomalous or match patterns associated with exploitation or payload execution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process command-line logs on all Windows hosts.",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for known screensaver executables. Apply regular expressions on the 'CommandLine' field to detect suspicious patterns, such as Base64 encoded strings, 'IEX', 'DownloadString', or arguments other than the standard '/s', '/c', or '/p' switches. Alert on any match.",
              "Statistical: For each legitimate screensaver executable, establish a baseline of normal command-line argument frequency and structure. For each new execution, calculate the Shannon entropy of its 'CommandLine' string. An execution with an entropy score greater than 3 standard deviations above the mean for that specific screensaver indicates a high degree of randomness and should be alerted.",
              "Machine Learning: Train a supervised classifier (e.g., Logistic Regression) on command-line arguments, using NLP-based features like n-grams, character distributions, and the presence of suspicious keywords. Use the trained model to assign a malice score to the command line of every screensaver execution, alerting on high scores."
            ]
          },
          {
            "description": "A process creation log (Windows Event ID 4688) shows a process with an image path ending in '.scr' spawning a command shell ('cmd.exe', 'powershell.exe') or a scripting engine ('wscript.exe', 'cscript.exe'), or spawning a child process running at a higher integrity level than the parent.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint process lineage and integrity level data from all Windows hosts.",
            "action": [
              "Symbolic: Create a high-severity alert rule for any process creation event (Windows Event ID 4688) where the 'ParentProcessName' ends in '.scr' and the 'NewProcessName' is one of 'cmd.exe', 'powershell.exe', 'pwsh.exe', 'wscript.exe', or 'cscript.exe'. Additionally, alert if the child process 'IntegrityLevel' field is higher than the parent process's integrity level.",
              "Statistical: Build a frequency table of all unique child processes spawned by '.scr' parent processes across the enterprise. Any child process name that is not in the top 99% of most common children should be flagged for investigation. This method can catch unusual child processes beyond just command shells.",
              "Machine Learning: Develop an autoencoder model trained on feature vectors representing benign process trees originating from screensavers. Features can include process counts, specific process names present in the tree, and integrity level changes. Trees with a high reconstruction error when passed through the model are flagged as anomalous, indicating a deviation from normal process behavior."
            ]
          },
          {
            "description": "An object access log shows a process whose image path ends in '.scr' (or its child process) attempting to access a highly sensitive resource, such as 'lsass.exe' process memory, the SAM file, or the 'HKLM\\SECURITY' registry hive.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint object access logs on all Windows hosts, and specifically on Domain Controllers for sensitive directory files (NTDS.dit).",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688 for '.scr' files) with subsequent object access events (Windows Event ID 4663, 4657) from the same Process ID. Generate a critical alert if the 'ObjectName' of the access event targets 'lsass.exe', '%SystemRoot%\\\\System32\\\\config\\\\SAM', '%SystemRoot%\\\\NTDS\\\\ntds.dit', or '\\\\REGISTRY\\\\MACHINE\\\\SECURITY'.",
              "Statistical: Establish a baseline of all file and registry objects accessed by legitimate screensaver processes. This baseline should be near-zero for sensitive assets. Any access by a '.scr' process to an object outside this baseline is a statistical outlier and should be flagged. Pay special attention to access in user directories or system configuration folders.",
              "Machine Learning: Train a sequence-based anomaly detection model (e.g., an LSTM network) on sequences of system calls or object access events following benign process launches. Feed the sequence of events following a '.scr' process launch into the model. If the model flags the sequence as anomalous (e.g., a sequence of file open -> process access -> registry write), generate an alert for a suspicious chain of activity."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]