[
    {
        "information_requirement": "Is the adversary maintaining persistence using XDG Autostart entries?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1547.013",
                "name": "XDG Autostart Entries",
                "evidence": [
                    {
                        "description": "An XDG autostart .desktop file is created whose file hash or whose referenced executable's hash matches a known malicious indicator.",
                        "data_sources": [
                            "Sysmon for Linux Event ID 11",
                            "Sysmon for Linux Event ID 1",
                            "Linux Auditd"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor file creation events (Sysmon for Linux Event ID 11, Linux Auditd) in all user autostart directories (e.g., ~/.config/autostart). Upon creation of a .desktop file, hash the file and any executable referenced in its 'Exec=' line. Correlate and inner join these hashes against a CTI feed of known malicious file hashes (updated daily). Alert on any match."
                    },
                    {
                        "description": "An XDG autostart .desktop file is created containing suspicious 'Exec=' line patterns, such as invoking an interpreter on a file in a non-standard location or using obfuscation.",
                        "data_sources": [
                            "Sysmon for Linux Event ID 11",
                            "Linux Auditd"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor file creation/modification events (Sysmon for Linux Event ID 11, Linux Auditd) for .desktop files in user autostart directories. Parse the 'Exec=' line of new files. Use regular expression matching to flag commands that: 1) execute interpreters (sh, bash, python, perl) against scripts in world-writable directories (/tmp, /var/tmp, /dev/shm); 2) contain 'base64 --decode', '| sh', or other common obfuscation techniques; or 3) reference hidden files or directories. Use descriptive statistics on command line length and complexity to spot outliers against a baseline of legitimate entries."
                    },
                    {
                        "description": "An XDG autostart .desktop file is created with a name or 'Name=' field value that mimics a legitimate application but points to a different executable path or has unusual permissions.",
                        "data_sources": [
                            "Sysmon for Linux Event ID 11",
                            "Linux Auditd"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Upon creation of .desktop files (Sysmon for Linux Event ID 11, Linux Auditd), parse the 'Name=' and 'Exec=' fields. Maintain a baseline of legitimate application names and their corresponding executable paths. Use fuzzy string matching to compare new 'Name=' entries against the baseline to detect masquerading (e.g., 'Gnome Terminal' vs 'Gnome Termanal'). Alert when a known 'Name' is paired with an unexpected 'Exec=' path, or when the .desktop file itself has overly permissive attributes (e.g., 777)."
                    },
                    {
                        "description": "A process launched via XDG autostart establishes a network connection to an unusual external destination or deletes its source .desktop file post-execution.",
                        "data_sources": [
                            "Sysmon for Linux Event ID 1",
                            "Sysmon for Linux Event ID 3",
                            "Sysmon for Linux Event ID 23",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Sysmon for Linux Event ID 1) originating from .desktop files with subsequent network connections (Sysmon for Linux Event ID 3, Zeek conn.log). Baseline normal network behavior for legitimate autostart applications. Flag processes that connect to low-reputation IPs, rare geolocations, or non-standard ports using frequency and percentile analysis. Additionally, correlate the process start with a near-simultaneous file deletion (Sysmon for Linux Event ID 23) of the source .desktop file, a common anti-forensics technique. Use time series analysis to detect anomalous process-network-file activity chains following user login."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary attempting privilege escalation using XDG Autostart entries?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1547.013",
                "name": "XDG Autostart Entries",
                "evidence": [
                    {
                        "description": "A process launched from a system-wide XDG autostart directory establishes a network connection to a known malicious C2 IP address or domain.",
                        "data_sources": [
                            "Sysmon for Linux Event ID 1",
                            "Sysmon for Linux Event ID 3",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for processes launched from /etc/xdg/autostart (Sysmon for Linux Event ID 1). Correlate the process ID with network connection events (Sysmon for Linux Event ID 3, Zeek conn.log). Inner join the destination IP addresses and domains from these connections with a high-confidence CTI feed of malicious infrastructure. Alert on any matches."
                    },
                    {
                        "description": "A process launched from a system-wide XDG autostart directory executes a command containing privilege escalation tools or syntax.",
                        "data_sources": [
                            "Sysmon for Linux Event ID 1",
                            "Linux Auditd"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Sysmon for Linux Event ID 1, Linux Auditd execve syscall) where the process is launched from a .desktop file in /etc/xdg/autostart. Analyze the full command line for patterns indicative of privilege escalation, such as 'sudo -n', 'pkexec', 'chmod u+s', or calls to known vulnerable SUID binaries. Use regular expressions to detect these patterns and alert for manual review."
                    },
                    {
                        "description": "A system-wide XDG autostart directory or a .desktop file within it is created or modified by a non-root user account.",
                        "data_sources": [
                            "Sysmon for Linux Event ID 11",
                            "Linux Auditd"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Set up file integrity monitoring (using Linux Auditd watches or Sysmon for Linux Event ID 11) on the /etc/xdg/autostart/ directory and all .desktop files within it. For every modification or creation event, record the user ID (UID) of the responsible process. Alert on any event where the UID is not 0 (root). Use descriptive statistics to track the frequency of modifications by user and flag any non-root user activity as highly suspicious."
                    },
                    {
                        "description": "A process launched from a system-wide XDG autostart directory writes a file to a sensitive system location or modifies a critical configuration file.",
                        "data_sources": [
                            "Sysmon for Linux Event ID 1",
                            "Sysmon for Linux Event ID 11",
                            "Linux Auditd"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate processes launched from /etc/xdg/autostart (Sysmon for Linux Event ID 1) with subsequent file creation events (Sysmon for Linux Event ID 11, Linux Auditd creat/open syscalls) initiated by that process. Maintain a list of sensitive system directories (/etc, /bin, /sbin, /usr/bin, /usr/sbin) and critical configuration files. Alert when a process originating from system-wide autostart writes to these protected locations, as this could indicate privilege escalation being used to create additional backdoors. Use correlation analysis to link the initial process launch to the unauthorized file write within a short time window (e.g., < 60 seconds)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
