[
  {
    "information_requirement": "Has the adversary attempted to gain credentials using an Evil Twin attack?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1557.004",
        "name": "Evil Twin",
        "evidence": [
          {
            "description": "A corporate endpoint's Wi-Fi connection log shows a connection to a BSSID that is present on a threat intelligence blocklist. Alternatively, a TLS log associated with the device's session shows an SSL certificate thumbprint for a captive portal that is also on a blocklist.",
            "data_sources": [
              "Zeek wifi.log",
              "Zeek ssl.log",
              "Windows Event ID 8001"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate endpoints with wireless capabilities, wireless access point controllers, and network sensors monitoring egress traffic.",
            "action": [
              "Query a threat intelligence feed of known malicious BSSIDs and SSL certificate thumbprints. Create a rule to alert when a BSSID from Windows Event ID 8001 or Zeek wifi.log, or a certificate thumbprint from Zeek ssl.log, matches an entry on this list.",
              "For each corporate SSID, calculate the historical frequency of all associated BSSIDs. Generate an alert for any connection to a BSSID that falls below a low frequency threshold (e.g., observed less than 0.1% of the time), as this may represent a transient, malicious access point.",
              "Deploy a supervised classification model (e.g., Random Forest) trained on labeled data of legitimate and malicious Wi-Fi connections. Use features such as BSSID vendor OUI, channel, signal strength, connection duration, and captive portal observation to score new connections in real-time and alert on high-probability malicious events."
            ]
          },
          {
            "description": "Following a new Wi-Fi connection, HTTP traffic from the device reveals interaction with a captive portal containing artifacts (e.g., specific HTTP headers, URI paths, HTML content) indicative of known Evil Twin frameworks like WiFi Pineapple or Evilginx.",
            "data_sources": [
              "Zeek http.log",
              "Zeek wifi.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors at egress points, endpoint EDR agents with network visibility, and DNS resolvers.",
            "action": [
              "Scan Zeek http.log headers and Zeek files.log content (for HTML/JS) using regular expressions that match known Evil Twin framework artifacts, such as 'Server: WiFi-Pineapple', specific JavaScript file names, or unique hidden form fields.",
              "For all observed captive portal pages, calculate the Shannon entropy of the URI path and query parameters. Generate an alert when a page's entropy exceeds a high percentile (e.g., 95th percentile) of the baseline for legitimate captive portals, indicating potential use of automated attack tools.",
              "Apply an NLP topic modeling technique (e.g., Latent Dirichlet Allocation) to the text content of captive portal login pages. Cluster pages into topics and flag pages that are classified into an outlier topic or a topic associated with suspicious credential harvesting as potential Evil Twin portals."
            ]
          },
          {
            "description": "A corporate device connects to a wireless access point broadcasting a corporate SSID, but the access point's Basic Service Set Identifier (BSSID) is not present in the authoritative inventory of approved BSSIDs.",
            "data_sources": [
              "Zeek wifi.log",
              "Windows Event ID 8001",
              "Wireless LAN Controller Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Wireless LAN Controllers, enterprise asset management database, endpoint wireless logs, and physical security access logs for location correlation.",
            "action": [
              "Maintain an authoritative inventory mapping corporate SSIDs to their authorized BSSIDs. Create a rule to alert when a device connection from Zeek wifi.log or Windows Event ID 8001 involves a corporate SSID but the BSSID is not on the authorized list.",
              "For each physical office location, establish a baseline of all observed BSSID-SSID pairs. Monitor for new, un-baselined pairs. Alert if the count of unique devices connecting to a new BSSID broadcasting a corporate SSID exceeds a low threshold (e.g., more than one device).",
              "Use a clustering algorithm (e.g., DBSCAN) on connection data, with features including BSSID, SSID, and client MAC address. A small, dense cluster of devices connecting to a previously unseen BSSID that spoofs a corporate SSID will be flagged as an anomalous cluster indicative of an Evil Twin."
            ]
          },
          {
            "description": "Within minutes of connecting to a non-corporate or un-baselined Wi-Fi network, a device receives a DNS response for a known internal or high-value external domain that resolves to a private (RFC1918) IP address.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek wifi.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized DNS servers, network sensors capturing DNS traffic, and endpoint DNS client logs.",
            "action": [
              "Create a rule that triggers if, within 5 minutes of a new BSSID connection in Zeek wifi.log, a Zeek dns.log event shows a DNS response for a known external corporate domain (e.g., 'login.mycorp.com') that resolves to a non-routable (RFC1918) IP address.",
              "For each device, baseline the set of IP addresses it typically receives from DNS for its top 50 most frequently accessed domains. After connecting to a new network, monitor for DNS responses that provide an IP address not in the established baseline for a given domain and alert if the count of such deviant responses exceeds a threshold (e.g., >3 in 10 minutes).",
              "Implement a time-series anomaly detection model (e.g., Seasonal-Trend decomposition using Loess) on the rate of DNS responses resolving to private IPs for each host. A sudden spike in these events immediately following a new Wi-Fi connection is a strong indicator of DNS-based redirection."
            ]
          },
          {
            "description": "After connecting to a new Wi-Fi network, a device interacts with a captive portal that is either served over unencrypted HTTP or uses an SSL certificate with a validation status of 'self-signed', 'expired', or 'host mismatch'.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek wifi.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, endpoint browsers (via EDR), wireless network sensors, and Certificate Transparency logs.",
            "action": [
              "Create a rule to alert when a connection event in Zeek ssl.log has a 'validation_status' of 'self-signed_certificate' or 'wrong_host_in_cert' and the destination appears to be a login portal (e.g., URI in http.log contains 'login'). Correlate this with a recent connection to a non-corporate SSID in wifi.log.",
              "Track the fleet-wide ratio of HTTP to HTTPS login pages encountered by corporate devices. Alert if this ratio for a specific device, or across all devices, suddenly increases beyond a statistical threshold (e.g., more than 3 standard deviations above the 30-day mean), indicating a potential downgrade attack.",
              "Train a decision tree classifier to predict malicious captive portals. Use features such as: protocol_is_http (boolean), ssl_validation_status (categorical), uri_contains_login_keyword (boolean), and is_new_bssid (boolean). A prediction of 'malicious' with high confidence triggers an alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Has the adversary collected data using an Evil Twin attack?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1557.004",
        "name": "Evil Twin",
        "evidence": [
          {
            "description": "A device, during a session on a suspicious Wi-Fi network, initiates an outbound connection to an IP address or domain present on a C2 or data exfiltration threat intelligence list.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek wifi.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network security gateways, DNS servers, and integrated threat intelligence platforms.",
            "action": [
              "After a device connects to a suspicious BSSID, join its subsequent outbound connections (from Zeek conn.log and dns.log) against a high-confidence C2/exfiltration threat intelligence list. Alert on any match.",
              "For devices on suspicious networks, track the enterprise-wide rarity of the JA3 hash from their TLS connections. An extremely rare hash (e.g., seen only once in the entire organization) is a high-fidelity indicator of a non-standard client, potentially custom C2 malware.",
              "Employ a graph-based anomaly detection model where nodes are devices and destination IPs. If a device, after joining a suspicious network, connects to a destination node that is an outlier with few or no other connections from the enterprise, flag it as a potential C2 channel."
            ]
          },
          {
            "description": "From a device connected to a suspicious Wi-Fi network, network traffic exhibits signs of data exfiltration, such as: (1) DNS queries with high-entropy subdomains indicative of tunneling, or (2) HTTP POST requests with atypically large body sizes and non-standard User-Agent strings.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS servers, network traffic sensors at egress points.",
            "action": [
              "For devices on suspicious networks, scan Zeek http.log for POST requests to URIs matching known data exfiltration patterns or User-Agent strings associated with tools like Cobalt Strike. Scan Zeek dns.log for queries to domains known for DNS tunneling.",
              "For each host on a suspicious network, calculate the Shannon entropy of the subdomain portion of its DNS queries in Zeek dns.log. A sustained high entropy score (e.g., > 4.0) indicates probable DNS tunneling. Separately, flag any HTTP POST request where the body size is in the 99th percentile of the user's historical baseline.",
              "Train a time-series forecasting model (e.g., ARIMA) on normal DNS query length and frequency per host. If, after connecting to a suspicious network, the observed query length or frequency significantly deviates from the forecasted values, flag it as anomalous exfiltration activity."
            ]
          },
          {
            "description": "After connecting to a suspicious Wi-Fi network, a device initiates an outbound data transfer where the total volume of bytes sent or the MIME types of files transferred significantly deviates from its established historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek wifi.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Data Loss Prevention (DLP) systems, file servers.",
            "action": [
              "For a device on a suspicious network, create a rule to alert if Zeek files.log shows an outbound transfer of files with sensitive MIME types (e.g., 'application/zip', 'application/x-7z-compressed') or extensions (e.g., '.pst', '.kdbx') to a non-corporate IP address.",
              "For each user/device, create a daily baseline of outbound data volume ('orig_bytes' in Zeek conn.log). After connecting to a suspicious network, if the outbound data volume in a 1-hour window exceeds 3 standard deviations from the user's daily average, generate an alert.",
              "Use a one-class SVM to model normal data transfer behavior for each device, using features like total_bytes, protocol, destination_port, and hour_of_day from Zeek conn.log. Any transfer that falls outside the learned boundary after connecting to a suspicious network is flagged as an anomaly."
            ]
          },
          {
            "description": "A TLS session originating from a device on a suspicious Wi-Fi network exhibits characteristics of Man-in-the-Middle (MitM) interception, such as the use of weak cipher suites, protocol downgrades, or server certificates not issued by a trusted public Certificate Authority.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek wifi.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensors, Enterprise PKI and trusted CA lists, endpoint EDR agents with network visibility.",
            "action": [
              "Create a rule to alert if an entry in Zeek ssl.log from a device on a suspicious network shows a 'version' of 'TLSv1.0' or 'SSLv3', or if the certificate issuer in Zeek x509.log is not on an approved list of CAs, especially for high-value domains.",
              "Maintain a baseline of common 'cipher' and 'version' values in Zeek ssl.log for connections to the enterprise's top 100 most visited domains. Alert if a new connection from a device on a suspicious network uses a cipher or version that is statistically rare (e.g., <1% frequency) for that destination domain.",
              "Use a clustering algorithm (e.g., k-means) to group TLS sessions based on a feature vector of cipher suite, TLS version, certificate issuer, and JA3 hash. If a session from a device on a suspicious network falls into a small, isolated cluster, it indicates a deviation from normal TLS parameters and could be a MitM proxy."
            ]
          },
          {
            "description": "Following a connection to a suspicious Wi-Fi network, the device initiates a high rate of connection attempts to numerous distinct IP addresses or ports within the local subnet, consistent with network scanning behavior.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network taps or SPAN ports monitoring local subnet traffic, endpoint firewalls, and EDR logs.",
            "action": [
              "Monitor Zeek notice.log for 'Scan::Address_Scan' or 'Scan::Port_Scan' notices originating from a device that recently joined a suspicious Wi-Fi network. Correlate with a high volume of Windows Event ID 5156 (WFP connection block/permit) on the endpoint.",
              "In a 1-minute sliding window, count the number of distinct destination IPs within the same /24 subnet a device attempts to connect to (from Zeek conn.log). If this count exceeds the 99th percentile of all devices' typical local connection rates, flag the device as scanning.",
              "Model a device's local connection 'fan-out' (number of unique local IPs contacted over time) using a time-series model. A sudden, sharp increase in fan-out after joining a new network, which deviates significantly from the model's prediction, indicates scanning activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]