[
    {
        "information_requirement": "Is the adversary attempting to steal credentials using ARP cache poisoning?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1557.002",
                "name": "ARP Cache Poisoning",
                "evidence": [
                    {
                        "description": "ARP traffic originates from a MAC address or OUI (Organizationally Unique Identifier) known to be associated with ARP poisoning tools.",
                        "data_sources": [
                            "Zeek arp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a watchlist of MAC addresses and OUIs associated with known ARP spoofing tools (e.g., Ettercap, Bettercap, Cain & Abel) or those identified in previous incidents. Scan Zeek arp.log for any ARP packets (requests or replies) originating from a MAC address on this watchlist. Alert on any matches, especially if they are attempting to impersonate critical infrastructure."
                    },
                    {
                        "description": "A specific sequence of ARP activity matches the known operational pattern of an ARP poisoning tool, such as a subnet-wide ARP scan followed by a flood of malicious gratuitous ARP replies targeting the gateway.",
                        "data_sources": [
                            "Zeek arp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and monitor for specific ARP sequences characteristic of poisoning tools. For example, detect a single MAC address sending ARP requests to the entire local subnet broadcast address (or sequentially to all IPs in a CIDR range) within a short window (e.g., < 1 minute), immediately followed by sending gratuitous ARP replies claiming the IP of the default gateway or DNS server. Use correlation analysis to link the sequence of `who-has` requests and subsequent `is-at` replies from the same source MAC."
                    },
                    {
                        "description": "An IP address conflict is detected on an endpoint, especially when the conflicting MAC address is claiming the IP of a critical server like a Gateway, DNS Server, or Domain Controller.",
                        "data_sources": [
                            "Windows Event ID 4199",
                            "Zeek arp.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for Windows Event ID 4199, which indicates a duplicate IP address was detected on the network. When an event is logged, extract the conflicting MAC address. Correlate this MAC with Zeek arp.log data to observe its other ARP activity. Prioritize alerts where the IP in conflict belongs to critical infrastructure, as this is a strong indicator of a man-in-the-middle attempt for credential capture."
                    },
                    {
                        "description": "Frequent and unsolicited ARP replies (gratuitous ARPs) for critical infrastructure IPs (e.g., Default Gateway, DNS server) originate from an unexpected MAC address.",
                        "data_sources": [
                            "Zeek arp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish and maintain a baseline of legitimate MAC-to-IP mappings for critical infrastructure. Monitor Zeek arp.log for gratuitous ARP replies (`is-at` packets without a corresponding `who-has` request). Alert when a gratuitous ARP advertises a critical IP with a MAC address that does not match the established, legitimate baseline. Use time series analysis to detect unusual spikes in the volume of gratuitous ARPs for these critical IPs."
                    },
                    {
                        "description": "A single, non-gateway MAC address rapidly claims multiple high-value IP addresses (e.g., domain controllers, authentication servers) sequentially, indicating an attempt to become the man-in-the-middle for credential-rich traffic.",
                        "data_sources": [
                            "Zeek arp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek arp.log over short time windows (e.g., 5 minutes). Group ARP replies by source MAC address and count the number of unique, critical IP addresses claimed by each MAC. Use percentile analysis or a fixed threshold (e.g., a single MAC claiming > 5 critical IPs) to identify MAC addresses behaving anomalously. Calculate the entropy of IPs claimed by a single MAC; a sudden increase in entropy for a non-gateway MAC is highly suspicious."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary collecting sensitive data using ARP cache poisoning?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1557.002",
                "name": "ARP Cache Poisoning",
                "evidence": [
                    {
                        "description": "ARP traffic from a known malicious MAC address/OUI is observed targeting specific data repositories like file servers or database servers.",
                        "data_sources": [
                            "Zeek arp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a watchlist of malicious MACs/OUIs. Scan Zeek arp.log for any ARP packets from a watchlisted MAC where the target IP being impersonated belongs to a pre-defined list of high-value data assets (e.g., file servers, database servers, code repositories). Alert on matches that specifically target these collection-relevant systems."
                    },
                    {
                        "description": "A pattern of targeted ARP poisoning is observed against two specific endpoints (e.g., a user workstation and a file server), indicating a focused man-in-the-middle attack to intercept a specific data stream.",
                        "data_sources": [
                            "Zeek arp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek arp.log for pairs of targeted ARP poisoning. This pattern involves a malicious MAC sending one ARP reply to Host A's MAC claiming to be Host B's IP, and another ARP reply to Host B's MAC claiming to be Host A's IP. Detect this by identifying a single source MAC address sending conflicting ARP replies for two different IPs, where the replies are directed to the legitimate MAC addresses of those respective IPs. Correlate this pattern with subsequent high-volume traffic flow between Host A and Host B through the attacker's MAC."
                    },
                    {
                        "description": "An IP address conflict is detected on a high-value data server (e.g., file server, database server) or a key user's workstation known to handle sensitive information.",
                        "data_sources": [
                            "Windows Event ID 4199",
                            "Zeek arp.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for Windows Event ID 4199 on servers designated as critical data repositories or on workstations of users with high-level data access. An IP conflict on a database server is a strong indicator of an attempt to intercept sensitive query traffic for collection. Correlate the conflicting MAC address from the event log with Zeek arp.log to determine if it is impersonating other key assets in a client-server relationship."
                    },
                    {
                        "description": "Anomalous network traffic redirection involving high-value data assets is observed immediately following a suspicious ARP event.",
                        "data_sources": [
                            "Zeek arp.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "First, identify suspicious ARP events (e.g., IP-MAC mapping changes for a file server via Zeek arp.log). Then, using correlation analysis, examine Zeek conn.log for traffic to/from the file server's IP address immediately following the ARP event. If the Layer 2 destination MAC address for this traffic is the new, suspicious MAC address instead of the legitimate one, it confirms traffic interception. Use linear regression to model normal traffic volume between key clients and servers; flag significant deviations that coincide with ARP anomalies as potential collection activity."
                    },
                    {
                        "description": "A non-gateway device suddenly begins receiving a large volume of traffic destined for a data-rich server, indicating it has successfully poisoned the ARP cache of other clients to intercept data.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Profile normal traffic volumes for all non-gateway endpoints on the network segment. Monitor Zeek conn.log, mapping Layer 3 traffic (IPs) to Layer 2 traffic (MACs). Use time series analysis or descriptive statistics (e.g., standard deviation, IQR) to detect when a non-gateway MAC address starts receiving an anomalously high volume of traffic, especially traffic on ports associated with file sharing (SMB/445), databases (SQL/1433), or other sensitive applications. Correlate this finding with suspicious ARP activity involving the same MAC address."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
