[
  {
    "information_requirement": "Has an adversary accessed cloud instance metadata to steal credentials or other sensitive data?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1552.005",
        "name": "Cloud Instance Metadata API",
        "evidence": [
          {
            "description": "A network connection from an external source IP to a public-facing web application is immediately followed, within a 5-second window, by a connection from that same application server's internal IP to the Instance Metadata API endpoint (169.254.169.254), suggesting a potential Server-Side Request Forgery (SSRF) attack.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web application servers, Cloud network flow logs (e.g., VPC Flow Logs), and network traffic logs from virtual network taps.",
            "action": [
              "Symbolic: Correlate inbound Zeek http.log traffic against a threat intelligence feed of known malicious IPs. If a match is found, query Zeek conn.log to detect if the targeted server subsequently initiated a connection to destination IP '169.254.169.254' within a 5-second time window.",
              "Statistical: For each public-facing web server, establish a baseline for the rate of connections to '169.254.169.254'. Alert when the connection rate exceeds 3 standard deviations above the moving average, especially if this spike correlates with inbound traffic from a low-reputation IP address.",
              "Machine Learning: Train a classifier (e.g., Random Forest) on features from inbound HTTP requests (e.g., User-Agent, URI parameters, request headers) to predict the likelihood of a subsequent malicious metadata API access event. Use a time-series anomaly detection model (e.g., ARIMA) on the request volume to the metadata API to flag anomalous spikes."
            ]
          },
          {
            "description": "A process creation event is logged on a cloud instance where the command line explicitly invokes a network utility (e.g., curl, wget, Invoke-WebRequest) to query the Instance Metadata API endpoint at '169.254.169.254'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud compute instances (VMs, containers), CI/CD pipeline runners, and Endpoint Detection and Response (EDR) logs on cloud instances.",
            "action": [
              "Symbolic: Create a detection rule that searches Windows Event ID 4688 process creation logs for command lines matching the regular expression: '(?i)(curl|wget|powershell|pwsh|python|Invoke-WebRequest|iwr).*(169\\.254\\.169\\.254)'.",
              "Statistical: For each host or host group, establish a baseline of common process names that access the network. Flag any process execution involving '169.254.169.254' where the process name's historical frequency on that host is in the bottom 5th percentile (i.e., it is a rare process).",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) using features extracted from command-line arguments (e.g., argument count, presence of IP addresses, specific keywords, entropy). Use this model to classify each process creation event involving a network connection as either 'benign' or 'suspicious metadata access'."
            ]
          },
          {
            "description": "A network connection to the metadata API endpoint '169.254.169.254' is initiated by a process name or user account that is not on a pre-defined allowlist for that specific instance role, indicating unauthorized or anomalous access.",
            "data_sources": [
              "Windows Event ID 5156",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud compute instances (VMs, containers), Authentication and identity management servers, and host-based firewall logs.",
            "action": [
              "Symbolic: Maintain role-specific allowlists of process names and user accounts authorized to access '169.254.169.254'. Ingest Windows Event ID 5156 or Sysmon Event ID 3 data and generate an alert when a connection to '169.254.169.254' is initiated by a process or user not on the corresponding allowlist.",
              "Statistical: For each instance, profile the set of unique processes that connect to the metadata API over a 30-day baseline period. On a rolling basis (e.g., hourly), use the Jaccard similarity index to compare the current set of connecting processes to the baseline set. A similarity score below a defined threshold (e.g., < 0.5) indicates a significant deviation.",
              "Machine Learning: Employ unsupervised clustering (e.g., DBSCAN) on features of processes connecting to the metadata API (e.g., process name, parent process, user context, command line arguments). Label the largest, densest cluster(s) as 'normal' and automatically flag any process falling into smaller clusters or classified as noise as a potential outlier requiring investigation."
            ]
          },
          {
            "description": "An instance's HTTP requests to the metadata API (169.254.169.254) deviate from its established baseline, characterized by a high rate of 4xx/5xx errors, a high Shannon entropy score for requested URIs, or access to an unusually high number of unique URI paths within a short time window (e.g., 1 minute), suggesting reconnaissance activity.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud instance virtual network interfaces (VNICs), Network traffic inspection points (e.g., Zeek sensors), and cloud provider-native traffic mirroring services.",
            "action": [
              "Symbolic: Monitor Zeek http.log for requests to '169.254.169.254' and alert on any HTTP method other than GET. Also, create a rule to detect a sequence of multiple 404 Not Found responses followed by further requests with slightly different URI paths, which is indicative of brute-force enumeration.",
              "Statistical: For each source IP, establish a 30-day rolling baseline for the number of unique URI paths accessed per hour and the Shannon entropy of the set of accessed URIs. Alert if the number of unique paths exceeds the 99th percentile of the baseline or if the entropy score increases by more than 2 standard deviations from its norm.",
              "Machine Learning: Use a time-series forecasting model (e.g., Prophet, LSTM) to predict the expected volume of requests and data transfer size from each instance to the metadata API. An actual volume that significantly exceeds the predicted volume's confidence interval can indicate an anomalous reconnaissance script or data exfiltration attempt."
            ]
          },
          {
            "description": "An instance accesses a known IAM credential endpoint of the metadata API (e.g., '/iam/security-credentials/'), and this access is followed within a 5-minute window by a new outbound connection from that same instance to a sensitive cloud provider API endpoint (e.g., s3.amazonaws.com, management.azure.com).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud compute instances (VMs, containers), Egress network gateways, DNS resolvers, and VPC network access control lists (NACLs).",
            "action": [
              "Symbolic: Filter Zeek http.log for requests to '169.254.169.254' where the URI contains '/iam/security-credentials/'. For each matching event, search Zeek conn.log and dns.log for any subsequent outbound connection or DNS query for a cloud API endpoint (e.g., '*.amazonaws.com', '*.core.windows.net') originating from the same source IP within 5 minutes.",
              "Statistical: Establish a baseline of typical cloud API endpoints that each instance role communicates with. After an instance accesses the metadata credentials path, monitor its subsequent outbound connections. If it connects to a cloud API endpoint that is not part of its historical baseline (i.e., a rare destination for that role), assign it a high risk score.",
              "Machine Learning: Develop a state transition model (e.g., a Markov chain) for normal instance behavior based on sequences of network connections. Train the model on benign traffic to learn probable state transitions (e.g., 'Accessing Metadata' -> 'Accessing S3 bucket X'). An observed transition from 'Accessing Metadata Credentials' to a rare or forbidden state (e.g., 'Creating New IAM User via API') would be flagged as a high-confidence anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]