[
    {
        "information_requirement": "Has the adversary accessed credentials stored in Group Policy Preferences?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1552.006",
                "name": "Group Policy Preferences",
                "evidence": [
                    {
                        "description": "Execution of a known GPP credential dumping tool or script identified by its process name or file hash.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) on endpoints and servers for process names or command lines matching known GPP credential dumping tools (e.g., `Get-GPPPassword.ps1`, `gpprefdecrypt.py`, `Gpp-Decrypt.ps1`, `gpp-dump`). Maintain and correlate against a list of known malicious tool names and their corresponding file hashes. An exact match constitutes a high-confidence alert."
                    },
                    {
                        "description": "Command-line execution patterns searching for or reading XML files containing the 'cpassword' attribute within the SYSVOL share.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for command lines using tools like `findstr`, `Select-String`, `grep`, or `Get-ChildItem` to search within the SYSVOL path (e.g., `\\\\<DOMAIN>\\SYSVOL\\<DOMAIN>\\Policies\\`) for XML files (`*.xml`) containing the specific string `cpassword`. Use regular expressions to detect this specific discovery pattern, which is a strong indicator of intent to find GPP credentials."
                    },
                    {
                        "description": "Anomalous access to Group Policy Preferences XML files by a user or from a host that does not typically interact with GPP, or a sudden spike in access activity to the SYSVOL share.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 5145",
                            "Zeek smb_files.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal user and host access to the SYSVOL share, specifically the `\\Policies\\` subdirectory. Monitor for deviations using file access logs (Windows Event ID 4663), detailed network share object access logs (Windows Event ID 5145), or Zeek `smb_files.log`. Use descriptive statistics and correlation analysis to identify users or hosts accessing these files for the first time or with unusual frequency. Apply time series analysis to detect sudden spikes in overall read activity targeting GPP files, which could indicate widespread discovery."
                    },
                    {
                        "description": "A sequence of events where a user or process first enumerates the SYSVOL share and then shortly after reads one or more GPP XML files.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688",
                            "Windows Event ID 5145"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate multiple security events within a short time window (e.g., 5 minutes) for a specific user or host. Look for a behavioral sequence starting with broad directory enumeration on the SYSVOL share (high volume of Windows Event ID 5145 or 4663 events), followed by one or more successful read events (Windows Event ID 4663) on specific files like `Groups.xml`, `Services.xml`, or `ScheduledTasks.xml`. A linear regression model could potentially be used to correlate the rate of enumeration events with subsequent targeted read events to flag suspicious sequences."
                    },
                    {
                        "description": "Read access attempts, successful or denied, on a 'canary' or honeypot GPP XML file placed in SYSVOL specifically to detect unauthorized access.",
                        "data_sources": [
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a GPP XML file with a unique name (e.g., `_canary_credentials.xml`) containing a fake 'cpassword' attribute and place it in a GPP directory within SYSVOL. Set a System Access Control List (SACL) on the file to audit all access attempts. Monitor Windows Event ID 4663 for any 'Object Name' matching the canary file. Any access attempt by a non-administrative or non-monitoring account is a high-fidelity alert for malicious GPP discovery."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
