[
  {
    "information_requirement": "Is the adversary maintaining persistence by modifying host software binaries?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1554",
        "name": "Compromise Host Software Binary",
        "evidence": [
          {
            "description": "The SHA256 hash of a monitored binary upon execution does not match its entry in a known-good hash baseline, or the binary's digital signature is invalid or untrusted.",
            "data_sources": [
              "Windows Event ID 1",
              "Windows Event ID 4688",
              "Windows Event ID 3002",
              "Windows Event ID 3034"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application Servers, User Workstations, Critical System Directories (e.g., C:\\Windows\\System32, C:\\Program Files\\)",
            "action": [
              "Create and maintain a 'golden image' list of known-good SHA256 hashes for critical binaries in directories like C:\\Windows\\System32. Join process creation logs (Windows Event ID 1) with this list on the binary's path. Generate an alert for any execution where the logged file hash does not match the corresponding hash in the golden image list and the signature status is not 'Valid' or 'Trusted'.",
              "For each monitored binary, track the frequency of hash changes over a 30-day rolling window. Calculate the mean and standard deviation of these changes. Generate a high-severity alert if the number of hash changes for a single binary in a 24-hour period exceeds three standard deviations from its historical norm, as this may indicate repeated patching or tampering outside of a normal maintenance window.",
              "Train a binary classification model (e.g., Random Forest) using features from process creation events (Windows Event ID 1). Features should include: binary path, signature status, parent process name, command line arguments, and a binary feature indicating if the hash is in the 'golden image' list. Use the trained model to score new process executions in real-time, alerting on those classified as 'suspicious' with high confidence."
            ]
          },
          {
            "description": "A file write or modification event targets a binary in a protected directory (e.g., C:\\Windows\\System32), and the initiating process is not a trusted installer (e.g., TrustedInstaller.exe, msiexec.exe) or an approved software deployment service.",
            "data_sources": [
              "Windows Event ID 11",
              "Windows Event ID 26",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of critical servers and endpoints, Software distribution points, Configuration Management Database (CMDB) servers",
            "action": [
              "Monitor for file creation events (Windows Event ID 11) where the TargetFilename is a binary within C:\\Windows\\System32 or C:\\Program Files\\*. The rule should trigger an alert if the Image (the process performing the write) is not in a pre-defined allowlist of trusted installers and updaters (e.g., msiexec.exe, TrustedInstaller.exe, wuauclt.exe).",
              "For each host, profile the set of processes that typically write to application and system directories. Calculate the entropy of the set of unique processes writing to these directories over a 24-hour period. An unusually high entropy score, indicating a large number of different or rare processes are performing writes, could signal widespread binary modification. Alert if the daily entropy score for a host exceeds the 95th percentile of its historical 30-day distribution.",
              "Develop an anomaly detection model (e.g., Isolation Forest) based on file modification events (Windows Event ID 11). Use features such as the source process name (Image), target file path (TargetFilename), parent process of the source, and user context. Train the model on benign activity, including standard patching and software installation, to identify and score new file modification events, flagging outliers that represent deviations from normal administrative behavior."
            ]
          },
          {
            "description": "A normally non-network-facing binary (e.g., notepad.exe) or a server-side binary initiates unexpected outbound network connections.",
            "data_sources": [
              "Windows Event ID 3",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), Endpoint network stacks, DNS servers",
            "action": [
              "Create a watchlist of executables that should never initiate outbound network connections (e.g., notepad.exe, calc.exe, services.exe). Query network connection logs (Windows Event ID 3) and generate a high-priority alert whenever a process from this watchlist is observed making an outbound connection to any destination IP address not in the private IP space.",
              "For each process, establish a baseline of its network behavior including common destination ports and protocols. Calculate the 99th percentile for data sent per connection for each process over a 30-day period. Alert when a new connection from a process exceeds this established percentile, or when a process communicates over a port it has never used before in its baseline.",
              "Use time-series analysis (e.g., ARIMA) on aggregated Zeek conn.log data, grouped by source host and destination port. Model the expected volume and frequency of connections for common services (e.g., SSH, RDP). An alert is triggered when the model detects a significant anomaly from the predicted pattern, which could indicate a compromised binary (like a modified SSH client) being used for C2 communication."
            ]
          },
          {
            "description": "A trusted binary exhibits anomalous behavior, such as spawning a shell (e.g., powershell.exe), loading an unsigned or unusually located DLL, or writing to a file outside of its expected operational directories.",
            "data_sources": [
              "Windows Event ID 1",
              "Windows Event ID 7",
              "Windows Event ID 11",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process execution environment on endpoints and servers, System memory space where modules are loaded, User profile directories and temporary folders (e.g., %TEMP%, %APPDATA%)",
            "action": [
              "Define a set of high-risk parent-child process relationships (e.g., parent winword.exe spawning child powershell.exe). Create a rule that queries process creation logs (Windows Event ID 1) and generates an immediate alert upon observing any of these forbidden relationships. Also, alert on any module load (Windows Event ID 7) where the loaded module is unsigned and resides in a non-standard directory like C:\\Users\\*\\AppData\\.",
              "For each parent process, build a historical baseline of its child processes. Alert when a parent process spawns a child that is statistically rare (e.g., seen in less than 1% of instances for that parent). Additionally, calculate the entropy of command-line arguments for sensitive processes; alert when entropy for a new process execution significantly deviates from the historical norm for that process.",
              "Implement a graph-based analysis by modeling process relationships (parent-child, process-module, process-network connection) as a graph. Use a graph-based anomaly detection algorithm to identify nodes (processes) with anomalous structural properties compared to a baseline graph of normal activity. A normally isolated process that suddenly becomes a central hub connecting to many other rare processes would be flagged as a high-risk anomaly."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]