[
  {
    "information_requirement": "Is the adversary using alternate authentication material to bypass defense mechanisms?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1550",
        "name": "Use Alternate Authentication Material",
        "evidence": [
          {
            "description": "Execution of processes or access to named pipes on endpoints or servers associated with known credential theft and alternate authentication tools (e.g., Mimikatz, Rubeus).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek smb.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations",
            "action": [
              "Symbolic: Create a watch list of process names (`mimikatz.exe`, `rubeus.exe`), command-line arguments (`sekurlsa::`, `kerberoast`), and SMB named pipes (`\\\\*\\pipe\\mimi_etc`, `\\\\*\\pipe\\psexesvc`) associated with credential theft tools. Query process creation logs (Windows Event ID 4688) and network logs (Zeek smb.log, dce_rpc.log) for exact matches. Generate a high-severity alert upon any match.",
              "Statistical: For each host, calculate the entropy of command-line arguments for common system processes (`powershell.exe`, `cmd.exe`, `rundll32.exe`). Establish a baseline entropy score for each process on each host over a 30-day period. Monitor for significant positive deviations (e.g., > 3 standard deviations above the mean), which can indicate obfuscated or encoded commands used by credential theft tools.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) on labeled process creation events (Windows Event ID 4688), using features such as process name, parent process, command-line length, command-line entropy, and user context. Use the trained model to score new, unseen process creation events in real-time. Events classified as malicious with high confidence should trigger an investigation."
            ]
          },
          {
            "description": "A Kerberos service ticket request (TGS-REQ, Event ID 4769) occurs for a user from a source IP without a recent, corresponding ticket-granting ticket request (TGT-REQ, Event ID 4768) from the same user and IP.",
            "data_sources": [
              "Windows Event ID 4769",
              "Windows Event ID 4768",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers",
            "action": [
              "Symbolic: For each Kerberos Service Ticket Request (Windows Event ID 4769), perform a stateful lookup to verify if a Ticket-Granting Ticket (Windows Event ID 4768) was issued to the same account from the same source IP within the TGT's lifetime (default 10 hours). If no corresponding Event ID 4768 is found, flag the event as a potential Pass-the-Ticket attack. Additionally, alert if the ticket encryption type in Event ID 4769 is RC4 (0x17).",
              "Statistical: Aggregate Kerberos events (Zeek kerberos.log) by user. For each user, profile the distribution of requested Service Principal Names (SPNs). Calculate the rarity of each SPN request for a given user based on historical data. Alert when a user requests a service ticket for an SPN that falls below a rarity threshold (e.g., in the bottom 5th percentile of their typical requests), suggesting anomalous service access.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., ARIMA or LSTM) on the volume of Kerberos service ticket requests (Event ID 4769) per user and per source host. The model should learn the normal cadence of requests. Flag anomalous spikes in requests from a single user or host, which could indicate automated ticket abuse via tools like Rubeus."
            ]
          },
          {
            "description": "A successful logon event (Windows Event ID 4624) is recorded with Logon Type 9 (NewCredentials), indicating a process is using explicit credentials different from its own security context.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Filter all successful logon events (Windows Event ID 4624) for Logon Type 9 ('NewCredentials'). Correlate the logon event with the 'New Process Name' field to identify the responsible executable (e.g., `runas.exe`, `powershell.exe`). Alert on any Logon Type 9 event not explicitly whitelisted as legitimate administrative activity.",
              "Statistical: Group Logon Type 9 events by the source process name and the user account performing the action. Calculate the frequency of these pairings across the enterprise over a 30-day baseline period. Alert when a new, previously unseen process-user pair generates a Logon Type 9 event, or if the frequency for an existing pair exceeds a statistical threshold (e.g., 99th percentile).",
              "Machine Learning: Use an unsupervised anomaly detection algorithm like Isolation Forest on Logon Type 9 events. Use features such as the source process name, parent process name, user account, target server, and time of day. The model will identify unusual combinations of these features that deviate from established administrative patterns, flagging them as potential credential abuse."
            ]
          },
          {
            "description": "A single user account is observed successfully authenticating from a number of distinct internal source systems that is anomalous for that user within a short time window.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, All Windows Endpoints and Servers, Network Flow Aggregators",
            "action": [
              "Symbolic: For a single user account, if successful network logons (Windows Event ID 4624, Logon Type 3) are observed from more than 'N' distinct source hosts within a 'T' minute window (e.g., N=5 hosts, T=10 minutes), generate an alert. This is a simple rule to catch brute-force style lateral movement.",
              "Statistical: For each user account, establish a baseline by profiling the number of distinct logon sources per hour. Trigger an alert if a user's activity exceeds a statistical threshold (e.g., the 95th percentile) for their own historical baseline or for their peer group, indicating an abnormal breadth of activity.",
              "Machine Learning: Model user logon behavior as a graph, where users and hosts are nodes and logons are directed edges. Use a community detection algorithm (e.g., Louvain Modularity) to identify clusters of hosts typically accessed by specific user groups or departments. An alert is triggered when a user logs into a host outside of their typical community, indicating a deviation from normal access patterns."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary using alternate authentication material for lateral movement?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1550",
        "name": "Use Alternate Authentication Material",
        "evidence": [
          {
            "description": "Remote process execution is observed via tools like PsExec or WinRM, identified by specific process names, command-line arguments, or associated network named pipe and DCE/RPC traffic.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek dce_rpc.log",
              "Zeek smb.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Member Servers, Privileged Access Workstations, Network Egress/Ingress Points",
            "action": [
              "Symbolic: Monitor process creation events (Windows Event ID 4688) for execution of remote administration tools (`psexec.exe`, `wmic.exe`). Simultaneously, monitor network logs for associated activity, such as SMB access to the `psexesvc` named pipe (Zeek smb.log) or DCE/RPC calls to the `svcctl` endpoint (Zeek dce_rpc.log). Create a high-priority alert when these process and network indicators correlate.",
              "Statistical: For each host, profile the parent-child process relationships (e.g., `services.exe` spawning `cmd.exe`). Calculate the frequency of these relationships. Alert when a rare parent-child relationship is observed (e.g., an IIS worker process `w3wp.exe` spawning `psexec.exe`), as this deviates from normal administrative patterns and may indicate lateral movement from a compromised web server.",
              "Machine Learning: Apply a sequence analysis model (e.g., Hidden Markov Model) to sequences of network and host events per user session. Train the model on normal administrative sessions. The model can then identify anomalous sequences, such as a network logon followed immediately by remote service creation and then a command shell execution, which is a common pattern for tools like PsExec."
            ]
          },
          {
            "description": "On a target host, a network logon event (Logon Type 3) using NTLM authentication is immediately followed by a remote process or service creation event by the same user account SID.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, especially Domain Controllers and critical servers",
            "action": [
              "Symbolic: On each host, create a stateful detection rule that triggers on a successful network logon (Windows Event ID 4624, Logon Type 3) using the NTLM authentication package. If, within 2 seconds, a new service is created (Event ID 7045) or a process is created (Event ID 4688) by the same 'Security ID' from the logon event, generate a critical alert for a likely Pass-the-Hash attack.",
              "Statistical: Analyze the distribution of Authentication Packages ('NTLM' vs 'Kerberos') for network logons (Type 3) across the environment. Calculate the ratio of NTLM to Kerberos logons for each user and host. A sudden, statistically significant increase in the NTLM ratio for a specific user or from a specific source host can indicate a fallback to NTLM for a Pass-the-Hash attack.",
              "Machine Learning: Train a decision tree classifier on correlated logon and process/service creation events. Features should include Logon Type, Authentication Package, time delta between events, user privilege level, and source/destination host roles. The model can learn to distinguish legitimate remote administration from high-confidence Pass-the-Hash patterns, providing a score to prioritize alerts."
            ]
          },
          {
            "description": "A 'chain' of network logon events is observed across multiple hosts, where one host becomes the source of a subsequent logon to another host, indicating multi-hop lateral movement.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Network Flow Aggregators, Log Aggregation Platform (SIEM)",
            "action": [
              "Symbolic: Stitch together network logon events (Windows Event ID 4624, Logon Type 3) by joining on `TargetUserName`. Identify sequences where `hostA` logs into `hostB` at `T1`, and then `hostB` logs into `hostC` at `T2` (where `T2 > T1`). Define a 'chain' as a sequence of 2 or more such hops within a 60-minute window. Alert on the formation of any new chain.",
              "Statistical: Represent logon data as a directed graph where hosts are nodes and logons are edges. Calculate graph metrics for each node, such as out-degree (number of hosts it logs into). Establish a baseline for these metrics for all hosts. Alert when a host's out-degree exceeds a statistical threshold (e.g., 3 standard deviations above its mean), indicating it has become a pivot point for lateral movement.",
              "Machine Learning: Use a pathfinding algorithm (e.g., Breadth-First Search) on the logon graph to identify the shortest path of logons between any two hosts in the network. Apply a time-series anomaly detection model to the daily count of newly discovered paths of length > 1. A sudden increase in the number of multi-hop lateral movement paths can indicate a widespread campaign."
            ]
          },
          {
            "description": "A privileged or service account performs a network logon from a workstation or at a time that deviates significantly from its established behavioral baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Privileged Access Workstations, Servers hosting critical applications",
            "action": [
              "Symbolic: Define a static rule: Alert if a Domain Admin account performs a network logon (Type 3) from any host that is not on the approved list of Privileged Access Workstations (PAWs). This provides a high-fidelity, policy-based detection.",
              "Statistical: For each privileged account, create a baseline of normal activity using historical logon data (Windows Event ID 4624). Dimensions should include: (1) set of source workstations, (2) set of destination servers, (3) time of day distributions. Alert if a logon occurs from a source workstation not in the top 95% of frequent sources, or at a time of day with historically low (<5%) activity for that account.",
              "Machine Learning: For each privileged user, train a one-class SVM (Support Vector Machine) model on their historical logon data (features: source IP, destination IP, protocol, time of day). This model learns a boundary defining 'normal' behavior for that specific user. Any new logon event that falls outside this boundary is flagged as an anomaly, potentially indicating the user's credentials have been stolen and are being used from an unusual context."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]