[
    {
        "information_requirement": "Is the adversary bypassing authentication mechanisms using stolen hashes?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1550.002",
                "name": "Pass the Hash",
                "evidence": [
                    {
                        "description": "Pass-the-Hash activity (NTLM LogonType 3) where the source workstation or destination server IP is a known indicator of compromise from a prior security alert or threat intelligence feed.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate all NTLM LogonType 3 events (Windows Event ID 4624) and associated network traffic (Zeek conn.log) with internal lists of compromised host IPs and external threat intelligence feeds. An inner join between logon event source/destination IPs and these indicator lists should trigger an immediate alert, as it suggests an adversary is using a compromised asset to pivot or is targeting an already compromised host."
                    },
                    {
                        "description": "Creation of specific services, named pipes, or process command-line arguments on a target system consistent with known Pass-the-Hash tools (e.g., Impacket, Mimikatz, CrackMapExec).",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 7045"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a successful NTLM LogonType 3 (Event ID 4624) with subsequent events on the target system. Monitor for Event ID 7045 (A service was installed) with service names like 'PSEXESVC' or randomly generated alphanumeric names. Monitor Event ID 4688 (Process Creation) for command lines containing patterns specific to tools like Impacket's `psexec.py` or `wmiexec.py`, or Mimikatz's `sekurlsa::pth` module. Maintain and use a library of regular expressions for these known tool artifacts to detect their specific usage patterns."
                    },
                    {
                        "description": "An NTLM LogonType 3 authentication occurs from a source system where the authenticating user has no recent interactive (LogonType 2/10) or Kerberos logon session, indicating credentials were used without a standard user logon.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For every successful NTLM LogonType 3 event (Event ID 4624) on a destination server, query the security logs of the source workstation for a corresponding recent (e.g., within the last 8-24 hours) successful interactive logon (LogonType 2 or 10) for the same user account. The absence of such a preceding logon on the source host is a strong behavioral indicator of Pass-the-Hash. Use correlation analysis across hosts based on user, source, and timestamps to automate this check."
                    },
                    {
                        "description": "An NTLM LogonType 3 authentication event where the account name ends in '$' (indicating a machine account) originates from a source workstation that is not a domain controller or authorized management server.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter all Windows Event ID 4624 for LogonType 3 where the 'Account Name' field ends in '$'. For each event, examine the 'Source Network Address'. Maintain a list of authorized management servers and domain controllers. Flag any logon event where a machine account is used for a network logon from a standard user workstation or any other unauthorized source. Use frequency analysis to identify rare or anomalous sources for machine account logons."
                    },
                    {
                        "description": "A user account, particularly a service account or local administrator account, performs an NTLM LogonType 3 authentication from a workstation it has never logged on from before, or to a server it does not typically access.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish baselines of user-to-host and user-to-server logon relationships using historical Windows Event ID 4624 data. Profile typical source-destination pairs for each user's NTLM LogonType 3 activity. Use descriptive statistics and frequency analysis to detect rare or first-time occurrences of a user authenticating from a specific source or to a specific destination. Use linear regression to detect anomalous trends and apply higher scrutiny to service accounts performing network logons from user workstations."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary moving laterally using stolen credentials/hashes?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1550.002",
                "name": "Pass the Hash",
                "evidence": [
                    {
                        "description": "Pass-the-Hash lateral movement attempts targeting high-value assets (e.g., domain controllers, critical application servers) whose IPs are on a protected asset list.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a list of IP addresses for high-value assets (e.g., Domain Controllers, key database servers, core infrastructure). Monitor all incoming NTLM LogonType 3 events (Windows Event ID 4624) on these assets. Inner join the logon events with the protected asset list. Any successful NTLM LogonType 3, especially from a non-administrative source workstation to a high-value target, should be alerted on and investigated as potential lateral movement to a critical asset."
                    },
                    {
                        "description": "Execution of remote administration or command-line tools (e.g., PsExec, PowerShell Remoting, WMI) on a target host immediately following a successful NTLM LogonType 3 authentication from a source host.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4688",
                            "Zeek dce_rpc.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a successful NTLM LogonType 3 event (Event ID 4624) on a target with subsequent process creation events (Event ID 4688) on the same target within a short time window (e.g., 1-2 minutes). Look for child processes of `services.exe` or `wmiprvse.exe` such as `cmd.exe` or `powershell.exe`, or the creation of service executables like `PSEXESVC.exe`. Analyze Zeek dce_rpc.log for remote procedure calls associated with service creation or command execution (e.g., `svcctl` or `winreg` operations) originating from the source host around the time of the logon to identify the pattern of remote execution post-PtH."
                    },
                    {
                        "description": "A single user account or source workstation initiates NTLM LogonType 3 authentications to numerous distinct destination hosts within a short period, indicating automated lateral movement.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate successful NTLM LogonType 3 events (Event ID 4624) by 'Account Name' and 'Source Network Address' over short time windows (e.g., 10-60 minutes). Count the number of unique destination hosts for each source/account. Use statistical methods like IQR or box-plots on the distribution of destination counts to identify outliers. A source workstation attempting to log into dozens or hundreds of other hosts via PtH is a strong behavioral indicator of automated lateral movement."
                    },
                    {
                        "description": "An NTLM LogonType 3 authentication path (e.g., Host A -> Host B -> Host C) that violates established network segmentation policies or represents an unusual topological path in the network graph.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Construct a network logon graph where nodes are hosts and directed edges represent NTLM LogonType 3 events between them. Analyze the paths and structure of this graph over time. Identify chains of logons (A->B, B->C, etc.) and correlate these paths with network segmentation rules (e.g., a workstation in a user VLAN should not be making NTLM logons to a server in a database VLAN). Use time series analysis to detect sudden increases in the number of edges or nodes in the graph, which may indicate a widespread lateral movement event."
                    },
                    {
                        "description": "A successful NTLM LogonType 3 authentication to a domain controller is immediately followed by Kerberos ticket requests from that same source IP, indicating a potential Overpass-the-Hash attack for enhanced lateral movement.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4768",
                            "Windows Event ID 4769"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Specifically monitor domain controllers. Correlate successful NTLM LogonType 3 events (Event ID 4624) with subsequent Kerberos ticket requests (Event ID 4768 for TGT, 4769 for Service Ticket) originating from the same source IP and involving the same user account. A tight temporal correlation (e.g., within seconds) between these events is a strong behavioral indicator of Overpass-the-Hash, where an NTLM hash is leveraged to obtain Kerberos tickets for more flexible lateral movement."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
