[
  {
    "information_requirement": "Is the adversary attempting to steal credentials using Kerberoasting?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1558.003",
        "name": "Kerberoasting",
        "evidence": [
          {
            "description": "A process is created with a name, command-line argument, or loaded module that matches signatures of known Kerberoasting tools like Rubeus or Invoke-Kerberoast.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain-joined endpoints, particularly workstations used by developers, system administrators, and security analysts, and member servers with connectivity to Domain Controllers.",
            "action": [
              "Search process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for process names like `rubeus.exe`, `asktgs.exe` or command-line strings like `kerberoast`, `asktgs`, `-spn`, or `invoke-kerberoast`. Generate a high-severity alert on any match.",
              "For common processes like `powershell.exe` or `cmd.exe`, calculate the historical baseline entropy of their command-line arguments. Monitor for new command lines where the entropy score exceeds the 95th percentile of the baseline for that specific process, and correlate with subsequent network connections to a Domain Controller on port 88. Flag for investigation.",
              "Deploy a pre-trained classification model (e.g., Random Forest, Gradient Boosting) that uses features from process command-line arguments (n-grams, character frequencies, argument count, length) to score the likelihood of being malicious. Ingest Windows Event ID 4688 and Sysmon Event ID 1 events and flag any command line classified as Kerberoasting with a confidence score above 0.9 for immediate review."
            ]
          },
          {
            "description": "A Kerberos TGS service ticket request (Event ID 4769) is logged on a Domain Controller with Ticket Encryption Type set to 0x17 (RC4-HMAC), where the requesting account is not on an approved list of legacy accounts that require RC4.",
            "data_sources": [
              "Windows Event ID 4769",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Domain Controllers within the Active Directory forest.",
            "action": [
              "Create a SIEM rule to alert on every occurrence of Windows Event ID 4769 where the 'Ticket Encryption Type' field is '0x17' and the 'Account Name' is not a member of a pre-defined 'Legacy RC4 Allowed' group in Active Directory. Escalate these alerts to high severity.",
              "For each user account, calculate a baseline of the proportion of RC4 (0x17) ticket requests versus all other encryption types over a 30-day period. Alert when a user's RC4 request proportion in a 24-hour window exceeds four standard deviations from their own baseline, or if any RC4 request is seen from an account with a zero-request baseline.",
              "Using data from Event ID 4769, apply a clustering algorithm (e.g., K-Means, DBSCAN) to group accounts based on features like the vector of encryption types requested, count of unique service names, and time-of-day patterns. Isolate and investigate any small clusters or outliers that exhibit a high proportion of RC4 requests and high service name counts, as these are distinct from typical user and service account behavior."
            ]
          },
          {
            "description": "A single source account or IP address requests a number of unique Kerberos TGS service tickets that is anomalous compared to its baseline within a short time frame.",
            "data_sources": [
              "Windows Event ID 4769",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers and network monitoring points capturing traffic to and from Domain Controllers, such as network taps or SPAN ports.",
            "action": [
              "Implement a rule that triggers an alert when a single source 'Client Address' (from Event ID 4769) or 'client' IP (from Zeek kerberos.log) is observed requesting more than 20 unique 'Service Name's in a 5-minute window. Tune this threshold based on an environmental baseline.",
              "For each source account, establish a 30-day baseline for the 99th percentile of unique service names requested within a 5-minute sliding window. Generate an alert if an account's current 5-minute count of unique service names exceeds this established 99th percentile threshold.",
              "For each source account, model the time series of unique TGS requests per minute using a forecasting model like Prophet or an LSTM-based autoencoder. Generate an alert when the observed request count significantly exceeds the model's forecasted value, including its uncertainty interval, indicating a statistically significant anomaly in request volume."
            ]
          },
          {
            "description": "A user account requests a Kerberos service ticket for a high-value Service Principal Name (SPN), such as one for a domain administrator's service account, or for an SPN that is inconsistent with the user's role and historical activity.",
            "data_sources": [
              "Windows Event ID 4769",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, and servers hosting high-value services (e.g., SQL Servers, SAP instances, SharePoint farms) which have registered SPNs.",
            "action": [
              "Maintain a watchlist of high-value and sensitive SPNs, including those for SQL services (`MSSQLSvc/*`), Exchange services, and any SPN associated with an account in a privileged group. Alert with high severity if any account not on an approved access list requests a ticket for an SPN on this watchlist.",
              "For each user, create a set of historically accessed SPNs from the last 90 days of Event ID 4769 logs. Calculate the population-wide rarity of each SPN. Generate a medium-severity alert when a user requests an SPN for the first time that is also in the top 5% of rarest SPNs accessed across the organization.",
              "Create a bipartite graph of users and the SPNs they access. Use a link prediction model or a graph embedding technique (e.g., Node2Vec) to learn typical user-service access patterns. Score each new TGS request (a new user-SPN link) based on the model's prediction. A low prediction score for an observed link indicates a highly unusual access attempt and should be flagged for review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]