[
    {
        "information_requirement": "Has the adversary accessed credentials via command history?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1552.003",
                "name": "Bash History",
                "evidence": [
                    {
                        "description": "Execution of specific search commands targeting keywords like 'password', 'token', or 'apikey' within shell history files.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Use regular expression matching on command-line audit logs (Windows Event ID 4688, especially from WSL or SSH client sessions) to detect the execution of commands like `grep`, `cat`, `awk`, or `sed` that search history files (`~/.bash_history`, `~/.zsh_history`) for specific credential-related keywords. Maintain and alert on a list of high-confidence selector strings such as `'password'`, `'apikey'`, `'ssh'`, `'--token'`, `'PT_TOKEN'`, `'AWS_ACCESS_KEY_ID'`, etc."
                    },
                    {
                        "description": "Access to or manipulation of `.bash_history` files by unusual processes or users, or commands executed to disable or clear shell history.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation logs (Windows Event ID 4688) for command lines that access or manipulate `.bash_history`. This includes read attempts (`cat`, `less`, `strings`), clearing the file (`> .bash_history`), or disabling history (`unset HISTFILE`, `export HISTSIZE=0`). Establish a baseline of normal processes that might access these files (e.g., backup agents) and alert on deviations, such as access by web server processes or newly created/suspicious user accounts. Use frequency analysis to flag hosts with an unusually high rate of history file access."
                    },
                    {
                        "description": "Anomalous exfiltration of shell history files or other configuration 'dotfiles' from user home directories over the network.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor network traffic (Zeek files.log) for the transfer of filenames matching common shell history or credential files (e.g., '.bash_history', '.zsh_history', '.ssh/', '.aws/credentials') to external destinations. Establish a baseline for normal file transfer sizes and frequencies from sensitive servers. Use time series analysis on Zeek conn.log data to detect sudden spikes in the volume of small file transfers to external destinations. Calculate the entropy of filenames being transferred from a host; a low entropy may indicate targeted exfiltration of specific file types."
                    },
                    {
                        "description": "A sequence of events where a process enumerates user home directories, accesses a `.bash_history` file, and is immediately followed by a new remote login or network connection using potentially stolen credentials.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a correlated detection rule that triggers on a specific sequence: 1. A process (via Event ID 4688) enumerates home directories (e.g., `ls /home`). 2. The same process then accesses a `.bash_history` file (e.g., `cat /home/user/.bash_history`). 3. Within a short time window (e.g., 5 minutes), a new network connection (Zeek conn.log) or successful remote login (Event ID 4624, logon type 3 or 10) is observed from the source host. Use correlation analysis based on host, user, and timestamps to link these disparate events into a single high-confidence alert indicating credential harvesting and use."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
