[
  {
    "information_requirement": "Is the adversary maintaining persistence by manipulating conditional access policies?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "A successful authentication event is observed from an external IP address that has a known malicious reputation and should have been blocked by risk-based conditional access policies.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Edge Firewalls, VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Symbolic Logic: Continuously check the `id.orig_h` field from Zeek conn.log and the `IpAddress` field from Windows Event ID 4624 for successful external authentications against a high-confidence threat intelligence feed of known malicious IPs (e.g., C2 servers, anonymizer services). Alert on any match.",
              "Statistical Method: For all successful external authentications, enrich source IPs with reputation scores from a threat intelligence provider. Calculate the 99th percentile of risk scores for all logins over a 24-hour period. Flag any login whose source IP risk score exceeds this percentile, indicating an unusually risky login that may have bypassed policy.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) on historical login data, using features such as source IP, ASN, geolocation, time of day, and threat intelligence reputation. Use the model to predict the probability of a login being malicious. A high-probability score for a successful login suggests a policy failure or evasion."
            ]
          },
          {
            "description": "A sustained pattern of successful logins is observed from a previously unseen or rare Autonomous System (AS) or IP range, suggesting a new, overly-permissive 'trusted location' has been added to a policy.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta), Network Gateway",
            "action": [
              "Symbolic Logic: Maintain an allow-list of approved corporate VPN provider ASNs and known partner IP ranges. Correlate the ASN of the `id.orig_h` from Zeek conn.log for all successful external logins against this list. Alert on any successful login from an ASN not on the allow-list.",
              "Statistical Method: For each user, create a baseline of historically used source ASNs and countries over the last 90 days. Calculate the Shannon entropy of the source ASN distribution for each user's logins within a rolling 24-hour window. A sudden, sharp decrease in entropy (indicating logins are now coming from a single, new ASN) combined with the new ASN being rare across the organization is anomalous.",
              "Machine Learning: Use a time series forecasting model (e.g., ARIMA, Prophet) to predict the expected volume of successful logins from each source ASN. An observed login volume from a new or rare ASN that significantly exceeds the forecasted value (which would be near zero) indicates a potential newly added trusted location."
            ]
          },
          {
            "description": "A measurable decrease in the rate of multi-factor authentication (MFA) challenges for a user or user group that historically required it, indicating a policy modification to weaken authentication controls.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows ADFS Event Logs",
              "Cloud Identity Provider Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider Portals (e.g., Entra ID, Okta), Active Directory Federation Services (ADFS) Servers, RADIUS Servers",
            "action": [
              "Symbolic Logic: Create a rule that triggers if a user account belonging to a group designated as 'MFA-required' has a successful login event (e.g., Windows Event ID 4624) without a corresponding MFA success event (e.g., ADFS Event ID 1201 or cloud audit log event) within a 5-minute window.",
              "Statistical Method: For each user group, calculate a rolling 7-day average of the ratio of MFA-enforced logins to total successful logins. Alert if the current day's ratio drops more than 3 standard deviations below this rolling average, indicating a significant, anomalous decrease in MFA enforcement.",
              "Machine Learning: Train a time series anomaly detection model (e.g., Isolation Forest, Autoencoder) on the MFA enforcement ratio for critical user groups. The model learns the normal ebb and flow of this metric. An anomalous point detected by the model signals a potential policy modification."
            ]
          },
          {
            "description": "Successful logins are observed from devices with client fingerprints (e.g., User-Agent, JA3 hash) that are inconsistent with managed corporate assets, especially if logins from such devices were previously blocked.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Application Frontends, VPN Portals, Endpoint Devices, Web Proxies",
            "action": [
              "Symbolic Logic: Maintain a list of approved User-Agent strings and JA3 hashes corresponding to corporate-managed devices. Correlate successful login events (Windows Event ID 4624) with web traffic (Zeek http.log, ssl.log). Alert if a successful login originates from a client with a User-Agent or JA3 hash not on the approved list.",
              "Statistical Method: Profile the rarity of User-Agent strings seen across all successful logins. Calculate the frequency of each User-Agent over the last 30 days. A successful login using a User-Agent that falls below a rarity threshold (e.g., seen in less than 0.1% of logins) is anomalous and could indicate an unmanaged device.",
              "Machine Learning: Use clustering algorithms (e.g., K-Means, DBSCAN) on features extracted from login events, such as User-Agent, JA3 hash, IP geolocation, and time of day. A small cluster of successful logins with unusual features may represent a group of non-compliant devices that are now permitted access due to a policy change."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by manipulating conditional access policies?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "A successful authentication is observed from an IP address, IP range, or country that is explicitly defined on a policy deny list, indicating the policy is not being enforced.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Edge Firewalls, VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Symbolic Logic: Continuously compare the source IP (`id.orig_h` in Zeek conn.log, `IpAddress` in Windows Event ID 4624) of every successful external authentication against an explicit, policy-defined deny list of countries, IP ranges, and ASNs. Any match is a high-fidelity alert for a policy bypass.",
              "Statistical Method: For each country on the deny list, the expected count of successful logins should be zero. Monitor the count of successful logins from these geolocations. Any count greater than zero is a statistically significant deviation from the policy-defined baseline and should be alerted.",
              "Machine Learning: Train a simple binary classifier (e.g., Decision Tree) where the target variable is `is_login_allowed` (should be 0 for deny-listed IPs) and features are source IP, country, and ASN. A prediction of `is_login_allowed=0` for an event that was actually a successful login represents a false negative for the policy, indicating it was evaded."
            ]
          },
          {
            "description": "A pattern of successful logins is observed originating from public cloud provider IP ranges (e.g., Azure, AWS, GCP) that are not associated with legitimate corporate services, suggesting use to bypass geo-fencing or IP reputation blocks.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta), Public Cloud Tenant (AWS, Azure, GCP)",
            "action": [
              "Symbolic Logic: Maintain a list of sanctioned public cloud IP ranges used for legitimate business purposes. Tag all successful external logins (Windows Event ID 4624) with their source IP's cloud provider (if any). Alert on any successful login from a cloud provider IP range that is not on the sanctioned list.",
              "Statistical Method: Calculate the proportion of successful logins per user that originate from non-sanctioned cloud IP ranges. Establish a baseline for each user (which should be near zero). Alert if this proportion for any user exceeds a predefined threshold (e.g., 5% of their logins in 24 hours) or is a statistical outlier compared to their peers.",
              "Machine Learning: Use a time series anomaly detection model on the volume of successful logins originating from non-sanctioned cloud providers. The model learns the normal (near-zero) baseline. A sudden spike in this volume is an anomaly that indicates an adversary may be using cloud infrastructure to bypass geo-fencing or IP reputation controls."
            ]
          },
          {
            "description": "A successful login for a single user account occurs from two geographically distant locations within a time frame that would make travel between them impossible, indicating location-based controls have been bypassed.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Identity Provider Portals (e.g., Entra ID, Okta), VPN Concentrators, Authentication Servers",
            "action": [
              "Symbolic Logic: For each successful login (Windows Event ID 4624), cache the user, timestamp, and geolocated source IP. Upon the next login for the same user, calculate the travel speed required. If the speed exceeds a fixed, physically impossible threshold (e.g., 1000 km/h), flag it as an 'impossible travel' event.",
              "Statistical Method: Instead of a fixed threshold, calculate the distribution of travel speeds for all users across the organization. Flag any impossible travel event where the calculated speed is a statistical outlier (e.g., exceeds the 99.9th percentile of all observed speeds), which accounts for legitimate but fast travel.",
              "Machine Learning: Model each user's sequence of login locations as a trajectory. Use a sequence anomaly detection model (e.g., an LSTM-based autoencoder) to learn a user's normal travel patterns. A new login that results in a high reconstruction error from the model is anomalous and could represent impossible travel that bypasses simpler checks."
            ]
          },
          {
            "description": "A sudden and statistically significant volume of successful logins is observed from a geographic location or Autonomous System (AS) that historically had zero or near-zero successful authentications.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Edge Firewalls, VPN Concentrators, Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Symbolic Logic: Define a list of 'zero-login' countries/ASNs where no business is conducted. Create a rule to alert on any successful login (Windows Event ID 4624) where the source IP (from Zeek conn.log enrichment) originates from a location on this list.",
              "Statistical Method: For each source country/ASN, calculate a baseline of successful login counts over a 30-day period. Use a moving average and standard deviation to define a dynamic threshold. Alert if the login count in a 1-hour window exceeds the baseline by more than 4 standard deviations, indicating a sudden surge.",
              "Machine Learning: Apply change point detection algorithms (e.g., CUSUM, Bayesian Change Point) to the time series of login volumes from each country/ASN. These algorithms can automatically detect an abrupt and persistent shift in the statistical properties of the time series, which would signify a new pattern of activity from a specific location."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary facilitating credential access by manipulating conditional access policies?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1556.009",
        "name": "Conditional Access Policies",
        "evidence": [
          {
            "description": "A successful authentication is observed for a user account whose credentials are known to be compromised, where a conditional access policy should have blocked the attempt or forced a password reset.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Domain Controllers), Cloud Identity Provider Portals (e.g., Entra ID, Okta), Threat Intelligence Platforms",
            "action": [
              "Symbolic Logic: Continuously cross-reference the usernames from all successful external authentications (Windows Event ID 4624) against a dynamic list of known-compromised accounts (e.g., from internal phishing reports or external breach data). Any successful login from an account on this high-risk watchlist is a critical alert.",
              "Statistical Method: Assign a risk score to each user account, with a higher score for those on the compromised list. For successful logins from these accounts, analyze the login parameters (location, time, device). A login that is also a statistical outlier based on the user's normal behavior (e.g., >3 standard deviations from their typical login time) dramatically increases the likelihood of abuse.",
              "Machine Learning: Train a classifier to predict malicious logins, including a binary feature 'is_credential_compromised'. A successful login where this feature is true, but where conditional access policies should have enforced a block, indicates a policy failure. The model's high confidence score for a successful login from a compromised account is a strong indicator."
            ]
          },
          {
            "description": "A successful external login is observed using a legacy authentication protocol (e.g., POP, IMAP, SMTP AUTH) that does not support modern controls like MFA, indicating a policy allowing their use has been enabled.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers (Exchange, O365), Legacy Application Servers, Edge Firewalls",
            "action": [
              "Symbolic Logic: Create a rule that alerts on any successful authentication (Windows Event ID 4624) that correlates with network traffic to a legacy protocol port (e.g., 25, 110, 143) in Zeek conn.log, especially if the source IP is external and the user is not on an explicit exception list.",
              "Statistical Method: Establish a baseline of legacy vs. modern authentication protocol usage for each user. Alert if a user who normally has 0% legacy usage suddenly has a successful legacy authentication, or if the organization-wide percentage of legacy authentications suddenly spikes above a percentile threshold (e.g., 95th percentile).",
              "Machine Learning: Use a time series anomaly detection model on the volume of successful legacy protocol authentications across the enterprise. A sudden spike or a sustained increase from the learned baseline would indicate that a policy disabling legacy auth has been weakened or removed."
            ]
          },
          {
            "description": "A high number of successful logins to distinct user accounts is observed originating from a single external IP address, indicating a successful credential stuffing or password spraying attack where MFA was not enforced.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Domain Controllers), Web Application Firewalls, Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Symbolic Logic: Create a rule that triggers if a single external source IP (`IpAddress` in Windows Event ID 4624) successfully authenticates as more than N distinct user accounts within a T time window (e.g., N=10 accounts in T=1 hour).",
              "Statistical Method: For each 1-hour window, calculate the number of unique successful logins per source IP. Identify any source IP whose count exceeds a dynamic threshold, such as 4 standard deviations above the mean or the 99th percentile for that time window, to detect outliers.",
              "Machine Learning: Use clustering (e.g., DBSCAN) on login events, with features like source IP, User-Agent, and time. A dense cluster of successful logins from a single IP to many different accounts would be identified as an anomalous cluster indicative of a large-scale attack that bypassed MFA or other controls."
            ]
          },
          {
            "description": "A sequence of failed login attempts for a user is immediately followed by a successful login that exhibits anomalous characteristics (e.g., new location, time, device), suggesting credential acquisition was followed by policy manipulation.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Domain Controllers), Cloud Identity Provider Portals (e.g., Entra ID, Okta)",
            "action": [
              "Symbolic Logic: Correlate failed login events (Windows Event ID 4625) with a subsequent successful login (Windows Event ID 4624) for the same user from the same source IP within a short time window (e.g., 15 minutes). If the successful login's properties (e.g., geolocation) are anomalous for that user, generate a high-priority alert.",
              "Statistical Method: For each user, maintain a baseline profile of login attributes (source country, ASN, time of day). After a brute-force sequence (e.g., >10 failures in 5 minutes), score the subsequent successful login against this baseline. If multiple attributes are statistical outliers (e.g., beyond the 95th percentile of rarity for that user), it indicates a high-risk success.",
              "Machine Learning: Model user login sequences using a Hidden Markov Model (HMM), where states could be 'Normal Login', 'Failed Login Spree', and 'Anomalous Success'. A transition from 'Failed Login Spree' to 'Anomalous Success' would be a low-probability sequence, flagging a likely compromise and policy bypass."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]