[
  {
    "information_requirement": "Is the adversary accessing credentials stored in password managers?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1555.005",
        "name": "Password Managers",
        "evidence": [
          {
            "description": "A process creation event is logged with a file hash matching a known password manager credential theft tool, or a network connection is initiated by any process to a destination IP or domain known to be associated with credential exfiltration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User and administrator workstations, network egress points, DNS and proxy servers",
            "action": [
              "Symbolic: Continuously match the SHA256 hash from process creation events (Windows Event ID 4688) against a threat intelligence feed of known password-stealing malware. Simultaneously, check all destination IPs and server names in network connection logs (Zeek conn.log, Zeek dns.log) against a high-confidence blocklist of C2 and exfiltration domains.",
              "Statistical: For each new executable hash, calculate its prevalence across the enterprise. Flag any hash present on fewer than 1% of endpoints that is not signed by a trusted publisher. For network connections, calculate the Shannon entropy of the server name in Zeek dns.log; alert on values exceeding a threshold (e.g., > 3.5), which may indicate DGA activity.",
              "Machine Learning: Train a logistic regression classifier on enriched process event data (e.g., parent process, command-line length, signature status) to predict the probability of a process being malicious. Use a time-series anomaly detection model (e.g., ARIMA) on outbound data volume per host (from Zeek conn.log) to flag sudden spikes inconsistent with forecasted baselines."
            ]
          },
          {
            "description": "A process creation event is logged for a known memory dumping utility (e.g., procdump.exe, comsvcs.dll) where the command-line arguments contain the process name or process ID of a running password manager application (e.g., KeePass.exe, 1Password.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User and administrator workstations",
            "action": [
              "Symbolic: Deploy a detection rule that monitors process creation events (Windows Event ID 4688) and applies a regular expression to the command line to find known memory dumping utilities (e.g., procdump.exe, rcsass.exe) followed by the process name of a common password manager.",
              "Statistical: For all command-line invocations of administrative tools, tokenize the arguments and establish a baseline of normal argument patterns. Calculate the Jaccard similarity between a new command's token set and the historical baseline for that executable; a similarity score below a set threshold (e.g., < 0.2) indicates a highly unusual command.",
              "Machine Learning: Use a pre-trained NLP model (e.g., a transformer-based classifier) on the raw command-line string to classify its intent as benign, suspicious, or malicious based on learned patterns of obfuscation and targeting. Alternatively, cluster command-line strings using DBSCAN to identify outlier commands that do not belong to known benign clusters."
            ]
          },
          {
            "description": "A file access event is logged for a known password manager database file (e.g., *.kdbx, *.agilekeychain) by a process that is not the signed executable of the password manager itself or an approved backup utility.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, file servers, or shared drives where password databases are stored",
            "action": [
              "Symbolic: After enabling object access auditing, monitor for Windows Event ID 4663 on file paths and extensions associated with password managers (*.kdbx, *.1pif, %APPDATA%\\Bitwarden\\data.json). Create a rule that alerts when the 'Process Name' field is not on an explicit allowlist of legitimate password manager executables (e.g., KeePass.exe, 1Password.exe).",
              "Statistical: Profile the set of processes that normally access sensitive password database files. Alert on any access attempt by a process with a historical access frequency in the lowest percentile (e.g., <1%) across the enterprise. Monitor the rate of access events per minute from a single host; a burst of access attempts (>10 events in 1 minute) can indicate a discovery script.",
              "Machine Learning: Develop an Isolation Forest model to detect anomalies in file access events. Use features such as the accessing process name, parent process name, user context, and time of day to train the model on normal access patterns. The model will then score and flag new access events that are outliers."
            ]
          },
          {
            "description": "A process creation event is logged showing an anomalous parent-child relationship, such as a non-standard parent process (e.g., winword.exe) spawning a password manager, or a password manager spawning a command shell (e.g., powershell.exe).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and servers with password managers installed",
            "action": [
              "Symbolic: Create explicit detection rules that flag high-risk parent-child process relationships involving password managers, such as a Microsoft Office application spawning a password manager, or a password manager spawning cmd.exe or powershell.exe.",
              "Statistical: Using historical Windows Event ID 4688 data, build a probability distribution of all parent-child process pairs. Alert on any process relationship involving a password manager that is statistically rare (e.g., has occurred fewer than 5 times in the last 90 days across the enterprise).",
              "Machine Learning: Model process ancestry as a directed graph. Use a graph-based anomaly detection algorithm (e.g., GraphSAGE) to identify anomalous edges (parent-child links) or subgraphs. This can identify when a password manager process appears in an unexpected context or has an unusual descendant process tree."
            ]
          },
          {
            "description": "A process, within 5 minutes of accessing a password manager database file, initiates an outbound network connection to a destination not on an allowlist of approved sync servers, or transfers a data volume anomalous for that process.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, network egress points, file servers",
            "action": [
              "Symbolic: Correlate Windows Event ID 4663 (file access to *.kdbx, etc.) with network connection events (Windows Event ID 5156 or Zeek conn.log) originating from the same process on the same host within a 5-minute window. Alert if the destination IP or domain is not on an allowlist of known password manager sync servers.",
              "Statistical: For each password manager process, establish a baseline of outbound data volume (`orig_bytes` in Zeek conn.log). Alert when a connection's data volume exceeds the 95th percentile for that process. Additionally, track the ratio of outbound to inbound bytes; a ratio significantly greater than the historical norm (e.g., > 3 standard deviations) for a sync process is suspicious.",
              "Machine Learning: Train a one-class SVM on features of legitimate password manager network connections (e.g., destination port, destination ASN, data volume, protocol). Use this model to score new connections and flag those identified as outliers. Separately, use a time-series model (e.g., Prophet) to forecast the expected daily outbound data volume per host; flag any day where the actual volume significantly exceeds the forecasted upper confidence bound."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]