[
  {
    "information_requirement": "Is the adversary maintaining persistence through manipulation of hybrid identities?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.007",
        "name": "Hybrid Identity",
        "evidence": [
          {
            "description": "The file hash (SHA256, MD5) of a DLL loaded by the AD FS service process (Microsoft.IdentityServer.Servicehost.exe) or PTA service process (AzureADConnectAuthenticationAgentService.exe) matches a known-malicious hash associated with authentication backdoors like MagicWeb.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA), SIEM Platform",
            "action": [
              "Query Sysmon Event ID 7 logs where the 'Image' field is 'C:\\Windows\\ADFS\\Microsoft.IdentityServer.Servicehost.exe' or 'C:\\Program Files\\Microsoft Azure AD Connect Authentication Agent\\AzureADConnectAuthenticationAgentService.exe'. For each event, extract the file hash from the 'Hashes' field of the loaded image ('ImageLoaded'). Compare this hash against a threat intelligence feed of known malicious DLLs. Generate a critical alert upon a match.",
              "For the AD FS and PTA service processes, build a historical baseline of all loaded DLLs and their file paths over a 30-day period. Calculate the load frequency for each unique DLL across the server fleet. Generate an alert if a DLL is loaded that has never been seen before or whose load frequency falls in the bottom 1st percentile, indicating extreme rarity.",
              "Train a supervised classification model (e.g., XGBoost, Random Forest) on a labeled dataset of benign and malicious DLLs. Extract features from each loaded DLL (Sysmon Event ID 7) including file entropy, signature status ('Signed', 'SignatureStatus'), import table hash (imphash), and file path characteristics. Deploy the model to score each new DLL loaded by AD FS/PTA services, alerting on any DLL with a high malicious probability score."
            ]
          },
          {
            "description": "The AD FS (Microsoft.IdentityServer.Servicehost.exe) or PTA (AzureADConnectAuthenticationAgentService.exe) service process loads a DLL that is either not digitally signed, has an invalid signature, or originates from a non-standard directory (e.g., C:\\ProgramData\\, C:\\Perflogs\\, C:\\Users\\Public\\).",
            "data_sources": [
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Create a query to monitor Sysmon Event ID 7 logs for the AD FS and PTA service processes. Trigger an alert if the 'Signed' field is 'false', the 'SignatureStatus' is not 'Valid', or the 'ImageLoaded' path is not in a whitelist of standard directories (e.g., not under 'C:\\Windows\\System32\\', 'C:\\Windows\\ADFS\\', 'C:\\Program Files\\Microsoft Azure AD Connect Authentication Agent\\').",
              "For all DLLs loaded by AD FS/PTA services, calculate the Shannon entropy of the parent directory path string. Establish a baseline of normal path entropy. Alert on any loaded DLL where the path entropy is in the top 98th percentile, as this suggests an unusually long or randomized path used for obfuscation.",
              "Utilize a clustering algorithm (e.g., DBSCAN) on features of loaded DLLs, including the full file path, signer name, and parent process. Identify dense clusters representing normal behavior. Flag any loaded DLL that is classified as a noise point or outlier by the model, as it does not conform to established patterns of legitimate module loading for these critical services."
            ]
          },
          {
            "description": "A write operation, file creation, or permission change occurs on a critical AD FS/PTA configuration file (e.g., Microsoft.IdentityServer.Servicehost.exe.config), executable, or associated registry key (e.g., HKLM\\SOFTWARE\\Microsoft\\ADFederationServices) by an unauthorized user or process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Sysmon Event ID 11",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Deploy and monitor System Access Control Lists (SACLs) on critical files (e.g., '%windir%\\ADFS\\Microsoft.IdentityServer.Servicehost.exe.config') and registry keys ('HKLM\\SOFTWARE\\Microsoft\\ADFederationServices'). Create an alert that triggers on any write access or modification event (Windows Event ID 4663, 4657; Sysmon Event ID 11, 13) not originating from a whitelisted administrative account or the 'NT AUTHORITY\\SYSTEM' account during a defined maintenance window.",
              "Establish a historical baseline for the frequency of modification events on AD FS/PTA configuration files and registry keys, segmented by time of day. Alert if the count of modification events in a 1-hour window exceeds 3 standard deviations from the historical average for that time slot, especially if it occurs outside of documented change control windows.",
              "Develop a time-series forecasting model (e.g., Prophet or ARIMA) based on the historical volume of configuration change events (e.g., Sysmon Event ID 11). Generate an alert when the observed volume of events significantly deviates from the forecasted volume and its confidence interval, indicating a potential burst of unauthorized modification activity."
            ]
          },
          {
            "description": "A new service or scheduled task is created on an AD FS/PTA server that executes code from a temporary or user-writable directory, uses a randomized name, or runs under a high-privilege account.",
            "data_sources": [
              "Windows Event ID 4698",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Monitor for the creation of new services (Windows Event ID 7045) or scheduled tasks (Windows Event ID 4698). Trigger an alert if the 'Service File Name' or 'Command' field contains paths pointing to non-standard executable locations (e.g., 'C:\\Temp\\', 'C:\\Users\\*\\AppData\\') or invokes tools like 'powershell.exe' with '-enc' or '-encodedcommand' arguments.",
              "For all new service and scheduled task names, calculate the character-level entropy. Compare the entropy score against a baseline derived from all existing service/task names on hardened servers. Alert on the creation of a new task or service whose name has an entropy score in the top 99th percentile, suggesting a machine-generated or randomized name to avoid detection.",
              "Train a classification model (e.g., Logistic Regression) to distinguish between legitimate and suspicious scheduled tasks/services. Use features such as: executable path (is it in System32?), command-line argument length and entropy, user account context (SYSTEM vs. a user), and the task name's linguistic properties. Deploy the model to score all new tasks/services and alert on those classified as malicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by modifying hybrid identity authentication?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1556.007",
        "name": "Hybrid Identity",
        "evidence": [
          {
            "description": "Command-line execution on an AD FS or PTA server includes strings associated with clearing logs, disabling security tools, or manipulating firewall rules.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Create a detection rule that searches process command-line logs (Windows Event ID 4688, Sysmon Event ID 1) for regular expressions matching known defense evasion commands, such as 'wevtutil.exe cl', 'auditpol /clear', 'netsh advfirewall', 'Set-MpPreference -Disable', or 'Clear-EventLog'.",
              "For each administrative user on AD FS/PTA servers, establish a baseline of executed command-line tools and their frequency. Calculate the rarity of each command per user. Alert when a user executes a command that falls in the bottom 5th percentile of their personal historical usage, indicating a deviation from their normal administrative duties.",
              "Implement a sequence analysis model, like a Hidden Markov Model (HMM), trained on common sequences of administrative commands during normal operations. Flag any sequence of commands that has a very low probability of occurring based on the learned model, as it may represent an adversary's unusual or exploratory actions to disable defenses."
            ]
          },
          {
            "description": "A successful AD FS token issuance event (AD FS Event ID 501) is logged for a user account configured to require MFA, but no corresponding MFA success event (e.g., AD FS Event ID 1200) is found for that user's session within a 5-minute window.",
            "data_sources": [
              "AD FS Event ID 1200",
              "AD FS Event ID 501"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Security Information and Event Management (SIEM) Platform",
            "action": [
              "Create a SIEM correlation rule. For each AD FS Event ID 501 ('Security token validated and claims issued'), extract the User Principal Name (UPN). Check if the UPN belongs to an MFA-enforced group. If so, query for an AD FS Event ID 1200 ('MFA Succeeded') with the same UPN within the preceding 5 minutes. If no such event exists, generate a high-severity alert for MFA bypass.",
              "For each user, calculate their historical ratio of successful logins (Event ID 501) to successful MFA events (Event ID 1200) over a 30-day baseline. This ratio should be close to 1.0 for MFA-enabled users. Alert if a user's ratio for the past hour drops more than 50% below their baseline, indicating successful logins are occurring without the expected MFA challenges.",
              "Model the authentication flow as a state machine (e.g., Start -> CredentialPOST -> MFA-Challenge -> MFA-Success -> Token-Issued). Train a sequence analysis model on legitimate event sequences from AD FS logs. Alert on any observed authentication flow that violates the learned state transition rules, such as a direct transition from CredentialPOST to Token-Issued for an MFA-enabled user."
            ]
          },
          {
            "description": "Aggregate authentication metrics show a statistically significant anomaly, such as a sudden spike in successful authentications from a single or geographically rare country, especially when not correlated with a spike in MFA events.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "AD FS Event ID 501"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Network Gateway, SIEM Platform",
            "action": [
              "Ingest successful login events (Windows Event ID 4624, AD FS Event ID 501) and network logs (Zeek conn.log). Join the logs on source IP address. Enrich the source IP with GeoIP data. Create a rule to alert on any successful authentication from a country on a 'never-travel' list or from an IP address associated with an anonymous proxy service.",
              "Calculate a 30-day rolling baseline (mean and standard deviation) of successful authentications per source country. Alert if the number of successful logins from any single country in a 1-hour period exceeds 4 standard deviations from its historical baseline, indicating a potential password spray or bypass from an unusual location.",
              "Apply a multivariate time-series anomaly detection model (e.g., Vector Autoregression) to key authentication metrics, including: total successful logins, total failed logins, total MFA challenges, and total MFA successes. Alert when the model flags a time window as anomalous, indicating a significant deviation from the historically correlated patterns of these metrics."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary accessing credentials via manipulated hybrid identity processes?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1556.007",
        "name": "Hybrid Identity",
        "evidence": [
          {
            "description": "An AD FS or PTA server initiates an outbound network connection to a destination IP/domain on a threat intelligence feed, or to a newly registered domain, suggesting C2 communication or data exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA), Network Egress Points, DNS Resolvers",
            "action": [
              "Continuously monitor DNS queries (Zeek dns.log) and outbound connections (Zeek conn.log) originating from the IP addresses of AD FS and PTA servers. Match the destination IP addresses and resolved domains against a high-confidence threat intelligence feed of known C2 servers. Generate a critical alert on any match.",
              "For each AD FS/PTA server, create a baseline of all destination domains contacted over 30 days. For each new DNS query, check the domain's registration date (via WHOIS data). Alert on any connection to a domain registered within the last 7 days, as this is a common indicator of malicious infrastructure.",
              "Apply a machine learning model trained to detect Domain Generation Algorithms (DGA). Use features from the query string in Zeek dns.log, such as query length, character entropy, n-gram frequency, and ratio of numbers to letters. Apply this model to all DNS queries from AD FS/PTA servers and alert on any query classified as DGA-generated with high confidence."
            ]
          },
          {
            "description": "The AD FS (Microsoft.IdentityServer.Servicehost.exe) or PTA (AzureADConnectAuthenticationAgentService.exe) process spawns an unexpected child process, especially one associated with credential dumping (e.g., 'procdump.exe', 'comsvcs.dll').",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Create a high-severity alert that triggers on any process creation event (Windows Event ID 4688, Sysmon Event ID 1) where the 'ParentProcessName' is 'Microsoft.IdentityServer.Servicehost.exe' or 'AzureADConnectAuthenticationAgentService.exe'. Additionally, search all process command lines for strings indicative of credential dumping, such as 'procdump', 'mimikatz', 'sekurlsa', or 'comsvcs.dll MiniDump'.",
              "Establish a baseline of all child processes spawned by the AD FS and PTA services. In a properly configured environment, this baseline should be empty. Therefore, any child process creation from these parent processes is a severe anomaly and should trigger an immediate alert without the need for complex statistical thresholds.",
              "Use a topic modeling algorithm (e.g., Latent Dirichlet Allocation) on a large corpus of benign system and administrative command-line arguments to define 'normal' topics of execution. For any child process spawned by AD FS/PTA, analyze its command line. If the model assigns its arguments to a rare or undefined topic, flag it as anomalous and potentially malicious."
            ]
          },
          {
            "description": "A process that is not a whitelisted system or debugging tool requests read access to the memory space of the AD FS (Microsoft.IdentityServer.Servicehost.exe) or PTA (AzureADConnectAuthenticationAgentService.exe) process.",
            "data_sources": [
              "Sysmon Event ID 10"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA)",
            "action": [
              "Configure and monitor Sysmon Event ID 10 for process access events. Create a rule to alert when 'TargetImage' is 'Microsoft.IdentityServer.Servicehost.exe' or 'AzureADConnectAuthenticationAgentService.exe', the 'GrantedAccess' code includes '0x1010' (PROCESS_VM_READ and PROCESS_QUERY_INFORMATION), and the 'SourceImage' is not on a strict whitelist of approved system/monitoring tools (e.g., 'lsass.exe').",
              "Profile all processes that legitimately access the memory of AD FS/PTA services over a 30-day period. Alert when a process that has never been observed before, or one whose access frequency is in the bottom 1st percentile, performs a memory read operation. This indicates a highly irregular and suspicious event.",
              "Train a one-class classification model (e.g., Isolation Forest) using features from legitimate process access events (SourceImage path, TargetImage path, user context, time of day). Deploy the model to score all new access events and alert on any event flagged as a significant outlier, indicating it does not fit the pattern of normal system operation and may be an attempt to dump credentials from memory."
            ]
          },
          {
            "description": "A temporal correlation is observed between a burst of successful authentications for multiple users on an AD FS/PTA server and a subsequent large outbound network connection from the same server, suggesting credential harvesting and exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "AD FS Event ID 501",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "AD FS Servers, Azure AD Connect Servers (PTA), Network Egress Points, SIEM Platform",
            "action": [
              "Create a SIEM correlation rule that triggers if an outbound connection from an AD FS/PTA server (from Zeek conn.log) with a payload size ('orig_bytes') greater than 5MB occurs within 5 minutes of a cluster of successful authentication events (e.g., >20 successful logins from AD FS Event ID 501) on the same server.",
              "In 5-minute windows, calculate two metrics: the count of unique users successfully authenticating, and the total volume of outbound data from the authenticating server. Calculate the Pearson correlation coefficient between these two time series over a 30-day baseline. Alert if the correlation in a given window spikes to a highly positive value (e.g., > 0.8), suggesting that as more users authenticate, more data is being sent out.",
              "Use a Granger causality test to statistically determine if the time series for successful authentications is a useful predictor of the time series for outbound data volume. If the test shows that authentication volume 'Granger-causes' outbound data volume with statistical significance (e.g., p-value < 0.05), where it did not historically, this implies a new, suspicious causal link between the events, warranting investigation for credential harvesting."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]