[
  {
    "information_requirement": "Has the adversary attempted to gain credential access using LLMNR/NBT-NS poisoning and SMB relay?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1557.001",
        "name": "LLMNR-NBT-NS Poisoning and SMB Relay",
        "evidence": [
          {
            "description": "A process, commonly python.exe or powershell.exe, is created with command-line arguments containing keywords and patterns characteristic of known LLMNR/NBT-NS poisoning tools like Responder (Responder.py) or Inveigh (Invoke-Inveigh.ps1).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, member servers, IT administrator jump boxes, and any endpoint on a local network segment where LLMNR/NBT-NS traffic is present.",
            "action": [
              "Search process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for command-line arguments containing regular expressions that match known poisoning tools and their options, such as `/(Responder\\.py|Invoke-Inveigh|ntlmrelayx\\.py)/` and `/(-I\\s+\\w+|-w|--lm|--disable-ess)/`.",
              "For all process creation events, calculate the command-line argument length and Shannon entropy. Establish a baseline for each parent process (e.g., powershell.exe). Alert when a new command's length or entropy exceeds a high percentile (e.g., 95th) of the historical distribution for that parent process, indicating potentially obfuscated or complex commands.",
              "Deploy a pre-trained classification model (e.g., Random Forest, Gradient Boosting) that uses features derived from command-line arguments (length, entropy, special character count, presence of IP addresses, keyword matches) to assign a 'maliciousness' score to each process creation event. Flag events with a score above a defined confidence threshold for analyst review."
            ]
          },
          {
            "description": "A single, non-authoritative name server IP address sends a high volume of UDP responses on port 5355 (LLMNR) or 137 (NBT-NS) to many unique destination IP addresses within a short time window (e.g., under 5 minutes), often in response to broadcast requests.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic sensor locations monitoring internal network segments (VLANs), core network switches, and network choke points between user and server subnets.",
            "action": [
              "Create a watchlist of authorized LLMNR/NBT-NS responders (if any exist) and DNS servers. Alert on any UDP traffic on ports 5355 or 137 originating from an IP address not on this watchlist. In environments where these protocols are disabled, any observed traffic on these ports should generate a high-severity alert. Correlate alerts with Zeek's `LLMNR_NBT-NS_Spoofing` notice.",
              "Group Zeek conn.log events by source IP over a 5-minute window for traffic on UDP ports 5355/137. For each source IP, calculate the count of unique destination IPs. Identify any source IP where this count exceeds the 99th percentile of the distribution for all sources in that time window, indicating one-to-many response behavior.",
              "For each host, model the time series of its LLMNR/NBT-NS response volume (packets per minute) using an algorithm like Seasonal-ARIMA or Prophet. An alert is generated when the observed traffic for a host significantly deviates from its forecasted volume, indicating a sudden, uncharacteristic spike in name resolution response activity."
            ]
          },
          {
            "description": "A high rate of failed NTLM network logons (Logon Type 3, Status Code 0xC000006A - wrong password) originates from a single source IP address, targeting multiple distinct user accounts and destination hosts. This activity is temporally correlated with preceding LLMNR/NBT-NS traffic from the same source IP.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek ntlm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Security event logs on Domain Controllers, member servers, and high-value workstations; network authentication logs captured by Zeek sensors.",
            "action": [
              "Query for Windows Event ID 4625 with Logon Type 3 and a status code indicating a bad password (e.g., 0xC000006A). Correlate the `IpAddress` field with source IPs flagged for suspicious LLMNR/NBT-NS activity in the last 15 minutes. Alert if a single source IP generates failed logons for >5 unique user accounts across >5 unique destination hosts within a 10-minute window.",
              "For each source IP address in authentication logs, calculate the ratio of failed logons (Event ID 4625) to total logons (4625 + 4624) within a 5-minute window. Flag any source IP where the failure rate exceeds 90% and the total number of attempts is greater than 20, indicating a potential spray or relay attack.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN) to authentication events, using features such as source IP, destination host, username, and time. Identify and alert on dense clusters of failed authentications (Event ID 4625, Logon Type 3) that originate from a single source IP but target many unique user/host combinations, which is characteristic of credential relay/spray activity."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary actively collecting data or credentials following a successful LLMNR/NBT-NS poisoning and SMB relay attack?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1557.001",
        "name": "LLMNR-NBT-NS Poisoning and SMB Relay",
        "evidence": [
          {
            "description": "A process is created whose file hash matches a known signature for tools like Responder, Inveigh, or ntlmrelayx.py.",
            "data_sources": [
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints where process creation is monitored, particularly user workstations, jump servers, and IT administrator workstations.",
            "action": [
              "Continuously match process hashes from process creation logs (Sysmon Event ID 1 with hash logging enabled) against a threat intelligence feed of known malicious file hashes for tools like Responder and Inveigh. Generate a high-severity alert upon any match.",
              "Calculate the prevalence (count of unique hosts) of every executable hash observed in the environment. Alert on the execution of any file whose hash has a very low prevalence (e.g., seen on < 3 hosts) and is associated with a suspicious parent process (`powershell.exe`, `python.exe`) or network connections on ports 137, 5355, 445.",
              "Implement a static file analysis pipeline. For each newly observed executable file hash, use a trained classifier (e.g., XGBoost) on features extracted from the PE file (e.g., sections, imports, string entropy) to predict its likelihood of being malicious. This can proactively identify unknown or packed variants of relaying tools."
            ]
          },
          {
            "description": "A new Windows service is created (Event ID 7045) with a service name, description, or binary path containing keywords like 'responder', 'inveigh', 'relay', or pointing to a non-standard file location like a user's temporary directory.",
            "data_sources": [
              "Windows Event ID 7045",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System event logs on all Windows endpoints, especially Domain Controllers, member servers, and other high-value assets targeted for persistence.",
            "action": [
              "Monitor Windows Event ID 7045 ('A service was installed') and Sysmon Event ID 13 ('RegistryKey created' on service keys). Create alerts based on regular expression matches for keywords like `responder`, `inveigh`, `spoofer`, `relay` in the 'Service Name' or 'Service File Name' fields. Also alert if the 'Service File Name' path points to a non-standard location (e.g., `C:\\Users\\`, `C:\\Temp\\`, `C:\\Perflogs\\`).",
              "Maintain a baseline of common service installation attributes (binary paths, service accounts, parent processes that install services). For each new service installation (Event ID 7045), calculate an anomaly score based on the rarity of its attributes. A service installed from a user's Temp folder, by a non-standard installer process, and configured to run as a standard user would receive a high score.",
              "Train a classification model (e.g., Logistic Regression) to predict if a new service is malicious. Features should include: the service binary path (is it in System32?), whether the binary is signed, the entropy of the service name and description, and the account under which the service will run. Flag services classified as 'suspicious' for review."
            ]
          },
          {
            "description": "A successful NTLM network logon (Event ID 4624, Logon Type 3) is observed where the user authenticates from a source workstation that is anomalous for that user, and this event is temporally linked to preceding LLMNR/NBT-NS poisoning activity.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ntlm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Security event logs on destination servers (Domain Controllers, file servers, application servers); network traffic logs from sensors monitoring traffic to these high-value assets.",
            "action": [
              "Create an alert for any successful network logon (Windows Event ID 4624, Logon Type 3) where the source IP address was flagged for suspicious LLMNR/NBT-NS poisoning or relay activity in the preceding 30 minutes. Add a condition to check that the source IP does not belong to a known management or application server.",
              "Maintain a stateful table of historical (user, source hostname) logon pairs over the last 90 days. For each new successful network logon (Event ID 4624, Logon Type 3), check if the (user, source hostname) pair is new or has not been seen in over 30 days. Flag these 'rare' logons, assigning a higher risk score if the user's primary workstation is known to be a different machine and is concurrently active.",
              "Use a clustering algorithm (e.g., K-Means or a graph-based community detection algorithm) to group users based on their typical logon behavior (source hosts, destination servers, protocols, time of day). A successful logon is flagged as anomalous if its features place it far from the centroid of the user's assigned cluster, suggesting a deviation from their normal role-based activity."
            ]
          },
          {
            "description": "Following a successful network logon from a source IP flagged as anomalous or involved in a relay attack, that same IP initiates an SMB session (TCP port 445) characterized by an unusually high volume of file access operations (e.g., reading multiple files) or a large data transfer from a network share.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek files.log",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting sensitive intellectual property or PII, Domain Controller SYSVOL/NETLOGON shares, Software distribution points.",
            "action": [
              "After a successful logon from a suspicious source IP is detected, monitor file access logs (Windows Event ID 5145, Zeek smb_files.log) for subsequent activity from that IP. Alert if the session accesses an unusually high number of distinct directories (>100 in 5 minutes) or accesses files/shares with sensitive keywords like `password`, `config`, `secret`, `backup`, or known credential dump locations (`lsass.dmp`).",
              "For each user, establish a baseline of their typical SMB session activity, including average files accessed per session and average bytes transferred per session. Following a logon flagged as suspicious, if the subsequent SMB session from that source IP exceeds the user's historical baseline by a significant margin (e.g., >3 standard deviations or 99th percentile), generate an alert for potential data collection.",
              "For each active user session on a file share, model the rate of file access events over time using a time-series anomaly detection algorithm (e.g., Holt-Winters). A sudden, sharp spike in the rate of file operations that deviates from the user's learned historical pattern indicates automated enumeration or bulk file collection and should be flagged."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]