[
  {
    "information_requirement": "Has the adversary attempted to acquire credentials from web browsers on enterprise hosts?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1555.003",
        "name": "Credentials from Web Browsers",
        "evidence": [
          {
            "description": "A process creation event on an endpoint has a file hash matching a known credential theft tool, or an endpoint establishes a network connection with a destination IP or domain known to be malicious C2 infrastructure.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, servers with interactive logins, and network egress points.",
            "action": [
              "Symbolic: Create a SIEM rule to monitor Windows Event ID 4688 for new processes. Calculate the executable's file hash and join against a threat intelligence feed of known credential theft tool hashes (e.g., LaZagne, Mimikatz, WebBrowserPassView). Simultaneously, monitor Zeek conn.log and dns.log for outbound connections and join destination IPs/domains against a C2 threat intelligence feed. Generate a high-priority alert on any match.",
              "Statistical: Analyze Zeek dns.log data to identify connections to domains with a low prevalence score across the enterprise. Correlate these connections by source host and time with preceding process creation events (Windows Event ID 4688). A connection to a domain queried by fewer than the 1st percentile of endpoints, occurring within 5 minutes of an unusual process launch on the same host, should be flagged for investigation.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA or Prophet) on the volume and frequency of outbound network connections per host using Zeek conn.log. A significant deviation from the predicted traffic pattern, such as a spike in connection count or data volume that exceeds the 99th percentile of forecast error and follows a suspicious process creation event (Windows Event ID 4688), indicates potential C2 communication and should generate an alert."
            ]
          },
          {
            "description": "A command line execution (Event ID 4688) or PowerShell script block (Event ID 4104) contains strings, functions, or file paths indicative of accessing or decrypting browser credentials.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers where PowerShell v5+ Script Block Logging is enabled.",
            "action": [
              "Symbolic: Implement a SIEM detection rule that searches Windows Event ID 4688 command lines and Event ID 4104 script blocks for regular expressions matching credential theft patterns. Include file paths like '*\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data*', commands like 'sqlite3.exe' targeting browser databases, and API calls like 'CryptUnprotectData'.",
              "Statistical: For all command line arguments (Event ID 4688) and PowerShell script blocks (Event ID 4104), calculate the Shannon entropy score. Establish a baseline entropy distribution for common administrative commands and scripts. An execution event with an entropy score exceeding the 98th percentile of the baseline, particularly for commands spawned by non-interactive shells, indicates potential obfuscation and should be flagged for review.",
              "Machine Learning: Develop a classification model (e.g., Gradient Boosting or a simple neural network) trained on a labeled dataset of benign and malicious PowerShell script blocks (Event ID 4104). Engineer features such as script block length, presence of specific keywords ('Unprotect', 'logins.json', 'SELECT...FROM logins'), character frequency distribution, API call frequency, and the entropy score. Deploy the model to classify new script blocks in real-time and alert on those classified as malicious with a high confidence score."
            ]
          },
          {
            "description": "A process not on an approved browser whitelist (e.g., 'chrome.exe', 'firefox.exe', 'msedge.exe') generates a file read audit event (Event ID 4663) for a browser credential database file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems on all user workstations and servers. This requires enabling SACLs on user profile directories containing browser data (e.g., '*\\AppData\\Local\\Google\\Chrome\\User Data\\*').",
            "action": [
              "Symbolic: First, deploy System Access Control Lists (SACLs) on browser credential store files (e.g., '*\\Login Data', '*\\logins.json', '*\\key4.db') to generate Windows Event ID 4663 for read access ('%%4416'). Create a SIEM rule that alerts whenever the Process Name in an Event ID 4663 log for these files does not match a pre-defined whitelist of legitimate browsers and system processes.",
              "Statistical: For all processes that access browser credential files (identified via Event ID 4663), create a frequency table of the process names over a 30-day rolling window. Calculate the rarity of each process access event. An access by a process that falls below the 5th percentile of frequency (e.g., 'powershell.exe', 'cscript.exe' accessing the file for the first time in a month) should generate a medium-priority alert.",
              "Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) on features extracted from Event ID 4663 and correlated parent process data (from Event ID 4688). Features should include the process name, parent process name, time of day, and user account context. The model will learn normal access patterns (e.g., 'chrome.exe' run by a user during work hours) and flag any combination of features that it identifies as a significant anomaly."
            ]
          },
          {
            "description": "A file copy operation is detected where the source is a browser credential store file and the destination is a temporary or staging directory, often followed by a read access event on the new file copy.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Temporary file locations (e.g., C:\\Windows\\Temp, C:\\Users\\Public, %APPDATA%\\Temp) and user profile directories on all Windows endpoints.",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process creation event (Event ID 4688) shows a command line indicating a file copy (e.g., 'copy', 'xcopy', 'Copy-Item', 'move') where the source argument matches a browser credential file path (e.g., '*\\User Data\\*\\Login Data') and the destination is a known staging directory. This is a high-confidence indicator of lock file evasion.",
              "Statistical: Profile file creation activity in common staging directories (e.g., C:\\Windows\\Temp) by analyzing file extensions and names. A file creation event where the file name or extension is unusual for the directory (e.g., 'Login Data', '.db', '.json', '.sqlite') and the file size is consistent with a browser credential store (typically < 10MB) should be flagged. This can be identified by flagging files with extensions falling outside the 95th percentile of normal extension frequency for that directory.",
              "Machine Learning: Develop a sequence analysis model (e.g., a Hidden Markov Model) to detect the specific chain of events: 1) A process (Process A) executes a copy command on a browser credential file (Event ID 4688). 2) A new file is created in a staging area. 3) Process A (or a child process) reads the newly created file (Event ID 4663). The model can learn the probabilities of this malicious sequence and alert when the full chain is observed with a high probability."
            ]
          },
          {
            "description": "A file read access event on a browser credential store by a non-browser process is followed within a short time window by an outbound network connection from the same host to an unusual or suspicious destination.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, firewalls, and host-level event logs on all endpoints where SACL auditing for browser credential files is enabled.",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when: (1) an Event ID 4663 is logged for read access to a browser credential file by a non-browser process, and (2) within 5 minutes, a Zeek conn.log entry shows the same source host initiating a connection to a destination IP/domain present on a threat intelligence feed of known malicious infrastructure.",
              "Statistical: For each event where a non-browser process reads a credential file (Event ID 4663), analyze the subsequent DNS queries from that host in Zeek dns.log. Calculate the enterprise-wide prevalence of the queried domains over the last 30 days. If the destination domain has been visited by less than 0.5% of all endpoints (i.e., it is in the bottom 0.5 percentile of domain popularity), flag the connection as suspicious exfiltration.",
              "Machine Learning: Implement a per-host time-series anomaly detection model on the bytes sent ('orig_bytes') from Zeek conn.log. When a credential access event (Event ID 4663 by a non-whitelisted process) is detected, begin monitoring this time-series for the specific host. If an anomalous spike in outbound data volume is detected that exceeds a dynamically calculated threshold (e.g., 3 standard deviations above the 24-hour rolling average) within 10 minutes of the access event, generate a high-priority alert for potential data exfiltration."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]