[
  {
    "information_requirement": "Is the adversary maintaining persistence via modified network device authentication? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "A file transfer event (e.g., TFTP, SCP, FTP) to or from a network device where the file's hash matches a known malicious signature or the transfer originates from an IP address not on the authorized administrator or vendor whitelist.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log",
              "Zeek tftp.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network management subnet, data center core switches, internet-facing routers and firewalls",
            "action": [
              "Symbolic: Create a SIEM rule that triggers when a file is transferred (via TFTP, FTP, SCP) to a network device (identified by an asset list) and the file hash recorded in `Zeek files.log` matches a known malicious hash from a threat intelligence feed of compromised firmware images.",
              "Statistical: For all file transfers to network devices, calculate the entropy of the transferred file. Establish a baseline entropy score for legitimate firmware and configuration files. Alert on files with entropy scores that deviate significantly (e.g., > 3 standard deviations) from the baseline, as this can indicate packed or encrypted malicious code.",
              "Machine Learning: Develop a time-series model (e.g., ARIMA) for the volume and frequency of file transfers to each class of network device (e.g., routers, switches). Alert on anomalous spikes in transfer activity that are not correlated with scheduled maintenance windows, which may detect unscheduled or bulk firmware modification attempts."
            ]
          },
          {
            "description": "A network device initiates an outbound connection on an authentication protocol port (e.g., TCP/49, UDP/1812, UDP/1813) to an IP address not on the pre-approved list of authentication servers (RADIUS, TACACS+).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek radius.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (RADIUS, TACACS+), network device management interfaces, domain controllers",
            "action": [
              "Symbolic: Create a SIEM rule that maintains a watchlist of approved RADIUS/TACACS+ server IPs. Alert when `Zeek conn.log` shows a connection from a network device IP to an external IP on port 49/TCP, 1812/UDP, or 1813/UDP, where the destination IP is not on the watchlist.",
              "Statistical: For each network device, profile the destination IPs for authentication traffic over a 30-day period. Use frequency analysis to identify the least frequent destinations. Alert when a connection is made to a destination in the bottom 5th percentile of frequency, indicating a rare and potentially unauthorized server.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on connection metadata from `Zeek conn.log` (destination IP, port, protocol, bytes transferred) for traffic originating from network devices. Treat connections classified as noise or belonging to a new, small cluster as anomalous and flag for investigation as potential redirection to an adversary-controlled server."
            ]
          },
          {
            "description": "A configuration or firmware management session (e.g., TFTP, SCP, HTTPS login) occurs at a time outside of a defined maintenance window or is initiated by a source IP not associated with an authorized administrator.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ftp.log",
              "Zeek tftp.log",
              "Zeek ssh.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network management jump boxes, network device management interfaces, configuration management servers",
            "action": [
              "Symbolic: Define maintenance windows (e.g., Saturday 1 AM - 5 AM) and a watchlist of authorized administrator source IPs in the SIEM. Create a rule to alert on any TFTP/FTP/SCP connection to a network device that occurs outside the window or originates from an IP not on the watchlist.",
              "Statistical: For each administrator account, model their login time-of-day and day-of-week patterns for accessing network devices. Calculate a z-score for each new login time. Alert on logins with a high z-score (e.g., > 3), indicating a significant deviation from normal working hours.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) model on features of legitimate administrative sessions (source IP, protocol, time of day, day of week, duration). Use the trained model to classify new sessions in real-time. Sessions classified as outliers are flagged as potentially unauthorized configuration changes."
            ]
          },
          {
            "description": "A pattern of successful logins to a network device administrative interface is characterized by one or more anomalous features, such as a source IP from a rare geolocation, a login time far outside the user's normal baseline, or use of a protocol (e.g., Telnet) when policy requires SSH.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, network management jump boxes, perimeter firewalls",
            "action": [
              "Symbolic: Create a rule that enriches the source IP of every successful network device login (`Zeek ssh.log`, `Zeek telnet.log`) with geolocation data. Alert if the source country is not on an approved list of countries where administrators operate.",
              "Statistical: For each administrator account, maintain a historical baseline of source IP subnets/ASNs. For each new successful login, calculate the historical frequency of the source ASN. Alert on successful logins from ASNs in the bottom 1st percentile of frequency for that user, indicating a rare and suspicious origin.",
              "Machine Learning: Use an autoencoder to model normal administrative session behavior based on features like source IP, protocol, time of day, and session duration. A high reconstruction error for a new session indicates a significant deviation from the learned norm and suggests a potentially compromised account or backdoor access."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses through network device authentication modifications? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "A successful TCP connection on an administrative port (e.g., 22, 23, 443) of a network device, where the source IP is present on a high-confidence threat intelligence list of malicious IPs, indicating a failure of perimeter blocking.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, internet gateway, network device management interfaces",
            "action": [
              "Symbolic: Create a high-severity alert in the SIEM that triggers when `Zeek conn.log` shows a successful connection to a network device's management port from a source IP that is present on a CTI feed of malicious infrastructure and is not on an explicit allow-list.",
              "Statistical: Continuously monitor and count successful connections from CTI-flagged IPs that are not blocked. Alert if the rate of successful connections from known-bad IPs to management interfaces exceeds a statistical threshold (e.g., the 99th percentile of the daily count), suggesting a systematic failure or misconfiguration of blocking controls.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) to predict the likelihood of a connection being malicious based on features (source IP reputation, ASN, port, time of day). If the model predicts a high probability of maliciousness for a connection that was not blocked by perimeter controls, flag it as a potential defense evasion."
            ]
          },
          {
            "description": "An SSH session to a network device is established using a client software string (from `Zeek ssh.log`) that is either associated with a known attack tool or is statistically rare compared to the baseline of approved administrative clients.",
            "data_sources": [
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network management subnet, jump boxes, core network devices",
            "action": [
              "Symbolic: Maintain a watchlist of SSH client strings associated with known offensive tools (e.g., 'Metasploit', specific 'paramiko' versions). Create a SIEM rule to alert whenever `Zeek ssh.log` records a successful authentication to a network device using a client string from this watchlist.",
              "Statistical: Profile all SSH client strings seen connecting to network devices over a 30-day baseline period and calculate their frequency. Alert on any successful connection using a client string that has never been seen before or falls below a low frequency threshold (e.g., seen less than 5 times).",
              "Machine Learning: Vectorize SSH client strings using TF-IDF and apply a clustering algorithm. Identify the main cluster of 'standard' clients. Any new connection whose client string falls far from the main cluster centroid can be flagged as anomalous, potentially indicating a custom or malicious client."
            ]
          },
          {
            "description": "A successful administrative session to a network device originates from a network segment or IP address that is not the designated bastion host or management subnet, violating established network access control policy.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, bastion hosts, internal network segments",
            "action": [
              "Symbolic: Define a SIEM asset list for the authorized bastion host and management subnet IPs. Create a rule that alerts on any successful connection to a network device's management interface where the source IP is not in the authorized list.",
              "Statistical: For each network device, baseline the distribution of source subnets for administrative traffic. Alert if a successful connection originates from a subnet that is statistically rare (e.g., in the bottom 5th percentile of historical connection counts by subnet), suggesting an unusual and unauthorized access path.",
              "Machine Learning: Model the network path for administrative sessions using traceroute data or router flow records. Train a sequence model (like an LSTM) on legitimate paths. If a new administrative session is established via a path that the model flags as anomalous, it may indicate routing manipulation or a compromised device being used as an illicit pivot point."
            ]
          },
          {
            "description": "Within a short time window (e.g., 5 minutes) following a successful administrative login, the network device itself initiates outbound connections to an external IP on a non-standard port or with a high data volume, inconsistent with normal device operation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device interfaces (all), internet gateway, internal scanning targets",
            "action": [
              "Symbolic: Create a SIEM correlation rule that triggers if a successful admin login to device X is followed within 5 minutes by an outbound connection from device X to an external IP on a non-standard C2 port (e.g., 4444/TCP, 53/UDP for tunneling).",
              "Statistical: For each network device, baseline the volume (bytes_out) and diversity (unique destination ports) of its outbound traffic. After a successful admin login, alert if the outbound byte count in the following hour exceeds the 99th percentile of the hourly baseline.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., LSTM autoencoder) for each network device's outbound connection patterns. If the model detects a significant anomaly in outbound traffic immediately following a login event, flag it as suspicious post-compromise activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary accessing credentials or bypassing authentication on network devices? (PIR)",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "A network connection to a network device's administrative interface contains a payload or traffic pattern that matches a known signature for an authentication bypass vulnerability (e.g., CVE-2023-20198).",
            "data_sources": [
              "Zeek conn.log",
              "IDS/IPS alert logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, network device management interfaces, IDS/IPS sensors",
            "action": [
              "Symbolic: Deploy IDS signatures (e.g., from Snort/Suricata) for known network device authentication bypass vulnerabilities. Create a SIEM rule to generate a high-severity alert whenever an IDS alert for one of these signatures fires against a network device asset.",
              "Statistical: Monitor the rate of IDS alerts related to network device exploits. Establish a baseline alert rate. A sudden spike in these alerts against a specific device or subnet (e.g., > 3 standard deviations above the hourly mean) can indicate a targeted scanning or exploitation campaign.",
              "Machine Learning: Train a supervised classification model (e.g., Gradient Boosting Machine) on labeled PCAP data of auth bypass exploits. Deploy the model to analyze traffic to management interfaces in near real-time to detect zero-day or polymorphic exploit variants."
            ]
          },
          {
            "description": "A successful authentication event on a network device where the username is part of a list of default, hardcoded, or known-compromised credentials.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, authentication servers (RADIUS/TACACS+), configuration backups",
            "action": [
              "Symbolic: Maintain a SIEM watchlist of forbidden usernames (e.g., 'cisco', 'admin', 'root', and any credentials from past breaches). Create a rule to alert on any successful authentication to a network device where the username is on this list.",
              "Statistical: For each network device, profile the set of usernames that successfully authenticate. Alert when a username that has never been seen before on that device successfully authenticates, especially if from an external or untrusted source IP.",
              "Machine Learning: Use a community detection algorithm on a graph of users and devices. A successful login that bridges two otherwise disconnected communities (e.g., a user from the 'developer' community logging into a 'core router') is highly anomalous and could indicate credential misuse."
            ]
          },
          {
            "description": "A stateful analysis of logs shows a sequence of one or more failed authentication attempts from a source IP, followed by a long-lived, interactive TCP session to the same device from the same source IP, but without an intervening successful authentication log event.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, log aggregation server/SIEM",
            "action": [
              "Symbolic: Create a SIEM correlation rule that looks for a sequence from a single source IP: (1) `Zeek ssh.log` event with `auth_success=false`, followed by (2) `Zeek conn.log` event with `duration > 60s`, WITHOUT an intermediate (3) `Zeek ssh.log` event with `auth_success=true` within a 2-minute window.",
              "Statistical: For each source-destination pair, calculate the ratio of successful authentications to total established TCP sessions on admin ports. The baseline should be near 1.0. Alert if this ratio for any source IP drops significantly (e.g., < 0.5 over 1 hour), indicating sessions are established without successful authentication.",
              "Machine Learning: Train a sequence-to-sequence (Seq2Seq) model on normal login event sequences. Feed real-time event sequences into the model. If the model encounters a sequence like (auth_fail, conn_start with long duration) and assigns it a very low probability, it indicates a deviation from learned legitimate patterns, suggesting a bypass."
            ]
          },
          {
            "description": "A successful authentication from an unknown or rare source IP occurs with zero preceding failed attempts, which is uncharacteristic for a first-time human login but typical for a hardcoded backdoor password.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, VPN concentrators",
            "action": [
              "Symbolic: Create a SIEM rule to alert on any successful authentication from a source IP that has never been seen before, where there are zero preceding failed authentication attempts from that same IP in the last 24 hours.",
              "Statistical: For each user, establish a baseline distribution of the number of failed attempts preceding a successful login. Alert when a successful login occurs with a number of preceding failures that is a statistical outlier for that specific user (e.g., a user who always fumbles their password once suddenly has a 'first-try' success from a new location).",
              "Machine Learning: Use a Bayesian inference model to calculate the probability of a login being legitimate given the evidence: `P(Legit | Source_Is_New, Num_Fails=0)`. If this probability falls below a certain threshold based on prior data of legitimate and malicious logins, flag the event."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]