[
  {
    "information_requirement": "Is the adversary maintaining persistence via modified network device authentication? (PIR)",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "A file transfer event (e.g., TFTP, SCP, FTP) to a network device where the transferred file's hash matches a known malicious signature, the file's characteristics are anomalous, or the transfer originates from an IP address not on the authorized administrator or vendor whitelist.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log",
              "Zeek tftp.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network management subnet, data center core switches, internet-facing routers and firewalls, configuration management servers",
            "action": [
              "Implement a SIEM detection rule to continuously compare the `sha1` hash from `Zeek files.log` for transfers to network device IPs against a threat intelligence feed of malicious firmware hashes. Alert on any match.",
              "For each file transfer to a network device captured in `Zeek files.log`, calculate the Shannon entropy of the file content. Maintain a baseline distribution of entropy scores for legitimate firmware and configuration files. Alert when a new file's entropy score exceeds the 95th percentile of the baseline, indicating potential packing or encryption.",
              "Apply a time-series anomaly detection model (e.g., Seasonal-ARIMA) to the hourly count of file transfers to network devices, segmented by device type. Flag any volume spikes that do not correlate with documented maintenance windows as potentially unauthorized bulk modification attempts."
            ]
          },
          {
            "description": "A network device initiates an outbound connection on an authentication protocol port (e.g., TCP/49 for TACACS+, UDP/1812 for RADIUS) to an IP address that is not on the pre-approved list of central authentication servers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek radius.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (RADIUS, TACACS+), network device management interfaces, domain controllers",
            "action": [
              "Implement a SIEM rule using a watchlist of approved RADIUS/TACACS+ server IPs. Alert on any connection from a network device asset to an external IP on TCP/49, UDP/1812, or UDP/1813 where the destination IP is not on the watchlist, based on `Zeek conn.log`.",
              "On a daily basis, analyze `Zeek conn.log` to profile the frequency of all authentication server destinations for each network device over the last 30 days. Generate an alert for any connection to a destination IP that falls in the bottom 5th percentile of connection frequency, indicating a rare and potentially unauthorized server.",
              "Ingest connection metadata from `Zeek conn.log` (destination IP, port, protocol, total bytes) for traffic originating from network devices. Apply a density-based clustering algorithm (DBSCAN) to identify normal clusters of authentication traffic. Classify any connection that is marked as a noise point or forms a new, small cluster as anomalous and flag for investigation."
            ]
          },
          {
            "description": "A configuration or firmware management session (e.g., via TFTP, SCP, HTTPS) occurs at a time outside of a defined maintenance window or is initiated by a source IP not associated with an authorized administrator workstation or jump box.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ftp.log",
              "Zeek tftp.log",
              "Zeek ssh.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network management jump boxes, network device management interfaces, configuration management servers",
            "action": [
              "Define maintenance windows (e.g., Saturday 1 AM - 5 AM UTC) and a watchlist of authorized administrator source IPs in the SIEM. Create a rule to alert on any TFTP, FTP, or SCP connection to a network device that occurs outside the window or originates from an IP not on the watchlist.",
              "For each administrator account, model their login time-of-day and day-of-week patterns for accessing network devices. Calculate a z-score for each new login's timestamp against the user's historical distribution. Alert on logins with a high z-score (e.g., > 3), indicating a significant deviation from normal working hours.",
              "Train a one-class SVM (Support Vector Machine) model on features of legitimate administrative sessions (source IP, protocol, time of day, day of week, duration). Use the trained model to classify new sessions in real-time. Sessions classified as outliers are flagged as potentially unauthorized configuration changes."
            ]
          },
          {
            "description": "A pattern of successful logins to a network device administrative interface is characterized by one or more anomalous features, such as a source IP from a rare geolocation, a login time far outside the user's normal baseline, or use of a legacy protocol (e.g., Telnet) when policy requires SSH.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, network management jump boxes, perimeter firewalls",
            "action": [
              "Create a SIEM rule that enriches the source IP of every successful network device login (`Zeek ssh.log`, `Zeek telnet.log`) with geolocation data. Alert if the source country is not on an approved list of countries where administrators operate.",
              "For each administrator account, maintain a historical baseline of source IP subnets and Autonomous System Numbers (ASNs). For each new successful login, calculate the historical frequency of the source ASN. Alert on successful logins from ASNs in the bottom 1st percentile of frequency for that user, indicating a rare and suspicious origin.",
              "Use an autoencoder neural network to model normal administrative session behavior based on features like source IP, protocol, time of day, and session duration. A high reconstruction error for a new session indicates a significant deviation from the learned norm and suggests a potentially compromised account or backdoor access."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses through network device authentication modifications? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "A successful TCP connection is established on an administrative port (e.g., 22, 23, 443) of a network device, where the source IP is present on a high-confidence threat intelligence list of malicious IPs, indicating a failure of perimeter blocking controls.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, internet gateway, network device management interfaces",
            "action": [
              "Implement a high-severity SIEM alert that triggers when `Zeek conn.log` shows a successful connection to a network device's management port from a source IP that is present on a CTI feed of malicious infrastructure and is not on an explicit allow-list.",
              "Continuously monitor and count successful connections from CTI-flagged IPs that are not blocked by firewall rules. Alert if the rate of successful connections from known-bad IPs to management interfaces exceeds a statistical threshold (e.g., the 99th percentile of the daily count over the last 90 days), suggesting a systematic failure of blocking controls.",
              "Train a classification model (e.g., Logistic Regression) to predict the likelihood of a connection being malicious based on features (source IP reputation, ASN, port, time of day). If the model predicts a high probability of maliciousness for a connection that was not blocked by perimeter controls, flag it as a potential defense evasion."
            ]
          },
          {
            "description": "An SSH session to a network device is established using a client software string that is either associated with a known attack tool or is statistically rare compared to the baseline of approved administrative clients.",
            "data_sources": [
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network management subnet, jump boxes, core network devices",
            "action": [
              "Implement a SIEM rule that compares the `client` field in `Zeek ssh.log` against a watchlist of client strings associated with offensive tools (e.g., 'Metasploit', 'Nmap NSE', specific 'paramiko' versions). Alert on any successful authentication to a network device using a watched client string.",
              "Periodically query `Zeek ssh.log` to calculate the frequency of all SSH client strings used to connect to network devices over the last 30 days. Alert on any successful connection using a client string that falls below a low frequency threshold (e.g., seen in less than 0.1% of sessions) or has never been seen before.",
              "Use a natural language processing technique to vectorize SSH client strings (e.g., character-level TF-IDF). Train a one-class SVM on the vectors of legitimate client strings. Classify any new client string that the model flags as an outlier as a potentially malicious or unauthorized client."
            ]
          },
          {
            "description": "A successful administrative session to a network device originates from a network segment or IP address that is not the designated bastion host or management subnet, in violation of established network access control policy.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, bastion hosts, internal network segments",
            "action": [
              "Define a SIEM asset list for the authorized bastion host and management subnet IPs. Create a rule that alerts on any successful connection to a network device's management interface where the source IP is not in the authorized list.",
              "For each network device, baseline the distribution of source subnets for administrative traffic. Alert if a successful connection originates from a subnet that is statistically rare (e.g., in the bottom 5th percentile of historical connection counts by subnet), suggesting an unusual and unauthorized access path.",
              "Model the network path for administrative sessions using traceroute data or router flow records. Train a sequence model (like an LSTM) on legitimate paths. If a new administrative session is established via a path that the model flags as anomalous, it may indicate routing manipulation or a compromised device being used as an illicit pivot point."
            ]
          },
          {
            "description": "Within a short time window (e.g., 5 minutes) following a successful administrative login, the network device itself initiates outbound connections to an external IP on a non-standard port or with a high data volume, inconsistent with normal device operation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssh.log",
              "Zeek telnet.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device interfaces (all), internet gateway, internal scanning targets",
            "action": [
              "Create a SIEM correlation rule that triggers if a successful admin login to network device X is followed within 5 minutes by an outbound connection from device X to an external IP on a non-standard C2 port (e.g., 4444/TCP, or DNS tunneling over 53/UDP).",
              "For each network device, baseline the volume (bytes_out) and diversity (unique destination ports) of its outbound traffic. After a successful admin login, alert if the outbound byte count in the following hour exceeds the 99th percentile of the hourly baseline.",
              "Develop a time-series anomaly detection model (e.g., LSTM autoencoder) for each network device's outbound connection patterns (e.g., bytes per second, new connections per minute). If the model detects a significant anomaly in outbound traffic immediately following a login event, flag it as suspicious post-compromise activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary accessing credentials or bypassing authentication on network devices? (PIR)",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1556.004",
        "name": "Network Device Authentication",
        "evidence": [
          {
            "description": "A network connection to a network device's administrative interface contains a payload or traffic pattern that matches a known signature for an authentication bypass vulnerability (e.g., Cisco IOS XE Web UI auth bypass CVE-2023-20198).",
            "data_sources": [
              "Zeek conn.log",
              "IDS/IPS alert logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, network device management interfaces, IDS/IPS sensors",
            "action": [
              "Deploy IDS signatures for known network device authentication bypass vulnerabilities. Create a SIEM rule to generate a high-severity alert whenever an IDS alert for one of these signatures fires against a network device asset.",
              "Monitor the rate of IDS alerts related to network device exploits. Establish a baseline alert rate. A sudden spike in these alerts against a specific device or subnet (e.g., > 3 standard deviations above the hourly mean) can indicate a targeted scanning or exploitation campaign.",
              "Train a supervised classification model (e.g., Gradient Boosting Machine) on labeled PCAP data of auth bypass exploits. Deploy the model to analyze traffic to management interfaces in near real-time to detect zero-day or polymorphic exploit variants."
            ]
          },
          {
            "description": "A successful authentication event on a network device where the username is part of a list of default, hardcoded, or known-compromised credentials.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, authentication servers (RADIUS/TACACS+), configuration backups",
            "action": [
              "Maintain a SIEM watchlist of forbidden usernames (e.g., 'cisco', 'admin', 'root', and any credentials from past breaches). Create a rule to alert on any successful authentication to a network device where the username is on this list.",
              "For each network device, profile the set of usernames that successfully authenticate. Alert when a username that has never been seen before on that device successfully authenticates, especially if from an external or untrusted source IP.",
              "Use a community detection algorithm on a graph of users and the devices they access. A successful login that bridges two otherwise disconnected communities (e.g., a user from the 'developer' community logging into a 'core router') is highly anomalous and could indicate credential misuse."
            ]
          },
          {
            "description": "A stateful log analysis shows a sequence of one or more failed authentication attempts from a source IP, followed by a long-lived, interactive TCP session to the same device from the same source IP, but without an intervening successful authentication log event.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, log aggregation server/SIEM",
            "action": [
              "Implement a stateful SIEM correlation rule that triggers for a single source IP to a single network device IP within a 2-minute window: Event A (`Zeek ssh.log` with `auth_success=false`) is NOT followed by Event B (`Zeek ssh.log` with `auth_success=true`), but IS followed by Event C (`Zeek conn.log` with `service='ssh'` and `duration > 60s`).",
              "For each source IP connecting to a network device's admin port, calculate a 'Success Ratio' as (count of `auth_success=true` events) / (count of `conn.log` sessions). Establish a baseline ratio for known admin workstations (should be ~1.0). Alert if the ratio for any source IP drops below a threshold (e.g., 0.5) over a 1-hour period.",
              "Model legitimate administrative sessions as sequences of events (e.g., `conn_start`, `auth_fail`, `auth_success`, `conn_end`). Train a sequence model, such as a Hidden Markov Model (HMM), on these event sequences. Flag any observed sequence that the model assigns a low probability as anomalous, indicating a potential authentication bypass."
            ]
          },
          {
            "description": "A successful authentication from an unknown or rare source IP occurs with zero preceding failed attempts, which is uncharacteristic for a first-time human login but typical for a hardcoded backdoor password.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek telnet.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, VPN concentrators",
            "action": [
              "Create a SIEM rule to alert on any successful authentication from a source IP that has never before been seen authenticating to a network device, where there are zero preceding failed authentication attempts from that same IP in the last 24 hours.",
              "For each user, establish a baseline distribution of the number of failed attempts preceding a successful login. Alert when a successful login occurs with a number of preceding failures that is a statistical outlier for that specific user (e.g., a user who always fumbles their password once suddenly has a 'first-try' success from a new location).",
              "Use a Bayesian inference model to calculate the probability of a login being legitimate given the evidence: `P(Legit | Source_Is_New, Num_Fails=0)`. If this probability falls below a certain threshold based on prior data of legitimate and malicious logins, flag the event for review."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]