[
  {
    "information_requirement": "Has the adversary attempted to gain credential access using LLMNR/NBT-NS poisoning and SMB relay?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1557.001",
        "name": "LLMNR-NBT-NS Poisoning and SMB Relay",
        "evidence": [
          {
            "description": "Process execution involving command-line arguments containing keywords and patterns characteristic of known LLMNR/NBT-NS poisoning tools like Responder or Inveigh.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Member Servers, IT Administrator jump boxes",
            "action": [
              "Symbolic: Query process creation logs (Windows Event ID 4688, Sysmon Event ID 1) for command lines containing keywords and regular expressions matching known poisoning tools, such as 'Responder.py', 'Invoke-Inveigh', 'ntlmrelayx.py', and arguments like '-I eth0', '-w', '--lm', or '--disable-ess'.",
              "Statistical: Calculate the entropy and length of command-line arguments for all processes. Establish a baseline for command-line complexity per parent process and user, and alert on significant deviations (e.g., > 3 standard deviations from the mean length or an entropy score in the top 5% for that process type), which can indicate obfuscated commands.",
              "Machine Learning: Use a trained classification model (e.g., logistic regression, random forest) on command-line features (length, special character count, presence of IP addresses/keywords, entropy) to predict the probability of a command being malicious. Continuously retrain the model with analyst-verified events to improve accuracy."
            ]
          },
          {
            "description": "A single source IP address sending a high volume of UDP responses on port 5355 (LLMNR) or 137 (NBT-NS) to many unique destination IPs within a short time window, where the source is not an authorized name resolution server.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments (VLANs), Core network switches, Network traffic sensors monitoring server subnets",
            "action": [
              "Symbolic: Filter network traffic logs (Zeek conn.log) for UDP packets on ports 5355 and 137. Create a high-severity alert if any traffic is observed on these ports in network segments where LLMNR/NBT-NS are disabled by organizational policy. Correlate with Zeek notice.log for 'LLMNR_NBT-NS_Spoofing' alerts.",
              "Statistical: For each source IP sending traffic on UDP 5355/137, calculate the ratio of unique destination IPs to total packets sent within a 5-minute window. Identify outliers where a single source IP communicates with an anomalously high number of unique destinations (e.g., exceeding the 99th percentile of the distribution of unique destinations per source).",
              "Machine Learning: Apply time-series analysis to the volume of LLMNR/NBT-NS traffic per source host. Use an anomaly detection model (e.g., ARIMA, Prophet) to flag sudden, uncharacteristic spikes in response traffic originating from a single host that deviates significantly from its own historical baseline or the baseline of its peer group."
            ]
          },
          {
            "description": "A high rate of failed NTLM network logons (Logon Type 3) originating from a single source IP against multiple distinct destination hosts and user accounts, immediately following suspected poisoning activity from the same source IP.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log",
              "Zeek ntlm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs on Domain Controllers, Security logs on critical servers (e.g., file servers, database servers), Remote access gateways",
            "action": [
              "Symbolic: Query for Windows Event ID 4625 (An account failed to log on) with Logon Type 3 (Network). Correlate the source IP with hosts flagged for suspicious LLMNR/NBT-NS activity. Alert if a single source generates failed logons for more than 5 unique user accounts on more than 5 unique destination hosts within a 10-minute window.",
              "Statistical: For each source IP, calculate the failure rate of NTLM authentication attempts (count of Event ID 4625 / (count of 4625 + count of 4624)) within a 1-minute window. Identify source IPs with a failure rate exceeding a dynamic threshold (e.g., 95%) and a total attempt count above a baseline (e.g., >20 attempts), indicating a likely relay or spray attack.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on authentication events, using features like source IP, destination IP, username, and time. Identify dense clusters of failed authentications originating from a single source IP targeting multiple destinations in a short period, which represents anomalous 'spraying' behavior characteristic of a relayed attack."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary actively collecting data or credentials following a successful LLMNR/NBT-NS poisoning and SMB relay attack?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1557.001",
        "name": "LLMNR-NBT-NS Poisoning and SMB Relay",
        "evidence": [
          {
            "description": "A process is created whose file hash matches a known signature for tools like Responder, Inveigh, or ntlmrelayx.py.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Jump Servers, IT administrator workstations",
            "action": [
              "Symbolic: Continuously match process hashes from process creation logs (Sysmon Event ID 1 with hash logging enabled) against a threat intelligence feed of known malicious file hashes for tools like Responder and Inveigh. Generate a high-severity alert upon any match.",
              "Statistical: Profile the prevalence of all executable file hashes across the environment. Flag any hash that is extremely rare (e.g., present on only one or two machines) but is associated with a suspicious process name (like python.exe or powershell.exe) and anomalous network activity. A low prevalence score combined with other suspicious attributes indicates a likely malicious tool.",
              "Machine Learning: Use a file-based classification model that inputs PE header information, string entropy, and other static features to classify executables as benign or malicious. Apply this model to newly observed executables to proactively identify unknown or packed versions of relaying tools before a hash signature is available."
            ]
          },
          {
            "description": "A new Windows service is created (Event ID 7045) with a service name, description, or binary path containing keywords like 'responder', 'inveigh', 'relay', or pointing to a non-standard file location like a user's temporary directory.",
            "data_sources": [
              "Windows Event ID 7045",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Systems targeted for persistent access",
            "action": [
              "Symbolic: Monitor Windows Event ID 7045 (A service was installed) and use regular expressions on the 'Service Name' and 'Service File Name' fields to detect keywords associated with attack tools (e.g., 'responder', 'inveigh', 'spoofer', 'relay'). Alert on any matches.",
              "Statistical: Establish a baseline of common service names, binary paths (e.g., System32), and account names (e.g., 'Local System') used for legitimate service installations. Calculate the rarity of these attributes for each new service. A service with a rare name, installed in a user profile directory, and running as a standard user would have a high anomaly score.",
              "Machine Learning: Train a model to classify new services as 'legitimate' or 'suspicious' based on features such as the service binary path, service account, service name entropy, and whether the service binary is signed. Flag services classified as 'suspicious' for immediate analyst review."
            ]
          },
          {
            "description": "A successful NTLM network logon (Event ID 4624, Logon Type 3) is observed where the user authenticates from a source workstation that is anomalous for that user, and this event is temporally linked to preceding LLMNR/NBT-NS poisoning activity.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ntlm.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Security logs on high-value servers (e.g., file servers, database servers, domain controllers), VPN concentrators, Network segments with critical assets",
            "action": [
              "Symbolic: For every successful network logon (Windows Event ID 4624, Logon Type 3), check if the source hostname has been flagged for suspicious LLMNR/NBT-NS activity within the last 30 minutes. Generate an alert if a user successfully logs into a resource from a host suspected of poisoning.",
              "Statistical: Maintain a historical baseline of (user, source hostname) logon pairs. For each new successful logon, calculate a rarity score for the pair. A logon from a host a user has never used before, or has not used in over 90 days, should be flagged as anomalous, especially if the user's primary workstation is also online.",
              "Machine Learning: Use peer group analysis or a clustering model (e.g., K-Means) to group users with similar roles and access patterns. If a user's successful logon (source host, destination server, time of day) falls outside their own cluster and into a different peer group's cluster, flag it as a potential credential relay."
            ]
          },
          {
            "description": "Following a suspicious successful logon, the source host initiates an SMB session involving an unusually high number of file or directory access operations, or transfer of a large volume of data from sensitive network shares.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek files.log",
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting sensitive intellectual property or PII, Domain Controller SYSVOL/NETLOGON shares, Software distribution points",
            "action": [
              "Symbolic: After a suspicious logon is detected from a source IP, monitor file access logs (Windows Event ID 5145, Zeek smb_files.log) from that IP. Alert if the session accesses files with sensitive keywords in their paths, such as 'password', 'config', 'secret', or known credential storage locations like 'lsass.dmp'.",
              "Statistical: For each SMB session, establish a baseline for the number of files accessed and total bytes transferred per user. After a suspicious logon, if the subsequent SMB session's file access count or data volume exceeds 3 standard deviations from the user's or peer group's typical session activity, flag it as anomalous collection behavior.",
              "Machine Learning: Employ a time-series anomaly detection model on the rate of file access events per user session. A sudden, sharp increase in file operations that deviates from the user's learned historical pattern can indicate automated enumeration or data exfiltration following a successful credential relay."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]