[
    {
        "information_requirement": "Is the adversary executing commands or payloads using Dynamic Data Exchange (DDE)?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1559.002",
                "name": "Dynamic Data Exchange",
                "evidence": [
                    {
                        "description": "Files transferred over the network containing specific DDE-related command strings (e.g., 'DDEAUTO', 'DDE', '=cmd|').",
                        "data_sources": [
                            "Zeek file.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Configure the file analysis framework (e.g., Zeek) to perform content inspection on transferred office documents (docx, xlsx, csv, rtf). Implement regular expression rules to search for known DDE syntax such as 'DDEAUTO', 'DDE', or formulas starting with a command interpreter like '=cmd|', '=powershell|', or '=mshta|'. Alert on any file containing these atomic indicators and log the source, destination, and file metadata for investigation."
                    },
                    {
                        "description": "An MS Office application (e.g., WINWORD.EXE, EXCEL.EXE) spawning a command-line interpreter child process (e.g., cmd.exe, powershell.exe) characteristic of DDE abuse.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events. Create a high-fidelity alert for the specific parent-child process pattern where ParentProcessName is in ('WINWORD.EXE', 'EXCEL.EXE', 'POWERPNT.EXE', 'OUTLOOK.EXE') and ProcessName is in ('cmd.exe', 'powershell.exe', 'mshta.exe', 'rundll32.exe', 'wscript.exe', 'cscript.exe'). Correlate these events with recent document access by the parent process and analyze command-line arguments for suspicious commands."
                    },
                    {
                        "description": "A sequence of events where a user receives a document, which upon opening, leads to an Office application spawning a process that initiates an outbound network connection.",
                        "data_sources": [
                            "Zeek file.log",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate data from multiple sources to detect the full attack chain. 1) Identify document downloads/transfers via Zeek file.log. 2) On the destination host, look for a subsequent process creation event (Windows Event ID 4688) where an Office app opens a file and spawns a child process. 3) Monitor for outbound network connections (Zeek conn.log) from that child process within a short time window (e.g., < 60 seconds). Use time series analysis and correlation logic to link these three events. A high correlation score indicates a strong behavioral signal of malicious DDE execution."
                    },
                    {
                        "description": "An MS Office application making an anomalous network connection or spawning a child process that deviates from an established baseline of normal activity for that user, host, or the organization.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal child processes and network destinations for MS Office applications across the enterprise. Monitor for deviations using Windows Event ID 4688 and Zeek conn.log. Use frequency analysis or entropy measures on child process names to identify Office applications spawning statistically rare processes. For network connections, geolocate destination IPs and use percentile analysis or Inter-Quartile Range (IQR) methods to identify connections to rare countries or autonomous systems. Flag any Office process behavior that falls outside of 2-3 standard deviations from its established normal profile."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
