[
  {
    "information_requirement": "Has the adversary gained initial access to the network via spearphishing voice? (PIR)",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1566.004",
        "name": "Spearphishing Voice",
        "evidence": [
          {
            "description": "An endpoint's network traffic shows a connection (DNS query, HTTP request, or TCP/IP connection) to a destination URL, domain, or IP address present on a threat intelligence feed specifically tracking vishing or social engineering campaigns.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, web proxies), DNS resolvers",
            "action": [
              "Symbolic: Continuously match outbound DNS queries (Zeek dns.log) and HTTP host headers (Zeek http.log) against a high-confidence threat intelligence list of indicators associated with vishing campaigns. Generate a high-severity alert on any match.",
              "Statistical: Calculate the organizational prevalence of all requested domains. Flag connections to domains requested by fewer than 0.1% of users or seen for the first time in the organization's history, and enrich with WHOIS data to check for registration dates less than 30 days old.",
              "Machine Learning: Use a classification model (e.g., Logistic Regression, Random Forest) trained on lexical features of domain names (e.g., length, entropy, number of hyphens, presence of brand names) to score domains for potential maliciousness, flagging those with high scores that are not on an established allow-list."
            ]
          },
          {
            "description": "A process for a remote access tool (e.g., AnyDesk, TeamViewer, GoToAssist, RustDesk) is created on an endpoint, where the parent process is not a standard software deployment or management tool (e.g., SCCM, Intune).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, Virtual Desktop Infrastructure (VDI) instances",
            "action": [
              "Symbolic: Create a detection rule to monitor for process creation events (Windows Event ID 4688) where the NewProcessName matches a list of known, unauthorized remote access tools and the CreatorProcessName is not in an allow-list of software management services (e.g., CcmExec.exe, IntuneManagementExtension.exe).",
              "Statistical: For each executable name, calculate its prevalence across the enterprise over a 30-day rolling window. Alert on executions of executables that are present on less than 0.5% of endpoints, indicating rare or non-standard software.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on process execution features (process name, command line, parent process, user context) to group similar execution events. Investigate small, anomalous clusters that contain remote access tool process names, as these may represent isolated, user-driven installations."
            ]
          },
          {
            "description": "A command-line interpreter (e.g., powershell.exe, cmd.exe, cscript.exe) is executed with command-line arguments containing obfuscation techniques (e.g., Base64), download strings, or direct commands to disable security controls.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, Servers with user RDP access",
            "action": [
              "Symbolic: Use regular expressions to scan command-line arguments (Windows Event ID 4688) and PowerShell script block logs (Event ID 4104) for patterns like 'IEX', 'DownloadString', '-enc', 'Set-MpPreference -Disable', or 'Net-NTLM'.",
              "Statistical: Calculate the entropy of command-line arguments for powershell.exe and cmd.exe. Flag commands with an entropy score in the top 99th percentile, as high entropy often indicates obfuscation or encoding. Establish a baseline for typical command lengths per user and flag significant deviations (>3 standard deviations).",
              "Machine Learning: Train a classification model on a labeled dataset of benign and malicious PowerShell commands. Use this model to score all new script block logs (Event ID 4104) in near-real-time, alerting on any command classified as malicious with high confidence."
            ]
          },
          {
            "description": "A single user endpoint exhibits a correlated sequence of events within a short time window (< 5 minutes): 1) a web request to a low-reputation or newly-observed domain, 2) a download of an executable or archive file, and 3) the execution of a new process from a user-writable directory (e.g., Downloads, AppData) matching the downloaded filename.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, Network egress points (e.g., firewalls, web proxies)",
            "action": [
              "Symbolic: Create a stateful correlation rule in the SIEM that triggers when, for the same source IP/hostname, a Zeek http.log event to a non-categorized or suspicious domain is followed by a Zeek files.log event for a MIME type of 'application/x-dosexec' or 'application/zip', which is then followed by a Windows Event ID 4688 event where the process name matches the downloaded file name.",
              "Statistical: Model the probability of a user downloading and immediately executing a file from the internet. Flag sequences where this probability is historically low for the user or their peer group. Use frequency analysis to identify rare parent-child process relationships (e.g., chrome.exe -> unzip.exe -> setup.exe) that deviate from the enterprise baseline.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model or Recurrent Neural Network) trained on event logs (web access, file downloads, process execution) to learn normal user behavior sequences. Alert when a sequence of events has a low probability of occurring under the learned 'normal' model."
            ]
          },
          {
            "description": "A user account generates multiple MFA failure or challenge events within a short time period (e.g., >5 events in 2 minutes) immediately followed by a successful authentication event from a potentially anomalous source IP address.",
            "data_sources": [
              "MFA provider logs (e.g., Azure AD, Duo, Okta)",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., Active Directory Domain Controllers), Cloud identity provider platforms (e.g., Azure AD), VPN concentrators",
            "action": [
              "Symbolic: Create a rule that triggers when the count of MFA challenge/failure events for a single user in the MFA logs exceeds a threshold (e.g., 5) within a 2-minute window, and is immediately followed by a successful logon event (Windows Event ID 4624 or corresponding cloud log) for the same user.",
              "Statistical: For each user, establish a baseline for the rate of MFA prompts per hour. Use a Z-score or percentile-based threshold (e.g., > 99th percentile) to detect anomalous spikes in prompt volume. Correlate alerts with the geographic rarity of the authenticating IP address based on the user's historical login locations.",
              "Machine Learning: Apply time-series anomaly detection (e.g., using Seasonal Hybrid ESD) to the stream of MFA events per user. This can identify statistically significant deviations from the user's established daily and weekly authentication patterns, indicating potential MFA fatigue attacks."
            ]
          },
          {
            "description": "An endpoint establishes a long-lived (> 1 hour) or high-volume (> 10MB) outbound TCP connection to an external IP address that has not been previously observed in the organization's network traffic within the last 90 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, web proxies), User workstations and laptops",
            "action": [
              "Symbolic: Maintain a stateful list of all external IP addresses contacted by the organization over a 90-day rolling window. Generate an alert when a Zeek conn.log entry shows a connection to an IP address not on this list, especially if the protocol is TCP and the destination port is non-standard (not 80/443).",
              "Statistical: For each internal host, baseline the distribution of connection durations and total bytes transferred (orig_bytes + resp_bytes in Zeek conn.log). Alert when a new connection's duration or volume exceeds the 99th percentile of the host's historical behavior. Calculate the JA3/JA3S hash prevalence and flag connections using rare client/server TLS fingerprints.",
              "Machine Learning: Use an autoencoder trained on features from Zeek conn.log (e.g., duration, byte counts, protocol, port, flags) to learn a model of 'normal' network connections. Process new connections through the model and flag those with a high reconstruction error, as these represent connections that do not conform to the learned normal patterns."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]