[
  {
    "information_requirement": "Has an adversary successfully exfiltrated data by uploading it to a public or private text storage site? (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567.003",
        "name": "Exfiltration to Text Storage Sites",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host to a hostname or IP address associated with a known text storage site, particularly connections involving data uploads (e.g., HTTP POST requests).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, Web Proxies",
            "action": [
              "Symbolic: Maintain a threat intelligence list of known text storage site hostnames, IPs, and SSL certificate subjects. Create a detection rule to alert on any network connection where the `id.resp_h` (Zeek conn.log), `host` (Zeek http.log), or `server_name` (Zeek ssl.log) matches an entry on this list.",
              "Statistical: For each host, calculate a baseline of bytes sent (`orig_bytes`) to all external destinations over a 30-day period. Alert if a connection to a text storage site results in an `orig_bytes` value that exceeds the 99th percentile of the host's typical outbound connection size.",
              "Machine Learning: Train a random forest classifier on labeled network connection data (Zeek conn.log) to distinguish between benign and malicious exfiltration activity. Use features such as `orig_bytes`, `resp_bytes`, `duration`, `proto`, destination port, and whether the destination is a known text storage site. Deploy the model to score new connections in real-time and alert on those classified as high-probability exfiltration."
            ]
          },
          {
            "description": "A command-line execution (e.g., cURL, PowerShell, Wget) containing both a URL for a text storage site and syntax for uploading data (e.g., HTTP POST method, file content arguments).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Production Servers, Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule using regular expressions to scan command-line arguments in Windows Event ID 4688. The regex should look for the co-occurrence of a process like `curl.exe`, `powershell.exe`, or `wget.exe` with data upload flags (e.g., `-d`, `--data`, `-F`, `-Body`) and a hostname from a list of text storage sites.",
              "Statistical: Calculate the entropy of command-line strings for common processes like PowerShell and cURL. A high entropy score can indicate obfuscated or data-laden commands. Establish a baseline entropy for normal commands per host and alert when a command involving a text storage site URL has an entropy score exceeding 3 standard deviations above the mean.",
              "Machine Learning: Use a one-class Support Vector Machine (SVM) trained on benign command-line invocations for processes like `powershell.exe` and `curl.exe`. Apply the model to new process creation events. Flag any command-line execution that the model identifies as a significant outlier, especially if it contains a URL, for analyst review."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of data sent (`orig_bytes`) or the frequency of connections from a single host to the category of text storage sites, when compared to a historical baseline for that specific host or its peer group.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, SIEM/Log Aggregator",
            "action": [
              "Symbolic: Define a simple threshold-based rule. Alert if any single host makes more than 10 connections to text storage sites within a 1-hour window OR if any single connection uploads more than 10MB of data, where thresholds are tuned for the specific environment.",
              "Statistical: For each host, create a 30-day rolling baseline of daily data volume sent to text storage sites. Use the interquartile range (IQR) method to define 'normal'. Alert if a host's daily upload volume exceeds Q3 + 1.5 * IQR. This identifies statistically significant outlier behavior.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., ARIMA) on the aggregate data volume sent to text storage sites per hour for the entire network. The model will learn the normal 'rhythm' of traffic. Alert when the actual observed volume significantly deviates from the model's predicted confidence interval."
            ]
          },
          {
            "description": "A network connection to a text storage site where the initiating parent process on the source host is not a standard web browser (e.g., `chrome.exe`, `firefox.exe`) but is instead a non-interactive or command-line process (e.g., `powershell.exe`, `svchost.exe`, `cscript.exe`).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, SIEM for correlation",
            "action": [
              "Symbolic: Create a list of approved browser executable names (e.g., `chrome.exe`, `firefox.exe`, `msedge.exe`). Correlate network connections to text storage sites (from Zeek conn.log) with the initiating process (from Windows Event ID 4688). Alert if the initiating process name is not on the approved browser list.",
              "Statistical: Build a profile for each host that maps processes to the destination categories they typically connect to. Calculate the frequency of these process-destination pairings. Alert when a rare pairing occurs, such as `svchost.exe` connecting to a 'Text Storage Site' category, if its frequency is below a 1st percentile threshold for that host's activity.",
              "Machine Learning: Train a Naive Bayes classifier to predict the legitimacy of a network connection based on features like `ProcessName`, `ParentProcessName`, `DestinationIPCategory`, and `DestinationPort`. Label data as 'legitimate' for browser processes connecting to text sites and 'suspicious' for all others. Deploy the model to flag connections with a high probability of being suspicious."
            ]
          },
          {
            "description": "A timed sequence of events on a single host where a process first accesses a file on a designated sensitive network share or local directory (Object Access), and then the same process or its child initiates an outbound network connection to a known text storage site within a short time window (e.g., under 5 minutes).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, Databases, User Workstations with access to sensitive data, SIEM for correlation",
            "action": [
              "Symbolic: Configure SACLs on critical file shares to generate Windows Event ID 4663 on access. Create a SIEM correlation rule that triggers when, for the same `Host` and `ProcessID`, an Event ID 4663 from a sensitive NAI is followed within 2 minutes by a network connection (from Zeek conn.log) to a destination on the text storage site watchlist.",
              "Statistical: For processes that access sensitive files (triggering Event ID 4663), baseline their typical subsequent network activity. Calculate the probability that such a process will connect to an external site. Alert when a process accesses a sensitive file and then makes a connection to a text storage site, if this sequence of actions is a statistical anomaly with a very low probability based on historical data.",
              "Machine Learning: Use a sequence analysis model like a Hidden Markov Model trained on event logs from endpoints. The model learns normal sequences of behavior (e.g., `open_word.exe` -> `access_document.doc` -> `connect_to_sharepoint.com`). The model can then identify and alert on anomalous sequences, such as `run_powershell.exe` -> `access_customer_data.csv` -> `connect_to_pastebin.com`, which deviate from learned legitimate workflows."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]