[
  {
    "information_requirement": "Has an adversary attempted to disable or modify security tools (e.g., antivirus, EDR, Sysmon) to evade detection?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.001",
        "name": "Disable or Modify Tools",
        "evidence": [
          {
            "description": "A process creation event where the executed file's hash or name matches a known security tool disabler (e.g., GMER, PCHunter, IOBit Unlocker) from a curated threat intelligence feed.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek software.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise workstations and servers, with heightened monitoring on administrative jump boxes, domain controllers, and security infrastructure servers.",
            "action": [
              "Configure a SIEM rule to continuously monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1). Compare the file hash (SHA256, MD5) and process name against a CTI feed of known security tool disablers. Trigger a high-severity alert on any match.",
              "For any process matching the CTI feed, analyze its parent process. Establish a baseline of common parent-child process relationships across the environment. If the observed parent process is statistically rare for that child (e.g., in the bottom 5th percentile of frequency), escalate the alert priority as it suggests an unusual execution chain.",
              "Deploy a pre-trained classification model (e.g., Random Forest, Gradient Boosting) that scores new process executions based on features like parent process, command-line entropy, user context, and file path characteristics. Flag processes with a high probability score of being a security tool disabler, even if the hash is unknown, for analyst review."
            ]
          },
          {
            "description": "A process creation event with a command line containing specific substrings or patterns used to disable security tools, such as stopping services (`net stop`), reconfiguring service startup (`sc config`), killing processes (`taskkill`), unloading filter drivers (`fltmc unload`), or modifying security policies via PowerShell.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Command-line and script block logs from all enterprise workstations and servers, especially domain controllers and administrative hosts.",
            "action": [
              "Implement SIEM detection rules using regular expressions to search command-line arguments (from Windows Event ID 4688, Sysmon Event ID 1) for patterns targeting security tools. Examples include: `net stop (WinDefend|Sysmon..)` , `sc config (wuauserv|Sysmon..) start= disabled`, `taskkill /IM (msmpeng.exe|..)` , `fltmc unload (SysmonDrv|..)` , `Set-MpPreference -DisableRealtimeMonitoring $true`, and `reg.exe add <HKLM..> /v Start /t REG_DWORD /d 4`.",
              "For all process creation events, calculate the Shannon entropy of the command-line argument string. Establish a per-host and per-user baseline entropy for common processes (e.g., `cmd.exe`, `powershell.exe`). Generate an alert when a command targeting a known security tool exhibits an entropy value exceeding the 95th percentile of its baseline, which can indicate obfuscation or encoding.",
              "Utilize a sequence-to-sequence model (e.g., LSTM) to analyze the full sequence of commands within a user's session. Train the model on benign administrative sessions versus known ATT&CK campaign data. Flag sessions that contain a sequence with a high probability of being malicious, such as reconnaissance commands followed by privilege escalation and then a security tool disablement command."
            ]
          },
          {
            "description": "On a single host, a process creation event from an unsigned binary or a process executing from a non-standard path (e.g., %TEMP%, %PUBLIC%) is followed within a 5-minute window by a service stop event (Windows Event ID 7036) or process termination event (Sysmon Event ID 5) for a known security tool or its components.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Windows Event ID 7036",
              "Sysmon Event ID 5"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process, service control manager, and process termination logs from all enterprise workstations, servers, and domain controllers.",
            "action": [
              "Create a SIEM correlation rule that triggers when a process creation event (Sysmon Event ID 1) from a non-standard location (`%TEMP%`, `%APPDATA%`, `%PUBLIC%`) or with an `IsSigned` status of `false` is followed within 5 minutes on the same host by a service stop event (Windows Event ID 7036) for services like 'WinDefend', 'Sysmon', or EDR agents.",
              "For each host, calculate the baseline hourly rate of security service stop events (Event ID 7036 for specific services). Trigger an alert if the rate on a host exceeds a statistical threshold (e.g., 3 standard deviations above the 30-day moving average), which indicates an abnormal frequency of service interruptions.",
              "Implement a Hidden Markov Model (HMM) where the hidden states are 'Benign Operation' and 'Tampering Activity'. Use sequences of observable events (process creations, service state changes, process terminations) as inputs. The model flags event sequences that have a high probability of being generated by the 'Tampering Activity' state, indicating a likely attack chain."
            ]
          },
          {
            "description": "A registry modification event targeting a key path known to control a security tool's configuration, such as its service startup type, logging parameters, or anti-tampering features.",
            "data_sources": [
              "Sysmon Event ID 12",
              "Sysmon Event ID 13",
              "Sysmon Event ID 14"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Registry modification logs from all enterprise workstations and servers, with a focus on keys related to security product configuration.",
            "action": [
              "Create a specific watchlist of critical security tool registry keys (e.g., `HKLM\\SYSTEM\\CurrentControlSet\\Services\\WinDefend`, `HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender`, `HKLM\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational`). Alert on any modification (Sysmon Event ID 13) or deletion (Sysmon Event ID 12/14) of these keys by any process not on an approved allowlist (e.g., trusted installers, system processes).",
              "For the monitored registry keys, baseline the set of processes that normally perform modifications over a 30-day period. Alert if a statistically rare process (e.g., a process not seen in the baseline, or one in the bottom 5% of modification frequency) modifies a key, indicating anomalous behavior.",
              "Train an anomaly detection model (e.g., Isolation Forest) on features from registry modification events (Sysmon Event IDs 12, 13). Features should include the modifying process name, its parent process, user account, and the target key path. The model will identify and score unusual combinations of these features that deviate from established normal administrative behavior."
            ]
          },
          {
            "description": "The explicit clearing of a Windows Event Log, or a statistically significant drop in the event volume from a specific host or log source (e.g., Zeek sensor, Sysmon), not attributable to a scheduled maintenance window.",
            "data_sources": [
              "Windows Event ID 1102",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Log aggregation platform (SIEM), Windows Security/System event logs on endpoints, and network traffic logs from network sensors.",
            "action": [
              "Create a non-suppressible, high-severity alert for Windows Event ID 1102 ('The audit log was cleared'). Enrich the alert with the user and process (e.g., `wevtutil.exe` from Event ID 4688) that initiated the action. Correlate with change management records to validate legitimacy.",
              "For each critical log source (e.g., Sysmon, Zeek conn.log), ingest log counts per minute into a time series database. Calculate a 30-day rolling average and standard deviation of log volume. Trigger an alert if the current volume drops more than 3 standard deviations below the average for a sustained period (e.g., >10 minutes), excluding approved maintenance windows.",
              "Employ a time series forecasting model (e.g., SARIMA or Prophet) to predict the expected log volume for each key log source, accounting for seasonality (time of day, day of week). If the observed volume falls significantly below the model's predicted confidence interval, generate an anomaly alert for investigation into a potential log stoppage or sensor tampering."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]