[
  {
    "information_requirement": "Has the adversary attempted to evade defenses by modifying cloud firewalls?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.007",
        "name": "Disable or Modify Cloud Firewall",
        "evidence": [
          {
            "description": "A cloud firewall rule modification event (e.g., AWS `AuthorizeSecurityGroupIngress`, Azure `Microsoft.Network/networkSecurityGroups/securityRules/write`) contains a source IP address or CIDR range that matches an entry on a current, high-confidence threat intelligence feed.",
            "data_sources": [
              "AWS CloudTrail: AuthorizeSecurityGroupIngress",
              "Azure Activity Log: Microsoft.Network/networkSecurityGroups/securityRules/write",
              "GCP Audit Log: compute.firewalls.patch",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Provider Management Console/API Endpoints, Organizational Threat Intelligence Platform, Cloud Network Gateways",
            "action": [
              "Symbolic Logic: Parse cloud audit logs for firewall rule creation/modification events. Extract the source IP/CIDR range from each event. Compare the extracted IP/CIDR against a list of known malicious indicators from a threat intelligence feed. Generate an alert for any match.",
              "Statistical Method: For all IPs matched in the symbolic logic step, analyze Zeek conn.log data for the 30 minutes following the rule change. Calculate the 95th percentile for connection attempts from that IP to the newly exposed resource. Alert if the observed connection count from the matched IP exceeds this historical baseline for the destination asset.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) using features from the cloud audit log event (user identity, source IP of the change, time of day) and the threat intelligence feed (IP reputation score). The model should predict the likelihood that a firewall change involving an external IP is malicious. An output probability score above a predetermined threshold (e.g., 0.85) triggers an alert."
            ]
          },
          {
            "description": "A cloud firewall rule modification event contains a user-agent string, rule name, or description text that matches signatures of known offensive security tools (e.g., 'pacu', 'Prowler') or malware.",
            "data_sources": [
              "AWS CloudTrail: UserAgent field",
              "Azure Activity Log: Caller, HttpRequest fields",
              "GCP Audit Log: requestMetadata.callerSuppliedUserAgent"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Provider Management Console/API Endpoints, Identity and Access Management (IAM) Logs",
            "action": [
              "Symbolic Logic: Create and maintain a list of regular expressions for known malicious tool user-agents, rule names, and descriptions (e.g., 'pacu', 'pwn', 'temp-allow', 'backdoor'). Scan all cloud firewall modification events against this regex list. Alert on any match.",
              "Statistical Method: Calculate the Shannon entropy of all firewall rule names and descriptions. Establish a baseline for normal entropy scores. Flag rules with unusually high entropy (suggesting randomized names from a tool) or unusually low entropy (suggesting simple, repeated names like 'test'). Alert if the score deviates by more than 2 standard deviations from the mean.",
              "Machine Learning: Use a Natural Language Processing (NLP) text classification model (e.g., a bag-of-words model with a Naive Bayes classifier) trained on a labeled dataset of benign and malicious rule names/descriptions. The model will classify newly created rules in real-time. Alert on any rule classified as 'malicious' with high confidence."
            ]
          },
          {
            "description": "A cloud firewall rule is created or modified to be overly permissive, such as allowing ingress from all IPs ('0.0.0.0/0' or '::/0'), or opening high-risk management ports (e.g., RDP 3389, SSH 22, WinRM 5985) to the internet.",
            "data_sources": [
              "AWS CloudTrail: AuthorizeSecurityGroupIngress (ipPermissions.ipRanges)",
              "Azure Activity Log: Microsoft.Network/networkSecurityGroups/securityRules/write (properties.sourceAddressPrefix)",
              "GCP Audit Log: compute.firewalls.patch (allowed.IPProtocol)",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Network Security Groups, Virtual Private Cloud (VPC) Firewall Rules, Cloud Network Gateways",
            "action": [
              "Symbolic Logic: Define a policy of 'never-allow' rules, such as ingress from '0.0.0.0/0' or '::/0' on sensitive ports (22, 3389, 5985, 1433, 3306). Create a real-time alert that triggers immediately whenever a firewall modification event violates this static policy.",
              "Statistical Method: For all ports, maintain a historical frequency distribution of their exposure to the internet ('0.0.0.0/0'). Calculate the rarity of exposing a given port. If a modification exposes a port that is in the bottom 5th percentile of historical exposure frequency (e.g., exposing SMB port 445 to the internet), generate a high-severity alert.",
              "Machine Learning: Use anomaly detection on the tuple (Port, Protocol, Source CIDR). Train a one-class SVM or Isolation Forest model on a baseline of all existing, approved firewall rules. The model will learn the 'normal' state of the firewall configuration. Any new rule that the model flags as a significant outlier triggers an alert."
            ]
          },
          {
            "description": "A cloud firewall modification API call is attributed to a user identity, source IP, or time of day that is anomalous when compared to historical baselines for that user or their role.",
            "data_sources": [
              "AWS CloudTrail: userIdentity, sourceIPAddress, eventTime",
              "Azure Activity Log: caller, claims, callerIpAddress",
              "GCP Audit Log: authenticationInfo.principalEmail, requestMetadata.callerIp"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Provider Management Console/API Endpoints, Identity and Access Management (IAM) Logs, VPN/Gateway Access Logs",
            "action": [
              "Symbolic Logic: Define a list of authorized user accounts and roles permitted to make firewall changes. Create an alert that triggers if any firewall modification event is performed by a user or role not on this explicit allow-list.",
              "Statistical Method: For each user, establish a baseline of normal activity for firewall changes, including: frequency of changes, typical time-of-day/day-of-week, and common source IP subnets/countries. Use a scoring system where a change by a user who has not made one in 90+ days, at 3 AM, from a new country, receives a high-risk score. Alert if the cumulative score exceeds a percentile-based threshold (e.g., 98th percentile of all change scores).",
              "Machine Learning: Implement a user and entity behavior analytics (UEBA) model to perform multi-variate anomaly detection on features like user identity, role, source IP geolocation, time of day, and the type of change. An event flagged as a high-confidence anomaly by the UEBA model, indicating a deviation from the user's established pattern of life, triggers an alert."
            ]
          },
          {
            "description": "Within a short time window following a cloud firewall rule modification, network traffic or host-based login events are observed that match the new rule's parameters and deviate from established baselines.",
            "data_sources": [
              "AWS CloudTrail: AuthorizeSecurityGroupIngress",
              "Azure Activity Log: Microsoft.Network/networkSecurityGroups/securityRules/write",
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Network Gateways, Targeted Virtual Machines/Hosts, Authentication Logs on Domain Controllers or Member Servers",
            "action": [
              "Symbolic Logic: For each firewall modification event allowing a new source IP and port, create a temporary 15-minute watch rule. If a connection is observed in Zeek conn.log from that source IP to the destination on that port, and it is followed by a successful login (Windows Event ID 4624) on the destination host from that same IP, trigger a high-severity alert.",
              "Statistical Method: Following a rule change, monitor traffic on the newly opened port in Zeek conn.log. Calculate the rate of change (first derivative) of the traffic volume. If the rate of change in a 5-minute window exceeds the 99th percentile of all historical traffic spikes on that host, flag it as anomalous volumetric activity.",
              "Machine Learning: Use time series analysis (e.g., ARIMA) to forecast expected network traffic and login attempt counts for the affected host. After a firewall rule change, compare the actual observed traffic/logins against the forecasted values with confidence intervals. If the observed values significantly exceed the upper bound of the confidence interval for a sustained period, classify the event as an anomaly and alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]