[
  {
    "information_requirement": "Has the adversary gained initial access by delivering a malicious payload via a third-party service?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1566.003",
        "name": "Spearphishing via Service",
        "evidence": [
          {
            "description": "A file hash or destination network indicator (domain/IP) associated with a download from a recognized third-party service (e.g., LinkedIn, personal webmail) matches a known-bad entry in a threat intelligence feed.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring (NSM) sensors at internet egress points; Centralized log aggregator (SIEM); Threat intelligence platform.",
            "action": [
              "Correlate Zeek files.log (fuid, md5, sha1) with Zeek http.log (uid, host, referrer) on the 'uid'. Filter for 'host' or 'referrer' values that match an enterprise-defined list of non-corporate, third-party services. Compare the resulting file hashes and host values against a high-confidence threat intelligence feed. Generate a high-priority alert for any match.",
              "For each monitored third-party service domain, establish a 30-day rolling baseline of the rate of threat intelligence matches per 1,000 downloads. Alert if the match rate for any service in a one-hour window exceeds the 99th percentile of its historical baseline, which may indicate a targeted campaign leveraging that service.",
              "Train a supervised classification model (e.g., Random Forest) using features from Zeek logs (MIME type, file size, connection duration, source/destination ports, domain age, and domain reputation score) to predict if a download is malicious. Deploy the model to score all file downloads from third-party services in near real-time and alert on any download classified as malicious with a confidence score above 0.90."
            ]
          },
          {
            "description": "An office productivity application (e.g., winword.exe, acrobat.exe) spawns a command-line interpreter or scripting engine (e.g., powershell.exe, cmd.exe) within a 5-minute window following a file download from a known third-party service.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Detection and Response (EDR) agents on user workstations; Virtual Desktop Infrastructure (VDI) environment; Centralized Security Information and Event Management (SIEM) system.",
            "action": [
              "Create a SIEM correlation rule that triggers when a file download is observed from a third-party service (via Zeek http.log `host` field) and, within 5 minutes, a process creation event (Windows Event ID 4688) is logged on the destination host where the 'CreatorProcessName' is an office application and the 'NewProcessName' is a scripting engine or shell.",
              "For each user and parent process (e.g., winword.exe), build a 90-day baseline of normally spawned child processes and the entropy of their command-line arguments. Generate an alert if a parent process spawns a child process not seen in its baseline or if the command-line entropy for a spawned process like powershell.exe exceeds 3 standard deviations from that user's established norm.",
              "Model baseline process execution chains (parent-child-grandchild relationships and command-line arguments) using a graph-based anomaly detection algorithm. After a file download from a third-party service, analyze the subsequent process tree on the endpoint. Flag any process chain originating from an office application that the model identifies as a high-scoring outlier compared to the learned organizational baseline."
            ]
          },
          {
            "description": "A file downloaded from a third-party service has a high-risk file type (e.g., macro-enabled Office document, HTA file) or a filename structured to deceive the user, such as using a double extension (e.g., 'invoice.pdf.exe').",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Security Monitoring (NSM) sensors at the network perimeter; Web content filters; Centralized log aggregator (SIEM).",
            "action": [
              "Monitor Zeek files.log for transfers where the corresponding Zeek http.log 'host' field matches a list of third-party services. Alert on any filename matching a regex for double extensions (e.g., '\\.(pdf|docx|xlsx|jpg)\\.(exe|scr|msi|hta)$') or if the 'mime_type' field is on a blocklist of high-risk types (e.g., 'application/hta', 'application/vnd.ms-word.document.macroEnabled.12').",
              "For each third-party service, establish a 30-day baseline of downloaded file MIME types across the organization. Calculate the daily proportion of high-risk vs. benign file types. Alert if the proportion of high-risk file types (e.g., .zip, .docm, .exe) from a specific service in a 1-hour window exceeds the 98th percentile of the daily average.",
              "Train a classification model to predict malicious intent based on file metadata from Zeek files.log. Use features such as MIME type, file extension, filename length, filename character entropy, and the presence of keywords like 'invoice' or 'urgent'. Use this model to score all files downloaded from third-party services and flag those with a high malicious probability score for analyst review."
            ]
          },
          {
            "description": "Within 5 minutes of a file download from a third-party service, the destination host initiates an outbound network connection to a domain that is newly registered (e.g., < 30 days old), has high character entropy, or is uncategorized by web filters.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS logs from internal resolvers; Firewall logs from egress points; Network Security Monitoring (NSM) sensors; Threat intelligence feeds.",
            "action": [
              "Create a SIEM rule to detect the following sequence: 1) A host downloads a file from a third-party service (Zeek files.log/http.log). 2) Within 5 minutes, the same host IP makes a DNS query (Zeek dns.log) for a domain. 3) Enrich the query with WHOIS data to determine domain age. 4) Alert if the domain was registered within the last 30 days.",
              "After a file download from a third-party service, monitor subsequent DNS queries (Zeek dns.log) from the client host. Calculate the Shannon entropy of the queried domain name (qname). Alert if the domain entropy is anomalously high (e.g., > 3.5) and the domain is rare for the host or organization (e.g., not in the top 95% of domains accessed in the last 30 days).",
              "Use a time series analysis model (e.g., ARIMA) to forecast the expected outbound connection count and data volume per hour for each host. After a file download from a third-party service, compare the actual subsequent outbound traffic (from Zeek conn.log) against the forecast. Alert on significant positive deviations that may indicate anomalous C2 beaconing activity."
            ]
          },
          {
            "description": "An anomalously high number of unique internal hosts download the same file (by hash) or connect to the same destination third-party service within a compressed timeframe (e.g., one hour).",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized logging infrastructure (SIEM); Network traffic monitoring points at the network perimeter.",
            "action": [
              "Create a SIEM rule to monitor Zeek files.log for a single file hash (md5/sha1) being downloaded by more than 10 distinct internal IP addresses within a one-hour window, where the referrer (from Zeek http.log) is a known third-party service domain. This 'fan-out' activity is a strong indicator of a coordinated campaign.",
              "For each monitored third-party service, create a 30-day rolling baseline of unique source IPs connecting per hour. Use a moving average and standard deviation to model normal traffic volume. Alert if the count of unique source IPs connecting in the current hour exceeds the baseline by more than 3 standard deviations.",
              "Employ a density-based clustering algorithm (e.g., DBSCAN) on connection data (Zeek conn.log) using features like source IP, destination domain, destination port, and timestamp. A dense cluster of many unique source IPs connecting to the same new or rare third-party service domain in a short period would be flagged as an anomalous event indicative of a coordinated campaign."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]