[
  {
    "information_requirement": "Has an adversary deployed or executed a virtual instance to evade host or network-based defenses? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.006",
        "name": "Run Virtual Instance",
        "evidence": [
          {
            "description": "Network traffic is observed from a MAC address whose Organizationally Unique Identifier (OUI) corresponds to a known virtualization vendor (e.g., VMware, VirtualBox, Parallels), but this MAC address is not registered in the corporate asset management database (CMDB).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dhcp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway/firewall, Core network switches, DHCP servers",
            "action": [
              "Maintain a watchlist of virtualization vendor OUIs (e.g., 00:05:69, 00:0C:29 for VMware; 08:00:27 for VirtualBox). Join network flow logs (Zeek conn.log) with DHCP logs (Zeek dhcp.log) on IP address to get the MAC. Join this with an asset inventory database on MAC address. Alert if a MAC's OUI is on the watchlist but the MAC is not in the asset inventory.",
              "From DHCP logs, identify newly observed MAC addresses with virtualization OUIs. For the associated IP address, analyze its network traffic patterns from Zeek conn.log over the next 24 hours. Calculate the entropy of destination ports and the total number of distinct destination IPs contacted. Alert if these values exceed the 95th percentile for newly added devices on the network segment.",
              "Train a time-series anomaly detection model (e.g., LSTM Autoencoder) on host-level network metrics (e.g., bytes_out, bytes_in, connection_count, unique_ports per hour) from Zeek conn.log for all known assets. When a new, un-inventoried MAC with a virtualization OUI appears, feed its network traffic metrics into the model. A high reconstruction error score indicates a significant deviation from learned normal behavior, suggesting a rogue VM."
            ]
          },
          {
            "description": "Execution of a virtualization command-line utility (e.g., VBoxManage.exe, vmrun.exe, qemu-system-x86_64.exe) with arguments indicating headless, silent, or non-interactive operation (e.g., '--type headless', '-nogui', '-silent', 'setextradata global GUI/SuppressMessages').",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Standard user endpoints, Developer workstations, Server infrastructure",
            "action": [
              "Using process creation logs (Sysmon Event ID 1 or Windows Event ID 4688), create a detection rule that searches for process names like 'VBoxManage.exe', 'vmrun.exe', or 'qemu-system-*.exe'. Trigger an alert if the associated command-line field contains strings indicative of evasion, such as '--type headless', '-nogui', '-silent', or 'GUI/SuppressMessages'.",
              "From process creation logs, build a historical frequency table of all command-line arguments used with known virtualization processes across the enterprise. For each new execution, calculate a rarity score based on the inverse frequency of its arguments. Alert on any execution whose rarity score exceeds a threshold (e.g., in the 99th percentile), indicating an uncommon and potentially malicious invocation.",
              "Train a supervised classification model (e.g., Logistic Regression or Random Forest) on a labeled dataset of command lines (benign vs. malicious). Extract features using TF-IDF vectorization on the command-line arguments. Deploy the model to classify new virtualization process executions in real-time. Classifications of 'malicious' with high confidence should generate an alert."
            ]
          },
          {
            "description": "A new file is created with a common virtual disk extension (e.g., .vmdk, .vhd, .vhdx, .vdi, .qcow2) in a non-standard or suspicious directory, such as a user's temporary folder (%TEMP%), a web-accessible directory, or a public share.",
            "data_sources": [
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, Standard user endpoints, Web servers",
            "action": [
              "Using file creation logs (Sysmon Event ID 11), monitor for events where the TargetFilename ends with a virtual disk extension ('.vmdk', '.vhd', '.vhdx', '.vdi', '.qcow2'). Trigger an alert if the file path is not in an allowlist of approved virtualization storage locations and is instead in a high-risk location (e.g., contains 'C:\\Users\\', 'C:\\ProgramData\\', 'C:\\inetpub\\wwwroot\\').",
              "For each file creation event involving a virtual disk extension, analyze the creating process (ProcessImage field in Sysmon Event ID 11). Maintain a baseline of common processes that create these files (e.g., 'vmware.exe', 'VirtualBox.exe'). Calculate the rarity of the creating process. Alert if a rare process (e.g., 'powershell.exe', 'mshta.exe', 'winword.exe') creates a virtual disk file.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to file creation events for virtual disks. Use features such as the creating process name, file path depth, file size, and parent directory name. Points that are classified as noise or belong to very small, sparse clusters represent anomalous events that deviate from the dense clusters of normal activity."
            ]
          },
          {
            "description": "A virtualization management process (e.g., VBoxManage.exe, vmrun.exe) is spawned by a parent process not typically associated with interactive system administration, such as a Microsoft Office application (winword.exe), a web browser (chrome.exe), or a non-interactive system process (services.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Standard user endpoints, Application servers",
            "action": [
              "Using process creation logs (Sysmon Event ID 1), define an explicit allowlist of legitimate parent processes for virtualization binaries (e.g., 'explorer.exe', 'cmd.exe', 'powershell.exe', 'devenv.exe'). Generate a high-severity alert whenever a virtualization process is created by any parent process not on this list.",
              "Continuously build a baseline of all parent-child process relationships observed over a 30-day rolling window. For each new process creation event where the child is a virtualization binary, look up the historical frequency of its parent. If the parent-child pair has occurred fewer than 5 times enterprise-wide, flag it as a statistically rare and suspicious event.",
              "Model process execution history as a directed graph where nodes are process names and edges represent parent-child relationships, weighted by frequency. Use a graph-based anomaly detection algorithm to identify low-probability paths or subgraphs. A path like 'outlook.exe -> powershell.exe -> VBoxManage.exe' would be flagged as a highly anomalous sequence not present in the learned 'normal' graph structure."
            ]
          },
          {
            "description": "A correlated sequence of events on a single host within 15 minutes: 1) A process creation event involving a virtualization binary with evasive command-line flags. 2) A subsequent file creation event for a large virtual disk file (>200MB). 3) Followed by new network connections from a new, non-inventoried MAC address with a virtualization vendor OUI originating from that host's IP.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway/firewall, Standard user endpoints, Server infrastructure",
            "action": [
              "Create a stateful correlation rule in a SIEM that triggers on a host if the following events occur in sequence within 15 minutes: 1. A Sysmon EID 1 event for a virtualization process with a command line matching '--type headless' or '-nogui'. 2. A Sysmon EID 11 event for a file with a virtual disk extension. 3. A Zeek conn.log entry where the source IP matches the host and the source MAC has a virtualization OUI not present in the asset inventory. An alert is fired if all conditions are met.",
              "Develop a host-based threat score. Assign points for suspicious activities: +10 for a virtualization process with rare command-line args, +5 for virtual disk creation in a temp directory, +15 for network traffic from a new virtualization MAC. Sum these points over a rolling 1-hour window for each host. Alert if a host's score exceeds 4 standard deviations above its own baseline score or the 98th percentile of all host scores.",
              "Define states representing stages of an attack: 'Initial Access', 'Evasive Process Execution', 'Artifact Drop', 'New Network Channel'. Train a Hidden Markov Model (HMM) on sequences of log events from known benign and malicious scenarios. Feed live, per-host event streams into the HMM. An alert is generated if the model calculates a high probability that the observed sequence of events corresponds to the path leading to the 'New Network Channel' state via 'Evasive Process Execution'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]