[
  {
    "information_requirement": "Has the adversary exfiltrated data using code repository services? (TA0010 - Exfiltration) (PIR)",
    "tactic_id": "TA0010",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1567.001",
        "name": "Exfiltration to Code Repository",
        "evidence": [
          {
            "description": "An outbound network connection is made to a domain or IP address of a code repository service that is present on a threat intelligence feed or is statistically rare within the enterprise.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, and Egress Proxies",
            "action": [
              "Correlate destination domains from Zeek dns.log ('query' field) and Zeek ssl.log ('server_name' field) and destination IP addresses from Zeek conn.log ('id.resp_h' field) against a threat intelligence feed of known malicious or suspicious code repository indicators. Generate an alert upon a match.",
              "Calculate the frequency of each 'server_name' from Zeek ssl.log across all hosts over a 24-hour period. Identify server names associated with code repositories that are requested by fewer than the 1st percentile of hosts and flag for investigation.",
              "Develop a classification model using features such as domain string characteristics (entropy, length, n-grams), WHOIS data (age, registrar), and passive DNS history. Use the model to score all new domains associated with code repositories, alerting on those with a high maliciousness score."
            ]
          },
          {
            "description": "A process execution sequence on a single host shows a data compression utility (e.g., 7z.exe) followed by a 'git.exe' process execution with 'push' arguments within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer Workstations, Build Servers, and CI/CD Pipeline Servers",
            "action": [
              "Create a SIEM rule that triggers when a process command line in Windows Event ID 4688 contains 'git.exe' and 'push' and is preceded by a process creation event for a known archiving utility (e.g., '7z.exe', 'rar.exe', 'zip.exe', 'tar.exe') from the same host and user within a 5-minute window.",
              "For each host, build a baseline of process co-occurrence frequency within a 5-minute sliding window. Calculate the probability of 'git.exe push' following an archiving process. Flag any sequence where the observed co-occurrence falls in the bottom 5th percentile of historical frequencies for that host or user.",
              "Train a sequence analysis model, such as a Recurrent Neural Network (RNN) or Hidden Markov Model (HMM), on benign process execution sequences from Windows Event ID 4688 logs. Feed new process sequences into the model and alert when the model assigns a low probability (high anomaly score) to a sequence involving data archiving followed by a git push."
            ]
          },
          {
            "description": "A single network session to a known code repository service exhibits an outbound-to-inbound data transfer ratio greater than 10:1, or the total daily outbound data volume from a single host to code repositories exceeds its 30-day statistical baseline by more than 3 standard deviations.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway and Core Network Taps",
            "action": [
              "Implement a rule that alerts on any single connection in Zeek conn.log to a known code repository domain where 'orig_bytes' is greater than 100MB and the ratio of 'orig_bytes' to 'resp_bytes' exceeds 10:1.",
              "For each source IP address, establish a 30-day rolling baseline (mean and standard deviation) of total daily outbound bytes ('orig_bytes' from Zeek conn.log) to all known code repository destinations. Alert when the current day's total volume for a host exceeds its 30-day average by more than 3 standard deviations.",
              "Employ a time series forecasting model (e.g., ARIMA) for each host to predict the expected range of outbound data volume to code repositories. Compare the actual observed volume against the forecasted volume's confidence interval. Generate an alert for any observation that falls significantly above the predicted upper bound."
            ]
          },
          {
            "description": "A network connection to a public code repository is initiated by a user account or from a host not designated as part of a developer, data science, or engineering group.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Devices (All Departments), and Identity and Access Management (IAM) Systems",
            "action": [
              "Maintain an explicit allow-list of Active Directory user groups (e.g., 'Developers', 'CI/CD Service Accounts') authorized to connect to external code repositories. Correlate network logs (Zeek conn.log) with user logon data (Windows Event ID 4624) and group membership. Alert on any connection to a code repository from a user or host not on the allow-list.",
              "For each user account, calculate the Shannon entropy of the set of destination server names ('server_name' in Zeek ssl.log) accessed over a 24-hour period. Establish a baseline entropy score for each user. Flag an alert when a user's daily entropy score deviates by more than 2 standard deviations from their 30-day moving average, particularly if the new service driving the entropy change is a code repository.",
              "Use a clustering algorithm (e.g., K-Means) to group users based on features of their network activity, such as categories of websites visited, data volumes, and time-of-day patterns. Identify users who are clustered with non-technical groups (e.g., 'Marketing', 'Sales') but initiate connections to code repositories, flagging them as cross-cluster anomalies."
            ]
          },
          {
            "description": "A network connection to a public code repository IP address is initiated by a process not typically associated with software development (e.g., 'powershell.exe', 'cscript.exe', 'rundll32.exe') or a process that has no history of this behavior on a given host.",
            "data_sources": [
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoint Devices and Servers",
            "action": [
              "Create a rule that alerts when Windows Event ID 5156 shows a process name from a curated list of LOLBins (e.g., 'powershell.exe', 'cscript.exe', 'mshta.exe') in the 'Application' field initiating a connection where the 'DestAddress' field matches an IP address of a known code repository service.",
              "For each host, create a baseline of observed (Process Name, Destination IP) pairs from Windows Event ID 5156 over a 30-day period. Alert when a new pair is observed where the Destination IP belongs to a known code repository service and the Process Name is not on an allow-list of developer tools (e.g., 'git.exe', 'code.exe').",
              "For each host, train a one-class SVM classifier using features from Windows Event ID 5156, such as process name, destination port, and protocol, to learn a boundary of normal network connection behavior. Classify any new connection as an anomaly if it falls outside this boundary, especially if the destination IP is associated with a code repository."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]