[
  {
    "information_requirement": "Is the adversary evading defenses by using NTFS file attributes?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.004",
        "name": "NTFS File Attributes",
        "evidence": [
          {
            "description": "A process command line matches a known threat intelligence indicator for Alternate Data Stream (ADS) abuse, such as a specific file path and stream name combination used by known malware.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Symbolic: Scan all process creation command lines (Windows Event ID 4688) against a curated list of regular expressions and string literals derived from threat intelligence reports on malware using ADS. An exact match generates a high-severity alert.",
              "Statistical: For command lines that contain the ADS colon syntax (`:`), extract the parent file path and the stream name. Calculate the rarity of each parent file path and stream name across the enterprise over a 30-day rolling window. Flag combinations where both the path and stream name fall below the 5th percentile of frequency, indicating an unusually rare occurrence.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled command-line data (benign vs. malicious ADS usage). Use features such as command line length, character entropy, presence of system paths, and the extension of the stream (e.g., .exe, .dll). Apply the model to new process creation events involving ADS to classify them as suspicious or benign."
            ]
          },
          {
            "description": "A process not typically associated with ADS usage executes a command line or accesses a file containing ADS syntax ('filename:streamname').",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Web Servers, and Application Servers",
            "action": [
              "Symbolic: Create a rule that triggers on any process creation (Windows Event ID 4688) or file access (Windows Event ID 4663) event where the command line or object name contains the ADS syntax (`:`). Maintain an explicit allow-list of known-good processes that use ADS (e.g., 'explorer.exe' for 'Zone.Identifier', 'chrome.exe', 'msedge.exe'). Alert on any process not on this list.",
              "Statistical: For each process name, establish a baseline of its ADS usage frequency over a 30-day period. Calculate the mean and standard deviation of ADS-related events per process per day. Generate an alert when a process exhibits a spike in ADS activity, such as a count exceeding three standard deviations above its daily average.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on processes that utilize ADS. Feature engineer based on the parent process, user context, target file path, and time of day. Identify clusters of anomalous behavior that deviate from the large, well-defined clusters of benign activity (e.g., browser usage)."
            ]
          },
          {
            "description": "A file write operation to an Alternate Data Stream is followed within a short time window by a process execution from the same ADS path on the same host.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical System Directories (e.g., C:\\Windows\\System32), User Profile Directories, and Temporary File Directories",
            "action": [
              "Symbolic: Correlate file write events (Windows Event ID 4663 with a SACL) that have a TargetFilename containing ADS syntax (`:`) with subsequent process creation events (Windows Event ID 4688) where the Image or ProcessName matches the TargetFilename from the write event. A match on the same host within a 5-minute window constitutes a high-confidence detection.",
              "Statistical: Analyze the time delta between ADS write events and ADS execute events from the same file path. Profile the distribution of these time deltas for any known benign software. Flag any write-then-execute sequences where the time delta falls into an anomalous range (e.g., below the 1st percentile, suggesting immediate automated execution) that deviates from the established baseline.",
              "Machine Learning: Implement a time-series anomaly detection model (e.g., SARIMA or LSTM-based autoencoder) to monitor the rate of 'write-then-execute' events across the enterprise. This model can identify sudden spikes in this specific behavior, which could indicate a widespread campaign or worm-like activity not caught by individual correlation rules."
            ]
          },
          {
            "description": "A process, such as an Office application or web server, which does not normally interact with Alternate Data Streams, becomes the parent of a process that creates or modifies an ADS.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Microsoft Office Servers (e.g., Exchange), Web Servers (e.g., IIS), and User Workstations running Office applications",
            "action": [
              "Symbolic: Define a list of high-risk parent processes (e.g., 'WINWORD.EXE', 'EXCEL.EXE', 'POWERPNT.EXE', 'w3wp.exe', 'httpd.exe'). Create a rule that alerts any time a process on this list spawns a child process (Windows Event ID 4688) whose command line involves creating or executing from an ADS.",
              "Statistical: For all parent-child process relationships involving ADS, calculate the conditional probability of that relationship occurring, P(child | parent), based on a 90-day historical baseline. Alert on any parent-child-ADS event where the calculated probability is below a rarity threshold (e.g., <0.01%), indicating a suspicious lineage.",
              "Machine Learning: Model parent-child process relationships as a directed graph. Apply community detection algorithms to identify normal clusters of activity. When a new ADS-related process creation occurs, determine if the resulting parent-child edge connects two previously separate communities or creates a node with an anomalous 'centrality' score, indicating it is acting as a suspicious bridge between processes."
            ]
          },
          {
            "description": "A process running from an Alternate Data Stream initiates an outbound network connection, particularly to a non-standard port or a low-reputation IP address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ Servers, Internet Gateways, and Domain Controllers",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) where the image path contains ADS syntax (`:`) with network connection events (Windows Event ID 5156 or Zeek conn.log) originating from the same Process ID on the same host. Escalate the alert severity if the destination IP is on a threat intelligence blocklist.",
              "Statistical: For all network connections originating from processes running from ADS, analyze the destination ports, connection duration, and bytes sent/received (Zeek conn.log). Any connection with a non-zero data transfer or a duration longer than a few seconds should be flagged. Calculate the entropy of the destination port distribution for a given host; a sudden increase in entropy could indicate scanning or C2 activity from a hidden process.",
              "Machine Learning: Use time-series analysis on the aggregated outbound data volume (from Zeek conn.log 'orig_bytes') for all connections linked to ADS-based processes. A model trained to recognize beaconing behavior (e.g., regularly spaced connections with similar payload sizes) can detect C2 channels. A separate classification model can score the connection's suspiciousness based on features like destination IP reputation and JA3/JA3S hash rarity (from Zeek ssl.log)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]