[
  {
    "information_requirement": "Is the adversary using email hiding rules to evade detection or facilitate other malicious activities?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.008",
        "name": "Email Hiding Rules",
        "evidence": [
          {
            "description": "A Windows Event ID 4104 (PowerShell Script Block Logging) event containing the execution of `New-InboxRule` or `Set-InboxRule` where rule parameters, such as keywords or sender addresses, match high-confidence threat intelligence indicators.",
            "data_sources": [
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers (e.g., Exchange), User Endpoints",
            "action": "1. (Symbolic) Query Windows Event ID 4104 logs for script blocks containing `New-InboxRule` or `Set-InboxRule`. Extract rule parameters such as `-SubjectContainsWords`, `-BodyContainsWords`, and `-From`. Alert immediately if any parameter value matches an entry in a high-confidence threat intelligence feed of malicious domains, email addresses, or keywords. 2. (Statistical) For all created rules, calculate the Jaccard similarity score between the set of words in the rule's parameters and a corpus of known malicious keywords. Flag rules with a similarity score above the 95th percentile of all rule creations in the last 90 days. 3. (ML) Train a logistic regression classifier on historical rule data, labeled as benign or malicious. Use features such as the presence of IOCs, the length of the rule name, the action taken (e.g., `DeleteMessage`), and the folder targeted. Use the model to assign a real-time risk score to each new rule creation event."
          },
          {
            "description": "A Windows Event ID 4688 (Process Creation) event for `powershell.exe` with command-line arguments indicating inbox rule modification (`New-InboxRule`, `Set-InboxRule`), where the executing user, host, or time of day is anomalous.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, User Endpoints, Mail Servers (e.g., Exchange)",
            "action": "1. (Symbolic) Join Windows Event ID 4688 (Process Creation) with Windows Event ID 4104 (Script Block Logging) on Process ID. Alert if the command line in 4688 contains `New-InboxRule` or `Set-InboxRule` and the executing user account is a service account not explicitly whitelisted for Exchange management. 2. (Statistical) For each user, establish a baseline of normal rule creation activity, including typical hours and source hosts. Calculate a multi-dimensional Z-score for each new rule creation event based on its deviation from the user's historical mean time-of-day and a categorical flag for non-standard source host. Flag events where the combined score exceeds a threshold (e.g., > 3). 3. (ML) Use an Isolation Forest model to detect anomalies in rule creation events. Featureize each event with user role, time of day (as a cyclical feature), day of week, and a one-hot encoded representation of the source host's role (e.g., DC, user workstation). The model will identify events that are outliers in this multi-dimensional space."
          },
          {
            "description": "A Windows Event ID 4104 log on a mail server showing the execution of `New-TransportRule` or `Set-TransportRule` with parameters designed to intercept or delete emails containing security-related keywords.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers (e.g., Exchange)",
            "action": "1. (Symbolic) On Exchange servers, monitor Windows Event ID 4104 for `New-TransportRule` or `Set-TransportRule`. Alert if the rule's `-SubjectOrBodyContainsWords` parameter contains generic security terms like 'phishing', 'incident', 'suspicious', 'breach', 'alert' AND the rule action is `DeleteMessage` or `RedirectMessage` to an external address. 2. (Statistical) Maintain a historical frequency distribution of words used in the `-SubjectOrBodyContainsWords` parameter of all transport rules. Calculate the inverse document frequency (IDF) for each word. Flag any new rule where the sum of the IDF scores for its keywords exceeds the 99th percentile, indicating the use of unusually specific or rare terms. 3. (ML) Develop a Naive Bayes classifier to predict if a transport rule is malicious. Train the model on a labeled dataset of transport rules, using the words in the condition parameters and the type of action (e.g., Delete, Redirect) as features. Deploy the model to score all new transport rules and flag those with a high probability of being malicious."
          },
          {
            "description": "A Windows Event ID 4104 log event showing an inbox rule being created that combines generic suspicious keywords (e.g., 'invoice', 'password') with a hiding action (`-DeleteMessage $true`, `-MoveToFolder` to a non-standard folder like 'RSS Feeds').",
            "data_sources": [
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Mail Servers (e.g., Exchange)",
            "action": "1. (Symbolic) Search Windows Event ID 4104 for `New-InboxRule` script blocks. Flag any event where `-BodyContainsWords` or `-SubjectContainsWords` includes terms from a 'watch list' (e.g., 'invoice', 'payment', 'password reset') AND the action is `-DeleteMessage $true` or the `-MoveToFolder` parameter specifies a low-visibility folder (e.g., 'RSS Feeds', 'Junk E-mail', 'Notes'). 2. (Statistical) For all rule creations, calculate the Shannon entropy of the destination folder name specified in `-MoveToFolder`. A high entropy score can indicate a randomly generated or obfuscated folder name. Flag rules where the folder name entropy is in the top 5% of all observed folder names. 3. (ML) Use a time-series anomaly detection model (e.g., ARIMA) on the daily count of rules created with the `DeleteMessage` action across the enterprise. An unexpected spike in the creation of deleting rules, which deviates significantly from the forecasted trend, should trigger an investigation."
          },
          {
            "description": "Anomalous network traffic, such as connections to first-seen domains or high-volume data transfers, originating from a user's host within 60 minutes after an email hiding rule is created on that user's account.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4104",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, User Endpoints, DNS Servers",
            "action": "1. (Symbolic) Correlate the timestamp of a rule creation event (from Windows Event ID 4104) with Zeek dns.log and conn.log events from the same source IP in the following 60 minutes. Alert if the host resolves a domain never seen before in the organization (first-seen) and subsequently establishes a long-lived connection or transfers over 10MB of data to the resolved IP. 2. (Statistical) For each user host, maintain a 30-day rolling baseline of outbound data transfer volume (sum of `orig_bytes` in Zeek conn.log) per destination country. After a rule creation event, if the host initiates a connection to a country it has not connected to in the last 30 days and the data volume exceeds 3 standard deviations above the user's overall daily average, flag it as suspicious. 3. (ML) Train a sequence-based model (e.g., LSTM) on user activity logs (process, file, network events). Feed the model a sequence of events leading up to and following a rule creation to identify anomalous post-rule-creation sequences of network activity indicative of C2 or exfiltration."
          },
          {
            "description": "A Windows Event ID 4663 (Object Access) event showing a non-standard process (e.g., `cmd.exe`, `wscript.exe`, or an unsigned executable) writing to Outlook rule files (e.g., `.rwz`, `.pst`, `.ost`) or associated registry keys.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints",
            "action": "1. (Symbolic) Monitor Windows Event ID 4663 for write access attempts on Outlook file types (`*.pst`, `*.ost`, `*.rwz`). Cross-reference the Process ID with Windows Event ID 4688 to get the process name. Alert if the process name is not on an approved list of mail clients and backup utilities (e.g., `outlook.exe`). 2. (Statistical) Establish a baseline of processes that legitimately write to these files. For each file write event, calculate a rarity score for the parent process of the writing process (from Event ID 4688). A high rarity score (e.g., a parent process seen less than 1% of the time) indicates anomalous execution flow and should be investigated. 3. (ML) Use a one-class SVM (Support Vector Machine) trained on legitimate file modification events. Featureize events by process name, parent process name, user context, and time of day. The model will create a boundary around normal activity, and any event that falls outside this boundary is flagged as a potential anomaly."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]