[
  {
    "information_requirement": "Has the adversary staged data for exfiltration by compressing or encrypting it using a third-party library?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1560.002",
        "name": "Archive via Library",
        "evidence": [
          {
            "description": "A process creation event is observed where the executable's file hash matches an entry on a threat intelligence list of malicious or suspicious archiving tools.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, File Servers, Critical Application Servers, Developer Workstations, Executive Laptops",
            "action": [
              "Join process creation events (Windows Event ID 4688) with a threat intelligence feed of known malicious file hashes (MD5, SHA256). Generate a high-severity alert for any process execution where the hash is an exact match.",
              "For each process hash observed in Windows Event ID 4688, calculate its enterprise-wide prevalence (percentage of endpoints where it has been seen). Flag process hashes that are exceptionally rare (e.g., present on < 0.5% of endpoints) and whose process names contain substrings like 'zip', 'rar', 'archive', 'compress', or '7z'.",
              "Train a binary classification model (e.g., XGBoost, Random Forest) on features from process creation events, including process name string length, parent process name, command-line argument count, and the statistical prevalence of the process hash. Use a labeled dataset of known-benign and known-malicious archiver executions to predict if a new execution is malicious."
            ]
          },
          {
            "description": "A scripting interpreter (e.g., python.exe, pwsh.exe) or a legitimate compiled binary is observed being executed with command-line arguments that explicitly call functions from data compression or archival libraries.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Web Servers, Application Servers, CI/CD Build Servers, Code Repositories",
            "action": [
              "Create a detection rule that scans the command-line field from process creation events (Windows Event ID 4688) for the co-occurrence of a script interpreter (e.g., 'python.exe', 'pwsh.exe') and keywords for archiving modules or functions (e.g., 'zipfile', 'rarfile', 'Compress-Archive', 'System.IO.Compression', 'zlib'). Alert if the command also targets sensitive user or system directories.",
              "For all command-line executions matching the keywords above, calculate the Shannon entropy of the command-line string. Establish a baseline entropy score for legitimate scripts and flag executions with anomalously high entropy scores (> 95th percentile), which can indicate obfuscation. Also, track the frequency of specific archive commands per user and alert on significant deviations from their individual baseline (e.g., > 3 standard deviations above the mean).",
              "Use a clustering algorithm (e.g., DBSCAN) on command-line arguments after tokenizing them into feature vectors (e.g., using TF-IDF). This can automatically group similar command executions to define normal behavior. Outlier clusters or small, isolated clusters may represent novel or rare adversary activity that does not match predefined symbolic patterns."
            ]
          },
          {
            "description": "A process associated with a system service or non-interactive application (e.g., w3wp.exe, sqlservr.exe, svchost.exe) creates a file with a common archive extension (.zip, .rar, .7z, .tar.gz).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Application Servers (DMZ), Database Servers, Internal File Shares, System Temporary Directories (e.g., C:\\Windows\\Temp)",
            "action": [
              "Create a rule that joins file creation events (from Windows Event ID 4663 where Object Name ends in .zip, .rar, etc.) with the parent process information (from Windows Event ID 4688). Alert if the creating process name is on a watchlist of typically non-interactive or sensitive processes (e.g., 'w3wp.exe', 'sqlservr.exe', 'lsass.exe', 'svchost.exe').",
              "For each process name in the environment, build a historical profile of the file extensions it commonly creates. Calculate the conditional probability $$ P(\\text{extension} | \\text{process_name}) $$. Generate a medium-severity alert when a process creates an archive file if this is a zero-probability event (first time ever seen) or if the calculated probability is below a very low threshold (e.g., < 0.01).",
              "Develop an anomaly detection model using a One-Class SVM or an Autoencoder. Train the model on features derived from file creation events, including the creating process name, parent process name, file path, and file extension. Once trained on a baseline of normal activity, the model can identify any file creation event that is a significant outlier, such as 'svchost.exe' creating a '.zip' file in 'C:\\Perflogs'."
            ]
          },
          {
            "description": "A single process is observed reading an anomalously large number of files or unique directories within a short time window, immediately followed by the same process writing a new file with an archive extension.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Profile Directories (Documents, Desktop), Network-mapped Drives, SharePoint Sites, Source Code Repositories",
            "action": [
              "Define a stateful detection rule that triggers if a single Process ID is responsible for a high number of file read operations (Windows Event ID 4663 with Accesses: ReadData), such as >200, within a 60-second window, followed by a file write operation from the same Process ID to a new file with a .zip, .rar, or .7z extension.",
              "Over a 5-minute sliding window per host, calculate the number of unique directories accessed per process. Correlate a spike in this 'directory traversal entropy' that exceeds the 95th percentile of that process's historical behavior with the subsequent creation of an archive file by the same process within the next minute.",
              "Implement a time-series forecasting model (e.g., Prophet, LSTM) for each host's aggregate file system read operations. The model learns the normal rhythm of file activity (e.g., daily/weekly seasonality). An alert is generated when the model detects a statistically significant, unpredicted spike in file read events that is temporally correlated with a file creation event for an archive file."
            ]
          },
          {
            "description": "A file creation event for an archive file is observed on a host, followed within a short time window by an outbound network connection from the same host to an external destination, especially one that is low-reputation or previously unseen.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (Firewalls, Proxies), DNS Servers, Endpoint Devices, Critical Servers",
            "action": [
              "Create a correlation rule that looks for a file creation event (Windows Event ID 4663 for an object name ending in .zip, .rar, etc.) on Host A, followed within 5 minutes by a network connection event (from Zeek conn.log where id.orig_h is Host A's IP) to an external IP address on a threat intelligence watchlist.",
              "For each host, build a statistical baseline of typical outbound connection destinations (countries, ASNs) and data volumes (sum of 'orig_bytes' in Zeek conn.log). When an archive creation event is detected on a host, flag any subsequent outbound connections from that host where the destination ASN is rare for that host (seen in <1% of historical connections) or the total bytes sent is an outlier (>98th percentile of typical outbound flows).",
              "Use a graph-based analysis where hosts and external IPs are nodes and network connections are edges. When an archive creation event occurs on a host node, temporarily increase its risk score. A pathfinding algorithm can then identify high-risk sequences, such as the 'at-risk' host connecting to an external node that belongs to a low-reputation community (group of IPs with poor threat intel scores) or has features (e.g., non-standard port, high entropy domain) identified as suspicious by a separate classifier."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]