[
  {
    "information_requirement": "Has the adversary gained initial access to the network via spearphishing link?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1566.002",
        "name": "Spearphishing Link",
        "evidence": [
          {
            "description": "Outbound network connection (TCP/UDP, DNS, HTTP/S) from an internal host to a destination IP address, domain, or server name that is present on a high-confidence threat intelligence feed categorized as phishing, malware C2, or recently compromised.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), DNS resolvers.",
            "action": "1. (Symbolic) Continuously join outbound network logs (Zeek conn.log `id.resp_h`, dns.log `query`, http.log `host`, ssl.log `server_name`) against a high-confidence threat intelligence feed of known malicious indicators (IPs, domains). Generate a high-severity alert for any direct match. 2. (Statistical) For any matched domain, calculate the number of distinct internal hosts making the connection over the last 30 days. If the count is below the 5th percentile of 'hosts per domain' for all outbound traffic, increase the alert's risk score, as this suggests targeted activity. 3. (Machine Learning) Feed all outbound URLs (from http.log and derived from other logs) into a supervised classification model trained to identify malicious URLs based on lexical features (e.g., length, entropy, keyword presence like 'login', character distribution) and reputation features (domain age, ASN prevalence). An event that is both a CTI match and has a high malicious probability score from the model should be escalated for immediate investigation."
          },
          {
            "description": "An outbound HTTP POST request to a non-corporate, low-reputation domain containing form data field names commonly associated with credential theft (e.g., 'user', 'pass', 'login', 'password', 'pin') in the POST body.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxy servers, network taps at internet gateways.",
            "action": "1. (Symbolic) Apply a ruleset of regular expressions to the URI and POST body (if available) in Zeek http.log to detect common credential harvesting field names (e.g., 'username', 'password', 'email', 'ssn'). Alert on any match directed to an external, non-whitelisted domain. 2. (Statistical) For any alerts generated, calculate the Shannon entropy of the destination URI. Compare this value against a learned baseline of URI entropy for the destination domain or the user's typical activity. An entropy score in the top 5th percentile is a strong indicator of a targeted phishing landing page. Also, flag destination domains that receive credential posts from a statistically insignificant number of internal hosts (e.g., < 3). 3. (Machine Learning) Use a time-series model (e.g., ARIMA) to monitor the volume of HTTP POSTs per user to external domains. A sudden, anomalous spike that deviates significantly from the user's predicted behavior, especially when combined with symbolic or statistical triggers, should be flagged as a high-confidence event."
          },
          {
            "description": "A file with a high-risk extension or MIME type (e.g., .iso, .hta, .lnk, .zip containing these types) is downloaded from an external domain that is newly registered (e.g., < 30 days old) or has a low reputation score.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, host endpoints, DNS resolvers.",
            "action": "1. (Symbolic) Create a watch list of high-risk MIME types ('application/hta', 'application/x-iso9660-image', 'application/x-ms-shortcut', 'application/zip') and file extensions. Alert when a file on this list is downloaded (Zeek files.log) from an external domain with a low reputation score or an age of less than 30 days. 2. (Statistical) Calculate a rarity score for each file download based on the enterprise-wide frequency of its MIME type/source domain pair. A download with a rarity score in the 99th percentile (e.g., a .hta from a domain never before seen serving .hta files) should be considered highly suspicious. 3. (Machine Learning) Train a classifier (e.g., Random Forest) to predict the likelihood of a download being malicious. Features should include file size, MIME type, source domain reputation, ASN, domain age, and the entropy of the filename. A high probability score from the model should trigger an alert for analyst review, even without a direct IOC match."
          },
          {
            "description": "A browser process (e.g., chrome.exe, msedge.exe) spawns a direct child process that is a command interpreter (cmd.exe, powershell.exe), scripting engine (wscript.exe, cscript.exe), or an unsigned binary, within 5 minutes of the browser accessing an external URL.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, VDI instances, network web proxies.",
            "action": "1. (Symbolic) Using Windows Event ID 4688, alert on any instance where a browser process (e.g., chrome.exe, msedge.exe, firefox.exe) is the parent of a process from a watchlist including cmd.exe, powershell.exe, wscript.exe, cscript.exe, mshta.exe, certutil.exe. 2. (Statistical) Maintain a baseline of all parent-child process relationships observed in the environment. Calculate the enterprise-wide rarity of each relationship. Flag any browser-initiated process creation that is statistically rare (e.g., observed on <0.1% of endpoints). Additionally, calculate the entropy of the command line for child processes; flag those in the 98th percentile as potentially obfuscated. 3. (Machine Learning) Model process lineage using a sequence-based model (e.g., LSTM) trained on normal process chains. Feed process creation events (parent, child, command line) into the model. An event sequence with a high prediction error (i.e., the model finds the sequence highly improbable) indicates an anomaly, such as a browser unexpectedly spawning a shell to download a second stage."
          },
          {
            "description": "An outbound network connection is observed from a user's host to a domain that was present as a URL in an email delivered to that same user within the last 10 minutes. The suspiciousness is increased if the domain is newly registered or has a low/no reputation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek smtp.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email gateway, DNS resolvers, network egress points.",
            "action": "1. (Symbolic) Extract all domains from URLs in inbound emails (Zeek smtp.log or email gateway logs) and correlate them with the recipient. If a recipient's host initiates a connection (Zeek dns.log/conn.log) to a domain from an email they received within the last 15 minutes, generate an alert. 2. (Statistical) Analyze the click-through rate (CTR) for every link delivered via email. A link with a very low CTR (e.g., <1% of recipients clicked) but which resulted in a connection should be considered suspicious, as it may indicate a highly targeted phish. Prioritize investigation for these low-prevalence clicks. 3. (Machine Learning) Model the temporal relationship between email receipt and outbound web traffic for each user. Use anomaly detection (e.g., a clustering algorithm like DBSCAN on features like time-of-day, day-of-week, time-delta-from-receipt) to identify clicks that fall outside a user's normal behavioral clusters, which could indicate a compromised session or a particularly effective social engineering lure."
          },
          {
            "description": "A DNS query for a domain name that has characteristics of algorithmic generation (high entropy), homoglyphs of a known brand, or typosquatting of a corporate domain, and is queried by a statistically insignificant number of hosts.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal and external DNS resolvers.",
            "action": "1. (Symbolic) For each DNS query in Zeek dns.log, compare the queried domain against a list of high-value internal and external domains using a homoglyph detection algorithm. Alert on any visually confusable domain. 2. (Statistical) Calculate the Shannon entropy for every newly observed domain. Establish a baseline and flag domains with entropy scores in the 95th percentile or higher as potentially DGA-related. Further, count the number of distinct hosts querying each domain; a suspicious domain queried by fewer than 3 hosts is a strong signal of a targeted attack. 3. (Machine Learning) Use a pre-trained or custom-trained classification model to score every requested domain based on lexical features (length, entropy, vowel-consonant ratio, numeric character ratio, TLD). Domains receiving a 'malicious' probability score above a set threshold (e.g., 0.90) should generate an alert, which is then enriched with host-count and other statistical data."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]