[
    {
        "information_requirement": "Is the adversary impairing defenses to evade detection?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1562",
                "name": "Impair Defenses",
                "evidence": [
                    {
                        "description": "Execution of processes with file hashes known to be associated with defense impairment tools or specific malware families.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688 or equivalent that includes process hash information). Correlate the captured file hashes against a high-confidence cyber threat intelligence feed of known malicious executables specifically designed for or known to include defense impairment capabilities (e.g., PCHunter, GMER, specific malware families). An alert on any confirmed hash match represents a high-fidelity indicator of defense evasion activity."
                    },
                    {
                        "description": "Execution of command-line arguments or scripts specifically targeting the termination, disabling, or misconfiguration of known security tools, services, or logging configurations.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for command-line arguments containing patterns used to disable defenses. This includes service controls (`sc stop`, `sc config <service> start=disabled`), process termination (`taskkill /f /im <av_process>.exe`), firewall manipulation (`netsh advfirewall set`), audit policy changes (`auditpol /clear`), or registry modifications (`reg delete HKLM\\...`). Correlate these commands with registry modification events (Windows Event ID 4657) targeting known security product keys. Use correlation analysis to link these commands to parent processes and user accounts, flagging any execution outside of authorized administrative activity."
                    },
                    {
                        "description": "Execution of commands specifically intended to clear or tamper with Windows Event Logs.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 1102"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for the execution of `wevtutil.exe` with arguments indicating log clearing (e.g., `wevtutil cl Security`, `wevtutil cl System`). Also, monitor directly for Windows Event ID 1102 (The audit log was cleared). Alert on any occurrence of Event ID 1102 or the suspicious use of `wevtutil.exe`, as these actions are highly indicative of an adversary attempting to cover their tracks. Use descriptive statistics to identify any rare or unauthorized executions of `wevtutil.exe`."
                    },
                    {
                        "description": "An anomalous and sudden cessation of logs from critical security tools (e.g., AV, EDR), system logging services, or entire hosts, indicating potential tampering or failure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 7036"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of log volume and frequency for each critical host and security service using a log aggregation platform. Use time series analysis (e.g., moving averages, exponential smoothing) on log flow rates to detect statistically significant drops or complete cessations ('flat-lining'). Correlate detected log drops with service stop events (Windows Event ID 7036) on the source host or the blocking of outbound logging traffic (analyzed via Zeek conn.log to logging infrastructure). Investigate any host that stops sending security logs without a scheduled maintenance event."
                    },
                    {
                        "description": "A behavioral sequence of a suspicious process being created, followed by the termination of security services or clearing of logs from the same host.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 7036",
                            "Windows Event ID 1102"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and monitor for a behavioral sequence of events occurring within a short time window (e.g., 5 minutes) on a single host. The sequence includes: 1) A process is created from an unusual path (e.g., `%APPDATA%`, `%TEMP%`) or by a non-standard parent process (e.g., `winword.exe` spawning `powershell.exe`) via Windows Event ID 4688. 2) The same host subsequently logs a service stop event for a known security service (Windows Event ID 7036) or a log clearing event (Windows Event ID 1102). Use correlation analysis on the hostname and timestamp to detect this TTP chain, which is a strong indicator of active defense evasion."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
