[
  {
    "information_requirement": "Has the adversary gained initial access to the network via phishing?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1566",
        "name": "Phishing",
        "evidence": [
          {
            "description": "An email (smtp.log), web connection (http.log, conn.log), or file download (files.log) involves an indicator (URL, domain, IP address, file hash) that is present in an active threat intelligence feed.",
            "data_sources": [
              "Zeek files.log",
              "Zeek smtp.log",
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Web Proxy, DNS Resolvers, User Endpoints",
            "action": [
              "Symbolic: Continuously ingest CTI feeds of malicious indicators. Create a search that joins Zeek log fields (e.g., smtp.log.helo, dns.log.query, conn.log.id.resp_h, files.log.md5, http.log.host) against the CTI data. Generate a high-severity alert for any match.",
              "Statistical: For each CTI source, track the daily hit rate. Alert if the hit rate for any single source drops to zero, indicating a potential feed ingestion failure. Calculate the historical probability of an indicator type (e.g., URL vs. IP) appearing in logs and flag if a rare indicator type suddenly spikes in frequency over a 24-hour window.",
              "Machine Learning: Use a supervised classification model (e.g., Gradient Boosting) trained on features from CTI (indicator type, threat score, source reputation) and log data (protocol, port, connection duration) to predict the likelihood of a true positive match. Prioritize alerts with a prediction score above a pre-determined threshold (e.g., 0.9)."
            ]
          },
          {
            "description": "An email's metadata (smtp.log) or attachment (files.log) exhibits characteristics common in phishing campaigns, such as header spoofing, suspicious subject lines, or deceptive filenames.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Mail Servers",
            "action": [
              "Symbolic: Using regular expressions, scan smtp.log for subject lines with keywords like 'Urgent', 'Invoice', 'Action Required', 'Password Reset'. Scan files.log for attachments with double extensions (e.g., 'invoice.pdf.exe') or extensions common in malware delivery (e.g., .iso, .vbs). Alert on mismatches between header fields like 'From:' and 'Return-Path:' or 'Reply-To:' in smtp.log.",
              "Statistical: Profile the frequency of all observed 'X-' headers in smtp.log over a 30-day rolling baseline. Alert on the appearance of a new 'X-' header not present in the baseline. Calculate the character-level entropy of email subject lines; flag subjects with an entropy score exceeding the 98th percentile of the established baseline, suggesting potential randomization or obfuscation.",
              "Machine Learning: Train a Naive Bayes classifier on a labeled dataset of phishing and benign email bodies and subjects. Apply the model to all incoming emails parsed in smtp.log to generate a real-time phishing probability score. Use an NLP topic modeling technique like Latent Dirichlet Allocation (LDA) to identify emerging campaign themes from email bodies and flag clusters of emails that deviate from established benign topics."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) shows an office application, browser, or email client spawning a command-line interpreter or scripting engine, which is a common post-exploitation step after a successful phish.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Virtual Desktop Infrastructure (VDI) fleet, Application Servers",
            "action": [
              "Symbolic: Alert on any instance where a parent process (e.g., 'outlook.exe', 'winword.exe', 'excel.exe', 'acrord32.exe', 'chrome.exe') spawns a child process such as 'powershell.exe', 'cmd.exe', 'wscript.exe', 'cscript.exe', or 'mshta.exe' using Windows Event ID 4688.",
              "Statistical: Build a baseline of all parent-child process relationships observed across the enterprise over 30 days and calculate the rarity of each. Generate a medium-severity alert for any relationship that occurs fewer than 5 times in the baseline, and a high-severity alert for a relationship that is completely new.",
              "Machine Learning: Model process execution chains as a directed graph where nodes are processes and edges are parent-child relationships. Use a graph analytics algorithm (e.g., centrality measures) to find anomalous paths (e.g., paths with rare nodes/edges). Train a one-class SVM on features extracted from PowerShell script blocks (Windows Event ID 4104), such as script length, character distribution entropy, and API call frequency, to detect obfuscated or malicious scripts."
            ]
          },
          {
            "description": "A multi-stage event sequence is observed within a short time window (e.g., 5 minutes): 1) a DNS query for a domain, 2) a subsequent HTTP/S connection to the resolved IP, and 3) a data upload (HTTP POST), where the domain is newly registered or has a low reputation.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Resolvers, Web Proxy, User Endpoints",
            "action": [
              "Symbolic: Within a 5-minute window per user, correlate dns.log queries with URLs found in smtp.log or clicked links in http.log. If a queried domain matches, check external WHOIS data via an API. Alert if the domain was registered within the last 30 days. If a subsequent http.log event shows a POST request to that domain, or conn.log shows a large orig_bytes count, elevate the alert severity.",
              "Statistical: For all domains visited via HTTP/S, calculate the ratio of bytes sent vs. bytes received (orig_bytes / resp_bytes in conn.log). Establish a baseline for this ratio across all web traffic. Alert when this ratio for a single connection to a rare domain (seen < 10 times in 30 days) exceeds the 99th percentile. Also, calculate the rarity of JA3/JA3S hashes in ssl.log; flag connections to new domains that use a rare client fingerprint.",
              "Machine Learning: Use time-series analysis (e.g., ARIMA) on dns.log data to forecast the expected volume of queries to newly observed domains. Flag any time window where the actual volume significantly exceeds the forecasted confidence interval. Use a clustering algorithm (e.g., DBSCAN) on features from http.log (URI length, user agent, POST body size) to group similar web requests; flag small, distinct clusters as they may represent targeted phishing activity."
            ]
          },
          {
            "description": "An email is received from an external domain that is either new to the organization or is exhibiting a volume or recipient pattern that is statistically anomalous compared to its historical baseline, or fails authentication checks.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Mail Servers",
            "action": [
              "Symbolic: Maintain a state table of all sender-domain/recipient pairs seen in the last 90 days. Generate a low-severity alert when an email is received from a sender domain that has never communicated with any internal recipient before. Escalate to high severity if the email also fails SPF/DKIM/DMARC checks as indicated in the smtp.log headers.",
              "Statistical: For each external sender domain, create a time-series baseline of daily email volume. Alert if the volume on a given day exceeds 3 standard deviations above the 30-day moving average. Separately, calculate the entropy for the distribution of recipients per sender domain; a sudden drop in entropy (approaching zero) indicates a shift from broad to targeted sending and should be flagged.",
              "Machine Learning: Train an autoencoder on feature vectors representing normal email traffic (e.g., hour of day, sender TLD, number of recipients, mail client string). Use the model to calculate a reconstruction error for each new email event in smtp.log. Emails with a high reconstruction error are anomalous and potentially part of a novel phishing campaign."
            ]
          },
          {
            "description": "A user browses to a newly registered or low-reputation domain and submits data via an HTTP POST request, consistent with credential submission on a phishing page. This is often followed by a successful login from an anomalous location.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Proxy, DNS Resolvers, Domain Controllers, VPN Concentrators",
            "action": [
              "Symbolic: Correlate HTTP POST events (http.log) to domains registered in the last 30 days (from dns.log + WHOIS). If the POST body size is between 50-500 bytes (typical for credentials), flag it. If this is followed within 15 minutes by a successful login (Windows Event ID 4624) for the same user from an IP geolocated to a foreign country or a non-corporate ASN, escalate to a critical alert.",
              "Statistical: For each user, baseline the set of domains to which they normally perform HTTP POSTs. Alert when a user POSTs to a domain not in their historical 90-day baseline. Separately, calculate the percentile of orig_bytes in conn.log for all HTTP/S POSTs. Flag POSTs to rare domains that are above the 95th percentile for orig_bytes.",
              "Machine Learning: Train a supervised classifier (e.g., Random Forest) to identify credential phishing pages. Features could include: presence of login-related keywords ('signin', 'password', 'login') in the URI, domain age, and TLS certificate properties (e.g., self-signed, short validity). Use a clustering algorithm on login events (Windows Event ID 4624) based on features like time-of-day, source IP/ASN, and client device to identify anomalous login clusters."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]