[
  {
    "information_requirement": "Has the adversary gained initial access to the network via spearphishing voice? (PIR)",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1566.004",
        "name": "Spearphishing Voice",
        "evidence": [
          {
            "description": "An endpoint's network traffic shows a connection (DNS query, HTTP request, or direct TCP connection) to a destination URL, domain, or IP address present on a high-confidence threat intelligence feed specifically tracking vishing or social engineering campaigns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, web proxies), Corporate DNS resolvers, VPN concentrators",
            "action": [
              "Query Zeek logs to match the 'query' field in dns.log, 'host' field in http.log, and 'id.resp_h' field in conn.log against a threat intelligence list of domains and IPs known to be associated with vishing campaigns. Generate a high-severity alert upon any match.",
              "For all domains in dns.log, calculate their request frequency across the enterprise over a 30-day window. Isolate domains in the bottom 1st percentile of prevalence (i.e., 'long-tail' domains). Enrich these rare domains with WHOIS data and flag any registered within the last 30 days or with privacy-protected registration details.",
              "Deploy a pre-trained classification model to score domain names from dns.log based on lexical features (e.g., entropy, length, n-grams, presence of brand names in a phonetically similar or misspelled way). Investigate domains that are not on an organizational allow-list and receive a high 'malicious' score from the model, prioritizing those also flagged by statistical methods."
            ]
          },
          {
            "description": "A process for a non-approved remote access tool (e.g., AnyDesk, TeamViewer, GoToAssist, RustDesk, ScreenConnect) is created on an endpoint, and the parent process is not an authorized software deployment or IT administration tool (e.g., SCCM, Intune, Tanium).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, Virtual Desktop Infrastructure (VDI) instances, Help desk operator consoles",
            "action": [
              "Create a detection rule for Windows Event ID 4688 where 'NewProcessName' matches a watchlist of unauthorized remote access tool executables and the 'CreatorProcessName' is not on an allow-list of legitimate administrative tools (e.g., CcmExec.exe, IntuneManagementExtension.exe, TaniumClient.exe).",
              "For all process creation events (Event ID 4688), calculate the prevalence of each 'NewProcessName' across all endpoints. Alert on executions of processes that have run on fewer than 1% of all endpoints in the last 30 days, as this indicates rare or non-standard software installation.",
              "Apply a clustering algorithm (e.g., DBSCAN) to process execution events using features like process name, parent process name, command line length, and user context. Isolate and investigate small, dense clusters that do not align with known benign software deployment or execution patterns, particularly if they contain known remote access tool names."
            ]
          },
          {
            "description": "A command-line interpreter (e.g., powershell.exe, cmd.exe, cscript.exe, mshta.exe) is executed with arguments containing indicators of obfuscation (e.g., Base64), remote file download, or security control modification.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Laptops, Application servers, Domain Controllers",
            "action": [
              "Scan command-line arguments in Event ID 4688 and script block content in Event ID 4104 using regular expressions for patterns like '-enc', 'DownloadString', 'Invoke-Expression', 'IEX', 'Set-MpPreference -DisableRealtimeMonitoring', and Base64-encoded strings with PowerShell headers.",
              "For every powershell.exe and cmd.exe execution, calculate the Shannon entropy of its command-line arguments. Establish a baseline entropy distribution and flag any command with an entropy score exceeding the 99th percentile. Also, baseline command length per user and flag commands longer than 3 standard deviations from the user's average.",
              "Train a logistic regression or gradient boosting classifier on a labeled dataset of malicious and benign PowerShell script blocks (Event ID 4104). Use features like character frequency, function call counts, presence of specific keywords, and entropy. Deploy the model to score all new script blocks in near-real-time and alert on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "On a single endpoint, a sequence of correlated events occurs within a 5-minute window: 1) a web request to a newly observed or low-reputation domain, 2) a download of an executable or archive file, and 3) the execution of a new process from a user-writable path (e.g., %USERPROFILE%\\Downloads) that matches the downloaded filename.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and laptops, Network egress points (e.g., web proxies), Cloud storage sync folders",
            "action": [
              "Implement a stateful SIEM rule that correlates events by hostname/IP. The rule should trigger when a Zeek http.log event to a suspicious domain is followed within 5 minutes by a Zeek files.log event for a MIME type of 'application/x-dosexec' or 'application/zip', which is then followed by a Windows Event ID 4688 from a user-writable directory where the new process name corresponds to the downloaded file.",
              "Analyze process lineage to identify rare parent-child relationships. Flag sequences where a browser (e.g., chrome.exe) or communication client (e.g., outlook.exe) spawns a process that subsequently executes a file downloaded from the internet, if this sequence is statistically rare (<0.1% of all such sequences) for the enterprise.",
              "Utilize a sequence analysis model, such as a Long Short-Term Memory (LSTM) network, trained on sequences of user events (web requests, file downloads, process executions). The model learns normal behavioral sequences. Alert when a new sequence of events from a user has a high anomaly score, indicating it deviates significantly from their established patterns."
            ]
          },
          {
            "description": "A user account, after being coached via a vishing call, experiences a rapid burst of MFA push notification challenges (>5 events in 2 minutes) which are denied or time-out, immediately followed by a successful authentication from a geographically anomalous source IP address.",
            "data_sources": [
              "Azure AD Sign-in logs",
              "Duo Authentication logs",
              "Okta System Log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud identity provider platforms (e.g., Azure AD, Okta), VPN concentrators, On-premise Active Directory Federation Services (ADFS)",
            "action": [
              "Create a SIEM rule that triggers when a single user's account in cloud identity logs shows a count of 'MFA challenge denied' or 'MFA challenge timeout' events exceeding 5 within a 2-minute window, immediately followed by a 'MFA challenge success' event for the same user.",
              "For each user, baseline the hourly rate and geographic source of MFA prompts. Use a Z-score to detect anomalous spikes in prompt volume (>3 standard deviations above the mean). If an alert is generated, cross-reference the source IP of the successful login with the user's 30-day history of login locations and flag if it originates from a new or rare country/ASN.",
              "Apply a time-series anomaly detection algorithm (e.g., SARIMA or Prophet) to the stream of MFA events per user, segmented by hour and day-of-week. The model will learn the user's typical authentication rhythm. Alert on any event sequence that is a statistically significant outlier from the predicted pattern, indicating a potential MFA fatigue attack."
            ]
          },
          {
            "description": "Following other suspicious activity on an endpoint, the device establishes a long-lived (>1 hour) or high-volume (>20MB) outbound TCP connection over a non-standard port to an external IP address not seen in the organization's network traffic within the last 90 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, web proxies), User workstations and laptops, Server subnets",
            "action": [
              "Query Zeek conn.log for outbound connections where the destination IP is not on an allow-list and has not been seen in the last 90 days, the duration is > 3600 seconds, and the destination port is not in the set {80, 443, 53}. Correlate with recent endpoint alerts for the source host.",
              "For each internal host, baseline the 99th percentile for connection duration and total bytes transferred using Zeek conn.log data. Alert on any new connection exceeding these host-specific thresholds. Additionally, calculate the enterprise-wide prevalence of JA3/JA3S hashes from Zeek ssl.log and flag connections using a hash seen in <0.01% of TLS sessions.",
              "Train an autoencoder neural network on feature vectors derived from Zeek conn.log sessions (e.g., duration, byte counts, protocol, port, TCP flags, state). This model learns to reconstruct 'normal' connections with low error. Process all new connections through the model and investigate any with a high reconstruction error, as they represent anomalous network behavior potentially indicative of C2."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]