[
    {
        "information_requirement": "Is the adversary moving laterally through the network using remote service session hijacking?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1563",
                "name": "Remote Service Session Hijacking",
                "evidence": [
                    {
                        "description": "Execution of known remote session hijacking tool executables identified by name or file hash.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for the execution of known session hijacking or credential access tools that enable hijacking (e.g., 'Mimikatz.exe', 'sessionGopher.exe'). Maintain and query against a list of specific tool names and their corresponding file hashes. Alert on any process creation event that matches this list of high-fidelity selectors and investigate the parent process and user context."
                    },
                    {
                        "description": "Use of built-in Windows utilities such as 'tscon.exe' or 'query session' with command-line parameters indicative of RDP session enumeration or hijacking.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for command-line patterns associated with RDP hijacking. Specifically, create rules to detect the execution of 'query user', 'quser', 'query session', or 'qwinsta' for session enumeration, especially when followed by 'tscon.exe' with a numeric session ID and the '/dest:console' flag. Alert on the execution of 'tscon.exe' with any session ID parameter, as this is highly anomalous for typical user or administrative activity."
                    },
                    {
                        "description": "A remote desktop session that is reconnected or unlocked from a source IP address different from the one that originally established or locked the session.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4778",
                            "Windows Event ID 4779",
                            "Windows Event ID 4800",
                            "Windows Event ID 4801"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a stateful analysis by tracking active RDP sessions. Use logon events (Windows Event ID 4624, Logon Type 10), disconnect events (4778), and lock events (4800) to record the 'Session ID', 'User', and original 'Source Network Address' for each session. Monitor for reconnect events (4779) and unlock events (4801) associated with the same Session ID. Use correlation analysis to join these events and alert if the 'Source Network Address' in the reconnect/unlock event does not match the session's original or last known source address."
                    },
                    {
                        "description": "An established remote session exhibiting a sudden change in activity, such as the execution of anomalous processes or network connections to unusual destinations, inconsistent with the legitimate user's baseline behavior.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 5156",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For active remote sessions, establish a behavioral baseline of typical user activity (e.g., common processes launched, typical internal/external network destinations, data transfer volumes). Monitor for significant deviations from this baseline within a single, established session. For example, a user who typically runs business applications suddenly executing discovery commands ('net.exe', 'whoami.exe'), PowerShell scripts, or network scanners. Use linear regression or time series analysis to detect anomalous spikes in process creation or network traffic originating from the logged-on session's host. Correlate Windows Event ID 4688 and 5156 events with Zeek conn.log data based on timestamps and host IP to confirm suspicious outbound connections."
                    },
                    {
                        "description": "Anomalous command execution patterns or evidence of multiplexing within a single, long-lived SSH connection, suggesting the session has been hijacked.",
                        "data_sources": [
                            "Zeek ssh.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for SSH sessions (TCP port 22) with unusually long durations or data transfer volumes that deviate from established baselines for specific hosts or services. Analyze Zeek ssh.log for authentication success and failures and note client/server version information that may be vulnerable. To detect potential hijacking via multiplexing (e.g., SSH ControlMaster), correlate a single, long-lived SSH connection observed in Zeek conn.log with multiple, logically distinct activities or command types, if visibility is possible. Increased entropy in SSH commands or traffic patterns within a single TCP session can be an indicator. Correlate with host-based logs to see if a single SSH process is spawning commands on behalf of different users."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
