[
  {
    "information_requirement": "Is the adversary moving laterally through the network using remote service session hijacking?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1563",
        "name": "Remote Service Session Hijacking",
        "evidence": [
          {
            "description": "A process creation event (Windows Event ID 4688) is observed for an executable whose file name, original file name, or file hash matches a known remote session hijacking tool (e.g., Mimikatz, sessionGopher), or whose command-line arguments contain strings indicative of session hijacking functionality (e.g., 'ts::sessions', 'sekurlsa::logonpasswords').",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Privileged Access Workstations, Multi-user systems like terminal servers",
            "action": [
              "Create a SIEM rule that triggers an alert when a process creation event (Windows Event ID 4688) has a 'ProcessName' or 'OriginalFileName' matching a watchlist of known session hijacking tools (e.g., 'mimikatz.exe', 'sessiongopher.exe') OR when the 'FileHash' matches a known malicious hash from a threat intelligence feed.",
              "For each host, build a historical baseline of all process names from Windows Event ID 4688. Calculate the frequency of each process name across the enterprise. Alert on the execution of any process whose enterprise-wide frequency falls below a low threshold (e.g., executed on < 0.1% of endpoints), as this indicates a rare tool that warrants investigation.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) using labeled process execution data (Windows Event ID 4688). Engineer features such as command-line argument length and entropy, parent process name, user context (e.g., SYSTEM vs. standard user), and the rarity of the parent-child process relationship. Deploy the model to score new process events in real-time, alerting on those with a high probability of being malicious."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) shows the execution of 'tscon.exe' with a numeric session ID and a destination switch (e.g., '/dest:console'), indicating an attempt to connect to another user's active session on the same machine.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Multi-user servers (e.g., Terminal Servers, Citrix hosts), Domain Controllers, Jump Boxes",
            "action": [
              "Create a SIEM correlation rule that alerts when a process creation event (Windows Event ID 4688) for 'tscon.exe' with a command line containing a numeric session ID and '/dest:' is preceded by the execution of 'query.exe user', 'quser.exe', or 'qwinsta.exe' by the same user on the same host within a 5-minute window.",
              "Establish a baseline of 'tscon.exe' usage per user role. Given that its use is typically restricted to administrators, calculate the execution frequency for all users. Generate an alert if 'tscon.exe' is executed by any user not in a predefined administrator group, or if an administrator's usage count on a single host exceeds a high percentile (e.g., 99th) of their own historical activity.",
              "Develop a sequence-based anomaly detection model (e.g., Markov Chain or LSTM) for each user based on their historical command execution sequences from Windows Event ID 4688. The model learns the probability of transitioning from one command to another. Flag any sequence of commands, such as 'qwinsta' -> 'tscon', that has a very low probability for a given user's learned behavior model, indicating a deviation from their normal workflow."
            ]
          },
          {
            "description": "An RDP session reconnect (Windows Event ID 4779) or unlock (Windows Event ID 4801) originates from a source IP address that is different from the source IP address recorded for the session's initial connection (Windows Event ID 4624, Logon Type 10) or last disconnect (Windows Event ID 4778).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4778",
              "Windows Event ID 4779",
              "Windows Event ID 4800",
              "Windows Event ID 4801",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, External-facing RDP gateways, Authentication logs on Domain Controllers and Member Servers, Network sensors at egress points",
            "action": [
              "Using a SIEM, build a state table keyed by user and session ID. On a new RDP logon (Event ID 4624, Logon Type 10), store the user, session ID, and source IP. On a session reconnect (Event ID 4779), look up the session ID. If the new source IP does not match the stored IP for that session, generate an alert for a potential session hijack.",
              "For each user, build a historical profile of source Autonomous System Numbers (ASNs) and countries from which they initiate RDP connections by enriching IPs from Windows Event ID 4624 with GeoIP data. For each RDP reconnect event (Event ID 4779), if the source ASN or country is not in the user's historical profile or is in the bottom percentile (e.g., 1%) of their connection frequencies, flag the event for review.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to historical RDP session data, using features such as source IP subnet, user, target host, and time of day. Most reconnects will fall into established clusters of normal behavior. Flag any reconnect event (Event ID 4779) that the model classifies as an outlier or noise point, as it does not fit any known pattern of legitimate user activity."
            ]
          },
          {
            "description": "Following a remote session login (e.g., RDP Logon Type 10), the process execution or network connection activity associated with that logon session ID deviates from the user's established baseline. This includes executing commands rare for that user or making network connections to destinations not previously associated with them.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Host-based process and network monitoring agents, Network TAPs at key egress/ingress points, DNS resolvers",
            "action": [
              "Within a logon session (tracked by Logon ID from Event 4624), create a SIEM rule to detect the execution (Event 4688) of specific discovery or credential access commands (e.g., 'nltest', 'net group', 'reg save hklm\\sam') by users who are not part of a predefined 'Systems Administrators' or 'Red Team' group.",
              "For each user, establish a baseline profile of normal activity during remote sessions, including the set of normally executed processes and the Shannon entropy of their command-line arguments (from Event ID 4688). During an active session, calculate these metrics over a rolling 15-minute window. Alert if a user executes a process not in their baseline set or if the command-line entropy exceeds 3 standard deviations above their mean.",
              "Train a one-class SVM or an autoencoder model on features derived from a user's typical remote session activity, aggregated into 5-minute windows (e.g., process counts, network connection counts, DNS query counts, total data transferred). During a live session, feed feature vectors into the model. If the model flags a time window as an anomaly (e.g., high reconstruction error from an autoencoder), it indicates behavior inconsistent with the user's learned profile."
            ]
          },
          {
            "description": "A single, authenticated SSH session (tracked by 'uid' in Zeek conn.log) shows a significant change in its traffic profile, such as a sudden spike in data volume or a shift in packet timing, changing from patterns typical of an interactive shell to those of a bulk file transfer or tunneled traffic.",
            "data_sources": [
              "Zeek ssh.log",
              "Zeek conn.log",
              "Linux auth.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring traffic to and from Linux/Unix servers, SSH jump boxes, and critical infrastructure.",
            "action": [
              "From Zeek ssh.log, create a rule to alert on any successful SSH authentication ('auth_success' is true) that uses a client or server software version string not present on an approved software list. Correlate this with a session duration in the corresponding Zeek conn.log record exceeding a defined threshold (e.g., 8 hours).",
              "Using Zeek conn.log data, build a historical profile for each source-destination SSH connection pair, modeling the distributions of session duration and total bytes transferred. Generate an alert when a new SSH session's duration or data volume exceeds the 98th percentile for that specific pair, indicating an abnormally long or high-volume session.",
              "Analyze SSH session traffic features from Zeek conn.log, such as packet inter-arrival times and packet size distributions, using a time-series anomaly detection model (e.g., an LSTM autoencoder). Train the model to recognize the patterns of normal interactive use. During a live session, if the model's reconstruction error spikes, it indicates a significant change in the traffic pattern (e.g., from typing to a large file transfer), which could signify a session being repurposed by an adversary."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]