[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by hiding malicious processes from the user's view?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.003",
        "name": "Hidden Window",
        "evidence": [
          {
            "description": "A process is created where the executable's file hash matches a known indicator of compromise (IOC) for malware families that employ hidden window techniques.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers",
            "action": [
              "Create a detection rule to monitor process creation events (Windows Event ID 4688) and compare the SHA256 or MD5 hash of the process executable against a threat intelligence feed of known malicious hashes associated with malware using T1564.003. Trigger an alert upon a direct match.",
              "For each new executable hash observed in Windows Event ID 4688, calculate its prevalence across the enterprise. Flag hashes that are seen on a small number of endpoints (e.g., fewer than 5) and are not digitally signed by a trusted publisher. Prioritize investigation for rare hashes initiating network connections.",
              "Utilize a pre-trained machine learning model (e.g., a gradient boosting classifier) that scores file hashes based on features like enterprise prevalence, threat intelligence hits, and static properties of the executable. Alert when a hash's maliciousness score exceeds a predetermined threshold, indicating a high probability of being an unknown threat using hiding techniques."
            ]
          },
          {
            "description": "A process creation event contains command-line arguments explicitly designed to hide a window, such as '-WindowStyle Hidden' or '//B'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows Endpoints and Servers, especially those with scripting engines (PowerShell, WScript, CScript) enabled",
            "action": [
              "Using regular expressions, create a detection rule to search process command lines in Windows Event ID 4688 for known window-hiding parameters, such as 'powershell.exe -WindowStyle Hidden', 'cscript.exe //B', 'wscript.exe //B', or 'rundll32.exe' with suspicious parameters.",
              "For common scripting engines (powershell.exe, cscript.exe), establish a baseline for command-line argument entropy and length. Use a percentile-based threshold (e.g., 99th percentile) to detect unusually long or complex command lines, which may indicate obfuscation used in conjunction with window hiding.",
              "Train a logistic regression classifier on process creation events, using features like process name, parent process name, command-line length, and command-line entropy. Use this model to classify new command-line executions as either benign or suspicious, flagging those with a high probability of being malicious for further analysis."
            ]
          },
          {
            "description": "A process typically associated with user interaction (e.g., chrome.exe, iexplore.exe) is running under a non-interactive parent process (e.g., services.exe, svchost.exe) and initiates external network connections.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Application Servers, Domain Name System (DNS) servers, Network Egress Points",
            "action": [
              "Create a detection rule that triggers when a process from a watchlist of interactive applications (e.g., iexplore.exe, msedge.exe, chrome.exe) is created with a parent process from a list of known system/service processes (e.g., services.exe, svchost.exe, wininit.exe).",
              "Build a statistical model of normal parent-child process relationships by calculating the frequency of each pair. Alert when a parent-child relationship is observed that is statistically rare (e.g., falls below the 1st percentile of historical occurrences), especially when the child process is correlated with external network connections in Zeek conn.log within a short time window.",
              "Employ a graph-based anomaly detection algorithm on process creation event data. Model parent-child relationships as a directed graph and identify subgraphs that are structurally anomalous compared to a baseline of normal process activity. Correlate these anomalous process trees with beaconing behavior detected via a time-series analysis of Zeek conn.log data for the associated host."
            ]
          },
          {
            "description": "A new 'explorer.exe' process is created for a user session that is not the primary interactive logon session, and this new process subsequently spawns other processes, indicative of a hidden desktop.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Remote Desktop Session Hosts, Virtual Desktop Infrastructure (VDI) servers",
            "action": [
              "Create a detection rule that alerts when a new 'explorer.exe' process is created (Windows Event ID 4688) for a user session where an 'explorer.exe' process is already running and the logon type (from Windows Event ID 4624) is not a remote interactive session (Logon Type 10).",
              "For each host, establish a baseline of the typical number of 'explorer.exe' processes (usually 1 per interactive session). Monitor for hosts where the count of 'explorer.exe' processes exceeds the baseline by more than two standard deviations. Correlate this with logon session data (Event ID 4624) to filter out legitimate concurrent sessions.",
              "Use a clustering algorithm (e.g., DBSCAN) on features of 'explorer.exe' processes, including parent process, logon session ID, and command-line arguments. Identify clusters of 'explorer.exe' processes that are outliers from the main cluster representing normal interactive sessions, as these may represent hidden desktops created by an adversary."
            ]
          },
          {
            "description": "The 'explorer.exe' process, which typically handles the user shell, initiates direct, recurring external network connections, which may indicate C2 communication from a process hidden within a virtual desktop.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Network Egress Points, Domain Controllers (for session info)",
            "action": [
              "Create a detection rule to alert on any network connection in Zeek conn.log where the source process is identified as 'explorer.exe' (requires host-level context enrichment of network logs) and the destination IP address is present on a high-confidence C2 threat intelligence feed.",
              "For each host, baseline the normal network behavior of 'explorer.exe'. Apply a time-series analysis to the connection logs (Zeek conn.log) for each 'explorer.exe' process to detect periodic, low-volume connections (beaconing). Also, calculate the destination country rarity and flag connections to countries not typically accessed by the user.",
              "Train a one-class Support Vector Machine (SVM) model on legitimate 'explorer.exe' network behavior, using features such as destination port, data volume, connection duration, and destination IP reputation. Use the trained model to classify new 'explorer.exe' network connections as anomalous outliers indicative of C2 communication."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]