[
    {
        "information_requirement": "Is the adversary using dynamic resolution for Command and Control?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1568",
                "name": "Dynamic Resolution",
                "evidence": [
                    {
                        "description": "DNS queries for domains or connections to IP addresses matching a high-confidence threat intelligence feed of known DGA-based C2 infrastructure or fast-flux services.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join the domain from DNS query logs (Zeek dns.log `query` field) and the destination IP from connection logs (Zeek conn.log `id.resp_h` field) against a CTI feed of known malicious domains and IPs associated with DGA malware families or fast-flux C2 networks. The feed must be updated at least hourly. Generate a high-priority alert for any confirmed matches."
                    },
                    {
                        "description": "DNS query responses exhibiting patterns of fast-flux DNS, such as an unusually high number of A/AAAA records or extremely short Time-To-Live (TTL) values for a single domain.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek dns.log for DNS responses. For each query, count the number of returned IP addresses in the `answers` field. Flag queries with a high number of answers (e.g., >5) for a single A/AAAA record lookup. Separately, analyze the `TTLs` field for all responses. Flag domains with consistently low TTLs (e.g., < 300 seconds), which is a common pattern for fast-flux C2. Use descriptive statistics (mean, median, percentiles) on TTLs per domain to identify significant outliers compared to network norms."
                    },
                    {
                        "description": "Use of DNS over HTTPS (DoH) to known public resolvers followed by suspicious C2-like traffic to the resolved IP, bypassing traditional DNS monitoring.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Identify connections to known public DoH resolver IP addresses on port 443 using Zeek conn.log. Analyze the corresponding Zeek ssl.log for Server Name Indication (SNI) values matching those resolvers (e.g., `dns.google`, `cloudflare-dns.com`). Correlate this activity with subsequent, periodic C2-like traffic (e.g., regular beacons, unusual data transfer sizes) from the same internal host to IP addresses that would have been resolved via the DoH query. Use time series analysis to detect beaconing patterns emerging immediately after DoH activity from a host."
                    },
                    {
                        "description": "DNS queries for domains with high linguistic entropy or other statistical anomalies characteristic of Domain Generation Algorithms (DGA), indicating algorithmically created C2 domains (T1568.002).",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze the `query` field in Zeek dns.log. For each unique second-level or third-level domain, calculate statistical properties such as Shannon entropy, character frequency distribution, n-gram model probability, and the proportion of dictionary words. Use a scoring model or machine learning classifier based on these features to identify and flag domains likely generated by a DGA. Use a box-plot on entropy scores across all queried domains to visually identify and investigate outliers."
                    },
                    {
                        "description": "An internal host rapidly resolving the same domain name to many different IP addresses in a short time frame, indicative of a client-side fast-flux DNS behavior (T1568.001).",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Group Zeek dns.log entries by internal source IP (`id.orig_h`) and the domain queried (`query`). For each source/query pair, track the set of resolved IP addresses (`answers`) over time. Flag instances where a single host resolves the same domain to a high number of unique IPs within a short window (e.g., >5 unique IPs in 10 minutes). Calculate the entropy of the resolved IP set for each domain to find those with unusually high IP churn and correlate with connection attempts in Zeek conn.log."
                    },
                    {
                        "description": "An internal host making an outbound connection to an unusual IP address immediately after visiting a common, legitimate web service (e.g., social media, code repositories), suggesting a C2 IP derived via DNS Calculation (T1568.003).",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek http.log for traffic to high-volume legitimate services known to be abused for DNS Calculation (e.g., Twitter, GitHub, Pastebin, Reddit). Correlate this activity by source host (`id.orig_h`) with subsequent connections in Zeek conn.log within a very short timeframe (e.g., < 5 seconds). Use correlation analysis to flag connections to destination IPs that are not part of the known IP space for the legitimate service and where the connection protocol/port is unusual (e.g., a custom TCP/UDP protocol on a non-standard port)."
                    },
                    {
                        "description": "A spike in DNS queries for newly registered domains (NRDs) or domains with very low global prevalence, which are often used for ephemeral C2 infrastructure.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log and enrich queried domains using a WHOIS or passive DNS data source to determine registration date and query prevalence. Establish a baseline for NRD lookups in the environment. Use time series analysis to detect sudden spikes in lookups for domains registered within the last 30-60 days. Correlate multiple internal hosts querying the same NRD to identify potential widespread infections and investigate the associated connections in Zeek conn.log."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
