[
  {
    "information_requirement": "Is the adversary using email hiding rules to evade detection or facilitate other malicious activities? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.008",
        "name": "Email Hiding Rules",
        "evidence": [
          {
            "description": "Execution of `New-InboxRule` or `Set-InboxRule` PowerShell cmdlets where rule parameters (e.g., `-SubjectContainsWords`, `-BodyContainsWords`, `-From`) contain values matching known malicious indicators.",
            "data_sources": [
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers, User Endpoints",
            "action": [
              "1. (Symbolic) Query Windows Event ID 4104 logs for script blocks containing `New-InboxRule` or `Set-InboxRule`. Extract rule parameters such as `-SubjectContainsWords`, `-BodyContainsWords`, and `-From`. Alert if any extracted parameter value matches a value in a high-confidence threat intelligence feed of malicious domains, email addresses, or keywords.",
              "2. (Statistical) For all new rules, extract the set of words from the condition parameters (`-SubjectContainsWords`, `-BodyContainsWords`, `-From`). Calculate the Jaccard similarity score between this set and a curated set of known malicious keywords (e.g., 'phish', 'hack', 'suspicious'). Alert on rules with a similarity score exceeding the 95th percentile of all rule creations over the last 90 days.",
              "3. (ML) Train a logistic regression classifier on a labeled dataset of historical rule creation events (benign/malicious). Engineer features from the script block, including: a binary flag for the presence of IOCs, the length of the rule name, a categorical representation of the action taken (e.g., `DeleteMessage`, `MoveToFolder`), and the target folder name. Use the model to assign a real-time risk score to each new rule creation event, flagging those above a defined probability threshold."
            ]
          },
          {
            "description": "Process creation (`powershell.exe`) with command-line arguments for inbox rule modification (`New-InboxRule`, `Set-InboxRule`) executed under an anomalous user context, from an unusual source host, or outside of typical working hours.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Mail Servers, User Endpoints",
            "action": [
              "1. (Symbolic) Join Windows Event ID 4688 (Process Creation) with Windows Event ID 4104 (Script Block Logging) on Process ID. Alert if the command line in 4688 contains `New-InboxRule` or `Set-InboxRule` AND the executing user account is a service account not explicitly allow-listed for Exchange management tasks.",
              "2. (Statistical) For each user, establish a baseline of normal rule creation activity, including typical hours of the day and source hosts. For each new rule creation event, calculate a multi-dimensional Z-score based on its deviation from the user's historical mean time-of-day and a categorical flag for being on a non-standard source host. Flag events where the combined score exceeds a threshold (e.g., > 3).",
              "3. (ML) Use an Isolation Forest model to detect anomalies in rule creation events. Featureize each event with user role (e.g., admin, standard user), time of day (as sine/cosine transformed features to capture cyclical nature), day of week, and a one-hot encoded representation of the source host's role (e.g., DC, mail server, user workstation). The model will identify events that are statistical outliers in this multi-dimensional space."
            ]
          },
          {
            "description": "Execution of `New-TransportRule` or `Set-TransportRule` on a mail server with conditions that target security-related keywords (e.g., 'phishing', 'incident') and actions that delete or redirect messages.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Servers",
            "action": [
              "1. (Symbolic) On Exchange servers, monitor Windows Event ID 4104 for `New-TransportRule` or `Set-TransportRule`. Alert if the `-SubjectOrBodyContainsWords` parameter contains a list of security terms like 'phishing', 'incident', 'suspicious', 'breach', 'alert' AND the rule action is `DeleteMessage` or `RedirectMessage` to an external domain.",
              "2. (Statistical) Maintain a historical frequency distribution (document frequency) of all words used in the `-SubjectOrBodyContainsWords` parameter of all transport rules across the enterprise. For each new rule, calculate the sum of the inverse document frequency (IDF) scores for its keywords. Flag any new rule where the cumulative IDF score exceeds the 99th percentile, indicating the use of unusually specific or rare terms.",
              "3. (ML) Develop a Naive Bayes classifier to predict if a transport rule is malicious. Train the model on a labeled dataset of transport rules, using the bag-of-words from the condition parameters and the type of action (e.g., Delete, Redirect, Log) as features. Deploy the model to score all new transport rules and flag those with a high probability of being malicious."
            ]
          },
          {
            "description": "Creation of an inbox rule where conditions contain common phishing or business-related keywords (e.g., 'invoice', 'password') and the action is to delete the message or move it to a low-visibility folder (e.g., 'RSS Feeds', 'Junk E-mail').",
            "data_sources": [
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Mail Servers",
            "action": [
              "1. (Symbolic) Search Windows Event ID 4104 for `New-InboxRule` script blocks. Flag any event where `-BodyContainsWords` or `-SubjectContainsWords` includes terms from a 'high-risk' watch list (e.g., 'invoice', 'payment', 'password reset') AND the action is `-DeleteMessage $true` or the `-MoveToFolder` parameter specifies a low-visibility folder (e.g., 'RSS Feeds', 'Junk E-mail', 'Notes', 'Deleted Items').",
              "2. (Statistical) For all rule creations involving the `-MoveToFolder` parameter, calculate the Shannon entropy of the destination folder name. A high entropy score can indicate a randomly generated or obfuscated folder name intended to be overlooked. Flag rules where the folder name entropy is in the top 5% of all observed folder names.",
              "3. (ML) Use a time-series anomaly detection model (e.g., ARIMA or Seasonal-ARIMA) on the daily count of rules created with the `DeleteMessage` action across the enterprise. An unexpected spike in the creation of deleting rules, which deviates significantly from the forecasted trend and confidence interval, should trigger a broad investigation."
            ]
          },
          {
            "description": "Anomalous network traffic, such as connections to first-seen domains or high-volume data transfers, originating from a user's host within 60 minutes after an email hiding rule is created on that user's account.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, User Endpoints, DNS Servers",
            "action": [
              "1. (Symbolic) For each rule creation event (from Windows Event ID 4104), correlate by timestamp and source IP with Zeek logs in the subsequent 60 minutes. Alert if the host resolves a domain not seen in the last 30 days (via Zeek dns.log) and subsequently establishes a connection transferring over 10MB of data (sum of `orig_bytes` in Zeek conn.log) to the resolved IP.",
              "2. (Statistical) For each user host, maintain a 30-day rolling baseline of outbound data transfer volume (sum of `orig_bytes` in Zeek conn.log) per destination country. After a rule creation event on a host, if that host initiates a connection to a country it has not connected to in the last 30 days and the data volume exceeds 3 standard deviations above the user's overall daily average, flag the activity as suspicious.",
              "3. (ML) Train a sequence-based model, such as a Long Short-Term Memory (LSTM) autoencoder, on streams of user activity events (e.g., process creation, file access, network connections). Feed the model a sequence of events following a rule creation. The model, trained on normal sequences, will have a high reconstruction error when given an anomalous sequence (e.g., rule creation -> new process -> network connection to rare domain), flagging it for review."
            ]
          },
          {
            "description": "A file modification or registry write event targeting Outlook rule files (.rwz, .pst, .ost) or rule-related registry keys, where the initiating process is not a standard mail client or approved utility (e.g., outlook.exe).",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, File Servers",
            "action": [
              "1. (Symbolic) Monitor Windows Event ID 4663 for write access attempts on files with extensions `.pst`, `.ost`, or `.rwz`. Correlate the Process ID with Windows Event ID 4688 to identify the process name. Alert if the process name is not on an approved allow list of mail clients and backup utilities (e.g., `outlook.exe`, `scanpst.exe`).",
              "2. (Statistical) For each host, establish a baseline of processes that legitimately write to Outlook-related files. For each new file write event, calculate a rarity score for the parent process of the writing process (from Event ID 4688). A high rarity score, indicating a parent process seen in less than 1% of historical cases, suggests an anomalous execution chain and should be investigated.",
              "3. (ML) Use a one-class SVM (Support Vector Machine) trained on legitimate file modification events targeting Outlook files. Featureize events by the writing process name, parent process name, user context, and time of day. The model will create a boundary encapsulating normal activity; any new event that falls outside this boundary is flagged as a potential anomaly."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]