[
  {
    "information_requirement": "Is the adversary attempting to impact system availability by wiping disk structures?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1561.002",
        "name": "Disk Structure Wipe",
        "evidence": [
          {
            "description": "Execution of a process whose name, hash, or command-line arguments match a known disk-wiping malware indicator, or the installation of a service associated with such malware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 7045"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical Application Servers, Domain Controllers, File Servers, User Workstations",
            "action": "1. Symbolic: Create a SIEM rule to alert on process creation (Event ID 4688) or service installation (Event ID 7045) where the process name, file hash, or service name matches a threat intelligence feed of known wiper malware (e.g., Shamoon, StoneDrill, NotPetya). 2. Statistical: For each host, establish a baseline of normal process and service names. Calculate the rarity of each new process/service name across the enterprise using frequency analysis. Alert on executions or installations that are statistically rare (e.g., seen on <0.1% of endpoints) and have names containing suspicious keywords like 'wipe', 'disk', 'erase'. 3. Machine Learning: Train a classification model (e.g., Random Forest) on process execution events, using features like process name entropy, command-line argument structure, parent process, and user context to classify new processes as potential wipers. Use this model to score and alert on high-probability wiper activity."
          },
          {
            "description": "A non-standard system process performs a direct raw write access attempt to a physical disk's master boot record (MBR) or partition table using \\\\.\\PhysicalDriveX notation.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Boot sectors of critical servers (especially Domain Controllers, Hypervisors) and executive workstations, System partitions",
            "action": "1. Symbolic: Enable SACLs on physical disk objects and create a SIEM alert for any process not on a strict allowlist (e.g., chkdsk.exe, specific backup agents) that requests write access (e.g., Access Mask 0x12019f) to an object named `\\\\.\\PhysicalDrive*` (Event ID 4656/4663). 2. Statistical: Establish a baseline of which processes normally access raw disk objects. Calculate the Z-score for the frequency of access attempts by any given process. Alert if a process's access frequency exceeds a high threshold (e.g., Z-score > 3) or if a process never before seen accessing these objects appears. 3. Machine Learning: Develop an anomaly detection model (e.g., Isolation Forest) using features from Event ID 4663/4656, such as process name, user account, access mask, and object name. The model learns the normal pattern of raw disk access and flags any significant deviation as a high-risk anomaly indicative of a potential wiper."
          },
          {
            "description": "Execution of a destructive file system format or erase command on a network device by an unauthorized user or at an anomalous time.",
            "data_sources": [
              "Network Device AAA Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core Routers, Core Switches, Firewalls, SAN Fabric Switches",
            "action": "1. Symbolic: Create a high-severity alert for any AAA log entry containing exact command strings like 'format flash:', 'erase startup-config', or 'write erase'. Correlate this with the executing user account and alert if the user is not in a predefined 'Senior Network Administrators' group. 2. Statistical: For each network administrator, establish a baseline of command usage frequency. Alert if a statistically rare and destructive command (e.g., 'format') appears, or if the entropy of commands run in a session drops suddenly, indicating repetitive, potentially automated destructive actions. 3. Machine Learning: Use a sequence-based anomaly detection model (e.g., LSTM) to analyze the sequence of commands executed by administrators. Flag sequences that deviate from normal administrative workflows, such as a login followed directly by a 'format' command without preceding diagnostic steps."
          },
          {
            "description": "An unsigned kernel-mode driver is installed, immediately preceding system instability, unexpected reboots, or a failure to boot.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 6008",
              "Windows Event ID 5038",
              "Windows Event ID 7000"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Hypervisors, Database Servers, Tier 0 assets",
            "action": "1. Symbolic: Alert when a new service is created (Event ID 7045) for a kernel-mode driver (`ServiceType=0x1`) AND a corresponding Event ID 5038 indicates the driver's image file is unsigned AND the service name is not on an established allowlist. 2. Statistical: Calculate the Shannon entropy of the 'Image Path' and 'Service Name' for all new driver installations. Flag installations whose entropy scores fall in the top or bottom 5th percentile of the historical distribution, indicating randomly generated or overly generic names. 3. Machine Learning: Use time-series analysis to correlate a spike in unsigned driver installations (Event ID 7045 + 5038) with a subsequent increase in unexpected shutdowns (Event ID 6008) across the enterprise to identify a coordinated attack campaign."
          },
          {
            "description": "A single, non-standard process modifies or deletes multiple critical boot files (e.g., bootmgr, BCD, winload.exe) in rapid succession across one or more systems.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "System partitions (e.g., C:\\Boot), Windows\\System32 directories on all endpoints and servers, Boot Configuration Data stores",
            "action": "1. Symbolic: Configure File System Object Auditing and create a SIEM rule to trigger an alert on any DELETE or WRITE_DATA access (Event ID 4663) to critical boot files (e.g., C:\\Boot\\BCD, C:\\Windows\\System32\\winload.exe) by any process not on a strict allowlist (e.g., TrustedInstaller.exe). 2. Statistical: Monitor the rate of modifications (Event ID 4663) to files in critical system directories. Use a sliding window to calculate the moving average and standard deviation of these events per host. Alert if the rate exceeds a dynamic threshold (e.g., >3 standard deviations above baseline). 3. Machine Learning: Use graph-based analysis where processes and files are nodes. A wiper attack would manifest as a new or rare process node creating multiple edges (file modifications) to critical file nodes in a short time. Use a community detection algorithm to spot these anomalous subgraphs, especially if they appear across multiple hosts simultaneously."
          },
          {
            "description": "A burst of failed remote authentication attempts from a single source is followed by a successful login and subsequent mass file transfer or remote process execution, indicating automated propagation of a wiper.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs from Domain Controllers, Network traffic at key network chokepoints, Endpoint process and network logs from server VLANs",
            "action": "1. Symbolic: Alert when a single source IP generates >10 logon failures (Event ID 4625) across >5 unique hosts within 5 minutes, followed by a successful logon (Event ID 4624), immediately followed by the transfer of a .exe file via SMB (Zeek smb_files.log) or remote process creation of a suspicious command (Event ID 4688). 2. Statistical: For each host, profile the normal fan-out of SMB/RPC connections (Zeek conn.log). A host that suddenly begins connecting to hundreds of other hosts on port 445, exceeding the 99th percentile of its typical hourly connection count, is a strong indicator of worm-like propagation. 3. Machine Learning: Use a Hidden Markov Model (HMM) to identify state transitions. Train the model to recognize the shift from a 'Normal Operations' state (low failed logins, low remote execution) to a 'Wiper Propagation' state (high failed logins, high remote execution, high SMB traffic) based on time-series data from the entire network."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]