[
  {
    "information_requirement": "Has an adversary manipulated data integrity or availability on critical systems? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1565",
        "name": "Data Manipulation",
        "evidence": [
          {
            "description": "A file write or creation event occurs for a file whose hash matches a known malicious tool associated with data manipulation (e.g., wiper, ransomware).",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical file servers, database servers, and domain controllers.",
            "action": [
              "Upon a file creation event (Sysmon Event ID 11), calculate the file's hash (e.g., SHA256). Query a threat intelligence database or internal IOC list to check if the hash corresponds to a known data manipulation tool. Generate a high-severity alert upon a match.",
              "For file write events (Windows Event ID 4663) in monitored directories, calculate the Shannon entropy of the file's content. Establish a baseline entropy score for common file types in these directories. Alert when a file's entropy deviates by more than 3 standard deviations from the baseline for its type, which may indicate encryption or obfuscation.",
              "Train a classification model (e.g., Random Forest) using features from file creation events, such as file extension, path, process context, and entropy. Use the model to predict the probability that a new file is malicious. Alert on files classified as malicious with a high confidence score (>0.9)."
            ]
          },
          {
            "description": "A process is created using a native utility (e.g., cipher.exe, fsutil.exe) or scripting engine (e.g., powershell.exe) with command-line arguments indicative of data overwriting, corruption, or deletion.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All enterprise endpoints and servers, with a focus on servers hosting critical applications or data.",
            "action": [
              "Monitor process creation events (Windows Event ID 4688, Sysmon Event ID 1) for command lines matching specific regular expressions for data wiping, such as `cipher\\.exe /w:`, `fsutil\\.exe file setzerodata`, or PowerShell scripts containing `Set-Content -Value $null` on multiple files. Generate a critical alert on a regex match.",
              "For each command line executed, calculate the frequency of its parent process, user, and command arguments. Identify commands that are statistically rare (e.g., in the bottom 5th percentile of frequency) for a given user or system role. A rare combination, like a web server service account running `cipher.exe`, should be flagged for review.",
              "Develop a supervised learning model (e.g., Logistic Regression) trained on a labeled dataset of benign and malicious command lines. Use features like command length, special character count, and presence of specific keywords. Use this model to score all new command lines in real-time, alerting on those exceeding a risk threshold."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of file modification or deletion events is observed on a sensitive data repository, originating from a single user or process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4659",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Sensitive data repositories, including network file shares, source code management systems, and SharePoint sites.",
            "action": [
              "Define a hard threshold rule: alert if any single user account or process generates more than 1000 file deletion events (Windows Event ID 4659/4663 with delete access) within a 10-minute window on a designated critical file server.",
              "For each critical file path, establish a baseline of file modification/deletion events per hour for each user. Use a moving average and standard deviation to model normal activity. Generate an alert when the event count for a user exceeds the 99th percentile or 3 standard deviations above the moving average for that time of day/day of week.",
              "Apply a time-series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the stream of file modification/deletion events for critical servers. This model will learn seasonality (e.g., higher activity during business hours) and trends, and will alert on spikes that are anomalous given the historical context."
            ]
          },
          {
            "description": "A single process performs a sequence of actions within a short time window: reads a sensitive file, establishes an external network connection, and then writes back to the original file.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek conn.log",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints of high-value users (e.g., developers, system administrators), servers hosting sensitive data, and network egress points.",
            "action": [
              "Create a SIEM correlation rule that triggers when, for the same process ID on the same host within 60 seconds: 1) A file read event (Windows Event ID 4663) on a critical file path is logged, followed by 2) A network connection to a non-local IP address (Zeek conn.log or Sysmon Event ID 3), followed by 3) A file write event on the same file path.",
              "Profile the network destinations for processes that typically access sensitive files. Calculate the frequency of destination IPs, ASNs, and countries. Alert when a process, after reading a sensitive file, connects to a destination that is statistically rare (e.g., never-before-seen ASN or a country in the bottom 1% of connection frequency for that process).",
              "Use a sequence analysis model (e.g., Hidden Markov Model or LSTM) trained on sequences of system calls or event logs (file read, file write, network connect). The model learns normal sequences of operations. Alert when a new sequence of events has a low probability of occurring based on the trained model, indicating a deviation from normal behavior."
            ]
          },
          {
            "description": "A high volume of file rename operations occurs in a short period, originating from a single process, often changing file extensions to a uniform or random pattern.",
            "data_sources": [
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, file servers, and backup servers.",
            "action": [
              "Create a rule to alert when a single process generates more than 100 file rename events within one minute where the new file extension matches a known ransomware pattern (e.g., `.lockbit`, `.crypted`) or is a random string of a specific length.",
              "For each directory, calculate the entropy of file extensions. Monitor for a sudden, sharp decrease in entropy, which indicates that many files are being renamed to the same extension. Also, track the rate of rename operations per process per minute and alert if it exceeds the 99th percentile of its historical behavior.",
              "Train a clustering algorithm (e.g., DBSCAN) on features of file system activity, including the rate of creations, deletions, and renames. Normal user activity and automated processes will form distinct clusters. An event of mass renaming would appear as a new, anomalous cluster or as a noise point, triggering an alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]