[
    {
        "information_requirement": "Is the adversary evading defenses by spoofing process arguments?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1564.010",
                "name": "Process Argument Spoofing",
                "evidence": [
                    {
                        "description": "A process created with benign-appearing command-line arguments that initiates network connections to known malicious infrastructure.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688), especially for common system processes (e.g., svchost.exe, rundll32.exe, powershell.exe), with subsequent network connection logs (Zeek conn.log) originating from the same host and process ID within a short time window (e.g., < 60 seconds). Inner join the destination IP addresses from these connections with a high-confidence threat intelligence feed of known C2 servers or malicious IPs. Alert on any process with benign arguments that communicates with a known malicious endpoint."
                    },
                    {
                        "description": "A common system process with seemingly benign command-line arguments (e.g., 'svchost.exe -k netsvcs') spawning an unusual or suspicious child process (e.g., 'powershell.exe', 'cmd.exe', 'whoami.exe').",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688). Maintain a list of common system processes often abused for hosting malicious code (e.g., 'svchost.exe', 'rundll32.exe', 'dllhost.exe'). For these parent processes, especially those created with standard command lines, flag the creation of suspicious child processes such as command shells, scripting engines, or reconnaissance tools. Use correlation analysis to link the parent creation event with the child creation event by Parent Process ID and time, focusing on unusual parent-child relationships."
                    },
                    {
                        "description": "A process, created with apparently benign command-line arguments, exhibiting network behavior that deviates significantly from its established baseline in terms of destination, port, protocol, or data volume.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For common executables (e.g., svchost.exe, powershell.exe, msedge.exe), establish baselines of normal network activity (typical destination subnets, common ports/protocols, average data transferred per session) using historical Zeek conn.log data correlated with Windows Event ID 4688. Monitor for new process instances whose network activity falls outside these baselines. Use statistical methods like Inter-Quartile Range (IQR) or Z-scores on data volume, and frequency analysis or entropy measures on destination IPs/ports to detect significant outliers. For example, flag 'svchost.exe' connecting to a non-Microsoft IP on a non-standard port where it has not been observed before."
                    },
                    {
                        "description": "A process whose logged command-line arguments imply a benign function (e.g., web browsing) but whose subsequent host-based actions involve unrelated, suspicious behavior (e.g., creating scheduled tasks, modifying registry run keys).",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4698",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a process creation event (Windows Event ID 4688) with its subsequent actions on the host within a short time window. Identify processes with benign-looking arguments (e.g., a browser launching without a malicious URL) that then perform unrelated persistence actions, such as creating a scheduled task (Windows Event ID 4698) or modifying a registry value in a common persistence location (Windows Event ID 4657). This requires defining and correlating sequences of events that represent a logical mismatch between the stated purpose (arguments) and the actual behavior."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
