[
  {
    "information_requirement": "Has an adversary deployed or executed a virtual instance to evade host or network-based defenses? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.006",
        "name": "Run Virtual Instance",
        "evidence": [
          {
            "description": "Anomalous network traffic originating from a MAC address associated with a virtualization platform's Organizationally Unique Identifier (OUI) that is not registered in the asset inventory.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway/firewall, Core network switches",
            "action": [
              "Symbolic Logic: Create a watchlist of MAC address OUIs for common virtualization software (e.g., 00:05:69 for VMware, 08:00:27 for VirtualBox). Join Zeek conn.log data with an asset inventory on MAC address. Alert on any connection where the source MAC is on the watchlist but not in the asset inventory and the destination IP is on a threat intelligence blocklist.",
              "Statistical Method: For each host, calculate the entropy of destination ports and the ratio of outbound-to-inbound bytes. Baseline these metrics over a 30-day period. Alert if a host exhibits a sudden, statistically significant increase (> 3 standard deviations) in port entropy or byte ratio, concurrent with the appearance of a new MAC address with a virtualization OUI.",
              "Machine Learning: Train a time-series anomaly detection model (e.g., LSTM Autoencoder) on host-level network metrics from Zeek conn.log (e.g., connection count, total bytes, unique destination IPs per hour). A high reconstruction error from the model, indicating a deviation from learned normal behavior that co-occurs with a new virtualization-related MAC address, signifies a potential rogue VM."
            ]
          },
          {
            "description": "Execution of a known virtualization process (e.g., VBoxManage.exe, vmrun.exe) with command-line arguments explicitly intended to hide the VM's presence or operation, such as '--type headless'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Standard user endpoints, Developer workstations, Server infrastructure",
            "action": [
              "Symbolic Logic: Scan the process command-line field in Windows Event ID 4688 events for virtualization process names (e.g., VBoxManage.exe, vmrun.exe, qemu-system-*.exe). Trigger an alert if the command line contains regex patterns matching headless/silent execution flags like '--type headless', '-silent', 'nogui', or arguments that suppress GUI messages.",
              "Statistical Method: For each virtualization process, build a frequency distribution of command-line argument combinations observed across the enterprise over 30 days. Flag any execution where the combination of arguments falls below a rarity threshold (e.g., seen on < 0.1% of hosts), indicating an unusual and potentially malicious invocation.",
              "Machine Learning: Use a classification model (e.g., Random Forest) trained on labeled command-line arguments. Features can be bag-of-words or TF-IDF representations of the arguments. The model should classify executions as 'benign administrative' or 'suspicious evasive' based on the presence and combination of specific flags and parameters."
            ]
          },
          {
            "description": "Creation of a file with a common virtual disk extension (e.g., .vmdk, .vhd) in a directory not approved for storing virtual machine images, such as a user's temporary folder or a web server directory.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers, Standard user endpoints, Web servers",
            "action": [
              "Symbolic Logic: Create a rule to monitor for file creation events (Windows Event ID 4663) where the file name ends with a virtual disk extension (e.g., .vdi, .vmdk, .vhd, .vhdx) and the file path is not on an allowlist of approved virtualization storage locations. Alert on any match.",
              "Statistical Method: For each process that creates a virtual disk file, profile the parent process name and the file path. Calculate the rarity of each parent-process/path combination. Alert when a combination is observed that is a statistical outlier (e.g., a low-frequency parent process like 'winword.exe' writing a '.vhd' file to 'C:\\ProgramData\\').",
              "Machine Learning: Employ an unsupervised clustering algorithm (e.g., DBSCAN) on file creation events. Features should include file path depth, parent process name (as a categorical feature), file extension, and file size. Clusters identified as sparse and distant from the main 'normal activity' clusters can be flagged as anomalous and investigated."
            ]
          },
          {
            "description": "A virtualization management process (e.g., VBoxManage.exe) is spawned by a parent process not typically associated with system administration or software development, such as a Microsoft Office application or web browser.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Standard user endpoints, Application servers",
            "action": [
              "Symbolic Logic: Using process creation events (Windows Event ID 4688), create an allowlist of expected parent processes for known virtualization binaries (e.g., 'explorer.exe', 'cmd.exe', 'powershell.exe'). Alert whenever a virtualization process is created by a parent not on this list, especially high-risk parents like 'winword.exe', 'outlook.exe', or 'svchost.exe'.",
              "Statistical Method: Analyze process lineage data to build a probabilistic graph of parent-child relationships. Calculate the conditional probability P(Child | Parent) for all observed pairs. Generate an alert when a virtualization process is spawned by a parent where this probability is below a pre-defined threshold (e.g., < 0.001), indicating a rare and suspicious event.",
              "Machine Learning: Train a graph-based anomaly detection model on the process execution graph where nodes represent processes and edges represent parent-child relationships. The model learns normal subgraphs of activity. A new, anomalous edge (e.g., 'AcroRd32.exe' -> 'vmrun.exe') would be flagged as a deviation from the learned graph structure."
            ]
          },
          {
            "description": "A correlated sequence of events on a single host within a short time window: 1) A large file (>500MB) is created by an anomalous process, 2) a virtualization process is executed, and 3) new, un-inventoried network traffic is observed from the host.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway/firewall, Standard user endpoints, Server infrastructure",
            "action": [
              "Symbolic Logic: Create a SIEM correlation rule that triggers on a specific sequence on the same host within 10 minutes: 1. Event 4663 (File Create) with file size > 500MB. 2. Event 4688 (Process Create) for a known virtualization binary. 3. A Zeek conn.log entry with a source MAC matching a virtualization OUI not in the asset inventory. An alert is fired if all conditions are met.",
              "Statistical Method: For each host, create a composite risk score. Increment the score for events like large file creation by a rare process, execution of a headless VM, or new network flows from a virtualization MAC. Use a moving average of this risk score over time. A sharp increase in the score (e.g., exceeding the 99th percentile of its historical values) indicates a high probability of malicious activity.",
              "Machine Learning: Use a sequence analysis model, such as a Hidden Markov Model (HMM), trained on logs from known benign and malicious activities. The model learns the transition probabilities between states (e.g., 'File Download' -> 'Process Execution' -> 'Network Connection'). A sequence of live events that has a high probability of belonging to the 'malicious VM deployment' path will generate a high-confidence alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]