[
  {
    "information_requirement": "Is the adversary moving tools or other files laterally within the network?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1570",
        "name": "Lateral Tool Transfer",
        "evidence": [
          {
            "description": "A file transferred between internal systems has a hash matching a known-bad indicator from threat intelligence, or a filename associated with common adversary tooling (e.g., mimikatz.exe, psexec.exe).",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal network segments, Domain Controllers, File Servers, Privileged Access Workstations (PAWs)",
            "action": [
              "Implement a query that computes the MD5/SHA256 hash of all files transferred over monitored protocols (from Zeek files.log) and joins this with process creation events (Windows Event ID 4688, Sysmon Event ID 1). Alert if the file hash matches a known-bad hash from a threat intelligence feed or if the process name matches a watchlist of adversary tool names.",
              "For each file transferred, calculate the Shannon entropy of its filename. Establish a network-wide baseline for filename entropy over a 30-day period. Generate an alert for any file transfer where the filename entropy exceeds the 95th percentile of the baseline, indicating a high degree of randomness often used to evade signature-based detections.",
              "Develop and deploy a supervised classification model (e.g., Random Forest, Gradient Boosting) trained on labeled historical data. Use features from Zeek logs (files.log, conn.log) and host logs, such as file MIME type, size, filename entropy, source/destination subnet, protocol, connection duration, and parent process name. The model will assign a 'malicious transfer' probability score to each file transfer event, with scores above a defined threshold triggering an alert."
            ]
          },
          {
            "description": "A file is written to a directory that is unusual for the destination host or is commonly abused by adversaries (e.g., C:\\Windows\\Temp, C:\\Users\\Public, C:\\$Recycle.Bin, C:\\ProgramData).",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek ftp.log",
              "Windows Event ID 4663",
              "Sysmon Event ID 11"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstation-to-workstation traffic, Server-to-server traffic, Critical application servers, File servers",
            "action": [
              "Create a detection rule that monitors for file write events (Sysmon Event ID 11, Windows Event ID 4663) or SMB file transfers (Zeek smb_files.log). Alert when a file is written to a directory on a watchlist of sensitive or non-standard paths (e.g., C:\\Windows\\Temp, C:\\Users\\Public) and the source of the write is another internal system.",
              "For each host, build a profile of common file write destination paths over a 30-day rolling window. Calculate the frequency of writes to each path. Alert when a file is written to a path that falls into the bottom 5th percentile of frequency for that specific host, indicating it is an anomalous write location for that system.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to file creation events (Sysmon Event ID 11). Use features such as the process that wrote the file, destination path depth, file extension, and whether the file is signed. Identify and investigate clusters that are flagged as noise or form small, distinct groups, as these often represent anomalous activity separate from normal OS and application behavior."
            ]
          },
          {
            "description": "A process not typically associated with network administration or file sharing (e.g., winword.exe, w3wp.exe, explorer.exe) initiates a file transfer to another internal system.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application servers (e.g., web servers, database servers), User workstations, Privileged access workstations (PAWs)",
            "action": [
              "Create a rule that correlates process creation events (Sysmon Event ID 1) with network connection events (Sysmon Event ID 3, Zeek conn.log). Alert if a process from a watchlist of non-standard transfer tools (e.g., 'winword.exe', 'excel.exe', 'w3wp.exe') initiates an outbound connection on a file sharing port (e.g., 445, 21, 22) to another internal IP address.",
              "For each process name across the environment, build a statistical baseline of its common child processes and network connection destinations (IPs and ports). Calculate the frequency of each (parent_process, child_process) and (process, destination_port) pair. Alert when a process initiates a connection or spawns a child that is statistically rare for it (e.g., below the 1st percentile of observed frequency).",
              "Develop a time-series anomaly detection model (e.g., LSTM autoencoder) for each host's process-network behavior. The model should be trained on sequences of events, including parent process, process, and destination port. An alert is generated when a new sequence of activity has a high reconstruction error, indicating a significant deviation from the host's learned normal behavior."
            ]
          },
          {
            "description": "A file, identified by its hash, is transferred from a single source host to a number of destination hosts that is statistically significant within a short timeframe (e.g., a fan-out to more than 10 hosts in under 30 minutes).",
            "data_sources": [
              "Zeek files.log",
              "Zeek smb_files.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Entire internal network address space, Subnets containing high-value assets, Domain Controllers",
            "action": [
              "Implement a stateful rule that triggers if a single source IP is observed in Zeek smb_files.log or files.log transferring a file with the same hash or name to more than 10 distinct internal destination IPs within a 30-minute window. This indicates a potential mass deployment of a tool.",
              "Over a rolling 1-hour window, group all file transfers by file hash (from Zeek files.log). For each hash, count the number of unique destination hosts (fan-out count). Establish a dynamic baseline by calculating the 99th percentile for this fan-out count across all files transferred in the last 30 days. Alert if any file's fan-out count in a 1-hour window exceeds this threshold.",
              "Construct a dynamic graph where hosts are nodes and file transfers are directed edges. Use a graph analytics platform to monitor for sudden changes in network topology. Specifically, trigger an alert if a single node's out-degree (number of outgoing edges representing transfers) increases dramatically in a short time, especially if the edges share identical properties (e.g., same file hash, same filename), indicating a broadcast or 'star' pattern."
            ]
          },
          {
            "description": "A direct connection between two internal endpoints occurs over a protocol or port not on an established allow-list for east-west traffic, or the volume of data transferred is a statistical outlier for that specific host pair.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "East-west traffic between all internal subnets, Network traffic to/from bastion hosts, VPN user subnets",
            "action": [
              "Define and enforce an allow-list of approved protocols and ports for internal host-to-host communications (e.g., SMB/445, RDP/3389). Implement a SIEM rule to alert on any connection logged in Zeek conn.log between internal IP ranges that uses a protocol or port combination not on this explicit allow-list.",
              "For each unique source-destination internal IP pair, establish a 30-day rolling baseline for total bytes transferred ('orig_bytes' + 'resp_bytes' from Zeek conn.log). Calculate the mean and standard deviation. Generate an alert if the total data volume for a given day exceeds the mean by more than 3 standard deviations ($$ \\text{volume} > \\mu + 3\\sigma $$).",
              "Apply an unsupervised anomaly detection model, such as an Isolation Forest, to all internal connection events from Zeek conn.log. Use features including protocol, destination port, connection duration, total bytes, connection state, source and destination subnet role, and TCP flags. The model will assign an anomaly score to each connection, and connections with the highest scores, indicating they are the most different from the norm, should be prioritized for investigation."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]