[
  {
    "information_requirement": "Is the adversary communicating with command and control infrastructure using symmetric cryptography? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1573.001",
        "name": "Symmetric Cryptography",
        "evidence": [
          {
            "description": "A network connection is established from an internal host to an external IP address or domain that is present on a threat intelligence feed and tagged as C2 infrastructure known to use symmetric encryption.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers",
            "action": [
              "Symbolic: Ingest a threat intelligence feed of known C2 infrastructure. Create a rule to join Zeek conn.log destination IPs and Zeek dns.log queried domains against this feed. Generate an alert for any observed match.",
              "Statistical: For each domain queried, calculate the total number of unique internal hosts that query it over a 24-hour period. Identify domains from the CTI feed that are queried by a number of hosts falling below the 5th percentile (i.e., very few hosts). Escalate alerts for these rare and known-bad domains.",
              "Machine Learning: Train a supervised classification model (e.g., Random Forest) using features from Zeek conn.log (destination port, protocol, bytes sent, bytes received) and historical CTI data as labels. Apply the model to new connections to previously unseen IP addresses to predict the probability of them being malicious C2. Alert when the probability exceeds a defined threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "A process is created from a non-standard directory (e.g., %TEMP%, %APPDATA%) or with a name matching a known malicious hash, and this process subsequently initiates outbound network connections.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for new process creation events. Alert if the process hash matches a known malicious hash or if the process path matches a regex for non-standard locations (e.g., `C:\\Users\\.*\\AppData\\Local\\Temp\\.*`). Correlate alerts with subsequent outbound connections from the host in Zeek conn.log within a 5-minute window.",
              "Statistical: For all processes, establish a baseline of common execution paths and parent-child process relationships. Calculate the rarity of each new process execution path. Flag any process execution whose path rarity is below the 1st percentile and is followed by an outbound network connection, indicating an anomalous execution flow.",
              "Machine Learning: Develop an anomaly detection model (e.g., Isolation Forest) trained on features from process command-line arguments (e.g., length, character entropy, presence of encoded strings). High anomaly scores for processes that also initiate network traffic indicate potential malicious execution and should be alerted on."
            ]
          },
          {
            "description": "Outbound network traffic on a standard port (e.g., 443, 80) fails to conform to the expected protocol (e.g., no valid TLS handshake on 443) and exhibits a payload entropy significantly higher than the established baseline for that port.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Internal Network Segments",
            "action": [
              "Symbolic: Create a rule that joins Zeek conn.log and ssl.log on the connection UID. Alert on any connection where `conn.log.service` is `ssl` or `conn.log.id.resp_p` is 443, but the corresponding UID is not present in `ssl.log`, indicating non-TLS traffic over a standard TLS port.",
              "Statistical: For each destination port, calculate the 95th percentile of payload entropy over a 30-day rolling window using the `entropy` field in Zeek files.log. Alert on any connection whose payload entropy exceeds this threshold, especially if it also meets the symbolic protocol-mismatch rule.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) to predict expected payload entropy levels for specific high-traffic ports (e.g., 80, 443). Generate an alert when the observed entropy for a connection significantly deviates (e.g., > 3 standard deviations) from the forecasted value for that time period."
            ]
          },
          {
            "description": "A sequence of network connections from a single host to a single external destination exhibits a periodic 'heartbeat' pattern with consistent timing and data size, or demonstrates a data transfer ratio (bytes sent vs. bytes received) that is anomalous for the given port.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": [
              "Symbolic: For each source-destination IP pair, analyze connection timestamps and sizes. Alert if a host makes more than 5 connections to the same destination at regular intervals (e.g., every 300 seconds +/- 10% tolerance) with a consistent payload size (+/- 10% tolerance).",
              "Statistical: For each destination port, establish a baseline for the ratio of original bytes (`orig_bytes`) to responder bytes (`resp_bytes`) from Zeek conn.log. Alert when a new connection's ratio deviates by more than 3 standard deviations from the established baseline for that port, indicating an unusual data transfer pattern.",
              "Machine Learning: Apply a time-series analysis function, such as autocorrelation, to the timestamps of connections grouped by source-destination pairs. A high autocorrelation score indicates a strong, repeating periodic signal. Alert on pairs with high scores, especially when the destination is an uncategorized or low-reputation IP address."
            ]
          },
          {
            "description": "A process, not on an established software allowlist, is observed initiating an outbound network connection that concurrently displays multiple suspicious attributes, such as high entropy, beaconing behavior, and a protocol mismatch for the destination port.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Critical Application Servers, Network Egress Points",
            "action": [
              "Symbolic: Create a correlation rule that triggers when a process hash from Windows Event ID 4688 is not found in a software allowlist AND it initiates a connection that triggers a separate rule for protocol mismatch (e.g., non-TLS on port 443).",
              "Statistical: Develop a composite risk score for each network-connected process. Assign points for each anomalous attribute: process path rarity < 5th percentile (+1), network connection entropy > 95th percentile for the port (+1), beaconing pattern detected (+2), data ratio > 3 standard deviations from port mean (+1). Alert when the cumulative score for a single process exceeds a predefined threshold (e.g., 3).",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on a feature set combining process and network data (e.g., process path rarity, network entropy, beaconing interval standard deviation, data ratio). Flag processes that fall into small, distant clusters, separate from the main 'normal' activity cluster, as multi-faceted behavioral outliers requiring investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]