[
  {
    "information_requirement": "Is the adversary maintaining persistence by manipulating service registry entries?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1574.011",
        "name": "Services Registry Permissions Weakness",
        "evidence": [
          {
            "description": "A service's 'ImagePath' or 'binPath' registry value is modified to an executable or script whose path, name, or hash is statistically rare or matches known threat intelligence.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application Servers, Critical Workstations, All Endpoints",
            "action": [
              "Symbolic: Monitor Windows Event ID 4657 for modifications to object names ending in `\\ImagePath` or `\\binPath` under `\\REGISTRY\\MACHINE\\SYSTEM\\CurrentControlSet\\Services\\`. For each modification, extract the new executable path. Enrich this path to obtain a file hash and compare the hash and path against threat intelligence feeds.",
              "Statistical: For the modifying process identified in the event, calculate its historical frequency of modifying service registry keys across the environment. Flag modifications by processes in the bottom 5th percentile of frequency as anomalous. Additionally, build a baseline of all known `ImagePath` values for each service; alert on any modification to a path that has never been seen for that specific service.",
              "Machine Learning: Utilize a classification model trained on features of the modification event (e.g., path string characteristics, parent process, time of day, service name, user context) to predict the likelihood of the change being malicious, alerting on high-probability events."
            ]
          },
          {
            "description": "A new service is installed (Windows Event ID 4697) where the service name exhibits high character entropy or the ImagePath points to a statistically anomalous file location.",
            "data_sources": [
              "Windows Event ID 4697",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application Servers, Critical Workstations, All Endpoints",
            "action": [
              "Symbolic: Monitor Windows Event ID 4697 for new service installations. Compare the new service name and executable path against a curated list of regular expressions (regex) associated with known malware families and persistence tools.",
              "Statistical: For each new service name, calculate its Shannon entropy score. Establish a baseline entropy score for all legitimate service names in your environment; flag new services with names exceeding the 95th percentile of this baseline. Separately, calculate the rarity of the `ImagePath` directory across the environment and alert on paths in the bottom 5% of prevalence.",
              "Machine Learning: Employ a clustering algorithm (e.g., DBSCAN) on new services based on features like name length, entropy, ImagePath directory, and character set. Investigate services that form small, distinct clusters or are classified as noise, as they deviate from established groups of legitimate software installations."
            ]
          },
          {
            "description": "A service's `ImagePath` or `binPath` is modified to a file path in a directory not authorized for executables, such as a user profile or temporary folder.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Multi-user Servers (e.g., Terminal Servers), All Endpoints",
            "action": [
              "Symbolic: Monitor Windows Event ID 4657 for modifications to `ImagePath` or `binPath` registry values. Compare the directory from the new path value against an allow-list of standard executable locations (e.g., `C:\\Windows\\System32`, `C:\\Program Files\\`). Alert if the path points to a user-writable or temporary location (e.g., `C:\\Users\\*`, `C:\\ProgramData\\`, `C:\\Temp\\`, `C:\\Windows\\Temp\\`).",
              "Statistical: For each service, build a historical baseline of legitimate `ImagePath` directories. Flag any modification where the new directory is a statistical outlier (e.g., has a historical probability of less than 1% for that service across the enterprise).",
              "Machine Learning: Train a one-class SVM or an isolation forest model on legitimate `(service_name, image_path_directory)` pairs. Use the trained model to detect and alert on novel or anomalous pairs that deviate from the established norm."
            ]
          },
          {
            "description": "A `Performance` or `Parameters` subkey, or a `ServiceDll` value, is created or modified for a service that does not normally use them, with the new value pointing to a DLL in a rare or non-standard location.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Application Servers, Critical Workstations",
            "action": [
              "Symbolic: Monitor Windows Event ID 4657 for creation/modification of `Performance` or `Parameters` subkeys, or the `ServiceDll` value, under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*`. If a `ServiceDll` value is modified, compare the DLL's hash and path against threat intelligence feeds.",
              "Statistical: Maintain a baseline of services that legitimately use these keys. Alert on the creation of these keys for any service not on the baseline. Further, calculate the frequency of all `ServiceDll` paths across the enterprise; flag paths that are in the bottom 5th percentile of rarity for investigation.",
              "Machine Learning: Use a classification model to score the risk of the modification based on features such as the service's historical usage of these keys, the rarity of the DLL path, the entropy of the path, and the reputation of the process that made the change."
            ]
          },
          {
            "description": "A process started by `services.exe` initiates network connections that exhibit periodic, low-volume behavior (beaconing) or communicate with known malicious destinations.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Servers, All Endpoints and Servers",
            "action": [
              "Symbolic: Correlate Windows Event ID 4688 events where the parent process is `services.exe` with Zeek conn.log data by matching the host's IP and timestamp. Compare destination IPs from the corresponding `conn.log` entries against threat intelligence feeds of known C2 servers. Alert on any match.",
              "Statistical: For each service-spawned process, analyze the connection frequency and data volume in `conn.log`. Calculate the standard deviation of the time delta between connections to the same destination. A very low standard deviation indicates regular, machine-like beaconing. Alert on processes with connection time deltas in the lowest 5th percentile of variance.",
              "Machine Learning: Train a time-series forecasting model (e.g., LSTM or ARIMA) on legitimate network traffic patterns (bytes out, connection count, protocol) for each known service. Alert when the observed traffic significantly deviates from the forecasted model, suggesting anomalous C2 activity or data exfiltration."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to escalate privileges by manipulating service registry entries?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1574.011",
        "name": "Services Registry Permissions Weakness",
        "evidence": [
          {
            "description": "A service's `FailureCommand` registry value is populated or modified to execute a command, especially for a service configured to run with SYSTEM privileges.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Standard User Workstations, Multi-user Servers, All Endpoints",
            "action": [
              "Symbolic: Monitor Windows Event ID 4657 for modifications to `HKLM\\SYSTEM\\CurrentControlSet\\Services\\*\\FailureCommand`. Extract the command and compare its file hash and command-line arguments against a specific threat intelligence list of privilege escalation tools and payloads (e.g., PrintSpoofer, Juicy Potato, BadPotato).",
              "Statistical: Baseline the modification frequency of the `FailureCommand` value across all services. Since legitimate modifications are exceptionally rare, any modification should be treated as a high-severity statistical anomaly and trigger an immediate alert.",
              "Machine Learning: Train a text classification model on `FailureCommand` values, using features like command length, keywords (e.g., 'powershell', 'whoami', 'net user', 'IEX'), and path locations to distinguish benign recovery scripts from potential privilege escalation commands."
            ]
          },
          {
            "description": "A non-administrative user or an unusual parent process (e.g., a web browser or office application) executes `sc.exe`, `reg.exe`, or a PowerShell cmdlet to modify a service's configuration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for process creations of `sc.exe`, `reg.exe`, and `powershell.exe`. Use regular expressions to match command lines against patterns known to modify service paths, e.g., `sc.exe config .* binPath=`, `reg.exe add HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\.* /v ImagePath`. Alert if the executing user is not a member of a privileged group (e.g., Domain Admins, Local Administrators).",
              "Statistical: Profile the user accounts and parent processes that execute these commands. Flag executions by users outside of administrator groups or by statistically rare parent processes (e.g., `outlook.exe`, `chrome.exe`) as outliers requiring investigation.",
              "Machine Learning: Use a sequence analysis model to detect chains of events, such as a browser spawning PowerShell which then modifies a service registry key. Train a model on benign sequences and flag any anomalous sequence as high-risk."
            ]
          },
          {
            "description": "A sequence of events is observed on a single host in a short time window: 1) A service registry key's permissions are changed (Event ID 4670), 2) The service's `ImagePath` or `FailureCommand` is modified by the user who gained permissions (Event ID 4657), and 3) The service starts, resulting in a privileged process execution (Event ID 4688).",
            "data_sources": [
              "Windows Event ID 4670",
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Member Servers, Administrative Workstations",
            "action": [
              "Symbolic: Create a correlation search that triggers on a Windows Event ID 4670 (Permissions on an object were changed) for an object name under `\\REGISTRY\\MACHINE\\SYSTEM\\CurrentControlSet\\Services`. Within 10 minutes of the trigger, look for a Windows Event ID 4657 (Registry value modified) on the same object name, where the Subject/User matches the user granted permissions in the 4670 event. If this sequence occurs, alert.",
              "Statistical: Measure the time delta between the 4670 and 4657 events. A delta below a statistically determined threshold (e.g., 5 minutes, or the 1st percentile of observed deltas for legitimate changes) strongly indicates an automated exploit chain and should be alerted on.",
              "Machine Learning: Use a graph-based analysis tool to model these event sequences as paths. Train a model to recognize legitimate administrative workflows (e.g., software deployment via SCCM), and alert on paths that deviate, such as those initiated by non-administrative users or involving short time-to-live permission changes."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to evade defenses by manipulating service registry entries?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1574.011",
        "name": "Services Registry Permissions Weakness",
        "evidence": [
          {
            "description": "A service's `ImagePath` is modified to a Living Off the Land Binary (LOLBAS) with command-line arguments containing encoded payloads, download cradles, or references to malicious scripts.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: Monitor Windows Event ID 4657 for `ImagePath` modifications. When the service starts, inspect the corresponding process creation event (Windows Event ID 4688). If the process is a known LOLBAS (e.g., `rundll32.exe`, `mshta.exe`, `powershell.exe`), use regex on the full command line from Event 4688 to detect suspicious patterns like `-enc`, `IEX`, `DownloadString`, or references to `.ps1`, `.sct`, or `.hta` files.",
              "Statistical: For LOLBAS executions spawned by services, calculate the entropy and length of the command-line arguments. Flag executions where these values exceed the 98th percentile of the established baseline for that specific LOLBAS, as this often indicates obfuscated or long, complex commands.",
              "Machine Learning: Train a classifier on LOLBAS command lines to distinguish benign from malicious usage. Features can include argument count, presence of URLs, Base64 strings, and specific flags, enabling detection of novel evasion techniques that don't match known patterns."
            ]
          },
          {
            "description": "A service's `DisplayName` or `Description` is modified to a value that is a minor misspelling of a legitimate service (e.g., 'WinDefend' vs. 'WinDefend'), while its `ImagePath` points to an atypical executable or location.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: On service creation (Event ID 4697) or modification (Event ID 4657), compare the `DisplayName` against a list of legitimate service names using a Levenshtein distance calculation. A low distance (e.g., 1-2) indicates a potential misspelling. If a misspelling is found and the `ImagePath` is not the legitimate system path for that service, generate an alert.",
              "Statistical: Create a baseline map of `(DisplayName, ImagePath)` pairs from all healthy systems. Alert on any modification that creates a known `DisplayName` paired with a statistically rare or never-before-seen `ImagePath` across the enterprise.",
              "Machine Learning: Use a clustering algorithm on all services based on features of their name (e.g., character n-grams) and path. Masquerading services will likely form a small, distinct cluster that can be flagged for investigation."
            ]
          },
          {
            "description": "A registry value for a critical security service (e.g., EDR, antivirus, Sysmon, Windows Defender) is modified, changing its `Start` type to disabled (value 4) or altering its `ImagePath`.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: Maintain a list of critical registry keys corresponding to security services (e.g., `HKLM\\SYSTEM\\CurrentControlSet\\Services\\WinDefend`, `HKLM\\SYSTEM\\CurrentControlSet\\Services\\Sysmon`). Monitor Windows Event ID 4657 for any modification to these keys. Create a high-priority alert if the `Start` value is changed to `4` (Disabled) or if the `ImagePath` is changed to anything other than its known-good value.",
              "Statistical: Monitor the population-wide rate of modifications to these specific keys. A sudden increase in modifications across the environment, even if to different security services, is a statistical anomaly indicating a potential coordinated tampering campaign.",
              "Machine Learning: Use an anomaly detection model (e.g., isolation forest) trained on legitimate modification events for these services (e.g., during approved patching cycles). The model can detect and alert on any modification that is an outlier based on its context (e.g., time of day, modifying process, user account)."
            ]
          },
          {
            "description": "A process not typically associated with system administration (e.g., `winword.exe`, `chrome.exe`, `acrord32.exe`) modifies a registry key under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\`.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers",
            "action": [
              "Symbolic: For every Windows Event ID 4657 modifying a key under `HKLM\\SYSTEM\\CurrentControlSet\\Services\\`, correlate the Process ID with Windows Event ID 4688 to identify the modifying process name. Maintain an allow-list of processes authorized to modify service registry keys (e.g., `svchost.exe`, `TrustedInstaller.exe`, `sc.exe`, `powershell.exe`, patch management agents). Alert on any modification performed by a process not on this list.",
              "Statistical: For all processes observed modifying service registry keys, calculate their prevalence (frequency) across the enterprise. Flag modifications made by processes in the bottom 5th percentile of frequency as they are statistically rare and warrant investigation.",
              "Machine Learning: Train a classification model (e.g., Random Forest) to predict if a `(Modifying_Process_Name, Target_Service_Name)` pair is malicious. Features can include process signature status, user context, and time of day, allowing detection of suspicious modifications even from seemingly legitimate processes."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]