[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by reverting cloud instances? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578.004",
        "name": "Revert Cloud Instance",
        "evidence": [
          {
            "description": "Evidence of a cloud snapshot restoration, instance state reset, or storage type modification (e.g., 'Restore-AzVM', 'ec2 restore-snapshot', 'gcloud compute instances reset') found in cloud provider audit logs, OR a process creation event (Windows Event ID 4688) on a host containing similar command-line arguments, followed within a 30-minute window by a system shutdown event (Windows Event ID 1074) or loss of heartbeat from the same host.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "GCP Audit Logs",
              "Windows Event ID 4688",
              "Windows Event ID 1074"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider audit log streams (e.g., CloudTrail, Azure Monitor); Cloud-hosted virtual machines (Windows); Centralized SIEM/Log Management Platform",
            "action": [
              "Symbolic: Monitor cloud provider audit logs (e.g., AWS CloudTrail, Azure Activity Logs) for events with names like 'RestoreSnapshot', 'RestoreFromSnapshot', 'ResetInstance', or 'ModifyInstanceAttribute'. Correlate these events with a subsequent unexpected host shutdown (Windows Event ID 1074) or loss of telemetry from the same instance within 30 minutes.",
              "Statistical: Establish a baseline for the frequency and timing of snapshot/revert-related API calls (e.g., 'Restore-AzVM') for each administrative user or role. Alert when the frequency of these events for a single user exceeds the 95th percentile of their historical behavior, especially if occurring outside of standard business or maintenance hours.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on cloud audit log events, using features like event name, user identity, source IP geolocation, user agent, and time of day. Use the model to classify events as 'benign change management' or 'suspicious activity', flagging suspicious restore/revert events for immediate review."
            ]
          },
          {
            "description": "A statistically significant spike in connections or data volume from an instance to cloud management API endpoints (e.g., 'ec2.*.amazonaws.com', 'management.azure.com') or the instance metadata service (169.254.169.254), observed in network flow logs (Zeek conn.log) within 10 minutes prior to an unexpected system shutdown (Windows Event ID 1074) or abrupt cessation of all network traffic from that host's IP.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 1074",
              "Windows Event ID 6005",
              "Windows Event ID 6006"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud environment network gateways; Virtual network flow log collectors; Centralized SIEM/Log Management Platform",
            "action": [
              "Symbolic: Create a detection rule that alerts when a host initiates a connection to a watchlist of cloud management API FQDNs (identified via Zeek dns.log or conn.log 'server_name' field) and is followed by a system shutdown event (Event ID 1074) or a TCP reset ('RST' flag in Zeek conn.log) for that host's traffic within a 10-minute window.",
              "Statistical: For each instance, establish an hourly baseline of connection count and data volume (e.g., 'orig_bytes' + 'resp_bytes' in Zeek conn.log) to cloud management API endpoints. Alert when the connection count or data volume for a given host exceeds 3 standard deviations above its historical hourly mean, particularly outside of approved change management windows.",
              "Machine Learning: Deploy a time-series anomaly detection model (e.g., Prophet or ARIMA) on Zeek conn.log data, monitoring the number of connections per minute from each instance to the cloud metadata service (169.254.169.254). An anomalous spike identified by the model, when correlated with a subsequent loss of heartbeat or a system shutdown event for that instance, indicates potential pre-revert activity."
            ]
          },
          {
            "description": "A verifiable time gap in host-based logs (Windows Event Logs) where the gap's start time corresponds with a system restart event (e.g., Event ID 1074) and its duration masks a period of confirmed malicious activity observed in other data sources like network logs (Zeek conn.log) or EDR alerts.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 1074",
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "EDR Alerts"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM/Log Management Platform; Network sensor data lake; Cloud-hosted virtual machines (Windows)",
            "action": [
              "Symbolic: Upon a high-confidence network or EDR alert (e.g., connection to a known C2 server in Zeek conn.log), trigger an automated query for the host's logs (Event IDs 4688, 4624) from the SIEM for the 15 minutes surrounding the network event. If a system restart (Event ID 1074) is found and the corresponding host logs for the alert period are missing, generate a high-severity alert for a likely instance revert.",
              "Statistical: Continuously monitor the ingestion latency of logs from each cloud instance into the central SIEM. Establish a baseline for expected log shipping delay per host using the 95th percentile. After a restart event (Event ID 1074), if the time to receive the first new log from the host exceeds this baseline, flag for investigation to identify a potential log gap caused by a revert.",
              "Machine Learning: For each host, train a time-series model (e.g., LSTM) on the volume of logs ingested per minute to forecast expected log volume. After a restart event (Event ID 1074), compare the actual volume of logs received for the pre-restart period against the model's forecast. A statistically significant negative residual (where actual volume is far less than predicted) indicates a high probability of a log gap and potential revert."
            ]
          },
          {
            "description": "A Windows Event ID 4616 (System time was changed) event where the 'NewTime' field is chronologically earlier than the 'PreviousTime' field by more than 5 minutes, indicating a system time rollback, often correlated with a recent system startup event (Windows Event ID 6005).",
            "data_sources": [
              "Windows Event ID 4616",
              "Windows Event ID 6005",
              "Windows Event ID 1074"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud-hosted virtual machines (Windows); Active Directory Domain Controllers; Centralized SIEM/Log Management Platform",
            "action": [
              "Symbolic: Create a high-priority alert that triggers immediately upon detection of Windows Event ID 4616 where the 'NewTime' value is chronologically before the 'PreviousTime' value. This is a direct, high-fidelity indicator of a time rollback and requires immediate investigation.",
              "Statistical: Analyze the time delta between 'NewTime' and 'PreviousTime' for all Event ID 4616 events across the environment to establish a baseline of normal time corrections from NTP. Use descriptive statistics to define 'normal' drift (typically seconds). Flag any event where the backward time jump exceeds a dynamic threshold, such as 4 standard deviations from the mean time correction delta, or a hard threshold of >5 minutes, to identify statistically significant rollbacks.",
              "Machine Learning: Apply a clustering algorithm (e.g., DBSCAN) to Event ID 4616 data, using features like the time delta (NewTime - PreviousTime), the process that made the change (e.g., svchost.exe for NTP), and time of day. This will automatically group normal NTP-related time changes into a large, dense cluster, while significant, manual rollback events will be classified as anomalous outliers."
            ]
          },
          {
            "description": "A system restart event (Windows Event ID 1074) or a sudden loss of all network flows from a host's IP address (observed in Zeek conn.log), occurring within 60 minutes after a high-severity security alert (e.g., from an EDR, IDS, or other analytic) was triggered for that same host.",
            "data_sources": [
              "Windows Event ID 1074",
              "Zeek conn.log",
              "EDR Alerts",
              "IDS Alerts"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM/Log Management Platform; EDR Management Console; IDS/IPS Management Console",
            "action": [
              "Symbolic: Implement a correlation rule in the SIEM that subscribes to a feed of high-priority EDR or IDS alerts. If an alert for a specific host is followed within a 60-minute window by an unexpected shutdown event (Event ID 1074 with a non-standard process or empty reason) for the same host, escalate to a new, higher-severity 'Suspected Anti-forensics' alert.",
              "Statistical: For each host, calculate the baseline frequency of unexpected restarts (e.g., restarts per week not associated with patching). Monitor for hosts where the restart frequency within 24 hours following a security alert is statistically anomalous (e.g., in the 99th percentile) compared to its own baseline or the baseline of its peer group (e.g., other web servers).",
              "Machine Learning: Train a Bayesian network to calculate the conditional probability of an instance revert. The model would include nodes representing different evidence types (e.g., 'High-Severity EDR Alert', 'C2 Beaconing Detected'). The occurrence of a subsequent 'Unexpected Restart' event for the same host updates the probability of the 'Instance Revert' hypothesis. If the posterior probability P(Revert|Alert, Restart) crosses a predefined threshold (e.g., > 0.8), generate a high-confidence alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]