[
  {
    "information_requirement": "Is the adversary moving tools laterally within the network?",
    "tactic_id": "TA0008",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1570",
        "name": "Lateral Tool Transfer",
        "evidence": [
          {
            "description": "A file transferred between internal hosts matches a known malicious hash or a name strongly associated with an adversary tool.",
            "data_sources": [
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All internal network segments, Domain Controllers, File Servers",
            "action": [
              "Symbolic: For files observed in Zeek files.log, compute the hash and compare against a threat intelligence feed of known malicious tool hashes. Alert on any match. Concurrently, search for process creation events (Windows Event ID 4688) where the process name matches a watchlist of specific tool names (e.g., 'mimikatz.exe', 'procdump.exe').",
              "Statistical: For each file transfer, calculate the entropy of the filename. Establish a baseline for filename entropy across the network. Flag transfers where the filename entropy is in the top 5% (95th percentile), as adversaries often use randomized names to evade simple signature-based detection.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from Zeek files.log and conn.log (e.g., file MIME type, size, source/destination subnet, protocol, connection duration). The model should be trained on labeled historical data to predict the likelihood of a transfer being malicious. A high probability score from the classifier triggers an alert."
            ]
          },
          {
            "description": "A file is transferred to a non-standard or sensitive directory (e.g., C:\\Windows\\Temp, C:\\Users\\Public) or the filename matches a pattern associated with adversary tools.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek ftp.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Workstation-to-workstation traffic, Server-to-server traffic, Critical application servers",
            "action": [
              "Symbolic: From Zeek smb_files.log or Windows Event ID 4663 (Object Access), create a rule that alerts when a file is written to a sensitive or unusual directory (e.g., 'RECYCLER', 'Temp', 'Public') and the source is another internal host. The rule should also use regular expressions to match filenames against a list of known tool patterns (e.g., *mimikatz*.exe, *procdump*.dmp).",
              "Statistical: For each destination path on a given host, calculate its historical rarity for file writes. Maintain a frequency map of (destination_host, destination_path). Alert when a file is written to a path that falls below the 5th percentile of frequency for that host, indicating a rare write location.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on file transfer events. Features should include source host role, destination host role, destination path depth, file extension, and whether the transfer is read or write. Identify and alert on clusters of anomalous transfers that do not group with normal administrative or user activity."
            ]
          },
          {
            "description": "A process not typically associated with network administration or file sharing (e.g., winword.exe, w3wp.exe) initiates a file transfer to another internal system.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application servers (e.g., web servers, database servers), User workstations, Privileged access workstations (PAWs)",
            "action": [
              "Symbolic: Create a watchlist of processes that should not typically initiate outbound SMB or FTP connections (e.g., 'winword.exe', 'excel.exe', 'acrord32.exe', 'w3wp.exe'). On a source host, correlate a process creation event (Windows Event ID 4688) with a subsequent outbound connection in Zeek conn.log on ports 445 or 21 to another internal host. Alert if the parent process is on the watchlist.",
              "Statistical: For each process name on each host, build a baseline of its child processes and network connection destinations. Calculate the frequency of each (parent_process, child_process) and (process, destination_port) pair. Alert when a process initiates a connection to a port or spawns a child process that is statistically rare for it (e.g., below the 1st percentile of observed frequency).",
              "Machine Learning: Develop a time series anomaly detection model for each host's network behavior, specifically focusing on the number of lateral file transfers initiated per hour. Use a model like SARIMA or an LSTM autoencoder to predict the expected number of transfers. An alert is generated when the observed number of transfers significantly exceeds the model's prediction interval."
            ]
          },
          {
            "description": "A file with the same hash or name is transferred from one source host to a statistically unusual number of destination hosts within a short time window (e.g., one hour).",
            "data_sources": [
              "Zeek files.log",
              "Zeek smb_files.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Entire internal network address space, Subnets containing high-value assets, Domain Controllers",
            "action": [
              "Symbolic: Create a rule that triggers if a single source IP is seen transferring the same filename via SMB (from Zeek smb_files.log) to more than 10 distinct internal IPs within a 30-minute window. This is a simple threshold-based rule indicating a potential 'fan-out'.",
              "Statistical: Over a rolling 1-hour window, group file transfers by file hash (from Zeek files.log). For each hash, count the number of unique destination hosts. Calculate the 99th percentile for this 'fan-out count' across all file transfers in the last 30 days. Alert if any file's fan-out count exceeds this dynamic threshold.",
              "Machine Learning: Use a graph-based anomaly detection approach. Model internal hosts as nodes and file transfers as directed, weighted edges. Analyze the graph for 'star' or 'broadcast' motifs where one node rapidly creates edges to many other nodes. A sudden increase in the out-degree of a node, especially with identical edge properties (same file hash), would be flagged as a high-priority anomaly."
            ]
          },
          {
            "description": "A peer-to-peer connection between internal hosts uses a protocol or port rarely associated with file transfers, or the data volume transferred deviates more than 3 standard deviations from the established baseline for that host pair.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "East-west traffic between all internal subnets, Network traffic to/from bastion hosts, VPN user subnets",
            "action": [
              "Symbolic: Define a list of allowed protocols and ports for internal peer-to-peer communication (e.g., SMB/445, RDP/3389). Create a rule to alert on any connection between internal IP ranges that uses a protocol/port combination not on the allow list, such as FTP (21), SSH (22), or any high, non-standard port.",
              "Statistical: For each source-destination host pair on the internal network, establish a daily baseline of total bytes transferred ('orig_bytes' + 'resp_bytes' from Zeek conn.log). Calculate the mean and standard deviation over a 30-day period. Generate an alert if the daily data volume for a host pair exceeds the mean by more than 3 standard deviations ($$ \\text{volume} > \\mu + 3\\sigma $$).",
              "Machine Learning: Apply an unsupervised learning model, like an Isolation Forest, to all Zeek conn.log entries for internal traffic. Use features such as protocol, port, duration, orig_bytes, resp_bytes, and connection state. The model will learn what 'normal' connections look like and assign an anomaly score to each connection. Connections with the highest anomaly scores should be investigated."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]