[
  {
    "information_requirement": "Is the adversary using encrypted channels for command and control?",
    "tactic_id": "TA0011",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1573",
        "name": "Encrypted Channel",
        "evidence": [
          {
            "description": "An encrypted connection is established to an external IP address, domain, or involves an SSL certificate fingerprint known to be associated with active command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies)",
            "action": [
              "Symbolic: Continuously inner join destination IPs from Zeek conn.log, server names (SNI) from Zeek ssl.log, and certificate SHA1 fingerprints from Zeek ssl.log against a high-confidence, frequently updated CTI feed of known malicious C2 IPs, domains, and certificate hashes. Generate an immediate alert for any matches.",
              "Statistical: For domains matching CTI, calculate the domain's registration age and DNS query-to-connection ratio. Flag domains that are newly registered (e.g., < 30 days old) and have a low query-to-connection ratio (e.g., below the 10th percentile for the organization), as this can indicate DGA or hardcoded IPs not reliant on DNS lookups.",
              "Machine Learning: Develop a classification model (e.g., Logistic Regression) trained on features from Zeek logs (connection duration, data volume, periodicity, certificate attributes) and CTI feeds. Use the model to score all outbound SSL/TLS connections for their likelihood of being malicious C2 traffic, alerting on scores above a defined probability threshold."
            ]
          },
          {
            "description": "An encrypted communication session uses a TLS client signature (JA3) or server signature (JA3S) known to be associated with a specific malware family or malicious tool.",
            "data_sources": [
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All hosts initiating TLS/SSL connections",
            "action": [
              "Symbolic: Extract JA3 (client) and JA3S (server) hashes from all Zeek ssl.log records. Correlate these hashes against open-source or commercial feeds of JA3/JA3S hashes associated with known malware (e.g., Cobalt Strike, Metasploit, TrickBot). Alert on any match.",
              "Statistical: Perform a frequency analysis on all observed JA3 hashes across the enterprise over a 24-hour period. Identify and investigate any JA3 hash that is seen on fewer than 5 hosts or represents less than 0.01% of total connections (long-tail analysis), as this indicates a non-standard or rare client application.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means, DBSCAN) on the feature space of JA3 hashes and associated connection metadata (port, destination ASN, SNI). Analyze clusters of rare JA3 hashes to identify potentially related malicious activity across different hosts that might not yet be in a CTI feed."
            ]
          },
          {
            "description": "An encrypted connection utilizes an SSL/TLS certificate with suspicious attributes, such as being self-signed, having a very short validity period, or containing generic, non-descriptive subject information.",
            "data_sources": [
              "Zeek x509.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with SSL/TLS inspection capabilities",
            "action": [
              "Symbolic: Analyze Zeek x509.log for certificates where the issuer and subject are identical (self-signed) and the connection is to an external IP. Additionally, flag certificates with subject or issuer common names (CN) containing known suspicious or default strings (e.g., 'localhost', 'admin', 'example.com').",
              "Statistical: For all external TLS connections, calculate the distribution of certificate validity periods. Flag any certificates with a validity period below the 5th percentile (e.g., < 90 days) or above the 95th percentile (e.g., > 825 days). Calculate the Shannon entropy of the certificate's Subject Common Name; low entropy strings may indicate auto-generated or non-descriptive names.",
              "Machine Learning: Train a decision tree classifier on features extracted from Zeek x509.log (is_self_signed, validity_period, subject_entropy, key_length). Use the model to classify each new certificate as 'benign' or 'suspicious', flagging the latter for analyst review."
            ]
          },
          {
            "description": "An internal host establishes periodic, low-volume, and long-running encrypted connections to a single external destination, which is characteristic of C2 beaconing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Client subnets and servers with direct internet access",
            "action": [
              "Symbolic: For each source-destination IP pair in Zeek conn.log, check if the destination IP is on a 'non-browser' or 'non-CDN' watchlist. Alert if periodic traffic is observed to a destination on this watchlist.",
              "Statistical: For each internal source IP, group external SSL/TLS connections from Zeek conn.log by destination IP. Calculate the standard deviation of the time deltas between consecutive connections. A standard deviation close to zero (e.g., < 1.0 second) indicates highly regular, machine-generated beaconing. Also flag connections where the ratio of outbound to inbound bytes is consistently high.",
              "Machine Learning: Apply a time series analysis model (e.g., Fourier Transform) to the connection timestamps for each source-destination pair to detect strong periodic signals. A strong, consistent signal with a fixed period (e.g., every 5 minutes +/- 1 second) is a high-fidelity indicator of beaconing."
            ]
          },
          {
            "description": "Encrypted network traffic is initiated by a process not typically associated with network communication, or by a process running from an unusual file path.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations and critical servers (e.g., Domain Controllers, Application Servers)",
            "action": [
              "Symbolic: Correlate process creation events (Windows Event ID 4688) with their subsequent network connections (Windows Event ID 5156). Maintain an allow-list of common processes known to make external encrypted connections (e.g., 'chrome.exe', 'outlook.exe'). Alert on any process not on this list that initiates an external connection.",
              "Statistical: For all processes making network connections, calculate the entropy of the process path. A high entropy score can indicate randomized file paths used by malware. Additionally, establish a baseline of 'normal' parent-child process relationships and flag any network-bound process spawned by an unusual parent (e.g., 'winword.exe' spawning 'powershell.exe').",
              "Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) trained on features of processes that make network connections (process name, path, parent process, command line arguments). The model can identify rare combinations of these features that deviate from baselined normal behavior, indicating a potentially malicious process."
            ]
          },
          {
            "description": "Sustained encrypted communication occurs over a non-standard port or the encrypted traffic violates expected protocol behavior, suggesting evasion of port-based filtering.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points and internal network segment gateways",
            "action": [
              "Symbolic: Filter Zeek conn.log for connections where Zeek's dynamic protocol detection identifies the service as 'ssl' but the destination port is not in a pre-defined set of common encrypted ports (e.g., 443, 8443, 993, 995). Review Zeek's weird.log for any weirds of type 'ssl_weird_version' or 'bad_client_hello' associated with these connections.",
              "Statistical: Perform a frequency analysis on all destination ports used for 'ssl' services identified by Zeek. Create a distribution and flag any port that falls in the long tail (e.g., used by less than 0.05% of all SSL connections). This 'long-tail analysis' helps find adversaries hiding on high, unassigned ports.",
              "Machine Learning: Develop a one-class SVM (Support Vector Machine) model trained on the features of 'normal' SSL/TLS connections (e.g., port=443, no associated weirds, common JA3). Use this model to identify outliers that do not conform to the profile of a normal connection, which could represent C2 over non-standard ports."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]