[
  {
    "information_requirement": "Has the adversary attempted to evade detection or remove evidence by deleting cloud instances?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578.003",
        "name": "Delete Cloud Instance",
        "evidence": [
          {
            "description": "A cloud instance deletion API call (e.g., AWS 'TerminateInstances') is executed from a source IP address that is either on a threat intelligence list or is statistically anomalous for the actor or organization.",
            "data_sources": [
              "AWS CloudTrail logs",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Management Plane, Identity and Access Management (IAM) Service, Internet Gateway/VPC Flow Logs, Threat Intelligence Platform",
            "action": [
              "Symbolic: For each instance deletion event, extract the source IP address. Alert if the source IP matches an entry in a threat intelligence feed of known malicious IPs, anonymizers, or TOR exit nodes.",
              "Statistical: For each user/role, build a historical baseline of source countries and Autonomous Systems (ASNs). Calculate the frequency distribution. Alert if a deletion event originates from a location that falls below a rarity threshold (e.g., <1% of the actor's historical activity).",
              "Machine Learning: Train an unsupervised anomaly detection model (e.g., Isolation Forest) on enriched deletion event data. Use features such as `[source_IP_geo_rarity_score, source_ASN_rarity_score, time_of_day, user_role]`. The model will assign an anomaly score to each event, with high scores indicating a likely malicious deletion."
            ]
          },
          {
            "description": "A cloud instance deletion API call is executed with a User-Agent string that is either on a deny-list of malicious tools or is inconsistent with approved Infrastructure-as-Code (IaC) or administrative tools.",
            "data_sources": [
              "AWS CloudTrail logs",
              "Azure Activity Logs",
              "Google Cloud Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Management Plane, CI/CD Pipeline Servers, Administrator Workstations",
            "action": [
              "Symbolic: Extract the User-Agent string from each deletion event. Alert if the User-Agent matches a known malicious tool signature or if it is not on an explicit allow-list of approved tools (e.g., 'Terraform', 'AWS-CLI', 'Azure-PowerShell').",
              "Statistical: Calculate the historical frequency of each User-Agent string per user or role. Alert if a deletion is performed using a User-Agent that has never been seen before for that actor or is in the bottom percentile (e.g., <2%) of usage frequency across the organization.",
              "Machine Learning: Use Natural Language Processing (NLP) vectorization techniques (e.g., TF-IDF) on User-Agent strings to create numerical feature sets. Apply a clustering algorithm (e.g., DBSCAN) to group legitimate agents and flag any deletion events whose User-Agent vectors are classified as noise or outliers."
            ]
          },
          {
            "description": "A cloud instance is deleted by an actor within an anomalously short time after its creation by the same actor, where the instance lifespan is a statistical outlier compared to organizational norms.",
            "data_sources": [
              "AWS CloudTrail logs",
              "Azure Activity Logs",
              "Google Cloud Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Management Plane, Virtual Private Cloud (VPC), Cloud Asset Inventory Database (CMDB)",
            "action": [
              "Symbolic: For each instance, correlate its creation ('RunInstances') and deletion ('TerminateInstances') events by `instanceId` and `userIdentity`. Alert if the calculated lifespan `(deletion_timestamp - creation_timestamp)` is less than a fixed threshold (e.g., 1 hour).",
              "Statistical: Calculate the lifecycle duration for all terminated instances, grouped by instance type or owner tag. Alert if an instance's lifespan falls below a low percentile (e.g., 5th percentile) of the historical distribution for its group.",
              "Machine Learning: Use time series forecasting (e.g., ARIMA) on the population of instance lifecycles to model normal behavior. An event where a new instance's lifecycle is a significant negative outlier from the forecast, or a sudden cluster of short-lived instances, would trigger an alert."
            ]
          },
          {
            "description": "A cloud instance tagged as 'critical' or with an uptime exceeding a high statistical threshold (e.g., 90th percentile) is deleted by an unauthorized user or outside of a scheduled change window.",
            "data_sources": [
              "AWS CloudTrail logs",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "CMDB/Asset Inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Production Environment VPCs, Cloud Asset Inventory Database (CMDB), Change Management System, Identity and Access Management (IAM) Service",
            "action": [
              "Symbolic: Create a rule that alerts when a deletion event's target instance has a `tag: 'critical'` AND the event's actor is NOT in the predefined `CloudAdmins` group OR the event timestamp does not fall within an approved change request window.",
              "Statistical: Maintain a running distribution of instance uptimes at the moment of deletion. Alert if an instance with an uptime in the top decile (e.g., >90th percentile) is deleted, as this indicates the unexpected removal of a stable, long-running asset.",
              "Machine Learning: Train a classification model (e.g., Random Forest) to predict the legitimacy of a critical instance deletion. Features would include `[actor_role, is_in_change_window, instance_uptime_days, time_of_day, day_of_week]`. The model can learn the patterns of authorized vs. unauthorized critical changes."
            ]
          },
          {
            "description": "A single actor deletes a statistically significant number of cloud instances within a short time window, exceeding their individual baseline or a global organizational threshold.",
            "data_sources": [
              "AWS CloudTrail logs",
              "Azure Activity Logs",
              "Google Cloud Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Management Plane, Identity and Access Management (IAM) Service, Billing and Cost Management Dashboard",
            "action": [
              "Symbolic: Alert if the count of distinct `instanceId` values deleted by a single `userIdentity` within a 5-minute sliding window exceeds a static threshold (e.g., >10 instances).",
              "Statistical: For each actor, establish a baseline of deletion activity (count per hour). Using a sliding window, calculate the Z-score for the current deletion count against the actor's historical mean and standard deviation. Alert if the Z-score is greater than 3.",
              "Machine Learning: Apply a time series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) to the organization-wide count of instance deletions aggregated per minute. This model can identify anomalous spikes that deviate from established daily or weekly operational rhythms."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]