[
    {
        "information_requirement": "Is the adversary developing or acquiring resources for attacks?",
        "tactic_id": "TA0042",
        "tactic_name": "Resource Development",
        "indicators": [
            {
                "technique_id": "T1588.005",
                "name": "Exploits",
                "evidence": [
                    {
                        "description": "Network connections from internal hosts to domains or IP addresses known to host exploit kits, malware development forums, or repositories of public exploit code.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate outbound network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) against a CTI feed of domains and IP addresses associated with exploit distribution, malware development forums, or known exploit code repositories (e.g., specific GitHub repositories, exploit-db.com). Alert on any matches originating from corporate, non-research subnets and investigate the host for staging or development activity."
                    },
                    {
                        "description": "An internal host downloading files with extensions or content characteristic of exploit code or vulnerability research tools (e.g., .py, .rb, .pl, .ps1 containing 'exploit', 'CVE-', 'PoC').",
                        "data_sources": [
                            "Zeek files.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek files.log and http.log for files downloaded from the internet. Analyze filenames for patterns such as 'exploit', 'poc', 'cve-[year]-[number]', or 'vulnerability'. Use frequency analysis to flag rare file extensions or filenames. If TLS inspection is available, apply content inspection to identify common patterns in exploit scripts. Flag downloads of these file types, especially when originating from unusual sources or destined for non-developer workstations."
                    },
                    {
                        "description": "Targeted, low-and-slow network scanning from an external source specifically probing for a single, recently disclosed vulnerability across multiple hosts, suggesting the adversary has acquired a new exploit and is identifying targets.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor inbound connection logs (Zeek conn.log) for patterns of distributed, low-frequency scanning targeting a specific port or service associated with a recent, high-profile CVE. Use correlation analysis to identify many different external IPs connecting to the same specific port across the external footprint over an extended period (hours/days). Apply time series analysis to detect a spike in this specific probe activity that correlates with the public disclosure date of the associated vulnerability."
                    },
                    {
                        "description": "An internal host exhibiting a behavioral sequence of vulnerability research and tool acquisition, such as visiting vulnerability databases, then code repositories, and then downloading potential exploit development tools or scripts.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek files.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate web browsing activity (Zeek http.log) to identify hosts visiting multiple vulnerability disclosure sites (e.g., NIST NVD, CVE Mitre), followed by visits to code repositories (e.g., GitHub, GitLab). Correlate this activity with subsequent file downloads (Zeek files.log) of scripts or tools, or the execution of compilers/interpreters with suspicious command lines (Windows Event ID 4688). Use correlation and sequence analysis to create a risk score for hosts exhibiting this behavioral chain, especially if the host does not belong to a developer or security researcher."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
