[
  {
    "information_requirement": "Has the adversary deployed a newly developed capability within our environment? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1587",
        "name": "Develop Capabilities",
        "evidence": [
          {
            "description": "The hash of an executed file or a file observed in network traffic matches a hash from a threat intelligence feed for newly developed malware, or a network connection is made to an IP/domain associated with newly identified adversary infrastructure.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices, Network egress points, Threat intelligence platforms",
            "action": [
              "Symbolic: Continuously join process creation logs (Windows Event ID 4688) and file analysis logs (Zeek files.log) against a high-fidelity threat intelligence feed of hashes for newly developed malware. Generate an alert upon a match.",
              "Statistical: For all file hashes observed for the first time in the environment, calculate their prevalence across all endpoints. A hash with extremely low prevalence (e.g., seen on < 0.1% of endpoints) that is not associated with legitimate software updates should have its risk score increased.",
              "Machine Learning: Deploy a supervised machine learning classifier (e.g., Random Forest) trained on file metadata (PE header info, entropy, string features) and contextual data (prevalence, source) to predict if a newly observed executable file is malicious. Use threat intelligence feeds and historical malware samples for training labels."
            ]
          },
          {
            "description": "A TLS session is established using a JA3/JA3S hash pair that is statistically rare or unseen in the environment, indicating a non-standard or custom client/server application.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internal network segments, TLS inspection points",
            "action": [
              "Symbolic: Maintain a watchlist of known malicious or suspicious JA3/JA3S hashes from threat intelligence. Query Zeek ssl.log to alert on any direct match with this watchlist.",
              "Statistical: For every JA3/JA3S hash pair observed in Zeek ssl.log, calculate its frequency across the enterprise over a 30-day rolling window. Identify pairs falling below a low percentile threshold (e.g., 1st percentile) as anomalous, especially when connecting to newly observed domains.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on JA3 hashes and associated connection metadata (destination port, SNI, byte counts) to group similar client behaviors. Identify small clusters or outliers as potentially unique, custom-developed tools that deviate from established application clusters."
            ]
          },
          {
            "description": "A process, observed for the first time in the environment, executes a chain of actions within a short time window: process creation, followed by file modification, followed by persistence mechanism creation, and concluding with an external network connection.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 11",
              "Windows Event ID 13",
              "Windows Event ID 7045",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations and servers), Domain Controllers",
            "action": [
              "Symbolic: Create a detection rule that triggers when a single Process GUID/ID is associated with a specific sequence of events: process creation (4688), followed by registry run key modification (Sysmon Event ID 13), followed by an external TCP connection (Zeek conn.log) within a 60-second window.",
              "Statistical: Establish a baseline of common parent-child process relationships and subsequent process action sequences. Calculate the probability of a given sequence occurring. Flag sequences with extremely low probability scores, especially when initiated by a process with low prevalence across the organization.",
              "Machine Learning: Develop a Hidden Markov Model (HMM) where states represent discrete host activities (e.g., 'FileWrite', 'NetConn', 'RegWrite'). Train the model on benign activity sequences. Use the model to score new event sequences; sequences with low likelihood scores are flagged as anomalous and potentially indicative of a newly developed malicious tool."
            ]
          },
          {
            "description": "Network connections are established to a domain or IP address with no prior history in the organization, and the traffic pattern exhibits characteristics of C2 beaconing (e.g., fixed time intervals, similar payload sizes) or data staging (e.g., large, sustained uploads).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS servers (recursive resolvers), Network egress points, Web proxies",
            "action": [
              "Symbolic: Join DNS query logs (Zeek dns.log) with a threat intelligence feed of newly registered domains (NRDs). Alert on any internal host attempting to resolve a domain registered within the last 48 hours.",
              "Statistical: For each source-destination IP pair in Zeek conn.log, calculate the time delta between connections. A very low standard deviation of these time deltas indicates regularly spaced connections (beaconing). Also, calculate the 95th percentile of originated bytes for all outbound connections; flag connections exceeding this threshold to a newly seen IP as potential data staging.",
              "Machine Learning: Apply a time series forecasting model (e.g., ARIMA) to the volume of traffic to all external destinations. A significant, unpredicted spike in traffic to a new destination could indicate the activation of a newly developed capability for data exfiltration. Use anomaly detection on the forecast residuals."
            ]
          },
          {
            "description": "A TLS connection is established using a certificate that is either self-signed, has a very recent creation date, or contains subject/issuer fields with low character-set entropy, all of which are hallmarks of custom, disposable C2 infrastructure.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "TLS inspection points, Network egress points, Web proxies",
            "action": [
              "Symbolic: Create a rule to alert on any TLS session in Zeek ssl.log where the 'issuer' field is identical to the 'subject' field (indicating a self-signed certificate) and the destination is an external IP address.",
              "Statistical: For all certificates in Zeek ssl.log, calculate the Shannon entropy of the 'subject' and 'issuer' strings. Establish a baseline entropy distribution for legitimate certificates. Flag certificates with entropy values in the lowest quartile (e.g., < 25th percentile) as suspicious. Additionally, flag any certificate where the 'not_valid_before' date is within the last 7 days.",
              "Machine Learning: Train a classifier (e.g., Logistic Regression) to distinguish between legitimate and malicious certificates. Use features such as certificate validity period length, entropy of subject/issuer, presence of certain keywords, and whether it's self-signed. Use public Certificate Transparency logs for training data."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]