[
  {
    "information_requirement": "What evidence indicates adversaries are leveraging malvertising infrastructure against our environment or users?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.008",
        "name": "Malvertising",
        "evidence": [
          {
            "description": "A direct network connection or DNS query from an internal host to a domain, IP address, or URL found on a high-confidence threat intelligence feed specifically categorized as malvertising infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Internet Gateway, Internal DNS Resolvers",
            "action": [
              "Symbolic (IOC Match): Continuously join Zeek conn.log, dns.log, and http.log records against a threat intelligence list of known malvertising indicators (IPs, domains, URLs). Generate an alert for any match.",
              "Statistical (Frequency Analysis): For each matched indicator, calculate the number of unique internal hosts making contact within a 1-hour window. If this count exceeds the 95th percentile of hourly unique host contacts for any IOC over the last 30 days, escalate the alert priority.",
              "Machine Learning (Time Series Forecasting): Apply a time series forecasting model (e.g., SARIMA) to the total volume of malvertising IOC matches per hour. An observed volume that exceeds the forecasted 99% confidence interval indicates a potential new campaign and should trigger an investigation."
            ]
          },
          {
            "description": "A sequence of at least three HTTP 30x redirects within 10 seconds, originating from a known ad network domain and terminating at a domain that is either a Newly Registered Domain (NRD, registered < 30 days ago) or has a reputation score below a defined threshold (e.g., < 20/100).",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Proxies, Internet Gateway, User Workstations",
            "action": [
              "Symbolic (Pattern Match): Using Zeek http.log, create a stateful rule that tracks sessions by `uid`. Identify sessions where the `referer` field matches a list of known advertising network domains. Alert if the session involves three or more consecutive HTTP 30x redirects and the final destination domain is present on an NRD list or has a reputation score below 20.",
              "Statistical (Entropy Analysis): For traffic to the final destination domain in a flagged redirect chain, calculate the Shannon entropy of the URL's query string. If the entropy score is in the top 5th percentile of all destination URL query string entropy scores calculated over the last 24 hours, increase the alert's risk score.",
              "Machine Learning (Classification): Train a gradient boosting classifier to predict malicious redirect chains. Use features such as: number of redirects, total chain duration, presence of NRD in chain, final domain reputation, final domain TLD, and entropy of final URL query string. Run all observed redirect chains through the model and alert on those with a high probability score (>0.8)."
            ]
          },
          {
            "description": "A file (e.g., EXE, MSI, DLL, script) is downloaded and written to an endpoint's file system, where the network download session originated from an advertisement referer URL, and the file's hash has a low prevalence (<10 instances) across the enterprise.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Windows Event ID 11 (Sysmon)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Internet Gateway, Download Servers",
            "action": [
              "Symbolic (Signature Match): Correlate Zeek http.log and files.log using the session `uid`. If the http.log `referer` matches a known ad network and a file is downloaded, extract the file hash from files.log. Correlate this with host logs (Sysmon Event ID 11) to confirm file creation on the endpoint. Alert if the file hash matches a known malicious signature.",
              "Statistical (Prevalence & Entropy): For any file downloaded via an ad network referer, calculate its prevalence (count of unique hosts with the same file hash) across the enterprise over the last 30 days. If the prevalence is below a threshold (e.g., < 10) and its Shannon entropy is high (> 7.0 for binaries), flag it as suspicious.",
              "Machine Learning (Time Series Anomaly): Implement a time series anomaly detection model on the rate of executable file downloads per hour where the referer is an ad network. An observed rate exceeding the 99th percentile of the historical baseline suggests a mass distribution campaign and should trigger an alert."
            ]
          },
          {
            "description": "A scripting engine process (e.g., powershell.exe, wscript.exe) or other non-browser process is created with a web browser process as its parent within 60 seconds of that browser completing a web request to a domain associated with a malvertising IOC or a high-risk redirect chain.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 1 (Sysmon)",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, Active Directory Domain Controllers",
            "action": [
              "Symbolic (Correlation): Create a correlation rule that triggers on a Windows Event ID 4688 or Sysmon Event ID 1 showing a browser process (`chrome.exe`, `edge.exe`) spawning a child process (e.g., `powershell.exe`, `cmd.exe`, `mshta.exe`). Within the rule, query network logs (Zeek conn.log/http.log) for the host's IP in the 60 seconds prior to the event timestamp. If the host communicated with a known malvertising IOC, generate a high-severity alert.",
              "Statistical (Argument Analysis): For all process creation events with a browser parent, extract and analyze the command-line arguments. Calculate the character frequency distribution and entropy of the command line. Flag any instance where the entropy exceeds the 98th percentile of the established baseline for that specific parent-child process pair.",
              "Machine Learning (Classification): Use a trained Random Forest classifier to score the likelihood of a browser-spawned process being malicious. Features should include: child process name, parent process name, command-line length, command-line entropy, presence of suspicious keywords (e.g., 'invoke', 'download', 'base64'), and a flag indicating recent network connection to a low-reputation domain. Alert on processes with a high malicious probability score."
            ]
          },
          {
            "description": "A sharp increase in DNS queries for Newly Registered Domains (NRDs) across the enterprise, correlated with web traffic originating from advertisement networks.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Internet Gateway, Web Proxies",
            "action": [
              "Symbolic (List Match & Correlation): Correlate Zeek dns.log with http.log on source IP and timestamp. For every DNS query to a domain on an NRD list, check for a preceding (within 5 seconds) HTTP request from the same source IP where the `referer` domain is on a list of known ad-serving platforms. Alert on each correlated instance.",
              "Statistical (Volume Anomaly): Establish an hourly baseline of the count of unique source IPs querying for NRDs over the past 30 days. Calculate the mean and standard deviation for each hour of the day. Trigger an alert if the current hourly count exceeds three standard deviations above the historical mean for that hour.",
              "Machine Learning (Anomaly Detection): Employ an unsupervised anomaly detection algorithm like Isolation Forest on 5-minute windows of DNS activity. Features should include: count of unique NRDs queried, ratio of NRD queries to total queries, average entropy of queried domain names, and the count of distinct TLDs within the NRDs. Flag time windows identified as highly anomalous for analyst investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]