[
  {
    "information_requirement": "Is the adversary gathering victim identity information during reconnaissance?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1589",
        "name": "Gather Victim Identity Information",
        "evidence": [
          {
            "description": "A successful or failed authentication attempt, or a web request, originating from a source IP address present on a high-confidence threat intelligence feed of known malicious scanners, open proxies, or TOR exit nodes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN, OWA, M365), public web servers, network firewalls/gateways",
            "action": [
              "Symbolic: Continuously correlate the source IP address from Zeek conn.log, Zeek http.log, and Windows Event IDs 4624/4625 against a threat intelligence feed of known malicious IPs. Generate an alert for any match.",
              "Statistical: For IPs matching a threat intelligence feed, calculate the ratio of failed (Event ID 4625) to successful (Event ID 4624) logins. Compare this ratio to the baseline for all external IPs. Flag IPs where this ratio exceeds the 95th percentile, indicating anomalous and likely malicious authentication activity.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) using features such as IP reputation, historical login success/failure rates for the IP, and time of day. Use the model to assign a 'malicious probability' score to each incoming authentication attempt from an external source. Alert on attempts with a score above a predefined confidence threshold."
            ]
          },
          {
            "description": "An HTTP/S request to a public-facing web application or authentication endpoint containing a User-Agent string, header combination, or request pattern associated with automated reconnaissance tools (e.g., Nmap, Feroxbuster, SQLMap).",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public web servers, application load balancers, web application firewalls (WAFs)",
            "action": [
              "Symbolic: Scan Zeek http.log for requests to sensitive URIs like '/login' or '/api'. Apply a ruleset of regular expressions to match User-Agent strings of known reconnaissance and vulnerability scanning tools (e.g., 'gobuster', 'sqlmap', 'nmap scripting engine'). Alert on any matches.",
              "Statistical: For each source IP, calculate the entropy of the User-Agent strings used within a 5-minute window. A very low entropy (near 0) indicates a single tool is being used repeatedly. Compare this to the distribution of User-Agent entropy scores from all external IPs and flag sources in the lowest 5th percentile that also exhibit a high request count.",
              "Machine Learning: Use a sequence analysis model (e.g., a Recurrent Neural Network) to learn normal user browsing sequences (URI paths, request timing). Feed real-time request sequences from individual IPs into the model. Flag sequences that the model identifies as anomalous or having a low probability of being generated by a human user, which often indicates automated scanning."
            ]
          },
          {
            "description": "A cluster of failed authentication events (Windows Event ID 4625 with status code 0xC0000064 'user name does not exist') from a single source IP targeting a large number of distinct, non-existent user accounts over a short period, indicating a username enumeration attempt.",
            "data_sources": [
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Federation Services (ADFS), RADIUS servers, any centralized authentication server",
            "action": [
              "Symbolic: From Windows Event ID 4625 logs, identify source IPs that generate more than 50 failed logins with status code 0xC0000064 ('user name does not exist') within a 5-minute window. Alert on any IP exceeding this threshold.",
              "Statistical: For each source IP, calculate the Shannon entropy of the set of attempted usernames from Event ID 4625 logs within a 10-minute window. A high entropy suggests random character guessing. Establish a baseline entropy for normal typo-related failures and alert on IPs whose username entropy exceeds the 98th percentile.",
              "Machine Learning: Employ a clustering algorithm (e.g., DBSCAN) on authentication failure events, using features like source IP, time between attempts, and the count of unique usernames. The algorithm can automatically group enumeration attempts into distinct clusters, separating them from random, isolated failed logins."
            ]
          },
          {
            "description": "A sustained, high-frequency pattern of HTTP GET requests from a single source IP to web pages or API endpoints known to contain identity information (e.g., 'About Us', 'Team Directory', user profile APIs), where the request rate is significantly higher than typical human browsing behavior.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing corporate website, employee directory pages, API gateways",
            "action": [
              "Symbolic: Create a list of sensitive URIs known to contain PII or employee data (e.g., '/about/team', '/api/users'). Monitor Zeek http.log and alert on any external source IP that requests more than 30 of these sensitive URIs within 1 minute.",
              "Statistical: For each source IP, calculate the requests per minute and the standard deviation of the time between requests. Automated scraping tools often have a very low standard deviation. Flag IPs where the request rate is above the 99th percentile and the inter-request time standard deviation is below the 1st percentile of the baseline.",
              "Machine Learning: Apply time series forecasting (e.g., ARIMA) to the request volume for sensitive web directories. The model will predict the expected request volume for a given time period. Generate an alert when the actual observed volume significantly exceeds the model's predicted confidence interval, indicating an anomalous spike consistent with scraping."
            ]
          },
          {
            "description": "A pattern of authentication failures characterized by either: (1) one source IP attempting logins against many accounts (Password Spraying), or (2) one account being targeted by many source IPs (Credential Stuffing).",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN, OWA, M365), Domain Controllers",
            "action": [
              "Symbolic: To detect password spraying, trigger an alert when a single source IP generates failed logins (Event ID 4625) for more than 20 unique accounts in 60 minutes. To detect credential stuffing, alert when a single user account has failed logins from more than 10 unique source IPs in 60 minutes.",
              "Statistical: In a 1-hour window, group authentication events by source IP. Calculate the ratio of unique accounts attempted to total attempts. A high ratio (near 1.0) is indicative of password spraying. Conversely, group by account name and calculate the ratio of unique source IPs to total attempts. A high ratio here suggests credential stuffing. Alert on values exceeding the 99th percentile of their respective baselines.",
              "Machine Learning: Train a classifier on aggregated authentication data to distinguish between brute force, password spraying, credential stuffing, and normal behavior. Features can include count of unique source IPs, count of unique target accounts, success/failure ratio, and entropy of source geolocations over a time window. Deploy the model to score incoming authentication bursts in real-time."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]