[
  {
    "information_requirement": "Is the adversary leveraging externally acquired Virtual Private Servers (VPS) for operations directed against the network?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.003",
        "name": "Virtual Private Server",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host matches a known malicious indicator (IP, domain, or certificate hash) associated with adversary infrastructure hosted on a VPS.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise egress points (e.g., firewalls, proxies), internal DNS servers, network security monitoring sensors.",
            "action": [
              "Symbolic: Correlate `destination_ip` from Zeek conn.log, `query` from Zeek dns.log, and certificate `sha1` from Zeek ssl.log against a threat intelligence feed of known malicious indicators tagged as 'C2', 'VPS', or 'T1584.003'. Generate an alert for any match.",
              "Statistical: For all connections to VPS provider IP ranges, calculate the rarity of the destination IP, domain, and SSL certificate subject across the enterprise over a 30-day baseline. A connection to a destination seen by fewer than 1% of other hosts (low prevalence) should be assigned a high risk score. Aggregate risk scores per host and flag hosts exceeding the 98th percentile.",
              "Machine Learning: Train a classification model (e.g., Random Forest) using features from Zeek logs (conn: duration, proto, service; dns: qtype, rcode; ssl: version, cipher, ja3) for connections to known benign and malicious VPS-hosted services. Use the model to score new outbound connections to VPS IP ranges in real-time, alerting on those classified as malicious with high confidence."
            ]
          },
          {
            "description": "An outbound HTTP or TLS connection to a VPS provider's IP range exhibits characteristics (e.g., URI path, User-Agent, JA3/JA3S hash) that match a signature for a known Command and Control (C2) framework.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise egress points, HTTP proxies, SSL/TLS inspection points.",
            "action": [
              "Symbolic: Scan Zeek http.log for requests to VPS IP ranges where the `uri` or `user_agent` field matches a list of known C2 patterns. Scan Zeek ssl.log for connections where the `ja3` or `ja3s` hash matches a list of known C2 tool hashes. Alert on any match.",
              "Statistical: Calculate the entropy of URI paths and User-Agent strings for all HTTP requests to VPS providers. A request with unusually high entropy (indicating randomization) or low entropy (fixed string) that deviates more than 3 standard deviations from the host's baseline should be flagged. Identify JA3 hashes that are rare across the enterprise (e.g., seen on <1% of hosts) and flag for review.",
              "Machine Learning: Develop a time-series anomaly detection model (e.g., LSTM) for each host's JA3 hash distribution when connecting to VPS providers. The model should learn the normal sequence and frequency of client hello signatures. An alert is triggered when a new connection sequence significantly deviates from the learned pattern, suggesting a new or modified C2 client."
            ]
          },
          {
            "description": "A process for a cloud infrastructure management tool (e.g., `aws`, `az`, `gcloud`, `terraform`) is executed on an endpoint not designated for cloud administration, and the process initiates a network connection to a non-corporate IP address within a known cloud/VPS provider range.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Standard user workstations, developer endpoints, non-production servers, domain controllers (for user group information).",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for process creation events where `NewProcessName` matches known cloud CLI tools (e.g., `aws.exe`, `az.exe`). Correlate the `ProcessId` with outbound network connections in Zeek conn.log. If the source host is not in an 'Authorized Cloud Admins' group and the destination IP is a non-corporate cloud/VPS provider, generate an alert.",
              "Statistical: Establish a baseline of command-line arguments used with cloud CLI tools for authorized users. For any execution of these tools, calculate the Jaccard similarity between the observed arguments and the baseline set for that user. A low similarity score (e.g., < 0.2) on a non-administrative host indicates anomalous usage and should be investigated.",
              "Machine Learning: Train an outlier detection model (e.g., Isolation Forest) on features from Event ID 4688 (Process Name, Parent Process, Command Line) and correlated Zeek conn.log data (Destination IP, Destination Port, Duration) for authorized cloud tool usage. Apply the model to all instances of cloud tool execution; flag any instance identified as an outlier for manual review."
            ]
          },
          {
            "description": "An internal host makes DNS queries for domains that resolve to a VPS provider's IP range and exhibit anomalous characteristics, such as being newly registered (NRD), belonging to a dynamic DNS service, or having a low query prevalence across the organization.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, DNS forwarders, network tap points.",
            "action": [
              "Symbolic: Enrich Zeek dns.log data by cross-referencing resolved IPs with known VPS provider ranges and domains with NRD/DDNS threat intelligence feeds. Generate an alert when an internal host queries for a domain that is on an NRD/DDNS list and resolves to a VPS provider.",
              "Statistical: For each host, calculate the entropy of the second-level domain (SLD) for all queries resolving to VPS IPs over a 24-hour window. A sudden spike in entropy compared to the host's 30-day rolling average (e.g., > 3 standard deviations) suggests domain generation algorithm (DGA) activity. Also, calculate the enterprise-wide prevalence of each queried domain; domains queried by only one or a few hosts (e.g., bottom 1% percentile) are suspicious.",
              "Machine Learning: Use a time-series forecasting model (e.g., ARIMA) to predict the daily volume of DNS queries to VPS-hosted domains for each internal host. An actual query volume that significantly exceeds the predicted value with a narrow confidence interval indicates a potential anomaly. Correlate with subsequent connection attempts in conn.log."
            ]
          },
          {
            "description": "An outbound connection from an internal host to a VPS provider's IP range demonstrates C2-like behavior, defined by highly periodic connection timing (beaconing), extended duration with minimal data transfer (heartbeat), or large, unidirectional data flows inconsistent with interactive use.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise egress points (e.g., firewalls, proxies), network core switches, server farm tap points.",
            "action": [
              "Symbolic: Filter Zeek conn.log for connections to VPS provider IP ranges where `conn_state` is 'SF' and `duration` is greater than 1 hour but `orig_bytes` + `resp_bytes` is less than 1KB. Alert on these long-lived, low-traffic connections as potential C2 heartbeats.",
              "Statistical: For each source-destination IP pair where the destination is a VPS, calculate the time delta between consecutive connections. Compute the standard deviation of these deltas over a 1-hour window. A very low standard deviation (e.g., < 1 second) indicates highly regular beaconing. Also, calculate the ratio of outbound to inbound bytes (`orig_bytes` / `resp_bytes`); a ratio greater than 100 on a long-running connection can indicate data exfiltration.",
              "Machine Learning: Apply a clustering algorithm (e.g., DBSCAN) to Zeek conn.log data for traffic to VPS providers. Use features like `duration`, `orig_bytes`, `resp_bytes`, `service`, and the standard deviation of inter-arrival times. Clusters that do not group with the main 'benign web traffic' cluster should be isolated and investigated as potential C2 channels representing beaconing or heartbeats."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]