[
  {
    "information_requirement": "Is the adversary developing resources by compromising social media accounts for potential future use? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1586.001",
        "name": "Social Media Accounts",
        "evidence": [
          {
            "description": "Outbound network connections from internal hosts to domains or IP addresses matching threat intelligence for social media credential phishing, typo-squatting, or command and control (C2).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers",
            "action": "Symbolic Logic: Continuously join DNS queries from Zeek dns.log with connection data from Zeek conn.log. Match the resolved destination IP and/or the queried domain against a high-confidence cyber threat intelligence (CTI) feed containing known phishing, C2, or typo-squatted domains related to social media platforms. Generate an alert for any match. Statistical Method: For domains not on a CTI list, calculate the Levenshtein distance between requested domains in dns.log and a list of legitimate social media domains (e.g., 'linkedn.com' vs 'linkedin.com'). Flag domains with a low distance score (e.g., 1 or 2) and an unusually high request frequency from a single host compared to a peer group baseline (e.g., >95th percentile). Machine Learning: Employ a pre-trained classification model (e.g., Random Forest or LSTM) to score domain names from dns.log in real-time based on features like character distribution, n-grams, and domain length. Alert on domains that are classified as malicious with high confidence and are successfully connected to, as seen in conn.log."
          },
          {
            "description": "Execution of web browsers or scripting engines with command-line arguments and process ancestry indicative of automated, non-interactive social media access.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Virtual Desktop Infrastructure (VDI), Application Servers",
            "action": "Symbolic Logic: Monitor Windows Event ID 4688 (Process Creation) for browser processes (e.g., chrome.exe, msedge.exe) launched with command-line flags such as '--headless' or '--remote-debugging-port'. Also, create rules to detect scripting engines (e.g., powershell.exe, python.exe) executing scripts containing keywords like 'Invoke-WebRequest' or 'selenium' in combination with social media domain names in the command line. Statistical Method: Establish a baseline of normal parent-child process relationships for each host. Flag rare relationships (e.g., a Windows service such as 'services.exe' spawning 'firefox.exe'), as these deviate from the norm (e.g., 'explorer.exe' spawning 'firefox.exe'). Further, calculate the entropy of command-line arguments for browser processes per host; a sustained low entropy value indicates repetitive, likely automated, activity. Machine Learning: Train a classification model (e.g., decision tree) using features from Event ID 4688, such as parent process name, command-line length, and token count, to distinguish between benign user-driven browser activity and malicious automated scripts. The model can be trained on labeled data from known benign and malicious executions."
          },
          {
            "description": "A sequence of events where known credential harvesting activity on a host is followed within a short time window by a new or anomalous network connection to a social media platform from the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Authentication Servers, Domain Controllers",
            "action": "Symbolic Logic: Create a SIEM correlation rule that triggers when a process creation event (Windows Event ID 4688) for a known credential dumping tool (e.g., mimikatz.exe) or suspicious access to the LSASS process (Windows Event ID 4663) is observed, followed within a 10-minute window by a network connection (Zeek conn.log) from the same host to a major social media domain. Statistical Method: For each host, calculate the conditional probability of a network connection to a social media site given a recent (t-5 min) process event involving credential access patterns. A probability that is a statistical outlier (e.g., >3 standard deviations from the mean of its peer group) indicates a suspicious correlation worth investigating. Machine Learning: Use a sequence analysis model, such as a Hidden Markov Model (HMM), trained on normal sequences of process and network events per user. An alert is generated when the model observes a low-probability sequence, such as [Event: Process access to LSASS] -> [Event: Network connection to api.linkedin.com], that deviates from the learned normal behavior."
          },
          {
            "description": "Anomalous network traffic patterns to social media platforms from an internal host, characterized by deviations in connection timing, frequency, data volume, or destination diversity compared to an established baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Web Proxies",
            "action": "Symbolic Logic: Maintain an explicit allowlist of servers or service accounts authorized to connect to social media APIs for business purposes. Generate a high-priority alert for any connection to these platforms (e.g., *.facebook.com, *.linkedin.com) originating from a host IP address that is not on this list. Statistical Method: For each host, establish a baseline of its typical interactions with social media sites using Zeek conn.log. Model metrics like hourly connection count and total bytes transferred ('orig_bytes' + 'resp_bytes'). Generate an alert when a live measurement exceeds a dynamic threshold, such as the 99th percentile of the host's own 30-day historical baseline for that metric. Machine Learning: Apply a time series anomaly detection model (e.g., SARIMA or an LSTM-based autoencoder) to each host's connection volume and data transfer volume to social media sites. The model learns the daily and weekly seasonality of a user's activity and flags significant deviations from the learned pattern, such as sustained, high-volume API-like traffic at 3 AM on a weekend, which is indicative of non-interactive, automated behavior."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]