[
  {
    "information_requirement": "Does the adversary possess compromised email accounts that could be used to target the organization? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1586.002",
        "name": "Email Accounts",
        "evidence": [
          {
            "description": "An inbound email contains a sender address, embedded link domain, or attachment hash that matches a high-confidence threat intelligence feed of known malicious or compromised indicators.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter email gateway (SMTP relay); Network security monitoring sensor tap points; DNS resolvers; Web proxies",
            "action": [
              "Symbolic Logic (IOC Matching): Continuously join sender addresses from smtp.log, requested domains from dns.log and http.log, and file hashes from files.log against curated threat intelligence feeds of known compromised accounts, malicious domains, and malware hashes. Generate a high-priority alert upon any match.",
              "Statistical Method (Reputation Scoring): For each inbound sender domain, calculate a reputation score based on its observed age within the network (first seen date), the total volume of emails sent, and the number of distinct recipients. Flag sender domains with a reputation score in the lowest quartile (e.g., bottom 25th percentile) that are observed sending emails with executable or archive attachments.",
              "Machine Learning (Classification): Train a supervised classification model (e.g., Gradient Boosting) using labeled historical email data. Extract features from Zeek logs such as: sender TLD (from smtp.log 'from' field), subject line length and keyword analysis (smtp.log 'subject'), URL-to-domain ratio (from http.log and smtp.log), and file MIME type (from files.log). Deploy the model to score new inbound emails and alert on those classified as 'malicious' with high confidence."
            ]
          },
          {
            "description": "An inbound email contains structural features indicative of phishing, such as links to dynamic DNS domains or URL shorteners, or includes high-risk attachment types (e.g., ISO, VHD, LNK) not typically used in legitimate business communications.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter email gateway; DNS resolvers; Web proxies",
            "action": [
              "Symbolic Logic (Pattern Matching): Apply regular expressions on dns.log 'query' and http.log 'host' fields to identify requests to known dynamic DNS providers (e.g., *.ddns.net, *.no-ip.com) and URL shortener services (e.g., bit.ly, t.co). Scan files.log 'mime_type' and 'filename' fields for high-risk attachment types like 'application/x-iso9660-image' or files ending in .iso, .vhd, .img, or .lnk.",
              "Statistical Method (URL Entropy Analysis): For each unique hostname observed in dns.log and http.log within email traffic, calculate its Shannon entropy. Maintain a distribution of entropy scores for all known-good domains observed over the last 90 days. Alert when an email contains a link to a domain with an entropy score in the top 5th percentile (e.g., > 95th percentile) of the observed distribution.",
              "Machine Learning (Time Series Anomaly Detection): From files.log, generate a daily time series of the count of specific high-risk attachment MIME types (e.g., 'application/x-iso9660-image', 'application/zip'). Apply a time series forecasting model (e.g., SARIMA) to predict the expected volume for the next day. Generate an alert if the observed volume significantly exceeds the predicted upper confidence interval, indicating a mass-mailing campaign leveraging a specific file type."
            ]
          },
          {
            "description": "A sender IP or domain, not seen in the last 60 days, directs a high volume of emails to a specific group of internal recipients (e.g., Finance, Executives) within a short time frame.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network security monitoring sensor tap points; Perimeter email gateway logs; Directory services (for recipient group enrichment)",
            "action": [
              "Symbolic Logic (New Sender Rule): Maintain a state table of sender domains observed over the last 60 days. Create a rule that triggers an alert when a domain not in this table sends emails to more than 10 internal recipients within a 1-hour window.",
              "Statistical Method (Volume Spike Detection): For each external sender domain, baseline the hourly email volume and the number of unique recipients using a 30-day moving average and standard deviation from smtp.log. Alert when the current hourly volume for a sender exceeds 3 standard deviations above its average AND the number of unique recipients also spikes.",
              "Machine Learning (Community Detection): Construct a sender-recipient graph from smtp.log data over the last 90 days. Use a community detection algorithm (e.g., Louvain Modularity) to identify clusters of internal users who are typically emailed together (e.g., 'Finance Team'). Score new emails based on how well their recipient list matches a known community. An email from a new external sender that targets a high percentage (>80%) of a single community receives a high anomaly score."
            ]
          },
          {
            "description": "A series of failed authentication attempts (Windows Event ID 4625) from a single source IP is immediately followed by a successful authentication (Windows Event ID 4624) for the same user account, where that account is known to be exposed in a public data breach.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing authentication servers (e.g., ADFS, Exchange OWA); VPN concentrators; Domain Controllers",
            "action": [
              "Symbolic Logic (Brute-Force Success): Create a rule that triggers when, for a single 'TargetUserName' and source 'IpAddress', more than 10 failed logon events (Event ID 4625 with status code 0xc000006d) are observed within 5 minutes, followed by a successful logon event (Event ID 4624). Enrich this alert by checking if the 'TargetUserName' exists in a database of credentials exposed in public breaches.",
              "Statistical Method (Failed Logon Ratio): For each external source IP address in authentication logs, calculate the ratio of failed logons (Event ID 4625) to total logon attempts within a 5-minute window. Establish a baseline for this ratio across all external IPs. Alert when an IP's failure ratio exceeds the 99th percentile of the baseline distribution, indicating anomalous authentication activity.",
              "Machine Learning (User Login Behavior Modeling): For each user, train an unsupervised anomaly detection model (e.g., Isolation Forest) on their historical successful logins (Event ID 4624). Use features such as time of day, day of week, source IP autonomous system number (ASN) enriched from Zeek conn.log, and logon type. Score each new successful login in real-time and alert on any login with a high anomaly score, especially if it follows a series of failures from the same source IP."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]