[
  {
    "information_requirement": "Has the adversary established operational infrastructure on a third-party Virtual Private Server (VPS) for use in targeting our organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.003",
        "name": "Virtual Private Server",
        "evidence": [
          {
            "description": "An outbound network connection from an internal asset communicates with a destination IP address, domain, or involves a TLS certificate associated with known malicious VPS infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, proxy server logs, enterprise DNS resolver logs, and network security monitoring (NSM) sensor placements.",
            "action": [
              "Symbolic: Continuously join outbound network logs (Zeek conn.log, dns.log, ssl.log) with a threat intelligence feed containing indicators (IPs, domains, cert hashes) tagged as malicious VPS infrastructure. Generate a high-severity alert upon any match.",
              "Statistical: For all outbound connections to known VPS provider IP ranges, calculate the enterprise-wide prevalence (percentage of unique hosts making the connection) for each destination IP, domain, and SSL certificate subject over a rolling 30-day window. Flag any connection where the destination IP/domain/cert is in the bottom 1st percentile of prevalence for further analysis.",
              "Machine Learning: Train a supervised classification model (e.g., XGBoost, Random Forest) on a labeled dataset of connections to known benign and malicious VPS-hosted services. Engineer features from Zeek logs, including connection duration, protocol, service, transferred bytes, DNS query type, DNS answer, TLS version, cipher suite, and JA3/JA3S hashes. Deploy the model to score all new outbound connections to VPS IP ranges in real-time. Alert on connections with a 'malicious' prediction probability exceeding 0.85."
            ]
          },
          {
            "description": "An outbound HTTP/S connection to a VPS provider IP address contains a URI, User-Agent string, or exhibits a JA3/JA3S hash that matches a known signature for a Command and Control (C2) framework.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SSL/TLS inspection appliances, web proxy servers, and network taps at egress points.",
            "action": [
              "Symbolic: Deploy and monitor signatures (e.g., Suricata/Zeek scripts) that match known C2 patterns in HTTP URI paths and User-Agent strings, or JA3/JA3S hashes of C2 tools, for all traffic to VPS provider IP ranges. Trigger an alert on any signature match.",
              "Statistical: For each host, establish a 30-day baseline of Shannon entropy for User-Agent strings and URI paths in requests to VPS providers. Flag any new request where the entropy deviates by more than 3 standard deviations from the host's baseline. Additionally, calculate the enterprise-wide prevalence of all JA3 hashes; investigate any connection using a JA3 hash seen on less than 1% of endpoints.",
              "Machine Learning: For each host, train a time-series anomaly detection model (e.g., an LSTM autoencoder) on sequences of JA3 hashes from connections to VPS providers to learn legitimate client behavior sequences. A high reconstruction error on a new connection sequence indicates a deviation from normal behavior, potentially a new C2 client, and should trigger an alert."
            ]
          },
          {
            "description": "A cloud administration CLI tool (e.g., aws.exe, az.exe, terraform.exe) is executed on a non-administrative endpoint, and the process initiates an outbound network connection to a non-corporate IP address within a known cloud/VPS provider range.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Standard user workstations and servers not part of a designated 'Cloud Administrators' group. Domain Controllers are an NAI for retrieving group memberships to correlate with host activity.",
            "action": [
              "Symbolic: Monitor for process creation events (Windows Event ID 4688/Sysmon EID 1) where the process name matches a list of cloud CLI tools. For each event, check if the source host belongs to an authorized cloud admin group. If not, correlate the Process ID with network connection logs (Zeek conn.log/Sysmon EID 3) to see if it connects to a public IP in a VPS provider range. Alert if all conditions are met.",
              "Statistical: For authorized cloud admin users, create a baseline of common command-line argument patterns. For any execution of a cloud CLI tool by a non-admin user, or by an admin user on a non-standard machine, calculate the Jaccard similarity between the observed command-line arguments and the baseline set. A score below 0.3 suggests anomalous usage and requires investigation.",
              "Machine Learning: Train an outlier detection model (e.g., Isolation Forest) on a dataset of legitimate cloud tool executions. Features should include process name, parent process, command-line length and token count (from Event ID 4688), and correlated network features like destination IP/port and data volume (from Zeek conn.log). Apply the model to all cloud tool executions; flag any instance identified as an outlier with a high anomaly score."
            ]
          },
          {
            "description": "An internal host makes DNS queries for domains that resolve to a VPS provider IP and have characteristics of malicious infrastructure, such as being newly registered (NRD), algorithmically generated (DGA), or having an extremely low query count across the enterprise.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise DNS resolvers, DNS forwarder logs, network taps monitoring DNS traffic (port 53).",
            "action": [
              "Symbolic: Enrich Zeek dns.log in real-time by cross-referencing requested domains with threat intelligence feeds for NRDs and known DGA patterns. If a queried domain matches and its resolved IP address belongs to a known VPS provider range, generate an alert.",
              "Statistical: Calculate the Shannon entropy of the subdomain structure for all DNS queries resolving to VPS IPs. A high entropy score (e.g., > 3.5) is indicative of DGA. Separately, track the enterprise-wide query count for each domain resolving to a VPS IP over a 24-hour period. Flag any domain queried by fewer than 5 unique hosts for review as potentially targeted infrastructure.",
              "Machine Learning: For each host, develop a time-series forecasting model (e.g., SARIMA) to predict the hourly volume of DNS queries to VPS-hosted domains. An actual query volume that significantly exceeds the upper bound of the 99% confidence interval of the forecast indicates a potential C2 registration or DGA burst and should trigger an alert, especially if followed by connections to the resolved IPs."
            ]
          },
          {
            "description": "An outbound connection from an internal host to a VPS provider's IP range exhibits a regular, periodic time interval (beaconing), a long duration with minimal data transfer (heartbeat), or a high outbound-to-inbound data ratio (data exfiltration).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network flow data sources at all egress points, including firewalls and core routers.",
            "action": [
              "Symbolic: Create a rule to detect connections in Zeek conn.log to VPS provider IPs where the connection duration exceeds 1 hour and total bytes transferred (`orig_bytes` + `resp_bytes`) are less than 2KB. This identifies potential idle C2 channels or heartbeats.",
              "Statistical: For each source-destination IP pair (where destination is a VPS), collect timestamps of connection initiations over a 1-hour window. Calculate the standard deviation of the inter-arrival times. A standard deviation less than 1.5 seconds indicates highly periodic, machine-generated traffic (beaconing). Additionally, for connections longer than 5 minutes, calculate the data ratio `orig_bytes / (resp_bytes + 1)`. A ratio greater than 50 suggests potential data exfiltration.",
              "Machine Learning: Periodically apply a clustering algorithm (e.g., DBSCAN) to the set of active connections to VPS providers. Use features such as connection duration, total bytes, byte ratio, and the standard deviation of inter-arrival times for each source-destination pair. Isolate and investigate small clusters that do not belong to the large, central cluster representing normal web traffic, as these are likely to be anomalous C2 communications."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]