[
  {
    "information_requirement": "Is the adversary developing resources, such as acquiring tools, for targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588.002",
        "name": "Tool",
        "evidence": [
          {
            "description": "An executable file with a hash matching a known adversary tool is created on a host, or a network connection is made from an internal host to a domain or IP address known to distribute adversary tooling.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Servers, Endpoints",
            "action": [
              "Symbolic: Query for network connections in Zeek conn.log where the destination IP or domain (resolved via Zeek dns.log) matches a threat intelligence feed of known adversary tool distribution sites. Simultaneously, query Windows Event ID 4688 logs for process creation events where the file hash matches a known-bad list of offensive security tools.",
              "Statistical: For all executable files identified in Zeek files.log, calculate the prevalence of the file hash across the enterprise. A hash with extremely low prevalence (e.g., seen on < 0.1% of endpoints) that is also an executable is suspicious. Calculate the entropy of requested domain names in Zeek dns.log; domains with high entropy that are not on an allowlist and are associated with executable downloads are potential candidates for tool hosting.",
              "Machine Learning: Train a decision tree or logistic regression classifier on labeled network connection data (Zeek conn.log features like duration, service, port, bytes transferred) to predict malicious connections. Use this model to score new connections to previously unseen domains, flagging those with a high probability of being malicious, especially if they are associated with a file download event."
            ]
          },
          {
            "description": "A command-line execution contains argument strings, parameter combinations, or obfuscation patterns (e.g., Base64 encoded PowerShell) that are uniquely characteristic of an offensive security tool's execution.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints, Application Servers, Domain Controllers",
            "action": [
              "Symbolic: Scan the CommandLine or ScriptBlockText fields in Windows Event ID 4688 and 4104 using a library of regular expressions (e.g., Sigma rules) that match known tool signatures, such as 'IEX(New-Object Net.WebClient).DownloadString', 'Invoke-Mimikatz', or specific argument structures for tools like AdFind or BloodHound collectors.",
              "Statistical: For all command-line executions, tokenize the arguments. Calculate the frequency of each token (argument) per process name (e.g., powershell.exe, cmd.exe). Flag command lines containing tokens that are statistically rare for that process across the environment (e.g., arguments in the bottom 5th percentile of frequency). Calculate the character entropy of command lines; unusually high entropy can indicate obfuscation or encoding.",
              "Machine Learning: Use a Natural Language Processing (NLP) model with a TF-IDF vectorizer on command-line arguments, followed by a clustering algorithm (e.g., DBSCAN). Identify and investigate clusters of anomalous command-line executions that do not group with normal administrative activity, as these may represent new or unknown tool usage."
            ]
          },
          {
            "description": "An executable file is downloaded from an external source and subsequently executed from a non-standard directory (e.g., %TEMP%, %PUBLIC%, recycle bin) within a short time window.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Endpoints, Shared Network Drives",
            "action": [
              "Symbolic: Create a rule that triggers when Zeek files.log or http.log records an executable download to a host, followed within 5 minutes by a Windows Event ID 4688 process creation event on the same host, where the NewProcessName path is within a list of suspicious directories (e.g., C:\\Users\\Public\\*, C:\\Perflogs\\*, C:\\$Recycle.Bin\\*, C:\\Windows\\Temp\\*).",
              "Statistical: Establish a baseline of common parent-child process relationships and execution paths. Calculate the conditional probability of a specific parent process (e.g., chrome.exe) spawning a child process (e.g., setup.exe) in a specific directory. Alert on sequences with a very low probability, such as outlook.exe spawning powershell.exe which writes and executes a file in C:\\Users\\Public.",
              "Machine Learning: Use a sequence analysis model, such as a Hidden Markov Model (HMM) or a Recurrent Neural Network (RNN), trained on sequences of events (file_download, process_create, network_connection). The model learns normal sequences of user and system behavior. Flag event sequences that the model identifies as having a low likelihood of being generated by the 'normal' process, indicating a potential tool staging and execution chain."
            ]
          },
          {
            "description": "A user account or host initiates a remote administration connection (e.g., WinRM, SMB, RDP) to another host for the first time, or with a frequency that is a statistical outlier compared to its own or its peer group's baseline, suggesting the use of a newly acquired remote access or lateral movement tool.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Network Segments, Domain Controllers, High-Value Servers",
            "action": [
              "Symbolic: Maintain a 'first seen' database of source-destination-protocol-user tuples. Generate an alert when a new combination is observed for a sensitive protocol (e.g., WinRM on port 5985, RDP on 3389), such as a user from the marketing department's workstation using WinRM for the first time to a domain controller.",
              "Statistical: For each user, build a baseline of normal remote access activity, including protocols used, destination hosts, and connection frequency. Using a moving average and standard deviation, flag any day where a user's connection count for a specific protocol (e.g., RDP) exceeds 3 standard deviations above their 30-day average. Compare a user's activity to their peer group; if their connection count is in the 99th percentile for the group, it warrants investigation.",
              "Machine Learning: Use a graph analysis or a community detection algorithm on network connection logs (Zeek conn.log) to model normal communication patterns between hosts and user groups. A new, high-weight edge appearing between nodes or communities that do not typically interact, especially over an administrative protocol, can indicate tool-driven lateral movement. A time-series anomaly detection model can be applied to connection volumes to detect sudden, unexplainable spikes in activity."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]