[
  {
    "information_requirement": "Is the adversary developing resources by acquiring or creating email accounts for use in targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.002",
        "name": "Email Accounts",
        "evidence": [
          {
            "description": "An inbound email contains a sender address, domain, link, or attachment hash that matches an entry on a high-confidence threat intelligence feed of known malicious indicators.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Web Proxy, DNS Resolver",
            "action": [
              "Symbolic (IOC Match): Continuously correlate sender addresses, domains, and source IPs from Zeek smtp.log, URLs from Zeek http.log, and file hashes from Zeek files.log against a threat intelligence feed of known malicious indicators. Generate a high-priority alert on any match.",
              "Statistical: For all inbound emails, calculate the percentile rank of the sender's domain reputation score provided by a CTI feed. Flag emails from domains in the bottom 5th percentile for review, especially if the email contains a URL or attachment, as this indicates a statistically rare and potentially risky sender.",
              "Machine Learning (Classification): Train a classification model (e.g., Random Forest) on features extracted from email metadata (sender, headers), linked URLs (domain age, reputation), and attachment properties (file type, entropy). Use the model to predict the probability of an email being malicious. Emails exceeding a high probability threshold (e.g., > 0.9) are flagged for automated quarantine or analyst review."
            ]
          },
          {
            "description": "An inbound email originates from a domain, or an internal host makes a DNS request for a domain, that is a suspected typosquat or combosquat of the organization's or a trusted partner's domain.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Email Gateway",
            "action": [
              "Symbolic (IOC Match): Maintain a pre-generated list of high-probability typosquatted and combosquatted domains targeting the organization. Monitor Zeek dns.log and Zeek smtp.log for any communication with these domains and alert immediately upon detection.",
              "Statistical: For all newly observed sender domains (from smtp.log) and resolved domains (from dns.log), calculate the Levenshtein distance to a list of legitimate company and partner domains. Flag domains with a distance of 1 or 2 that are not on an allowlist. Separately, calculate the character-level entropy of all requested domain names; flag domains with anomalously high entropy scores that fall outside 3 standard deviations of the norm, as this can indicate DGA activity.",
              "Machine Learning (Classification): Use a pre-trained or custom-trained NLP model to analyze domain names for linguistic anomalies. The model can be trained to recognize patterns like omitted letters, added characters, homoglyphs, or combosquatting (e.g., 'company-support.com'). Classify all new domains as 'legitimate' or 'suspicious' based on these features and flag suspicious domains for review."
            ]
          },
          {
            "description": "A high volume of inbound emails are received from a domain that was registered within the last 30 days and is not on an established allowlist. The emails target multiple executives or users in sensitive roles.",
            "data_sources": [
              "Zeek smtp.log",
              "WHOIS Lookup Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, External Threat Intelligence Platforms",
            "action": [
              "Symbolic (IOC Match): For every inbound email, query the sender domain's creation date via WHOIS data. If the domain was registered in the last 30 days and is not on an organizational allowlist, flag the email for analysis as a potentially malicious newly created domain.",
              "Statistical: Maintain a 90-day rolling baseline of known sender domains. For any sender domain not in the baseline, track the number of unique recipients. Calculate the 95th percentile for the number of recipients for a new domain. If a new domain sends emails to a number of recipients exceeding this threshold, especially if they are high-value targets, generate an alert for a potential spearphishing campaign.",
              "Machine Learning (Time-Series Anomaly Detection): Use a time-series model (e.g., ARIMA) on the volume of email from all new domains. Anomaly detection algorithms can identify sudden spikes in email traffic from a single new domain or a cluster of related new domains, which deviate significantly from the established pattern of new domain communication. Such spikes are indicative of a coordinated campaign."
            ]
          },
          {
            "description": "An internal host makes outbound connections to a statistically unusual number of distinct free or disposable email service domains within a short time window (e.g., 5+ domains in 10 minutes).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Proxy, DNS Resolver, Network Egress Points",
            "action": [
              "Symbolic (IOC Match): Maintain a list of domains associated with free and disposable email providers. Monitor Zeek dns.log and conn.log for any outbound connection to these domains from servers or restricted subnets where such activity is explicitly forbidden by policy. Alert on any violation.",
              "Statistical: For each internal host, establish a baseline for the number of unique email provider domains accessed per hour. Use a statistical measure like the 99th percentile or a fixed threshold (e.g., >5 unique domains in 10 minutes) to detect hosts exhibiting an unusual frequency of connections to different providers. This identifies outlier behavior indicative of automated activity.",
              "Machine Learning (Clustering): Use a clustering algorithm (e.g., DBSCAN) on connection metadata from Zeek conn.log (duration, bytes sent/received, destination port). The goal is to group connections into 'normal browsing', 'large file transfers', etc. Look for new clusters forming that represent short, repetitive connections to multiple unrelated domains, a pattern consistent with automated scripts used for account creation, without relying on a predefined list of domains."
            ]
          },
          {
            "description": "A successful user authentication to a corporate email service (Windows Event ID 4624) originates from an IP address that is geographically impossible given the user's previous login location and time, or the IP is associated with an anonymizing service (VPN, Tor).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., ADFS), VPN Concentrators, Cloud Identity Provider Logs",
            "action": [
              "Symbolic (IOC Match): Correlate the source IP address from successful login events (Windows Event ID 4624) against a threat intelligence feed of known malicious IPs, Tor exit nodes, and public anonymizing VPN services. Generate a high-priority alert for any login from a matching IP.",
              "Statistical: For each user, maintain a historical record of login locations and times. For each new login, calculate the 'impossible travel' speed required to travel from the previous location to the current one. If the speed exceeds a realistic threshold (e.g., 1000 km/h), flag the event. Additionally, establish a baseline of common source countries for each user and flag any login from a country that accounts for <1% of the user's historical logins.",
              "Machine Learning (Behavioral Anomaly Detection): Train a user-specific behavioral model (e.g., a One-Class SVM or an autoencoder) on features like login time-of-day, day-of-week, source IP geolocation, and ASN. The model learns the user's 'normal' login pattern. Each new login is scored by the model; logins that are classified as anomalies (e.g., high reconstruction error) are flagged as high-risk, potentially indicating a compromised account."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]