[
  {
    "information_requirement": "Is the adversary developing resources using cloud accounts?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.003",
        "name": "Cloud Accounts",
        "evidence": [
          {
            "description": "A DNS query for a known disposable email domain from an internal host is observed within a 5-minute window of an HTTP/S connection from the same host to a known cloud provider account creation URL.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points and internal DNS resolvers.",
            "action": [
              "Symbolic: Create and maintain watchlists of disposable email service domains and cloud provider account creation URLs. Write a SIEM rule that joins Zeek dns.log and http.log on the source IP. Trigger an alert when a host resolves a domain from the disposable email list and then connects to a URL from the cloud creation list within a 5-minute window.",
              "Statistical: For each source IP, calculate the ratio of connections to disposable email domains versus connections to corporate or legitimate webmail domains over a 24-hour period. Establish a baseline ratio for different user groups. Generate an alert if a user's ratio exceeds their group's baseline by more than 3 standard deviations.",
              "Machine Learning: Develop a sequence analysis model (e.g., a Hidden Markov Model) trained on benign user web browsing sequences. Feed real-time sequences of DNS and HTTP events into the model. An alert is triggered if the model assigns a low probability to an observed sequence involving a disposable email provider followed by a cloud provider, indicating a deviation from normal browsing patterns."
            ]
          },
          {
            "description": "HTTP POST/PUT requests to cloud provider resource creation API endpoints are observed originating from an internal host not on the pre-approved list of infrastructure management systems, identified by a programmatic User-Agent (e.g., 'Terraform/', 'Boto3', 'Go-http-client').",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoint subnets, server subnets, and cloud management system enclaves.",
            "action": [
              "Symbolic: Maintain an asset inventory of authorized infrastructure management servers and a watchlist of programmatic User-Agent strings. Create a SIEM rule to alert on any HTTP request in Zeek http.log that contains a programmatic User-Agent and originates from an IP address not in the authorized inventory.",
              "Statistical: For each host, profile the distribution of User-Agent strings over a 30-day baseline period. Calculate the rarity of each User-Agent using frequency analysis. Generate a risk score when a programmatic User-Agent is observed from a host for the first time or if its frequency of use exceeds the 99th percentile of the established baseline for that host or its peer group.",
              "Machine Learning: Train a one-class Support Vector Machine (SVM) or Isolation Forest model on features from legitimate cloud administrative traffic (e.g., source IP, User-Agent, destination API endpoint, time of day). Apply the model to all internal traffic destined for cloud APIs. Any traffic flagged as an outlier by the model indicates potentially unauthorized resource development."
            ]
          },
          {
            "description": "An internal host, not designated as a cloud administration host, makes one or more connections to web pages or APIs associated with cloud provider account creation, billing, or identity and access management (IAM).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoint subnets and corporate network egress points.",
            "action": [
              "Symbolic: Maintain a watchlist of URIs and domains related to cloud account management (e.g., 'console.aws.amazon.com/billing', 'portal.azure.com/#create', 'myaccount.google.com'). Create a SIEM rule to alert on any connection to these resources from hosts not in the authorized cloud administrator group.",
              "Statistical: For all non-admin hosts, establish a baseline for the volume of traffic to cloud management domains over a 30-day period. Use time-series analysis to monitor the aggregate traffic volume. An alert is triggered if the volume on any given day exceeds a dynamic threshold, such as the 95th percentile of the historical distribution, which could indicate widespread, unauthorized exploration.",
              "Machine Learning: Use a clustering algorithm (e.g., K-Means or DBSCAN) on features extracted from cloud management web traffic, such as session duration, number of requests, and diversity of URIs accessed. Identify clusters of normal administrative behavior. Any user session that does not fall into a known legitimate cluster or forms a new, small, anomalous cluster should be flagged for review."
            ]
          },
          {
            "description": "An internal host is observed making DNS queries or connections to the account management or API endpoints of three or more distinct cloud service providers (e.g., AWS, Azure, GCP, DigitalOcean) within a 1-hour rolling window.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points and internal DNS resolvers.",
            "action": [
              "Symbolic: Create and maintain lists of domains and IP ranges for major cloud providers. Create a SIEM rule that counts the number of distinct cloud providers a single source IP connects to within a 1-hour window. Trigger an alert if the count is greater than or equal to 3.",
              "Statistical: For each host, calculate a daily baseline of the number of distinct cloud providers contacted. Alert if the number of distinct providers contacted in an hour exceeds the 99th percentile of that host's daily baseline values, or if it exceeds the 99th percentile for the host's assigned user group (e.g., 'Developers', 'Sales').",
              "Machine Learning: Train a classification model (e.g., Random Forest) to distinguish between legitimate multi-cloud activity and suspicious 'cloud shopping'. Features could include the specific providers contacted, the time between connections, total data transferred, and whether connections are to marketing pages versus API endpoints. Flag activity classified as suspicious."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]