[
  {
    "information_requirement": "Is an adversary actively gathering our organization's email addresses for targeting? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1589.002",
        "name": "Email Addresses",
        "evidence": [
          {
            "description": "Sustained or high-volume network connections to public-facing services from an external IP address present on a threat intelligence feed for reconnaissance, anonymization (TOR, VPN), or malicious scanning.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, network DMZ, public-facing web servers, external-facing authentication services (e.g., M365, VPN concentrators).",
            "action": [
              "Symbolic: Continuously correlate the source IP address ('id.orig_h') in Zeek conn.log and http.log against a threat intelligence feed of known malicious scanners, reconnaissance tools, and anonymizing services (e.g., TOR exit nodes). Generate a high-severity alert for any match.",
              "Statistical: For IPs matching a lower-confidence threat feed (e.g., generic VPNs), calculate the connection frequency over a 10-minute window. Flag any source IP whose connection count exceeds the 99th percentile of connection rates for all external IPs to that specific service port.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA) on the volume of connections from known anonymizing services over the last 90 days. An observed connection volume that significantly exceeds the model's prediction interval indicates a potential coordinated reconnaissance campaign."
            ]
          },
          {
            "description": "One or more HTTP requests to public-facing web services containing a User-Agent string or a combination of HTTP headers known to be associated with automated email harvesting or OSINT tools.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web servers (e.g., company 'About Us' or 'Contact' pages), SharePoint sites, and web application frontends.",
            "action": [
              "Symbolic: Using regular expressions, search the 'user_agent' field in Zeek http.log for signatures of known email harvesting and reconnaissance tools (e.g., 'theHarvester', 'hunter.io', 'Email-Harvester', 'Recon-ng', 'sqlmap', 'Nmap Scripting Engine'). Alert on any match.",
              "Statistical: For a given source IP, calculate the entropy of the 'uri' field requested over a 5-minute session. A very low entropy score, combined with a high request rate, suggests automated enumeration of a specific directory path. Alert if entropy is below 0.5 and request count is >50.",
              "Machine Learning: Use a pre-trained classification model to score each HTTP request based on its headers (User-Agent, Accept, Referer) and URI structure. Flag requests classified as 'automated' or 'scraping' with high confidence, especially when originating from IPs not associated with known benign crawlers (e.g., Googlebot, Bingbot)."
            ]
          },
          {
            "description": "A high ratio of failed to successful authentication attempts (Windows Event ID 4625) from a single external IP address against a public-facing authentication service over a short time window, targeting multiple distinct user accounts.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory Federation Services (ADFS) servers, Remote Desktop Gateway servers, VPN concentrators, Microsoft 365 / Entra ID tenant.",
            "action": [
              "Symbolic: Create a detection rule that triggers when a single source IP address generates more than 10 failed logon events (Windows Event ID 4625, Logon Type 3) for more than 5 unique user accounts within a 1-minute window. Verify the source IP is external using Zeek conn.log.",
              "Statistical: For each external source IP, calculate the ratio of failed logons (Event ID 4625) to successful logons (Event ID 4624) over a 15-minute window. Establish a baseline ratio for normal traffic. Alert if the observed ratio for an IP exceeds the baseline by 3 standard deviations.",
              "Machine Learning: Implement an unsupervised learning algorithm (e.g., Isolation Forest) on authentication log data, using features such as source IP, count of unique target users, time between attempts, and success/failure status. The model will identify anomalous clusters of activity indicative of enumeration that deviate from normal user behavior."
            ]
          },
          {
            "description": "An external source IP exhibits web browsing behavior characteristic of automated scraping, defined by a request rate > 5 requests/second, systematic traversal of URI paths (e.g., /staff?id=1, /staff?id=2), and a session duration significantly longer than the user average.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing websites, especially those with employee directories, contact lists, or profile pages.",
            "action": [
              "Symbolic: Alert when a single external source IP requests more than 100 pages containing '/profile/', '/staff/', or '/contact/' in the URI within a 5-minute period. Exclude known benign web crawlers by their User-Agent string.",
              "Statistical: Establish a baseline for normal user sessions, calculating the 95th percentile for requests per minute and total pages viewed. Flag any external IP session that exceeds both of these thresholds. Additionally, calculate the Levenshtein distance between consecutive URI requests; a consistently low distance (e.g., 1 or 2) indicates sequential enumeration.",
              "Machine Learning: Develop a session-based classifier using features like request frequency, URI entropy, diversity of User-Agents, and time-of-day. Train the model on labeled data of 'human' vs. 'bot' sessions. Apply the model in real-time to classify incoming traffic sessions and alert on those identified as 'malicious bot' or 'scraper'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]