[
  {
    "information_requirement": "Is the adversary developing resources, such as compromised DNS servers, for use in operations?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.002",
        "name": "DNS Server",
        "evidence": [
          {
            "description": "A DNS response for an internal or external query contains an IP address present on a high-confidence threat intelligence feed. OR: A successful or failed login attempt (Windows Event ID 4624/4625) or network connection (Zeek conn.log) to a DNS server's management interface (e.g., RDP, SSH, WinRM) originates from an IP address on a high-confidence threat intelligence feed.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal recursive DNS servers, External-facing authoritative DNS servers, Network egress points",
            "action": [
              "Symbolic Logic: Continuously join the 'answers' field from Zeek dns.log and the 'id.orig_h' field from Zeek conn.log (where 'id.resp_p' is a management port like 3389, 22) against a threat intelligence feed of known malicious IP addresses. Alert on any match.",
              "Statistical: For all IPs in DNS responses, calculate the historical rarity of the IP-domain-ASN combination. A resolution to an IP in a new or rare ASN for a given domain, especially if that IP has a reputation score below the 20th percentile of known-good IPs, should increase a risk score. Aggregate scores by client to find systems communicating with multiple risky domains.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., ARIMA) on the volume of DNS responses containing IPs from known malicious or suspicious ASNs. A sudden spike deviating from the forecasted volume indicates a potential campaign or widespread compromise."
            ]
          },
          {
            "description": "A DNS query of type AXFR or IXFR is observed in network traffic originating from an IP address not on an established allowlist of authorized secondary DNS servers or administrative hosts.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal recursive DNS servers, External-facing authoritative DNS servers",
            "action": [
              "Symbolic Logic: Filter Zeek dns.log for records where 'qtype_name' is 'AXFR' or 'IXFR'. Compare the source IP ('id.orig_h') of each request against a static allowlist of authorized IP addresses. Generate a high-severity alert for any request from an unauthorized source.",
              "Statistical: Establish a baseline of source IPs that perform AXFR/IXFR requests. Calculate the frequency of requests per source IP. An IP not on the baseline making even a single request is an anomaly. For IPs on the baseline, a request volume exceeding the 99th percentile of their historical daily request count could indicate misuse of a legitimate server.",
              "Machine Learning: Train a classification model (e.g., a decision tree) using features like source IP, ASN, query type, and time of day. Label known-good AXFR transfers. Use the model to classify new transfer attempts as 'authorized' or 'unauthorized' in real-time, flagging unauthorized attempts that may have more subtle anomalous characteristics than a simple non-allowlisted IP."
            ]
          },
          {
            "description": "A successful administrative login (Windows Event ID 4624) to a DNS server originates from a source IP that geolocates to a new or statistically rare country for that user. OR: The primary DNS service process ('dns.exe') spawns a child process other than its expected helper processes, such as 'cmd.exe' or 'powershell.exe' (Windows Event ID 4688).",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS Server infrastructure (both authoritative and recursive), Domain Controller servers (if running DNS role)",
            "action": [
              "Symbolic Logic: Create a rule to monitor Windows Event ID 4688 on DNS servers. Alert immediately if 'Creator Process Name' is 'dns.exe' and 'New Process Name' is 'cmd.exe', 'powershell.exe', 'rundll32.exe', 'cscript.exe', or 'wscript.exe'.",
              "Statistical: For each administrative user on DNS servers, build a baseline of typical login source countries/cities/ASNs from Windows Event ID 4624 and Zeek conn.log geolocation data. Calculate the frequency of logins from each location. A login from a location with a frequency of zero (a new location) or in the bottom 5th percentile of historical locations for that user should trigger an alert.",
              "Machine Learning: Use an unsupervised learning model (e.g., One-Class SVM or Isolation Forest) trained on a baseline of normal process execution chains on DNS servers (parent-child process relationships from Event ID 4688). The model will identify anomalous process creation events that deviate from the learned 'normal' behavior."
            ]
          },
          {
            "description": "For a monitored set of high-reputation external domains, a DNS response provides an IP address that falls outside the domain's known, historically observed set of IP addresses and Autonomous System Numbers (ASNs). This anomaly is observed across a statistically significant number of distinct internal clients within a short time window.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Internal recursive DNS servers, Endpoint devices",
            "action": [
              "Symbolic Logic: Maintain a curated allowlist of known IP ranges and ASNs for critical external domains (e.g., Office 365, Salesforce). Monitor Zeek dns.log for any DNS response for these domains that resolves to an IP or ASN not on the allowlist. Alert on any match.",
              "Statistical: For a given domain, calculate the Shannon entropy of the set of resolved IP addresses ('answers' field in Zeek dns.log) across the enterprise over a sliding 5-minute window. A sudden, sharp decrease in entropy, indicating many clients are resolving the domain to a single, new IP, is a strong indicator of hijacking. Alert if entropy drops more than 2 standard deviations below the historical mean for that domain.",
              "Machine Learning: Implement a time-series model to forecast the count of unique client-IP resolution pairs for critical domains. A sudden, unexplained spike in the number of clients resolving a domain to a new, previously unseen IP address, which deviates significantly from the forecast, indicates a coordinated redirection event."
            ]
          },
          {
            "description": "An internal client makes a DNS query for a domain that was registered within the last 30 days (Newly Registered Domain) or has a label with a character entropy score above a set threshold (e.g., 3.5), characteristic of a Domain Generation Algorithm (DGA). The response IP for this query has a low reputation score or is associated with a suspicious ASN.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Endpoint devices",
            "action": [
              "Symbolic Logic: Enrich Zeek dns.log data with domain registration dates (WHOIS data) and IP reputation scores from a threat intelligence provider. Create a rule that alerts when 'domain_age' < 30 days AND 'ip_reputation' is 'malicious' or 'suspicious'.",
              "Statistical: For each DNS query in Zeek dns.log, calculate the Shannon entropy of the query name. Establish a baseline entropy distribution for legitimate traffic. Alert on queries with entropy scores in the top percentile (e.g., >99th percentile), especially if they are also NRDs or resolve to IPs in rarely used ASNs.",
              "Machine Learning: Train a classifier (e.g., Random Forest) to predict if a domain is DGA-generated using features like domain length, entropy, vowel-to-consonant ratio, and n-gram frequency analysis. Apply this model to all queried domains in Zeek dns.log. Domains classified as DGA that are also newly registered and resolve to a low-reputation IP should generate a high-priority alert."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]