[
  {
    "information_requirement": "Is the adversary obtaining capabilities to support their operation?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588",
        "name": "Obtain Capabilities",
        "evidence": [
          {
            "description": "An internal host establishes a network connection (outbound) or receives a connection (inbound) where the remote IP address, domain, or a transferred file hash matches a high-confidence threat intelligence feed listing known malware distribution points, exploit kit domains, or tool repositories.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek file.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, DNS resolvers, and web proxies",
            "action": [
              "Create a watch list of malicious indicators (IPs, domains, file hashes) from threat intelligence feeds. Join network connection logs (Zeek conn.log), DNS query logs (Zeek dns.log), and file transfer logs (Zeek file.log) against this watch list. Generate a high-priority alert for any match.",
              "For all downloaded files identified in Zeek file.log, calculate the Shannon entropy of the filename. Flag filenames with entropy scores in the 99th percentile, as this can indicate algorithmically generated names used to evade simple blocklists. Separately, alert if a user downloads a file with a rare MIME type (e.g., 'application/x-dosexec') that is in the bottom 5% of all MIME types downloaded in the organization.",
              "Develop a time-series model (e.g., ARIMA) for the volume of data transferred from each internal host to external destinations. Flag any host where the daily data transfer volume spikes more than three standard deviations above the forecasted value, especially if the destination is a low-reputation IP address or a newly observed domain."
            ]
          },
          {
            "description": "A process is created on a host with a process name, command-line argument, or parent-child relationship that matches signatures for known adversarial tools (e.g., Cobalt Strike, Metasploit) or Malware-as-a-Service (MaaS) families.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, user workstations, and application servers",
            "action": [
              "Scan all process creation events (Windows Event ID 4688) for command-line arguments matching regular expressions for known malicious tool usage (e.g., `powershell -enc`, `certutil -urlcache`, `rundll32.exe javascript`). Alert on any matches.",
              "For each parent process (e.g., `winword.exe`, `powershell.exe`), build a baseline of normal child processes. Calculate the frequency of each parent-child process relationship across the enterprise. Alert on statistically rare relationships (e.g., `outlook.exe` spawning `cmd.exe`) that fall below a 1% prevalence threshold.",
              "Train a random forest classifier on process creation events, using features such as command-line length, entropy of command-line, parent process name, and process path. Use the model to classify new process events as benign or suspicious, flagging those with a high probability score of being malicious for analyst review."
            ]
          },
          {
            "description": "An SSL/TLS certificate observed in network traffic exhibits multiple suspicious characteristics simultaneously, such as a very recent issuance date, a self-signed issuer, a subject common name that mimics a legitimate service (typosquatting), or a serial number known to be associated with a C2 framework's default configuration.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, internal Certificate Authorities, and web proxies",
            "action": [
              "Query Zeek x509.log and ssl.log for certificates where the issuer string matches known C2 defaults (e.g., 'CN=Major Cobalt Strike') or where the serial number or JA3/JA3S hash matches a known threat intelligence feed for malicious infrastructure.",
              "For all observed certificates in x509.log, calculate the Damerau-Levenshtein distance between the certificate's subject common name and a list of high-value internal and external domain names. Flag certificates with a small edit distance (e.g., 1 or 2) but a different issuer. Additionally, alert on certificates with an unusually short validity period (e.g., less than 30 days) that are not from known free certificate providers.",
              "Use a clustering algorithm (e.g., DBSCAN) on features extracted from x509.log, such as certificate validity duration, public key algorithm, and subject/issuer attributes. Identify and investigate clusters of certificates that deviate from the established norms of legitimate traffic, as these may represent a campaign using a consistent method of certificate generation."
            ]
          },
          {
            "description": "A correlated sequence of events on a single host within a short time window: 1) Download of an executable file from an external IP. 2) Creation of a new process from a non-standard user-writable directory (e.g., %PUBLIC%, %APPDATA%\\Local\\Temp). 3) The new process initiates periodic, low-volume outbound network connections (beaconing).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek file.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, public-facing web servers, and egress points to the internet",
            "action": [
              "Create a SIEM correlation rule that triggers when, for the same hostname within a 5-minute window: a) a file with MIME type 'application/x-dosexec' is seen in Zeek file.log from an external source, b) a process creation event (Windows Event ID 4688) occurs with a path in a temporary or download directory, and c) the new process ID makes an outbound connection in Zeek conn.log.",
              "For outbound connections in Zeek conn.log, calculate the standard deviation of the inter-arrival time and data volume for each source-destination pair over a 24-hour period. Identify potential beaconing by flagging connections with a low standard deviation in both metrics, indicating periodic and uniformly sized callbacks, especially to newly observed destination IPs.",
              "Implement a sequence analysis model, such as a Hidden Markov Model (HMM), trained on labeled benign and malicious event sequences (file download -> process execution -> network connection). Feed real-time event streams into the model to calculate the probability that an observed sequence matches a malicious TTP. Alert when the probability crosses a predefined threshold."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]