[
  {
    "information_requirement": "Is the adversary gathering our organization's credentials? (TA0043 - Reconnaissance)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1589.001",
        "name": "Credentials",
        "evidence": [
          {
            "description": "An inbound email or web request contains a URL, IP address, domain, or file hash that matches a high-confidence threat intelligence feed for credential phishing.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Web Proxy, Network Egress Points",
            "action": [
              "Symbolic Logic (IOC Matching): Continuously query Zeek http.log (host, uri fields) and smtp.log (from, subject, links) against a threat intelligence database of known phishing domains, URLs, and sender addresses. Generate an alert for any match.",
              "Statistical Method (URL Feature Analysis): For URLs not on an IOC list, calculate statistical properties like domain age, character entropy of the path, and domain-to-path similarity. Flag URLs where the domain was registered within the last 30 days and the path entropy is in the 95th percentile of all observed URLs.",
              "Machine Learning (File Hash Classification): Extract file hashes from files.log for all downloaded executables or documents. Submit hashes to a machine learning-based malware classification service to get a probability score for maliciousness. Alert on files with a score greater than 0.8."
            ]
          },
          {
            "description": "Multiple internal recipients (>20) receive emails within a short time window (<1 hour) that share common features, such as a similar subject line, sender domain, or embedded link structure, which are anomalous compared to historical email patterns.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Internal Mail Servers, DNS Resolvers",
            "action": [
              "Symbolic Logic (Correlation Rule): Create a rule that triggers when 20 or more unique internal recipients receive an email from the same external sender IP address or /24 subnet within a 1-hour window, where the emails have an identical or highly similar subject line (>80% string similarity).",
              "Statistical Method (Link Velocity Thresholding): From smtp.log, extract all embedded URLs. For each unique URL, count the number of distinct internal recipients who received it within a 5-minute period. Calculate a moving average and standard deviation for this 'link velocity' metric. Alert when the velocity for any single URL exceeds 3 standard deviations above the 30-day average.",
              "Machine Learning (Email Campaign Clustering): Use an unsupervised learning algorithm (e.g., DBSCAN) on features extracted from smtp.log (TF-IDF vectors of subject lines, sender domain, URL structure). For each identified cluster, use a time series model (e.g., ARIMA) on the cluster's volume; an anomalous spike in a newly formed cluster indicates a potential phishing attack."
            ]
          },
          {
            "description": "A single external source IP address generates authentication failures (Windows Event ID 4625) for a high number of distinct user accounts (>10) within a short time frame (<1 hour) against a public-facing authentication service, indicating password spraying.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Authentication Servers (e.g., ADFS, VPN, OWA), Active Directory Domain Controllers",
            "action": [
              "Symbolic Logic (Password Spraying Rule): Create a rule that triggers when a single source IP address, observed in Zeek conn.log, generates Windows Event ID 4625 for more than 10 distinct user accounts on a single server within a 1-hour window. Exclude trusted corporate IP ranges.",
              "Statistical Method (Authentication Failure Baselining): For each public-facing service, establish a baseline of hourly failed login counts (Event ID 4625) per source country (derived from Zeek conn.log source IPs). Calculate the 99th percentile for this metric. Generate an alert when the failed login count from any country exceeds this percentile.",
              "Machine Learning (Login Anomaly Detection): Train an Isolation Forest model on login events, using features like source IP, user agent, time of day, and number of targeted accounts per source IP. Apply the model to new login events in real-time to generate an anomaly score. An event with a high anomaly score indicates a likely credential attack."
            ]
          },
          {
            "description": "An external source IP sends a high volume of HTTP POST requests to a login endpoint, resulting in a high ratio of authentication responses that indicate 'invalid user' (e.g., Windows Event ID 4625 with sub-status 0xc0000064) versus 'invalid password', suggesting username list validation.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Application Servers, Authentication APIs",
            "action": [
              "Symbolic Logic (Username Enumeration Rule): Monitor Windows Event ID 4625 for sub-status code 0xc0000064 ('user name does not exist'). Alert if a single source IP (from Zeek conn.log correlated by timestamp and destination port) generates more than 50 such events within 10 minutes.",
              "Statistical Method (Username Entropy Analysis): For each source IP targeting a login endpoint (identified in Zeek http.log), extract the attempted usernames from the HTTP POST body. Calculate the Shannon entropy of the character distribution for the set of usernames attempted by that IP in a 5-minute window. Alert on IPs where the username entropy is in the top 5% of all observed source IPs.",
              "Machine Learning (Request Pattern Classification): Use a supervised learning model (e.g., Random Forest) trained on labeled benign and malicious login attempts. Features should include request frequency, ratio of different HTTP response codes, and time between requests. Apply the model to live HTTP traffic to classify sessions as 'benign', 'password spray', or 'username enumeration'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]