[
  {
    "information_requirement": "Is the adversary developing resources, specifically social media accounts, for targeting our organization or personnel?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.001",
        "name": "Social Media Accounts",
        "evidence": [
          {
            "description": "A social media profile impersonating the organization or an employee contains a URL, email address, or username that is an exact match for an indicator in a Cyber Threat Intelligence (CTI) feed of known-malicious infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Cyber Threat Intelligence Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External Social Media Platforms, Threat Intelligence Platform, DNS Resolvers, Web Proxies",
            "action": [
              "Continuously ingest a CTI feed of known-malicious domains, URLs, and email addresses into a threat intelligence platform or SIEM. Using a brand monitoring service or custom script, scan social media platforms for profiles impersonating the organization or its executives. Extract profile metadata (URLs, emails) and query the SIEM for any exact match. Trigger a high-severity alert on a match.",
              "For any domain found in a suspect social media profile, query domain registration (WHOIS) data to determine its creation date. Calculate the Levenshtein distance between the suspect domain and the organization's legitimate domain(s). Score and flag domains that are newly registered (e.g., < 90 days) and have a low Levenshtein distance (e.g., <= 2), as these are common typosquatting characteristics.",
              "Train a classification model (e.g., Logistic Regression, Random Forest) on a labeled dataset of benign and malicious social media profiles. Engineer features such as account age, follower count, following count, follower-to-following ratio, post frequency, and the presence of a profile picture or biography. Periodically score newly discovered, potentially impersonating accounts and flag those classified as malicious with a confidence score > 0.9 for analyst review."
            ]
          },
          {
            "description": "A cluster of social media profiles exhibit high similarity in content, such as using identical biography text, profile images, or following a programmatic username convention.",
            "data_sources": [
              "Publicly available social media data",
              "Corporate brand monitoring service data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External Social Media Platforms (e.g., LinkedIn, Twitter, Facebook), Corporate Brand Monitoring Service, Internal HR/Employee Directory Database",
            "action": [
              "Generate perceptual hashes (pHash) for official corporate logos and executive profile pictures. Periodically scan profile images of accounts impersonating the organization and match against this pHash library to find unauthorized usage. Use regular expressions (e.g., '(company)-(firstname)-(lastname)', '(lastname).(firstname).(support)') to search for usernames that match common adversarial patterns.",
              "For a group of suspected impersonation accounts, tokenize and compute the Jaccard similarity score for their profile descriptions (biographies). A high average score across the cluster (e.g., > 0.85) indicates templated text. For the same cluster, calculate the character-level entropy of the usernames; an entropy score significantly lower than that of legitimate employee usernames suggests a programmatic naming scheme.",
              "Apply Natural Language Processing (NLP) with Latent Dirichlet Allocation (LDA) to the corpus of posts and biographies from a suspected cluster of accounts. Compare the resulting topics (e.g., 'crypto,' 'giveaway') to the topics generated from a baseline of legitimate employee posts. A significant divergence in topic distribution indicates inauthentic activity and potential campaign alignment."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688 or Sysmon Event ID 1) on an endpoint shows a scripting engine or browser automation tool being executed with command-line arguments containing social media domains, where the activity is not associated with an authorized function.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Employee Workstations, Marketing Department Servers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Create a SIEM rule to detect process creation events (EID 4688, EID 1) where the process name is a known automation tool ('chromedriver.exe', 'geckodriver.exe', 'pwsh.exe', 'python.exe') AND the command line contains strings like 'linkedin.com', 'twitter.com', or 'facebook.com'. Suppress alerts for users in an allow-list, such as the marketing or social media teams.",
              "For each user, establish a 30-day rolling baseline of the hourly count of script and browser automation process executions. Calculate the 99th percentile for this count. Trigger an alert when a user's hourly process creation count exceeds this established threshold, particularly if occurring outside of standard business hours (e.g., 10 PM - 6 AM local time).",
              "Train a decision tree or random forest classifier on process event features (process name, parent process name, command line length and entropy, user context, host) to distinguish benign from malicious script execution. Deploy the model to score real-time process events, flagging anomalous process chains (e.g., 'outlook.exe' -> 'powershell.exe' -> 'chromedriver.exe' with social media arguments) that deviate from learned benign patterns."
            ]
          },
          {
            "description": "Network logs (Zeek conn.log) from a single internal host show a high-frequency, repetitive pattern of connections to social media domains, indicative of automated activity rather than human interaction.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, Web Proxies",
            "action": [
              "Maintain a watchlist of social media API endpoints (e.g., 'api.twitter.com', 'graph.facebook.com'). In your SIEM, create a rule that alerts when a host not on an infrastructure allow-list (e.g., marketing automation servers) generates DNS requests (Zeek dns.log) or initiates connections (Zeek conn.log) to any domain on this watchlist.",
              "From Zeek conn.log, extract the timestamps of all connections from an internal host to social media domains over a one-hour window. Calculate the standard deviation of the inter-arrival times (time between connections). A very low standard deviation (e.g., < 1 second) suggests robotic, non-human behavior. Alert when this value falls below a dynamically calculated baseline for that host or its peer group.",
              "For each host, create a time series of the total bytes sent ('orig_bytes') to social media domains per 5-minute interval. Train an ARIMA or Prophet forecasting model on this data. Generate an alert when the observed data volume exceeds the upper bound of the model's forecasted confidence interval for two or more consecutive intervals, indicating a sustained and anomalous data transfer."
            ]
          },
          {
            "description": "A newly created external social media account sends connection requests to a large and diverse set of employees within the organization in a short period.",
            "data_sources": [
              "Publicly available social media data",
              "Employee-reported phishing/contact attempts"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External Social Media Platforms, Employee Inboxes, Corporate Brand Monitoring Platform",
            "action": [
              "Through manual or automated means, identify new social media accounts (< 60 days old) that have sent connection requests to more than 5 employees. Cross-reference the list of targeted employees with an internal directory of high-value targets (e.g., executives, system administrators). Escalate for immediate investigation if a high-value target is contacted.",
              "Aggregate all incoming connection requests from non-employee accounts over a 24-hour period. For each source account, calculate the number of requests sent. Flag any account where the request count exceeds the 99.5th percentile of all external requesters. Further enrich by calculating the 'departmental blast radius'—the number of unique business units targeted by a single account.",
              "Model the organization's employee connections on a social media platform as a graph. When a new external account sends connection requests, analyze its structural role using graph theory metrics. Use a community detection algorithm (e.g., Louvain) to identify employee clusters. Flag external accounts that appear to be 'bridge nodes,' attempting to connect disparate or isolated communities within the organization, as this is a common reconnaissance tactic."
            ]
          },
          {
            "description": "A set of suspected inauthentic social media profiles exhibit synchronized behavior, such as posting content, liking, or following other accounts at nearly identical times.",
            "data_sources": [
              "Publicly available social media data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External Social Media Platforms",
            "action": [
              "For a group of suspected inauthentic accounts, check for common static artifacts. Trigger an alert if a high percentage (e.g., > 75%) of the accounts all post links pointing to the same external domain, follow the same small set of central accounts, or use the same URL shortener service.",
              "Extract the timestamps of all posts from a cluster of suspected malicious accounts. For each pair of accounts in the cluster, calculate the time series cross-correlation of their posting activity. A high average correlation coefficient across the cluster, with a time lag near zero (e.g., < 60 seconds), is a strong indicator of coordinated, automated control.",
              "Represent a large collection of accounts (both known-good and suspected-bad) as nodes in a graph. Use a graph embedding algorithm like Node2Vec to generate a vector representation for each account based on its connections and interactions. Apply a clustering algorithm like DBSCAN to these vectors. A dense cluster composed primarily of suspected accounts, and which is distant from the main cluster of legitimate accounts, indicates a coordinated botnet or inauthentic network."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]