[
  {
    "information_requirement": "Is the adversary establishing resources (accounts/personas) for use in targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585",
        "name": "Establish Accounts",
        "evidence": [
          {
            "description": "Receipt of one or more emails where the sender's domain or source IP address matches an entry on a high-confidence threat intelligence feed of known malicious infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Network Egress/Ingress Points (Firewalls/Proxies)",
            "action": [
              "Symbolic: Create a watch list of malicious IP addresses and domains from CTI feeds. Query Zeek conn.log and smtp.log every 5 minutes for `id.orig_h` (source IP) or `from` (sender) that match the watch list. Generate a high-severity alert for any match.",
              "Statistical: For each CTI feed, calculate the historical true positive rate. For new matches, weight the alert severity by the feed's historical performance and the age of the IOC, where newer IOCs receive a higher weight. Flag sender IPs that appear on multiple distinct feeds simultaneously.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) using features from Zeek logs (IP, domain, ASN, reputation scores) and a labeled dataset of malicious/benign communications. Use the model to predict the probability of an incoming connection being malicious. Alert when the probability exceeds a defined threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "Receipt of an email from a sender domain that is either: (1) algorithmically identified as a typosquat or homoglyph of the organization's domain, or (2) has a WHOIS creation date less than 30 days old.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Internal/External DNS Resolvers",
            "action": [
              "Symbolic: Generate a list of potential typosquatted and homoglyph domains for your organization's primary domain. Create a rule to alert on any inbound email (Zeek smtp.log `from` field) where the sender's domain exactly matches an entry in this list.",
              "Statistical: For all inbound sender domains, perform a passive DNS lookup to find their creation date. Calculate the 5th percentile for domain age across all inbound emails over the last 90 days. Flag any email from a domain with an age below this percentile for review.",
              "Machine Learning: Use a time series forecasting model (e.g., ARIMA) on daily counts of newly observed sender domains. An anomalous spike in the number of newly observed domains, especially those with recent registration dates, could indicate a coordinated campaign preparation. Alert when the daily count exceeds the forecasted value by more than two standard deviations."
            ]
          },
          {
            "description": "A single external source IP or domain sends emails to more than 10 distinct internal recipients within a 24-hour period, with the total email count from that source being less than 20 and receiving zero replies.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Mail Exchange Servers",
            "action": [
              "Symbolic: For each 1-hour window, search for sender domains in Zeek smtp.log that are new (not seen in the last 90 days) and have sent emails to >10 unique internal recipients but have a total email count <20. Alert on any domain meeting these criteria.",
              "Statistical: For each new sender, calculate the entropy of the recipient list over a 24-hour period. A high entropy score indicates a wide, non-targeted distribution. Establish a baseline for typical entropy scores for inbound mail. Alert when a new sender exhibits an entropy score in the top 5th percentile combined with a low email volume in the bottom 5th percentile.",
              "Machine Learning: Construct a bipartite graph of external senders and internal recipients from Zeek smtp.log. Apply a community detection algorithm (e.g., Louvain Modularity) to identify normal communication clusters. Flag nodes (senders) that do not belong to any well-defined community and exhibit sparse, high-degree connections, as these may represent probing activity."
            ]
          },
          {
            "description": "The daily volume of emails or total data transferred from a specific free webmail provider (e.g., gmail.com, outlook.com) or dynamic DNS service provider increases by more than 3 standard deviations above the 30-day moving average.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Network Egress/Ingress Points (Firewalls/Proxies)",
            "action": [
              "Symbolic: Maintain a list of domains associated with free webmail, dynamic DNS, and public cloud providers. Create a rule that alerts if the number of unique source IPs from any single provider in this list communicating with the organization in a 1-hour window exceeds a hard threshold (e.g., 50 unique IPs).",
              "Statistical: For each provider category (e.g., 'Free Webmail'), calculate a 30-day moving average and standard deviation for email volume (from Zeek smtp.log) and bytes transferred (from Zeek conn.log). Generate an alert when the daily volume for a category exceeds the moving average by 3 standard deviations.",
              "Machine Learning: Implement a Seasonal-Hybrid-ESD (S-H-ESD) time series anomaly detection model on the hourly connection count from high-risk provider categories. This model can account for daily and weekly seasonality in communication patterns. Alert on any anomalies detected by the model, as they represent significant, non-seasonal deviations from the norm."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]