[
  {
    "information_requirement": "Is an adversary acquiring or using malicious domains to support operations against our organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.001",
        "name": "Domains",
        "evidence": [
          {
            "description": "An internal host's DNS query (in the 'query' field of Zeek dns.log) or network connection (to a destination in the 'id.resp_h' field of Zeek conn.log) matches a domain on a high-confidence threat intelligence feed of known malicious domains.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Egress Web Proxies, Network Security Monitoring (NSM) Sensors, Firewall Egress Logs",
            "action": [
              "Continuously ingest threat intelligence feeds of malicious domains. Create a detection rule to generate a high-severity alert when a domain in the Zeek dns.log 'query' field or a destination IP in the Zeek conn.log 'id.resp_h' field (after resolving to a domain) matches an indicator from the feed.",
              "Group Zeek conn.log and dns.log events by source IP over 5-minute windows. For any source IP, count the number of unique malicious domains contacted based on the threat feed. Alert if this count exceeds a statistical threshold (e.g., 3), as this indicates a higher likelihood of active compromise rather than an accidental click.",
              "Use a time-series anomaly detection model (e.g., SARIMA) on the volume of threat intelligence matches per hour across the enterprise. A sudden spike exceeding a learned threshold (e.g., 3 standard deviations above the rolling 24-hour average) can indicate a widespread campaign or a significant internal compromise requiring immediate investigation."
            ]
          },
          {
            "description": "An internal host resolves a domain via a DNS query (Zeek dns.log) that is visually or typographically similar to a legitimate corporate or partner domain. This similarity is identified through Levenshtein distance, homograph character detection, or Jaccard similarity scores.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Mail Gateway Logs, Egress Web Proxies, Endpoint DNS Cache, Network Security Monitoring (NSM) Sensors",
            "action": [
              "Generate and maintain a static list of potential typosquatted and homograph domains for the organization's primary domains using open-source tools. Create a rule to generate an alert when a domain in the 'query' field of Zeek dns.log exactly matches an entry in this pre-computed list.",
              "For each unique domain in Zeek dns.log, calculate its Levenshtein distance from a master list of legitimate corporate domains. Isolate domains with a distance between 1 and 2. For this subset, calculate the percentage of non-alphanumeric characters. Flag domains where the Levenshtein distance is low and the non-alphanumeric character percentage is above a baseline (e.g., > 10%) for manual review.",
              "Train a supervised classification model (e.g., Random Forest) on a labeled dataset of legitimate and known typosquatted domains. Engineer features including n-gram frequency, character entropy, Levenshtein distance to known good domains, TLD type, and domain length. Apply the trained model to all resolved domains in Zeek dns.log to generate a 'typosquat probability' score. Alert on any domain exceeding a high-confidence probability threshold (e.g., > 0.9)."
            ]
          },
          {
            "description": "An internal host establishes a TLS connection (Zeek ssl.log) to a domain where the domain was registered recently (e.g., less than 30 days ago) and the TLS certificate has suspicious attributes, such as being issued by a free Certificate Authority and having a short validity period (e.g., 90 days).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Web Proxies, Corporate DNS Resolvers, Certificate Transparency Log Feeds, Network Security Monitoring (NSM) Sensors",
            "action": [
              "Enrich Zeek ssl.log events with passive DNS data for domain registration dates. Create a rule that triggers an alert if (domain_registration_age < 30 days) AND (ssl_log.issuer IN ['C=US, O=Let\\'s Encrypt, CN=R3', ...]) AND (ssl_log.certificate.validity_length <= 90 days).",
              "For each new external connection in Zeek conn.log, enrich with domain registration date, WHOIS privacy status, and TLS certificate issuer. Calculate a risk score: add 10 points if registration age < 60 days, 5 points for WHOIS privacy, 5 points for a free TLS CA. Sum the points and alert on any connection where the destination domain's score exceeds the 95th percentile of all domain scores calculated in the last 24 hours.",
              "Implement an unsupervised clustering algorithm (e.g., K-Means or DBSCAN) on domain features including registration age, TLD, ASN reputation, and TLS certificate attributes (issuer, validity period). Analyze the resulting clusters by sampling members and labeling each cluster as 'benign', 'suspicious', or 'malicious'. Create a rule to alert when an internal host from Zeek conn.log connects to a domain that is part of a 'suspicious' or 'malicious' cluster."
            ]
          },
          {
            "description": "An internal host generates a high volume of DNS queries for non-existent domains (NXDOMAIN), characteristic of a Domain Generation Algorithm (DGA). These queries often exhibit high Shannon entropy and are followed by a successful query to a newly registered domain.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Processes, Corporate DNS Resolvers, Domain Controllers, Endpoint DNS Cache",
            "action": [
              "Create a rule that triggers when a source IP in Zeek dns.log generates > 20 NXDOMAIN responses in 60 seconds. Correlate the source IP and timestamp with Windows Event ID 4688 to identify the parent process. Alert if the process name is not on an allowlist of approved applications (e.g., web browsers, updaters).",
              "For each internal source IP, calculate two metrics over a 5-minute sliding window from Zeek dns.log: 1) The ratio of NXDOMAIN responses to total queries. 2) The average Shannon entropy of the queried domain names that resulted in NXDOMAIN. Create an alert if both metrics exceed their respective historical 99th percentile baseline for that specific host.",
              "Deploy a pre-trained deep learning model (e.g., LSTM or GRU) that classifies domain names as human-generated or machine-generated. In near-real time, feed all queried domains from Zeek dns.log into the model. If a domain is classified as DGA with high confidence (e.g., > 0.95) and the query results in an NXDOMAIN, flag the source host for investigation."
            ]
          },
          {
            "description": "An internal host's communication to an external domain, potentially acquired for Command and Control, exhibits beaconing behavior. This is characterized by highly periodic connections (low jitter), use of non-standard ports for common protocols, or anomalous data transfer sizes compared to a baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Firewall Egress Logs, Egress Web Proxies, Network Sensor Taps, Endpoint Process Execution Logs",
            "action": [
              "From Zeek conn.log, create a rule that alerts when the `service` field (e.g., 'http', 'ssl') does not correspond to the `id.resp_p` (destination port), such as HTTP traffic over port 8888. Exclude known, legitimate non-standard port usage within the environment to reduce false positives.",
              "For each unique source-destination IP pair in Zeek conn.log over a 24-hour period, calculate the standard deviation of the time delta between consecutive connections (jitter). Alert on pairs with a jitter below a threshold (e.g., < 1 second) and a mean interval between 1 minute and 2 hours. Separately, for each destination port, calculate the 95th percentile for `orig_bytes` and `resp_bytes` and alert when a connection exceeds this threshold.",
              "Train an autoencoder neural network on a dataset of benign network connection metadata from Zeek conn.log. Use features such as `duration`, `orig_bytes`, `resp_bytes`, `proto`, and one-hot encoded `conn_state`. For each new connection, calculate the reconstruction error. An error that exceeds the 99th percentile of errors from the training set indicates a highly anomalous connection and should trigger an alert for C2 investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]