[
  {
    "information_requirement": "Is an internal host part of an adversary-controlled botnet, or is our organization being targeted by one?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.005",
        "name": "Botnet",
        "evidence": [
          {
            "description": "An internal host establishes a confirmed outbound network connection or resolves a domain to an external destination (IP address or domain) present on a high-confidence threat intelligence feed of known botnet command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Egress Points (Firewalls, Proxies), Internal DNS Resolvers, Endpoint Devices",
            "action": [
              "Continuously query all outbound network connection logs (Zeek conn.log, Windows Event ID 5156) and DNS query logs (Zeek dns.log) against a threat intelligence feed of known botnet C2 IP addresses and domains. Generate a high-priority alert for any match.",
              "For each host, calculate a risk score based on the number of distinct threat intelligence feeds that flag its destination IPs or domains within a 1-hour window. Alert if a host's risk score exceeds the 99th percentile of all hosts, indicating communication with multi-source-validated malicious infrastructure.",
              "Deploy a pre-trained classification model (e.g., Random Forest) that inputs connection features (destination port, protocol, destination ASN, domain age, IP reputation) to predict the probability of a connection being 'botnet C2'. Generate an alert for any connection classified as such with a confidence score greater than 0.90."
            ]
          },
          {
            "description": "An internal host's outbound network traffic exhibits patterns indicative of automated C2, such as a high ratio of NXDOMAIN responses, DNS queries for high-entropy domains (DGA), use of non-standard ports for common protocols, or a TLS client fingerprint (JA3/JA3S) matching a known malware family.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Egress Points (Firewalls, Proxies), Internal DNS Resolvers",
            "action": [
              "Query TLS connection logs (Zeek ssl.log) for JA3 or JA3S hash values. Generate a high-priority alert if any observed hash matches an entry in a curated list of known botnet malware family fingerprints.",
              "For each internal host, calculate the Shannon entropy of all unique queried subdomains in Zeek dns.log within a 5-minute sliding window. Generate an alert if a host's average entropy score exceeds a dynamically calculated threshold, such as the 98th percentile of all hosts over the last 24 hours, indicating potential DGA activity.",
              "Implement a time-series anomaly detection model (e.g., LSTM Autoencoder) trained on the per-host ratio of NXDOMAIN responses to total DNS queries. An anomalous spike in this ratio, when compared to the model's prediction of normal behavior for that host, signifies a potential DGA execution attempt. Generate an alert on any statistically significant anomaly."
            ]
          },
          {
            "description": "An internal host generates outbound network traffic characterized by either rhythmic, periodic connections to a single external destination (beaconing) or a high rate of connection attempts to numerous unique external destinations (scanning).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "General User Workstation Subnets, Server Subnets, Internet Egress Points",
            "action": [
              "Correlate process creation events (Windows Event ID 4688) with subsequent outbound network connections (Windows Event ID 5156). Alert if a newly created, non-browser, and unsigned process establishes a persistent outbound connection to an external IP on a non-standard port.",
              "Analyze Zeek conn.log by grouping connections by source IP and destination IP over a 1-hour window. Calculate the standard deviation of the time delta between consecutive connections. A standard deviation near zero (e.g., < 1.0 second) indicates rhythmic beaconing. Alert on hosts exhibiting this behavior with a frequency above the 99th percentile.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN) to connection metadata (source IP, destination IP, destination port, bytes sent, inter-connection time). Identify and alert on clusters representing beaconing (small, dense groups of connections from one host to another) or scanning (large, sparse groups of connections from one host to many others)."
            ]
          },
          {
            "description": "A public-facing service experiences a sudden, sustained increase in inbound traffic volume and connection rate originating from a large, distributed set of external source IP addresses, inconsistent with established baselines.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-Facing Services (Web Servers, VPN Concentrators), DMZ Network Segments, Internet Ingress Points",
            "action": [
              "Create a rule to monitor Zeek notice.log for the generation of specific DDoS-related notices, such as 'Scan::Address_Scan' or 'Attack::DOS', targeting a single destination host. Trigger a high-priority, automated alert upon detection.",
              "For each public-facing service IP, establish a 30-day rolling baseline for inbound connections per minute and unique source IPs per minute. Alert if both metrics simultaneously exceed 3 standard deviations above their respective baselines, indicating a potential volumetric attack.",
              "Utilize a time-series forecasting model (e.g., ARIMA) to predict the expected volume of inbound traffic and unique source ASNs for the next 5-minute interval. If observed traffic significantly exceeds the model's predicted upper confidence interval, classify the event as a volumetric anomaly and potential DDoS attack."
            ]
          },
          {
            "description": "The mail gateway receives a high volume of inbound emails within a short time frame that share common features (subject line patterns, attachment hash, URL domain) but originate from a large, geographically diverse, and non-reputable set of source IP addresses.",
            "data_sources": [
              "Email Gateway Logs",
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Gateway Servers, Internet Ingress Points, User Workstation Subnets",
            "action": [
              "From email gateway logs and Zeek files.log, create a rule that alerts when more than 50 unique source IPs send emails with the same attachment SHA256 hash or an embedded URL from the same non-whitelisted domain within a 1-hour window.",
              "Calculate the Shannon entropy of the source IP addresses for all inbound emails in 10-minute windows. Establish a dynamic baseline for this entropy score. Generate an alert if the entropy score spikes more than 3 standard deviations above the baseline, indicating a campaign originating from a highly distributed source network.",
              "Use a clustering algorithm (e.g., DBSCAN) on feature vectors derived from emails (e.g., TF-IDF of subject, URL structure, attachment file type). For any large cluster of highly similar emails, analyze the distribution of source Autonomous Systems (ASNs). If the cluster originates from an anomalously high number of ASNs compared to normal email traffic, flag it as a probable botnet-driven phishing campaign."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]