[
    {
        "information_requirement": "Is the adversary developing resources, such as social media accounts, for potential future use?",
        "tactic_id": "TA0042",
        "tactic_name": "Resource Development",
        "indicators": [
            {
                "technique_id": "T1586.001",
                "name": "Social Media Accounts",
                "evidence": [
                    {
                        "description": "Connections from internal hosts to domains or IP addresses known to be associated with social media credential phishing, typo-squatting, or related C2 infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join DNS queries from Zeek dns.log and destination IPs from Zeek conn.log against a high-confidence cyber threat intelligence (CTI) feed. This feed should contain domains/IPs known for phishing major social media platforms (e.g., domains typo-squatting Facebook, LinkedIn, etc.) or known C2 infrastructure used in social media-related campaigns. Alert on any matches and investigate the source host for compromise."
                    },
                    {
                        "description": "Execution of web browsers or scripting engines with command-line arguments and process characteristics indicative of automated, non-interactive social media activity.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 (Process Creation) for browser processes (e.g., chrome.exe, msedge.exe, firefox.exe) launched with specific command-line flags indicating automation or headless operation (e.g., '--headless', '--remote-debugging-port'). Also, flag scripting engines (e.g., powershell.exe, python.exe) executing scripts that make web requests (e.g., using 'Invoke-WebRequest' or libraries like 'requests', 'selenium') to social media domains. Use regular expressions on command lines to find these tool-specific patterns and correlate with network logs to confirm the destination."
                    },
                    {
                        "description": "Suspicious host process activity associated with credential harvesting occurring in close temporal proximity to network connections to social media platforms.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for processes indicative of credential access (e.g., execution of known credential-dumping tools, scripts accessing credential stores, or suspicious access to the LSASS process). Correlate these host events by timestamp and hostname with network connections to social media platforms recorded in Zeek conn.log. Use correlation analysis to flag instances where a credential access event is followed within a short time window (e.g., 1-15 minutes) by a connection to a social media site from the same host, which may indicate the use of stolen credentials to compromise an account."
                    },
                    {
                        "description": "Anomalous patterns in network traffic to social media platforms from internal hosts, such as unusual connection timing, frequency, or data volume, deviating from established user or host baselines.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal network interaction with social media sites for each host and/or user, profiling metrics like connection frequency, time-of-day, and data upload/download volumes (from 'orig_bytes' and 'resp_bytes' in Zeek conn.log). Use time series analysis to detect unusual spikes in connection frequency or activity outside of normal hours. Employ statistical methods, such as Inter-Quartile Range (IQR) or Z-score calculations on data volumes, to flag significant deviations from the baseline. Further, analyze the entropy of destination social media domains accessed by a single host; a sudden increase may indicate automated activity across many platforms."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
