[
  {
    "information_requirement": "Is the adversary compromising external or internal accounts to support targeting or operations?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1586",
        "name": "Compromise Accounts",
        "evidence": [
          {
            "description": "A login attempt (successful or failed) where the username is present in a known credential breach dump, or the source IP address is listed in a threat intelligence feed for credential abuse.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing authentication services (VPN, OWA, M365), Domain Controllers, Internet gateway/network egress points, Threat Intelligence Platform",
            "action": [
              "Symbolic: Continuously correlate usernames from login events (Windows Event IDs 4624, 4625) against a CTI feed of breached credentials. Concurrently, match source IPs from Zeek conn.log against a CTI feed of IPs known for credential stuffing or other abuse. Alert on any match.",
              "Statistical: Calculate the rate of login attempts from IPs on a 'watchlist' (e.g., IPs that have appeared on CTI feeds within the last 90 days). Alert if the login rate from these IPs exceeds the 95th percentile of login rates from all external IPs over a 1-hour window.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression) using labeled historical login data. Features should include 'is_on_breach_list', 'is_on_cti_ip_list', 'time_of_day', 'source_asn', and 'user_privilege_level'. The model will output a probability score indicating the likelihood a login is malicious, with alerts triggered above a defined threshold (e.g., 0.85)."
            ]
          },
          {
            "description": "A high volume of failed login events (Windows Event ID 4625) across multiple user accounts originating from one or a few source IPs, where the User-Agent string in corresponding network logs (Zeek http.log) matches signatures of known credential attack tools.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web application servers, VPN concentrators, Network perimeter firewalls, Cloud identity provider logs",
            "action": [
              "Symbolic: Create a detection rule that triggers when a single source IP generates more than 20 failed logins (Windows Event ID 4625) for more than 10 unique accounts within a 5-minute window, and the User-Agent string in Zeek http.log matches a known attack tool signature (e.g., 'Hydra', 'Medusa', 'sqlmap').",
              "Statistical: For each source IP, calculate the ratio of unique failed accounts to total failed login attempts within a 10-minute window. A ratio approaching 1.0 suggests a password spray. Alert if this ratio for any given IP exceeds the 99th percentile of all source IP ratios observed in the last 24 hours.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on login event data, featuring 'source_ip', 'timestamp', and 'username_hash'. A dense cluster of failed logins from a single IP across many usernames, identified as an anomalous cluster, indicates a likely password spraying attack."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of failed login events (Windows Event ID 4625) against a single account from many IPs (distributed brute-force) or many accounts from a few IPs (credential stuffing) compared to an established baseline.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication logs on Domain Controllers and member servers, Public-facing application logs, Cloud identity provider logs (e.g., Azure AD Sign-in logs)",
            "action": [
              "Symbolic: Trigger an alert if the count of failed logins (Windows Event ID 4625) for a single user account exceeds a hard threshold of 20 failures in 5 minutes from more than 5 distinct source autonomous systems (ASNs), as identified in Zeek conn.log.",
              "Statistical: For each authentication service, model the baseline failed login rate using a 30-day moving average and standard deviation. Generate an alert when the current hourly failure rate exceeds the baseline by 3 standard deviations. Separately, calculate the entropy of source IPs per target username over a 5-minute window; a sudden spike in entropy for one user indicates a distributed attack.",
              "Machine Learning: Apply a time series anomaly detection model (e.g., ARIMA or LSTM) to the stream of failed login counts per minute. The model, trained on normal login patterns, will flag statistically significant deviations from the expected volume, indicating a potential brute-force or credential stuffing attack."
            ]
          },
          {
            "description": "A successful login event (Windows Event ID 4624) that is either: (1) preceded by numerous failed login attempts from the same source IP within a short time window, or (2) occurs from a geographic location that is physically impossible to travel to from the location of the user's previous successful login.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controller security logs, VPN access logs, Internet gateway flow logs (Zeek conn.log), Geolocation enrichment database",
            "action": [
              "Symbolic: Create a rule that triggers when a successful login (Windows Event ID 4624) from a source IP is preceded by 10 or more failed logins (Windows Event ID 4625) from the same IP for the same user account within the last 15 minutes.",
              "Statistical: For each user, maintain their last successful login's timestamp and geolocated IP (from Zeek conn.log). For each new login, calculate the required travel speed from the previous location. Alert if the speed exceeds 1000 km/h. Also, alert if the login source country is not in the user's list of previously used countries.",
              "Machine Learning: Train a classifier on user login sessions with features including 'time_since_last_login', 'distance_from_last_login_km', 'is_new_asn', and 'count_of_prior_failures'. The model classifies each login as 'normal' or 'suspicious', flagging potential impossible travel or brute-force success events with high confidence."
            ]
          },
          {
            "description": "An inbound email from a known external partner's domain that contains indicators of compromise, such as a link to a domain registered within the last 30 days, a mismatch between 'From' and 'Reply-To' headers, or a failure of DMARC/SPF/DKIM authentication.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Email Gateway Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email gateway/Mail Transfer Agent (MTA), Network DNS resolvers, Web proxy/egress points",
            "action": [
              "Symbolic: Alert on any inbound email from a partner domain that fails DMARC authentication ('p=reject' or 'p=quarantine') or contains a URL with a domain present on a CTI feed of known malicious domains.",
              "Statistical: For all domains found in inbound email links, query their registration date via WHOIS lookups cached from Zeek dns.log. Calculate the age of all domains in the email body and flag any email where the newest domain is less than 30 days old. Alert if such an email also contains keywords related to urgency or financial transactions.",
              "Machine Learning: Utilize a Natural Language Processing (NLP) model to analyze email body content. Compare the topic distribution (using Latent Dirichlet Allocation) and sentiment of an incoming email against a historical baseline for that specific sender. A significant deviation in topic (e.g., a sudden financial request from a technical contact) or sentiment will trigger an alert for manual review."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]