[
  {
    "information_requirement": "Is the adversary developing resources using compromised cloud accounts?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1586.003",
        "name": "Cloud Accounts",
        "evidence": [
          {
            "description": "An internal host makes outbound connections to domains or IP addresses associated with known-malicious infrastructure or cloud providers frequently abused by adversaries for resource development.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Corporate DNS Resolvers, Proxy Servers",
            "action": [
              "Symbolic: Query Zeek dns.log and conn.log for connections where the destination domain or IP address matches a threat intelligence feed of known malicious C2 servers, phishing hosts, or anonymization services hosted on cloud infrastructure. Generate an alert for any match.",
              "Statistical: Enrich Zeek dns.log data with domain registration age (via WHOIS lookups). Calculate the 10th percentile for domain age across the organization. Flag any connections to cloud service domains that fall below this percentile (e.g., newly registered domains), as they are statistically more likely to be malicious.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from Zeek conn.log and dns.log (e.g., destination ASN, domain name entropy, connection duration, data volume). Use labeled data from threat feeds and internal benign traffic. Use the model to score new connections for their likelihood of being malicious resource development activity."
            ]
          },
          {
            "description": "Process execution or network traffic characteristic of cloud management CLI tools (e.g., AWS CLI, Azure CLI, gcloud CLI) originates from a host or user account not explicitly authorized for cloud administration.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Server Subnets (excluding designated admin hosts), Developer Workstations",
            "action": [
              "Symbolic: Create a detection rule that triggers when Windows Event ID 4688 shows a process creation for 'aws.exe', 'az.cmd', 'gcloud.cmd', or 'terraform.exe' AND the associated user account is not in a pre-defined 'Cloud Admins' group. Correlate with Zeek http.log User-Agent strings like 'aws-cli/', 'Boto3/', 'Azure-CLI/' from the same source IP.",
              "Statistical: For each host, establish a baseline of executed processes from Windows Event ID 4688 over a 30-day period. Calculate the rarity of each process. Generate a high-severity alert if a cloud CLI tool is executed for the first time on a host, or if its execution frequency suddenly deviates by more than 3 standard deviations from its baseline.",
              "Machine Learning: Use unsupervised learning (e.g., DBSCAN clustering) on hosts based on their process execution and network activity profiles. Identify clusters of 'normal' user workstations, 'developers', and 'servers'. Flag any host that is identified as an outlier, particularly if the anomalous activity involves cloud CLI tools or API endpoints."
            ]
          },
          {
            "description": "An internal host exhibits a statistically significant and sustained increase in connection count or data volume to cloud service provider IP ranges, particularly for compute or storage services, when compared to its historical baseline.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, All Corporate Subnets, VPN User IP Pools",
            "action": [
              "Symbolic: Define a high-watermark threshold for data transfers to cloud storage providers (e.g., S3, Azure Blob). Create a rule to alert if any single host sends more than a fixed amount (e.g., 1GB) of data in an hour to these services, excluding known backup servers.",
              "Statistical: For each host, create a baseline of daily outbound data volume (bytes_out) and connection count to cloud provider IP ranges using Zeek conn.log. Alert if the daily volume for a host exceeds the 99th percentile of its own 30-day historical data, or the 99th percentile of its peer group (e.g., other marketing department workstations).",
              "Machine Learning: Implement a time-series forecasting model (e.g., ARIMA) for each host's outbound traffic volume to cloud providers. Continuously predict the expected traffic for the next hour. Generate an alert when the actual observed traffic significantly exceeds the model's prediction interval, indicating an anomaly that simple thresholds might miss."
            ]
          },
          {
            "description": "An internal host initiates interactive sessions or a high diversity of API calls to cloud management portals and endpoints, inconsistent with the host's role and typical behavior.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, VPN Concentrators, Administrative Workstations",
            "action": [
              "Symbolic: Alert on any direct connection from a server subnet to a cloud management web portal (e.g., console.aws.amazon.com, portal.azure.com), as servers should typically use APIs, not interactive logins.",
              "Statistical: For each source IP, calculate the Shannon entropy of the requested subdomains under a cloud provider's main domain (e.g., '.amazonaws.com', '.azure.com') within a 1-hour window using Zeek dns.log. Establish a baseline entropy score for different user groups. A score that deviates by more than 2 standard deviations from the baseline suggests unusual service discovery or enumeration.",
              "Machine Learning: Use a sequence analysis model (e.g., Markov Chain) to learn common sequences of API calls for legitimate cloud administration tasks. Analyze Zeek dns.log and http.log to extract API call sequences per session. Flag sessions that contain highly improbable sequences of API calls, such as creating a user (IAM), then a VM (EC2), then a DNS record (Route53) in rapid succession from a non-admin host."
            ]
          },
          {
            "description": "An internal host sequentially connects to a combination of distinct cloud services (e.g., identity, compute, storage, networking) in a logical pattern that mirrors the workflow of provisioning new infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Developer Subnets, Corporate DNS Resolvers",
            "action": [
              "Symbolic: Create a rule that looks for a sequence of DNS queries from a single host within a 15-minute window for specific service endpoints in a logical order: 1) IAM service (e.g., `iam.amazonaws.com`), 2) a compute service (e.g., `ec2.*.amazonaws.com`), and 3) a networking or storage service (e.g., `s3.*.amazonaws.com`).",
              "Statistical: Categorize cloud service domains from Zeek dns.log into functional groups (IAM, Compute, Storage). For each host, create a feature vector representing the count of unique services accessed in each category per day. Calculate the cosine similarity between a host's daily activity vector and its historical baseline profile. A low similarity score indicates a significant change in behavior.",
              "Machine Learning: Apply association rule mining (e.g., Apriori algorithm) to historical Zeek log data to discover frequent itemsets of cloud services accessed together by legitimate users. Generate alerts when a host accesses a rare combination of services that has low 'support' and 'confidence' scores, suggesting a non-standard workflow indicative of malicious activity."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]