[
  {
    "information_requirement": "Is the adversary developing resources (e.g., servers) for use in operations against us?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.004",
        "name": "Server",
        "evidence": [
          {
            "description": "An internal host establishes a network connection with or resolves a domain for an external IP address that is present on a high-confidence threat intelligence feed of known adversary infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Threat Intelligence Platform Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, Endpoint Devices, Threat Intelligence Platforms",
            "action": [
              "Create and maintain a watchlist of IP addresses and domains from high-confidence threat intelligence feeds. Continuously join network flow logs (Zeek conn.log, Windows Event ID 5156) and DNS query logs (Zeek dns.log) against this watchlist, generating an alert for any successful connection or query that matches an entry.",
              "For each alert generated from a threat intelligence match, enrich the event by calculating the 30-day prevalence of the destination IP or domain across the enterprise. Prioritize investigations for destinations contacted by a number of hosts below a set threshold (e.g., fewer than 5 hosts) or falling in the bottom 5th percentile of destination prevalence.",
              "Develop and deploy a supervised classification model (e.g., Random Forest) trained on labeled historical network data. Use features such as connection duration, bytes sent, bytes received, destination port, and threat intelligence category. Use the trained model to assign a 'probability of maliciousness' score to new connections that match threat intelligence, automatically escalating those with a score above a defined confidence threshold (e.g., 0.90)."
            ]
          },
          {
            "description": "An internal host initiates an SSL/TLS session with an external server where the server's X.509 certificate, JA3/JA3S hash, or HTTP server header matches a known adversary Command and Control (C2) profile.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek http.log",
              "Zeek ja3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Proxies with SSL/TLS Inspection, Network Security Monitoring (NSM) Sensors",
            "action": [
              "Maintain a signature library of known malicious C2 indicators, including common self-signed certificate subjects (e.g., empty or default Cobalt Strike values), specific JA3/JA3S hashes, and adversary-associated HTTP server headers. Scan Zeek ssl.log, ja3.log, and http.log in real-time for exact matches to this library and generate an alert on any match.",
              "For all external SSL/TLS connections, calculate the Shannon entropy of the certificate's subject and issuer fields. Establish a baseline of entropy scores for legitimate traffic. Flag connections for review where the subject or issuer entropy falls below a dynamic threshold (e.g., the 10th percentile of daily entropy scores), as this may indicate default or auto-generated certificates common in C2 frameworks.",
              "Implement an unsupervised clustering algorithm (e.g., DBSCAN) on features extracted from Zeek ssl.log, such as certificate validity period, public key length, signature algorithm, and JA3/JA3S hash. Periodically analyze the resulting clusters to identify small, distinct groups of connections that deviate from large clusters of legitimate traffic (e.g., Google, Microsoft, CDNs) and investigate these outlier clusters as potential C2 infrastructure."
            ]
          },
          {
            "description": "An internal host initiates a connection to an external domain or IP address that has not been previously observed in the environment and was registered within the last 60 days.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Sysmon Event ID 22",
              "Passive DNS Data",
              "WHOIS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, Endpoint Devices, Threat Intelligence Platforms",
            "action": [
              "Maintain a stateful baseline of all external domains and IP addresses contacted over the last 90 days. For every new DNS query or network connection, check if the destination exists in the baseline. If the destination is not found, perform a WHOIS lookup. Generate a high-priority alert if the domain's 'creation_date' is less than 60 days from the current date.",
              "For all newly observed domains, calculate a risk score based on statistical properties such as domain name length, character-to-digit ratio, Shannon entropy (to detect DGA), and TLD rarity (e.g., .xyz, .top). Sum the points for each property and flag domains that exceed a percentile-based threshold (e.g., the 95th percentile of risk scores for all new domains observed that day).",
              "Develop a time-series anomaly detection model (e.g., SARIMA) on the daily count of newly observed domains contacted by internal hosts. An anomalous spike in the number of new domains can indicate the activation of a widespread campaign using newly acquired server infrastructure. Investigate the specific domains contributing to any detected spike."
            ]
          },
          {
            "description": "Multiple internal hosts concurrently query a single, uncommon external domain, where the domain resolves to a newly observed IP address.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Sysmon Event ID 22"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Network Egress Points, Endpoint Devices",
            "action": [
              "For each unique domain in DNS logs, count the number of distinct source hosts querying it within a 5-minute window. If the count of hosts for a single domain exceeds a hard threshold (e.g., 50 hosts) and the domain's first-seen timestamp in the environment is within the last 24 hours, generate a 'suspected C2 rallying' alert.",
              "For each domain, calculate the number of unique client queries per hour and establish a baseline using a 14-day moving average and standard deviation. Generate an alert when the current hour's query count for a domain exceeds the mean plus three standard deviations (a 3-sigma event), indicating a statistically significant spike in query activity.",
              "Apply an online change point detection algorithm to the time series of query counts for each domain. This method can identify abrupt shifts in the statistical properties of the query volume (e.g., mean, variance) that are more subtle than a simple spike, potentially indicating a change in C2 behavior or the start of a new campaign phase."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]