[
  {
    "information_requirement": "Is the adversary developing resources, specifically social media accounts, for targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.001",
        "name": "Social Media Accounts",
        "evidence": [
          {
            "description": "A social media profile contains profile information (URL, email address, username) that matches indicators from a Cyber Threat Intelligence (CTI) feed.",
            "data_sources": [
              "Publicly available social media data",
              "Cyber Threat Intelligence Feeds",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External Social Media Platforms, Threat Intelligence Platform, DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Proactively scan social media platforms for profiles impersonating the organization or its employees. Extract all associated metadata, including linked websites and contact information. Correlate these extracted indicators (domains, URLs, email addresses, usernames) against a high-confidence CTI feed of known malicious infrastructure. Generate an alert for any exact match.",
              "Statistical: For domains found in social media profiles claiming affiliation with the organization, calculate the domain's registration age and Levenshtein distance from the official company domain. Flag domains registered within the last 90 days or with a small Levenshtein distance (e.g., < 3) as suspicious. Compare the frequency of new suspicious domains against a 30-day moving average to detect campaign-level activity.",
              "Machine Learning: Develop a classification model trained on features from known benign and malicious social media profiles. Features should include account age, number of followers/connections, follower-to-following ratio, and presence of a profile picture. Use this model to score newly discovered accounts impersonating employees, flagging those classified as malicious with high confidence."
            ]
          },
          {
            "description": "One or more social media profiles impersonating employees use duplicated or templated biography text, profile imagery, or structured naming conventions.",
            "data_sources": [
              "Publicly available social media data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External Social Media Platforms, Corporate Brand Monitoring Service",
            "action": [
              "Symbolic: Using regular expressions, search for usernames and profile URLs that match common impersonation patterns (e.g., `(firstname).(lastname).(company)`, `(company)-(support)`). Maintain and match against a library of perceptual hashes (pHash) for official corporate logos and executive profile pictures to find unauthorized or manipulated usage.",
              "Statistical: For a group of suspected impersonation accounts, calculate the Jaccard similarity score for their profile descriptions (biographies). A high average similarity score across the group (e.g., > 0.8) indicates templated content. Calculate the entropy of usernames within the cluster; abnormally low entropy suggests a programmatic naming convention.",
              "Machine Learning: Use Natural Language Processing (NLP) topic modeling (e.g., Latent Dirichlet Allocation) on the text from posts and biographies of suspicious accounts. Compare the resulting topics to those from known adversary campaigns and legitimate employee profiles to identify thematic anomalies and attribute activity."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) shows the execution of a scripting engine or browser automation tool with command-line arguments referencing social media platform domains.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Employee Workstations, Marketing Department Servers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Symbolic: Monitor for process creation events (Windows Event ID 4688) where the process name matches known automation tools (e.g., `chromedriver.exe`, `geckodriver.exe`) or scripting engines (`powershell.exe`, `python.exe`) and the command line contains keywords for social media sites (e.g., 'twitter.com', 'linkedin.com'). Alert if the user is not in a pre-approved group (e.g., Marketing Team).",
              "Statistical: For each user, establish a baseline of normal process executions. Calculate the frequency of script or automation tool usage. Alert when the daily count of such process creations for a user exceeds the 99th percentile of their historical 30-day activity, especially outside of business hours.",
              "Machine Learning: Train a random forest classifier on process event features (process name, parent process, command line length, user, host) to distinguish between benign and malicious script execution. Use the model to flag anomalous process chains, such as `winword.exe` spawning `powershell.exe` which then executes a script with social media command-line arguments."
            ]
          },
          {
            "description": "Network connection logs from a single host show a statistically significant deviation in connection count, data volume, or connection timing to social media domains compared to its own or its peers' baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, DNS Resolvers, Web Proxies",
            "action": [
              "Symbolic: Create a watchlist of social media API domains (e.g., `api.twitter.com`, `api.linkedin.com`). Generate an alert when an internal host not on an approved list (e.g., marketing servers) initiates a connection to these domains, as captured in Zeek dns.log or conn.log.",
              "Statistical: For each host, profile the hourly connection count to social media domains over a 30-day period. Calculate the Z-score for the connection count in each one-hour window. Alert if the Z-score exceeds a threshold (e.g., 3.5), indicating a burst of activity. Calculate the entropy of inter-request timings; low entropy suggests automation.",
              "Machine Learning: Apply a time series forecasting model (e.g., ARIMA) to the volume of data transferred to social media sites per host. Generate an alert when the observed data volume significantly exceeds the forecasted volume with its confidence interval, indicating an unexpected bulk data transfer or sustained interaction."
            ]
          },
          {
            "description": "An external social media account, created recently, sends an anomalously high number of connection requests to organization employees in a short time frame.",
            "data_sources": [
              "Publicly available social media data",
              "Employee reports"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External Social Media Platforms, Employee Inboxes (for reported contact attempts)",
            "action": [
              "Symbolic: Maintain a list of newly created (< 30 days old) social media profiles that have sent connection requests to more than one employee. If an account from this list attempts to connect with a key executive or a high-privilege user, trigger an immediate alert for manual review.",
              "Statistical: Aggregate connection requests from external accounts to employees. For each source account, calculate the rate of requests per day. Flag any account whose request rate exceeds the 99th percentile of all requesting accounts over the last 90 days. Analyze the 'blast radius' by counting the number of unique departments targeted by a single account.",
              "Machine Learning: Use graph analysis to model the social network of the organization's employees. When a new external account sends connection requests, analyze its position in the graph. Use community detection algorithms (e.g., Louvain Modularity) to identify accounts that are attempting to bridge otherwise disconnected employee clusters, a common tactic in reconnaissance."
            ]
          },
          {
            "description": "A group of social media profiles, identified as impersonating employees or the organization, demonstrates highly correlated activity in time, such as posting or liking content within seconds or minutes of each other.",
            "data_sources": [
              "Publicly available social media data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External Social Media Platforms",
            "action": [
              "Symbolic: Identify a set of suspected inauthentic accounts. Check if they all follow a central 'master' account or all post links to the same set of external domains. An exact match on these shared characteristics across a significant portion of the cluster is a strong indicator of coordination.",
              "Statistical: For a cluster of suspected accounts, extract the timestamps of all their posts and actions. Perform a time series cross-correlation analysis between pairs of accounts. A high correlation coefficient with a small time lag (e.g., < 5 minutes) across many pairs in the cluster indicates synchronized activity. Calculate the pairwise Jaccard similarity of their follower lists; a high average similarity suggests they are part of an engineered botnet.",
              "Machine Learning: Represent the cluster of accounts as a graph where nodes are accounts and edges represent follows or interactions. Use graph embedding techniques (e.g., Node2Vec) to create vector representations of each account. Apply clustering algorithms (e.g., DBSCAN) to these vectors. A tight, isolated cluster that is distant from known legitimate accounts suggests a coordinated inauthentic network."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]