[
  {
    "information_requirement": "Has the adversary acquired a Virtual Private Server (VPS) for operational use? (TA0042 - Resource Development)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.003",
        "name": "Virtual Private Server",
        "evidence": [
          {
            "description": "An outbound network connection from an internal host to an external IP address or domain, or an outbound TLS session involving a certificate SHA-1 hash, matches an entry on a threat intelligence feed specifically identifying known malicious infrastructure hosted on Virtual Private Servers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Internet Gateway, Firewalls, Proxies), Internal DNS Resolvers",
            "action": [
              "Implement a SIEM rule that joins outbound network connection logs (Zeek conn.log), DNS queries (Zeek dns.log), and TLS certificate data (Zeek x509.log) with a threat intelligence feed of known malicious VPS infrastructure. Trigger an alert for any connection where the destination IP, domain, or certificate hash matches an indicator in the feed.",
              "For all outbound connections, enrich destination IPs with ASN information. Create a daily job that calculates the total number of connections from each internal host to ASNs associated with major VPS providers. Identify and alert on any host whose connection count to these ASNs exceeds the 95th percentile of its own 30-day rolling baseline or the global 30-day baseline for all hosts.",
              "Deploy a supervised classification model (e.g., Random Forest) trained on labeled historical network data. The model should use features such as destination ASN, port, data volume, connection duration, domain reputation, and threat intelligence matches. Use this model to assign a risk score to new outbound connections in real-time, flagging those classified as high-probability C2 connections to VPS infrastructure."
            ]
          },
          {
            "description": "An outbound TLS session from an internal host produces a JA3 or JA3S hash that matches a known signature for a Command and Control (C2) framework, or a connection to an external service returns a banner string matching a known C2 server signature.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Internet Gateway, Firewalls, Proxies)",
            "action": [
              "Create a detection rule that continuously scans Zeek ssl.log for JA3 and JA3S hashes and Zeek conn.log for service banners. Match these extracted values against a curated list of signatures for known C2 frameworks (e.g., Cobalt Strike, Sliver). Generate a high-severity alert on any match.",
              "For all TLS sessions in Zeek ssl.log, calculate the frequency of each JA3/JA3S hash observed across the enterprise over a 30-day rolling window. Alert on connections that use a JA3/JA3S hash that appears in less than 0.1% of all sessions. Increase the alert's priority if the destination IP is also part of a known VPS provider's network range.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to a feature set derived from Zeek ssl.log, including JA3/JA3S hashes, cipher suites, and TLS extensions. Identify and investigate clusters of TLS handshakes that are distinct from large, well-known clusters representing benign applications (e.g., web browsers, OS update clients)."
            ]
          },
          {
            "description": "An internal host performs a DNS query for, or initiates a connection to, a domain that was registered within the last 30 days, has a subdomain Shannon entropy score above a defined threshold (e.g., 3.5), or is served by a known dynamic DNS provider.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "WHOIS Data",
              "Passive DNS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Network Egress Points (e.g., Internet Gateway, Firewalls)",
            "action": [
              "Create a SIEM rule that triggers when a DNS query for a domain on a dynamic DNS (DDNS) provider list is observed in Zeek dns.log. Correlate this event with Zeek conn.log to confirm a connection was established to the resolved IP address before alerting.",
              "For each new domain queried in Zeek dns.log, calculate the Shannon entropy of the fully qualified domain name. Enrich the domain with WHOIS data to determine its registration date. Generate an alert if a connection is made to a domain that meets a combined risk threshold, such as an entropy score > 3.5 and a registration age < 30 days.",
              "Develop a time-series forecasting model (e.g., Prophet or ARIMA) on the query volume for newly observed domains. An alert is triggered if the query volume for a new domain, particularly one with suspicious features (high entropy, recent registration), suddenly spikes and exceeds the model's predicted confidence interval, which may indicate coordinated beaconing."
            ]
          },
          {
            "description": "An internal host establishes a recurring connection to an external IP address within a known VPS provider's network space, where the time between connections has a low standard deviation (indicating a 'heartbeat'), the volume of data transferred is a statistical outlier, or the destination port is non-standard for the observed application protocol.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 3"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Internet Gateway, Firewalls), Monitored Endpoint Devices",
            "action": [
              "Implement a rule that alerts on connections in Zeek conn.log or Windows Event ID 3 to destination IPs within known VPS provider network ranges where the destination port is a known C2 port (e.g., 50050) or a common port being used for a non-standard service (e.g., 'service' field in conn.log is not 'DNS' for destination port 53).",
              "For each source-destination IP pair, execute a periodic query to calculate the standard deviation of the time deltas between consecutive connections over a 24-hour window. Alert on pairs with a standard deviation below a defined threshold (e.g., < 2 seconds) indicating a regular beacon. Concurrently, use a Z-score calculation to flag sessions where the total bytes transferred is a statistical outlier compared to the 30-day baseline for that pair.",
              "Train a sequence analysis model, such as a Long Short-Term Memory (LSTM) network, on historical sequences of connection metadata (e.g., inter-arrival time, duration, bytes transferred) for each host. Use the trained model to predict the next event in a sequence. Flag connections that represent a significant deviation from the model's prediction, indicating anomalous network behavior consistent with C2."
            ]
          },
          {
            "description": "An outbound TLS session involves a server certificate that is self-signed, has a validity period less than 90 days, or is issued by a free Certificate Authority (e.g., Let's Encrypt) and is associated with a domain also exhibiting suspicious characteristics (e.g., newly registered, high entropy).",
            "data_sources": [
              "Zeek x509.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points with TLS Inspection Capabilities",
            "action": [
              "Create a detection rule that parses Zeek x509.log and alerts on any certificate where the issuer and subject distinguished names are identical (self-signed). Suppress alerts for connections originating from pre-approved internal management servers to reduce false positives.",
              "For all observed certificates in Zeek x509.log, calculate the distribution of validity periods (end date - start date). Flag certificates with a validity period in the bottom 5th percentile (typically < 90 days). Correlate these short-lived certificates with other risk factors, such as a destination domain registered within the last 30 days, to increase alert fidelity.",
              "Train a decision tree or random forest classifier to identify malicious certificates. Use features from Zeek x509.log and Zeek ssl.log, such as certificate validity duration, public key algorithm, key length, issuer details (e.g., is it a free CA), presence of Subject Alternative Names (SAN), and whether it is self-signed. Deploy the model to score and flag newly observed certificates in real time."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]