[
  {
    "information_requirement": "Has the adversary acquired exploits for use against our enterprise? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588.005",
        "name": "Exploits",
        "evidence": [
          {
            "description": "A non-research/non-security host makes outbound network connections to domains or IP addresses known to host exploit kits, malware development forums, or public exploit code repositories.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, DNS resolvers, Web proxies",
            "action": [
              "Symbolic: Correlate outbound network connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) against a threat intelligence feed of domains and IP addresses associated with exploit distribution or development forums. Generate an alert on any match originating from subnets not designated for security research.",
              "Statistical: For all DNS queries (Zeek dns.log), calculate the population-wide rarity of each requested domain (e.g., using inverse document frequency). Flag hosts that query for domains in the 99th percentile of rarity, especially if those domains are newly registered or have a history of being associated with malicious activity.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from Zeek conn.log and dns.log (e.g., connection duration, bytes transferred, domain entropy, TLD, ASN information) to predict if a connection is related to research/exploit acquisition. Apply the model to new connections to score and flag suspicious activity from non-research hosts."
            ]
          },
          {
            "description": "An internal host, not associated with a security or development team, downloads files with extensions or content patterns indicative of exploit code or vulnerability research tools (e.g., .py, .rb, .pl, .ps1 containing 'exploit', 'CVE-', 'PoC').",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies, Network taps at egress points, Endpoint devices",
            "action": [
              "Symbolic: Monitor Zeek files.log and http.log for downloaded filenames matching regular expressions for exploit code (e.g., 'CVE-[0-9]{4}-[0-9]+', '.*-exploit\\\\.py', '.*\\\\.ps1') or file hashes matching a known-malicious/exploit code threat intelligence feed. Trigger an alert if the download destination is a host outside of a pre-defined security research group.",
              "Statistical: Analyze file downloads (Zeek files.log) across the enterprise. Calculate the entropy of filenames and the frequency of file MIME types per user or host. Flag hosts that download files with unusually high filename entropy or rare MIME types (e.g., 'application/x-python-code') that deviate more than 3 standard deviations from their own or their peer group's baseline.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., LSTM) on file download activity per host. The model should be trained on features like download frequency, file size, and MIME type. An alert should be generated when a host's download activity significantly deviates from its established historical pattern, such as a sudden burst of script file downloads."
            ]
          },
          {
            "description": "Multiple, disparate external IP addresses conducting low-frequency probes against a single port or service on multiple public-facing hosts, where the port or service is associated with a recently disclosed vulnerability.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External-facing firewalls, Demilitarized Zone (DMZ) network segments, Internet gateway",
            "action": [
              "Symbolic: Create a rule that triggers when N unique source IPs connect to the same destination port on M unique internal hosts within a T time window, where the destination port is on a watchlist of ports associated with newly published, critical CVEs. For example, N > 50, M > 10, T = 24 hours.",
              "Statistical: For each inbound port, calculate a baseline of unique source IPs seen per hour. Alert when the number of unique source IPs probing a specific port exceeds a dynamic threshold, such as the 99th percentile of the historical hourly count for that port, especially if the connection state in Zeek conn.log is 'REJ' or 'RSTO'.",
              "Machine Learning: Implement a time-series forecasting model (e.g., ARIMA) for connection attempts to critical external-facing ports. The model will predict the expected volume of connection attempts. Generate an alert when the actual observed volume significantly exceeds the predicted volume's confidence interval, suggesting an anomalous scanning event."
            ]
          },
          {
            "description": "An internal host exhibits a behavioral sequence of vulnerability research and tool acquisition, such as visiting vulnerability databases, then code repositories, and then downloading and executing potential exploit development tools or scripts.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Developer environments, Web proxies",
            "action": [
              "Symbolic: Create a correlation rule that chains events: 1) A user visits a known vulnerability database (e.g., nvd.nist.gov) based on Zeek http.log `host` field. 2) Within 1 hour, the same user visits a code repository (e.g., github.com). 3) A file download of a script (.py, .ps1) is observed in Zeek files.log. 4) A process creation event (Windows Event ID 4688) shows the execution of an interpreter (python.exe, powershell.exe) with that script. Alert if the user is not in a designated security or developer Active Directory group.",
              "Statistical: Develop a risk score for each user. Increment the score based on statistical anomalies: a) visiting a domain in the top 1% of DNS query rarity; b) downloading a file with a MIME type that is rare for that user's department; c) process command-line length or entropy exceeding 2 standard deviations from the user's baseline. Alert when the cumulative score crosses a predefined threshold.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) to learn normal sequences of user activity (web browsing, file downloads, process execution). Train the model on benign user behavior. Apply the model to real-time event streams to calculate the probability of an observed sequence. Flag user sessions with very low probability sequences as they may represent the distinct pattern of exploit acquisition and preparation."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]