[
  {
    "information_requirement": "Has an adversary registered or hijacked a domain that mimics our organization's identity to support future operations? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.001",
        "name": "Domains",
        "evidence": [
          {
            "description": "Internal host makes a DNS query for or establishes a network connection to a domain present on a high-confidence threat intelligence feed, specifically feeds tracking hijacked domains, known C2 infrastructure, or newly registered domains (NRDs).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise DNS resolvers, Outbound web proxies and firewalls",
            "action": [
              "Symbolic: Correlate the 'query' field from Zeek dns.log and the 'server_name' field (from SNI) in Zeek conn.log against a threat intelligence list of known malicious, hijacked, or newly registered domains. Generate a high-severity alert upon any match.",
              "Statistical: For domains matching NRD feeds, calculate the number of unique internal hosts connecting to the domain within the first 24 hours of its registration. Alert if this count exceeds a statistical baseline (e.g., 95th percentile) for new domain connections in the environment, suggesting coordinated activity.",
              "Machine Learning: Train a classification model (e.g., a Random Forest) on features from threat intelligence feeds (domain age, reputation score, associated malware families) and internal connection data (number of hosts, data volume). Use the model to predict the likelihood that a connection to a feed-matched domain is malicious, filtering out potential false positives from benign services."
            ]
          },
          {
            "description": "A DNS query is observed for a domain that is visually or structurally similar to the organization's or its key partners' domains, but is not on an approved domain allow-list. This includes typosquats, homographs, and combosquats.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise DNS resolvers, Certificate Transparency logs",
            "action": [
              "Symbolic: Maintain an allow-list of company and partner domains. For each domain in Zeek dns.log, check if it's on the list. If not, apply a set of regular expressions to detect common combosquatting patterns (e.g., 'yourcompany-login', 'support-yourcompany'). Alert on any match.",
              "Statistical: For domains not on the allow-list, calculate the Levenshtein distance or another fuzzy string similarity score against the list of legitimate domains. Flag any domain with a distance below a tuned threshold (e.g., distance of 1 or 2) as a potential typosquat. Calculate the character entropy of the queried domain; an unusually high entropy might indicate a homograph attack using non-standard character sets.",
              "Machine Learning: Develop a supervised classification model that uses features like domain length, character frequency, n-gram analysis, Levenshtein distance to known domains, and presence of keywords ('login', 'support', 'mail') to classify queried domains as either 'benign' or 'suspected typosquat'. Continuously score all new, unseen domains and alert on high-probability predictions."
            ]
          },
          {
            "description": "A DNS query is observed for a previously unseen subdomain of a legitimate company-owned domain, and the subdomain's name exhibits random or suspicious characteristics.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing DNS records, Internal DNS resolvers",
            "action": [
              "Symbolic: Maintain an authoritative allow-list of all known, legitimate subdomains for company-owned domains. Ingest all queries from Zeek dns.log and alert immediately when a query is made for a subdomain that is not on this allow-list.",
              "Statistical: For newly observed subdomains (not on the allow-list), calculate the Shannon entropy of the subdomain string (e.g., 'k4f9z1' in 'k4f9z1.yourcompany.com'). Flag subdomains with an entropy score exceeding a baseline (e.g., > 3.5 bits/char), which is indicative of algorithmically generated names rather than human-readable ones.",
              "Machine Learning: Use a time-series analysis model (e.g., ARIMA or Prophet) to forecast the expected volume of queries for new subdomains. A sudden spike in queries for one or more new subdomains that significantly deviates from the forecast constitutes an anomaly, suggesting active use for C2 or data exfiltration."
            ]
          },
          {
            "description": "A DNS response for a company-owned domain resolves to an IP address that is not within the organization's registered and approved IP address space (CIDR blocks).",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, External DNS monitoring services",
            "action": [
              "Symbolic: Maintain an allow-list of all authoritative IP ranges (CIDR blocks) for company-owned domains. For every DNS response ('answers' field) in Zeek dns.log pertaining to these domains, check if the resolved IP address falls within the approved ranges. Alert immediately on any IP address that is outside the allow-list.",
              "Statistical: For each company domain, establish a baseline of its resolved IP addresses and their autonomous system numbers (ASNs). Monitor for changes. A sudden change where a domain resolves to an IP in a new, uncharacteristic ASN (e.g., a residential ISP instead of a major cloud provider) should be flagged, especially if the change is observed from multiple geo-distributed monitoring points.",
              "Machine Learning: Implement a one-class SVM or isolation forest model trained on historical DNS resolution data (resolved IPs, ASNs, TTLs, geo-location) for critical company domains. Use the model to detect anomalous resolutions that deviate significantly from the established 'normal' profile for a given domain, indicating a potential hijack."
            ]
          },
          {
            "description": "An internal host connects to a domain that exhibits multiple suspicious attributes simultaneously, such as a very recently issued SSL certificate, a low DNS Time-To-Live (TTL) value, and being newly observed in the environment.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Outbound web proxies and firewalls, Certificate Transparency logs, Enterprise DNS resolvers",
            "action": [
              "Symbolic: Create a rule that triggers when a domain is observed for the first time AND its SSL certificate (from Zeek ssl.log) was issued within the last 72 hours AND its DNS response TTL (from Zeek dns.log 'ttl' field) is less than 300 seconds. Alert on any domain that meets all three conditions.",
              "Statistical: Develop a risk scoring system. Assign points for suspicious characteristics: +10 for being seen for the first time today, +15 for an SSL certificate age < 3 days, +5 for a TTL < 300s, +5 for a free certificate issuer. Sum the points for each new connection. Alert on domains exceeding a percentile-based threshold (e.g., 99th percentile of risk scores observed over the last 30 days).",
              "Machine Learning: Train a clustering algorithm (e.g., K-Means or DBSCAN) on features of newly observed domains, including certificate age, issuer, TTL value, and entropy of the domain name. Identify clusters that represent 'suspicious' activity (e.g., a dense cluster of domains with low TTL and recent certs). Classify new domains into these clusters in real-time to detect emerging campaigns."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]