[
  {
    "information_requirement": "(PIR) Is an adversary attempting to gather employee names for targeting?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1589.003",
        "name": "Employee Names",
        "evidence": [
          {
            "description": "A single external source IP address exhibits web crawling or scraping behavior against public web pages known to contain employee names (e.g., 'About Us', 'Team' pages), characterized by a high request rate, a user-agent associated with scanning tools, or an origin IP on a threat intelligence list.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web servers, Network perimeter firewalls/gateways, Web Application Firewalls (WAFs)",
            "action": [
              "Join Zeek http.log with conn.log on the 'uid' field. Create a rule to alert when a request to a URI path containing '/about', '/team', or '/contact' has a source IP ('id.orig_h') present in a threat intelligence feed of known malicious IPs or a 'user_agent' string matching common scraping tools (e.g., 'Scrapy', 'HTTrack', 'python-requests').",
              "For traffic to sensitive URIs (e.g., '/team', '/about'), aggregate request counts by source IP ('id.orig_h') over a 1-hour window. Calculate the 95th percentile for this metric across all external source IPs from the last 30 days. Generate an alert when any source IP's request count in a given hour exceeds this established percentile threshold.",
              "Train a time-series forecasting model (e.g., Prophet, ARIMA) on the minute-by-minute request volume to a collection of employee-related web pages. The model should account for weekly and daily seasonality. Generate an alert when the observed request volume exceeds the model's forecasted upper confidence interval for a sustained period (e.g., 5 minutes), indicating an anomalous surge in traffic."
            ]
          },
          {
            "description": "A single source IP generates a high rate of failed authentication attempts (Windows Event ID 4625) against a public-facing application (e.g., ADFS, OWA), using a pattern of usernames that are lexically similar or follow a common naming convention, indicating automated enumeration.",
            "data_sources": [
              "Zeek http.log",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (e.g., ADFS), Public-facing application servers, Web Application Firewalls (WAFs)",
            "action": [
              "Correlate failed login events (Windows Event ID 4625) with web server logs (Zeek http.log) using source IP and timestamp. Create a rule that alerts when a single source IP generates more than 20 failed logins for 10 or more distinct target usernames within a 5-minute window.",
              "For a given source IP, extract all unique target usernames from failed login events (Event ID 4625) within a 1-hour window. Calculate the average Levenshtein distance between sequential usernames; a low average (e.g., < 2) suggests enumeration. Additionally, calculate the Shannon entropy of the character distribution across all attempted usernames from that IP; a low entropy score indicates programmatic generation. Alert if the average distance is below the threshold or entropy is in the bottom 5th percentile.",
              "Implement an isolation forest model on sessionized login data from a single source IP. Features should include: request rate to the login page, count of distinct usernames attempted, ratio of failed to successful logins, and user-agent consistency. The model will identify sessions that are anomalous compared to a baseline of normal, benign login traffic, flagging likely enumeration activity."
            ]
          },
          {
            "description": "Multiple failed login attempts (Windows Event ID 4625) originate from one or a few source IPs, targeting a large number of distinct, valid user accounts over an extended period. This is often followed by a single successful login (Windows Event ID 4624) from the same source IP.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication servers (e.g., ADFS, RADIUS), Cloud identity providers (e.g., Azure AD)",
            "action": [
              "Create a rule that triggers when a successful login (Windows Event ID 4624) occurs for any account, if the source IP of that login was responsible for failed logins (Windows Event ID 4625) against 10 or more other distinct accounts within the preceding 24 hours.",
              "Over a 1-hour rolling window, aggregate Windows Event ID 4625 by source IP. For each IP, count the number of unique target usernames. Establish a baseline for the 99th percentile of unique failed usernames per source IP. Alert when an IP exceeds this threshold, especially if the count of failures per unique username is low (e.g., < 3), which is characteristic of a spray attack.",
              "Use a graph-based clustering algorithm (e.g., Louvain community detection) to establish peer groups based on Active Directory group memberships. Model the baseline rate of failed logins for each peer group. Alert when a statistically significant number of members within a single peer group experience a failed login from a common set of external source IPs within a short time frame (e.g., 1 hour), indicating a targeted attack against a specific department."
            ]
          },
          {
            "description": "A single web session, identified by a common UID in Zeek logs, demonstrates systematic directory traversal, an unusually high request rate, or a high data-to-request ratio, focused on pages known to contain employee directories or information.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web servers, Public API gateways, Web Application Firewalls (WAFs)",
            "action": [
              "Search Zeek http.log for requests where the 'user_agent' field contains substrings like 'Scrapy', 'BeautifulSoup', 'python-requests', 'Go-http-client', or 'HTTrack'. If such a user agent is observed making more than 100 requests in a 10-minute window to a common directory path (e.g., '/people/*'), generate an alert.",
              "For each web session (grouped by 'uid' in Zeek logs), calculate the total number of requests, the total response body bytes ('resp_body_len'), and the entropy of the requested URI paths. Establish a 98th percentile baseline for each of these metrics from the last 30 days of traffic. Alert on sessions that exceed the percentile for at least two of these three metrics simultaneously.",
              "Train a Random Forest or Gradient Boosting classifier to distinguish between 'human', 'benign bot' (e.g., Googlebot), and 'malicious scraper' sessions. Use session-level features from Zeek logs, such as: standard deviation of time between requests, ratio of POST to GET requests, average URI depth, user-agent string, and presence of a 'Referer' header. Apply the trained model to classify all new sessions from external IPs."
            ]
          },
          {
            "description": "A user account, authenticated from an internal IP address, accesses an unusually high number of distinct employee records or profiles from internal repositories (e.g., intranet, HR systems, file shares) in a manner inconsistent with their established behavioral baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 4663",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal SharePoint/intranet sites, Human Resources application servers, File servers hosting employee records, Domain Controllers",
            "action": [
              "Define a 'watchlist' of sensitive network file shares and SharePoint sites containing employee PII (e.g., '\\\\server\\hr\\personnel_files', 'intranet.corp.com/directory'). Enable object access auditing (for Event ID 4663). Create a rule to alert when any user account not in the 'HR_Users' or 'Senior_Management' Active Directory groups generates an access event for any resource on this watchlist.",
              "For each user, establish a daily baseline of unique internal resources accessed, calculated over the past 30 days. Use a 3-sigma (standard deviation) or 99th percentile threshold on this count. Generate an alert when a user's daily access count to employee data repositories (identified by URI patterns or file paths) exceeds their personal threshold.",
              "Employ a UEBA system or build a model using an autoencoder. For each user, create a feature vector representing a 1-hour window of activity, including: logon count (Event ID 4624), count of file accesses (Event ID 4663), and volume of network traffic (Zeek conn.log 'orig_bytes'). The autoencoder learns to reconstruct 'normal' feature vectors with low error. An alert is generated when the reconstruction error for a user's activity window is anomalously high."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]