[
  {
    "information_requirement": "Is the adversary acquiring information about vulnerabilities to support targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588.006",
        "name": "Vulnerabilities",
        "evidence": [
          {
            "description": "A connection attempt from an external IP address that is present on a high-confidence threat intelligence feed of known malicious scanners or command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring internet gateway traffic; SIEM platform hosting threat intelligence feeds.",
            "action": [
              "Symbolic: Join inbound `Zeek conn.log` records with a high-confidence threat intelligence list of known scanners or C2 infrastructure on the `id.orig_h` (source IP) field. Generate an alert for any match, excluding IPs on an approved allow-list of known benign scanners.",
              "Statistical: For any IP that triggers the symbolic rule, query `Zeek conn.log` for that source IP's activity over the last 24 hours. Calculate the Shannon entropy of the `id.resp_p` (destination port) field. Prioritize alerts where the entropy score is high (e.g., > 3.5), indicating broad, non-specific port scanning.",
              "Machine Learning: Train a logistic regression classifier using features from `Zeek conn.log` (e.g., protocol, duration, orig_bytes, resp_bytes) and IP-based features (e.g., ASN, country). The model should be trained on historical data labeled with threat intelligence. Use the model to score new inbound connections from unknown IPs to predict the probability of maliciousness, flagging those above a high-confidence threshold (e.g., > 0.9)."
            ]
          },
          {
            "description": "An inbound HTTP request from an external source contains a User-Agent, URI path, or request body payload matching a known signature for a vulnerability scanner (e.g., Nmap, Nikto) or a specific vulnerability probe (e.g., JNDI strings for Log4Shell).",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web-facing application servers; Reverse proxies and load balancers where network traffic is inspected.",
            "action": [
              "Symbolic: Apply a ruleset of regular expressions against the `user_agent`, `uri`, and `post_body` fields of `Zeek http.log` data. The regex patterns must match known scanner User-Agents (e.g., (?i)nmap|nikto|acunetix), directory traversal (`../`), and vulnerability probes (`jndi:ldap`). Generate an alert on any match from an external source IP (`id.orig_h`).",
              "Statistical: For each external source IP (`id.orig_h`) in `Zeek http.log`, calculate the ratio of HTTP requests with a 4xx status code to the total request count over a 1-hour window. Establish a baseline 95th percentile for this ratio across all external IPs. Generate an alert for any IP exceeding this percentile, indicating likely forceful browsing or endpoint scanning.",
              "Machine Learning: Implement a character-level Convolutional Neural Network (CNN) or a pre-trained NLP model to classify the `uri` field (including query parameters) from `Zeek http.log` as benign or malicious. This model can identify novel or obfuscated scanning and injection patterns that regex-based signatures may miss. Alert on URIs classified as malicious with high confidence."
            ]
          },
          {
            "description": "A single external source IP address establishes connections to an anomalously high number of unique destination hosts (horizontal scan) or unique destination ports on a single host (vertical scan) within a defined time window.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring DMZ and internet gateway traffic; SIEM platform used for data aggregation and analysis.",
            "action": [
              "Symbolic/Threshold: Create a rule that, for each external source IP (`id.orig_h`), counts the unique destination ports (`id.resp_p`) on a single host and unique destination hosts (`id.resp_h`) across the network within a 5-minute window. Generate an alert if the port count exceeds a threshold (e.g., > 25 ports for a vertical scan) or the host count exceeds a threshold (e.g., > 50 hosts for a horizontal scan).",
              "Statistical: Using `Zeek conn.log` data aggregated over 15-minute windows, calculate the count of distinct destination hosts and distinct destination ports for each source IP. Establish a baseline distribution for these counts across all external traffic. Flag any source IP where either count exceeds 3 standard deviations from the hourly mean or is above the 99th percentile, indicating anomalous scanning behavior.",
              "Machine Learning: Apply a density-based clustering algorithm like DBSCAN to a dataset of `(source_ip, destination_ip, destination_port)` tuples from `Zeek conn.log` over a 30-minute window. Legitimate traffic will form dense clusters. Identify scanning activity by flagging source IPs that are classified as noise points or belong to sparse, low-density clusters."
            ]
          },
          {
            "description": "A sudden, anomalous increase in connection attempts from a geographically or logically diverse set of external IP addresses, all targeting the same destination port, especially if the timing correlates with a recent public vulnerability disclosure for that service.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors monitoring internet-facing services (web, email, VPN); SIEM platform for time-series analysis and correlation with vulnerability intelligence.",
            "action": [
              "Symbolic: Correlate a vulnerability intelligence feed (e.g., CISA KEV catalog) with network traffic. When a new vulnerability is announced for a specific service/port, create a time-bound rule to alert on any connection attempts to that port from source IPs not seen in the previous 30 days.",
              "Statistical: For each critical internet-facing service port, create a time series of the unique source IP count per hour from `Zeek conn.log`. Calculate a 24-hour moving average and standard deviation. Generate an alert when the current hourly count of unique source IPs exceeds the moving average by more than 4 standard deviations, indicating a potential distributed scan.",
              "Machine Learning: For each critical service port, employ a time series anomaly detection model (e.g., Seasonal-ARIMA or Prophet) trained on historical unique source IP counts. Generate an alert when the observed traffic volume significantly deviates from the model's forecast, indicating an anomalous event potentially related to mass exploitation."
            ]
          },
          {
            "description": "A process associated with network scanning (e.g., nmap.exe, masscan.exe) or reconnaissance scripting (e.g., powershell.exe with Test-NetConnection) is created on a non-administrative endpoint, immediately followed by network connections from that host to an anomalously high number of internal IP addresses or ports.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Detection and Response (EDR) agents on workstations and servers; Network sensors monitoring internal (east-west) traffic segments; Domain Controllers.",
            "action": [
              "Symbolic: Create a rule that triggers when a process creation event (Windows Event ID 4688) with a `NewProcessName` from a watchlist of scanning tools (e.g., `nmap.exe`, `masscan.exe`, `Advanced_IP_Scanner.exe`) is observed on a host not belonging to an IT/Security asset group. Correlate with PowerShell logs (Event ID 4104) for reconnaissance cmdlet usage.",
              "Statistical: For each internal host, establish a daily baseline of unique internal destination IPs and ports contacted using `Zeek conn.log`. Use the Interquartile Range (IQR) method to define normal behavior for each host. Generate an alert when a host's connection count in a 1-hour window exceeds its upper fence (Q3 + 1.5 * IQR), indicating potential internal network scanning.",
              "Machine Learning: Model the internal network as a host communication graph using `Zeek conn.log` data. Use a graph-based anomaly detection algorithm to assign a rarity score to each new connection (edge). An adversary performing internal reconnaissance will create unusual, high-scoring edges (e.g., a marketing workstation connecting to database administration ports) that deviate from the learned baseline communication patterns."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]