[
  {
    "information_requirement": "Has an adversary registered or hijacked a domain that mimics our organization's identity to support future operations? (PIR)",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.001",
        "name": "Domains",
        "evidence": [
          {
            "description": "An internal host queries or connects to a domain listed on a threat intelligence feed of hijacked, command and control (C2), or newly registered domains (NRDs).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise DNS resolvers, Outbound web proxies and firewalls, Endpoint devices",
            "action": [
              "Continuously ingest threat intelligence feeds for hijacked, C2, and NRDs into a master blocklist. Join the Zeek dns.log 'query' field and the Zeek conn.log 'server_name' (from SNI) field against this list. Trigger a high-severity alert on any match.",
              "For any domain matching an NRD feed, query logs for the first 24 hours of the domain's registration date. Count the unique internal source IPs connecting to it. If the count of unique hosts exceeds the 95th percentile of unique connections observed for other NRDs in the last 90 days, flag as potentially coordinated activity.",
              "Train a Random Forest classifier using features including domain age, threat feed source, internal connection count, total bytes transferred (in/out), and connection duration. Train the model on historical true and false positives from threat intelligence alerts. Apply the model to new threat intel matches to generate a 'maliciousness probability' score, allowing analysts to prioritize high-score alerts."
            ]
          },
          {
            "description": "A DNS query is observed for a domain that is visually or structurally similar to the organization's or its key partners' domains, but is not on an approved domain allow-list. This includes typosquats, homographs, and combosquats.",
            "data_sources": [
              "Zeek dns.log",
              "Certificate Transparency Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise DNS resolvers, Certificate Transparency log aggregators",
            "action": [
              "Generate and maintain an allow-list of all organizational and key partner domains. For every DNS query in Zeek dns.log not on this list, apply a library of regular expression patterns to detect common combosquatting keywords (e.g., 'yourcompany-login', 'support-yourcompany', 'hr-yourcompany'). Alert on any pattern match.",
              "For all domains not on the allow-list, calculate the Damerau-Levenshtein distance to the nearest domain on the allow-list. Flag any domain with a distance of 1 or 2 as a potential typosquat. Additionally, calculate the Shannon entropy of the domain label; if the entropy is unusually high and contains Punycode prefixes ('xn--'), flag as a potential homograph attack.",
              "Train a supervised classification model (e.g., Logistic Regression) on a labeled dataset of legitimate and known typosquatted domains. Use features such as n-gram frequency, character distribution, vowel-to-consonant ratio, Damerau-Levenshtein distance to the allow-list, and the presence of keywords ('login', 'support', 'mail'). Score all newly observed, non-allow-listed domains in real-time and alert on high-probability predictions."
            ]
          },
          {
            "description": "A DNS query is observed for a previously unseen subdomain of a legitimate company-owned domain, and the subdomain's name exhibits random or suspicious characteristics, suggesting domain shadowing.",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 22"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing DNS records, Internal DNS resolvers, Endpoint devices",
            "action": [
              "Create and maintain an authoritative inventory of all legitimate subdomains for all company-owned domains. Ingest Zeek dns.log and Windows Event ID 22 (DNS Query Response). Generate a medium-severity alert for any query to a company-owned domain where the requested subdomain is not in the inventory.",
              "For any query to a non-inventoried subdomain, calculate the Shannon entropy of the subdomain label (e.g., the 'k4f9z1' in 'k4f9z1.yourcompany.com'). Compare this score against a pre-calculated distribution of entropy scores from all legitimate subdomains. Alert if the score exceeds the 98th percentile of the legitimate distribution, indicating a high degree of randomness typical of DGAs used in domain shadowing.",
              "Model the rate of new (previously unseen) subdomain discovery per hour using a time-series forecasting model (e.g., SARIMA). If the observed count of new subdomains discovered in a given hour exceeds the model's 99% prediction interval, flag it as an anomalous event potentially indicative of domain shadowing infrastructure being activated or used."
            ]
          },
          {
            "description": "A DNS response for a company-owned domain resolves to an IP address that is not within the organization's registered and approved IP address space (CIDR blocks), indicating a potential hijack.",
            "data_sources": [
              "Zeek dns.log",
              "External DNS Monitoring Service Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, External DNS monitoring services (e.g., distributed probes)",
            "action": [
              "Maintain an allow-list of all authoritative IP ranges (CIDRs) and specific IPs for all company-owned domains. For every DNS response in Zeek dns.log related to these domains, check if the IP in the 'answers' field is on the allow-list. Trigger a critical-severity alert for any resolution to an unauthorized IP.",
              "For each critical company domain, create a baseline profile of its historical resolved IPs, their corresponding Autonomous System Numbers (ASNs), and countries. Periodically query external DNS monitoring services for current resolutions. Flag any change where the new IP's ASN or country has never been associated with that domain, suggesting an unauthorized routing or DNS change.",
              "Train an anomaly detection model (e.g., Isolation Forest) on historical DNS resolution data for critical domains. Features should include the resolved IP (as a numerical representation), ASN, country code, and TTL value. Continuously feed live internal and external resolution data into the model. An 'anomaly' score exceeding a tuned threshold indicates a resolution that deviates significantly from the established norm and could represent a hijack."
            ]
          },
          {
            "description": "An internal host connects to a domain that exhibits multiple suspicious attributes simultaneously, such as a very recently issued SSL certificate, a low DNS Time-To-Live (TTL) value, and being newly observed in the environment.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Outbound web proxies and firewalls, Certificate Transparency logs, Enterprise DNS resolvers",
            "action": [
              "Implement a SIEM correlation rule that joins data across logs. For a given connection, trigger an alert if: 1) The destination domain is not in a cache of domains seen in the last 30 days, AND 2) The SSL certificate 'not_valid_before' timestamp from Zeek x509.log is less than 72 hours old, AND 3) The DNS TTL from Zeek dns.log is less than 300 seconds.",
              "For each new external connection, calculate a risk score based on a weighted sum of suspicious attributes. Example weights: Domain not seen in 30 days (+10), SSL certificate age < 24h (+20), free certificate issuer (e.g., Let's Encrypt) (+5), DNS TTL < 300s (+5), high entropy domain name (+15). Sum the scores and alert on any connection whose total score exceeds the 99th percentile of all connection risk scores calculated in the past 30 days.",
              "Using Zeek log data, featurize all newly observed domains with attributes like TTL, certificate age, certificate issuer, domain name entropy, and top-level domain (TLD). Use an unsupervised clustering algorithm like DBSCAN to group these domains. Manually investigate and label the resulting clusters (e.g., 'benign-new-saas', 'suspicious-low-ttl-dga'). New domains can then be assigned to the nearest cluster, and an alert is generated if it falls into a 'suspicious' cluster."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]