[
  {
    "information_requirement": "Is the adversary developing resources using cloud accounts?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1585.003",
        "name": "Cloud Accounts",
        "evidence": [
          {
            "description": "An internal host, identified by its source IP address, performs a DNS query for a domain associated with a disposable email service, immediately followed within a 5-minute window by an HTTP/S connection to a known cloud provider's account creation or sign-up page.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points and internal DNS resolvers.",
            "action": [
              "Create and maintain watchlists of disposable email service domains and cloud provider account creation URLs. Write a SIEM rule that joins Zeek dns.log and ssl.log/http.log on the source IP. Trigger an alert when a host resolves a domain from the disposable email list and then connects to a URL/SNI from the cloud creation list within a 5-minute window.",
              "For each source IP, calculate the baseline frequency of DNS queries to disposable email domains over a 30-day period. On a daily basis, calculate the entropy of destination domains (from Zeek ssl.log or http.log) that are visited within 5 minutes of a disposable email domain query. Alert when a low-entropy event is detected (e.g., entropy below a dynamically calculated threshold), suggesting multiple hosts are performing the same scripted sign-up sequence.",
              "Develop a sequence analysis model (e.g., a Hidden Markov Model or LSTM) trained on benign user web browsing sequences (DNS queries, SNI names, HTTP URLs). Feed real-time event sequences into the model. Trigger an alert if the model assigns a low probability to an observed sequence involving a disposable email provider domain followed by a cloud provider sign-up domain, indicating a significant deviation from normal user behavior."
            ]
          },
          {
            "description": "An HTTP/S request containing a programmatic User-Agent string (e.g., 'Terraform/', 'Boto3', 'Go-http-client', 'aws-sdk-') and directed to a cloud provider's API endpoint originates from a source IP address not on an established allowlist of authorized infrastructure-as-code or administrative systems.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoint subnets, server subnets, and cloud management system enclaves.",
            "action": [
              "Maintain an asset inventory of authorized infrastructure management servers and a watchlist of programmatic User-Agent strings. Create a SIEM rule to alert on any HTTP request in Zeek http.log that contains a programmatic User-Agent and originates from an IP address not in the authorized server inventory.",
              "For each host, profile the set of User-Agent strings used over a 30-day baseline. Alert when a host that is not on the authorized list uses a programmatic User-Agent for the first time. Additionally, calculate the population-wide rarity of each User-Agent string; flag any non-admin host using a User-Agent that falls below the 1st percentile of usage frequency across the enterprise.",
              "Train a one-class Support Vector Machine (SVM) or Isolation Forest model on features from legitimate cloud administrative traffic (e.g., source IP subnet, User-Agent, destination API endpoint, time of day, request method). Apply the model to all internal traffic destined for cloud APIs. Flag any traffic classified as an outlier for investigation."
            ]
          },
          {
            "description": "An internal host, whose source IP is not part of the defined 'Cloud Administrators' asset group, generates network traffic to domains or specific URIs associated with cloud provider account management, billing dashboards, or IAM configuration pages.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoint subnets, corporate network egress points, and VPN concentrators.",
            "action": [
              "Maintain a watchlist of URIs and domains related to cloud account management (e.g., 'console.aws.amazon.com/billing', 'portal.azure.com/#create', 'myaccount.google.com'). Create a SIEM rule to alert on any connection to these resources (from Zeek dns.log, ssl.log, or http.log) from hosts not in the authorized 'Cloud Administrators' asset group.",
              "For each non-administrative host, calculate the daily count of connections to cloud management domains. Establish a 30-day baseline for each host and its peer group (e.g., 'Sales' department). Alert if a host's daily connection count exceeds the 98th percentile of its historical baseline or 3 standard deviations above its peer group's average.",
              "Apply a clustering algorithm (e.g., DBSCAN) to sessionized web traffic data for all hosts connecting to cloud management domains. Use features like session duration (from Zeek conn.log), number of unique URIs visited (from http.log), and total bytes transferred. Identify and flag sessions that are classified as noise/outliers or form new, small clusters, as they deviate from established patterns of legitimate administrative activity."
            ]
          },
          {
            "description": "A single internal source IP address is observed making DNS queries or direct connections to the account management or API domains of three or more unique cloud service providers (e.g., AWS, Azure, GCP, DigitalOcean, Linode) within a 60-minute rolling window.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, internal DNS resolvers, and VPN user subnets.",
            "action": [
              "Create and maintain lists of domains and IP ranges for major cloud providers. Create a SIEM rule that counts the number of distinct cloud providers a single source IP connects to within a 1-hour window, based on Zeek dns.log and ssl.log records. Trigger an alert if the count is greater than or equal to 3.",
              "For each host, calculate a daily baseline of the number of distinct cloud providers contacted. Alert if the number of distinct providers contacted in an hour exceeds the 99th percentile of that host's daily baseline values, or if it exceeds the 99th percentile for the host's assigned user group (e.g., 'Developers', 'Sales').",
              "Develop and apply a supervised classification model (e.g., Random Forest) trained on labeled examples of legitimate and suspicious multi-cloud activity. Extract features such as the set of providers contacted, time between connections, ratio of marketing pages vs. API/console endpoints visited, and total data transferred. Flag any sequence of connections that the model classifies with high confidence as 'suspicious cloud shopping'."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]