[
  {
    "information_requirement": "Is the adversary developing resources by compromising third-party network devices for use in targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.008",
        "name": "Network Devices",
        "evidence": [
          {
            "description": "An outbound or inbound network connection is observed in network flow data where either the source or destination IP address matches an entry on a high-confidence threat intelligence feed categorized as 'compromised router', 'botnet C2', or 'malicious proxy'.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Firewall Logs, Network Taps, Perimeter DNS Servers, Endpoint Network Telemetry",
            "action": [
              "1. Ingest high-confidence threat intelligence feeds for compromised network devices (e.g., routers, IoT), botnet C2s, and anonymous proxies into the SIEM. Tag entries with their specific category.",
              "2. Create a detection rule that continuously joins network flow logs (e.g., Zeek conn.log) against this threat intelligence list. Trigger a high-severity alert for any connection where an internal IP communicates with a matched external IP, or a matched external IP communicates with an internal IP. Include the threat feed name and category in the alert.",
              "3. For any alert generated, enrich it by calculating the percentile rank of the connection's duration (`duration`) and total bytes (`orig_bytes` + `resp_bytes`) against a 30-day rolling baseline for the specific internal host's external connections. Escalate the alert's priority if both metrics exceed the 95th percentile.",
              "4. Aggregate network traffic volume (total bytes) per hour to threat intelligence categories (e.g., 'botnet', 'proxy'). Train a time-series forecasting model (e.g., ARIMA or Prophet) on this data. Generate a high-severity anomaly alert when the observed traffic volume for any category exceeds the upper bound of the model's 99% confidence interval."
            ]
          },
          {
            "description": "An outbound network connection from an internal host to an external IP address demonstrates multiple low-prevalence indicators simultaneously. These include a JA3/S hash, HTTP User-Agent, or TLS Server Name (SNI) that matches known IOCs for malware families known to infect SOHO routers and other network devices.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, DNS Resolvers, Endpoint EDR Logs, Web Proxies",
            "action": [
              "1. Maintain and ingest lists of known malicious indicators associated with network device malware, including JA3/JA3S hashes, TLS SNI values, and HTTP User-Agent strings. Create a detection rule to search outbound traffic logs (Zeek `ssl.log`, `http.log`) for exact matches against these indicator lists. Generate a medium-severity alert upon any match.",
              "2. For each internal host, calculate the Shannon entropy of its outbound JA3S hashes (from `ssl.log`) and User-Agent strings (from `http.log`) over a rolling 24-hour window. Establish a per-host baseline entropy score. Trigger an alert when a host's entropy for either JA3S or User-Agents drops below the 5th percentile of its own historical baseline.",
              "3. Employ a trained classification model (e.g., Random Forest) that uses features extracted from Zeek logs (JA3S, SNI, User-Agent, connection duration, byte counts, periodicity) to assign a 'maliciousness' score to each outbound connection. Generate an alert for any connection that receives a score greater than a predefined threshold (e.g., 0.9), and enrich the alert with the top contributing features."
            ]
          },
          {
            "description": "An internal host establishes a long-running or periodic (beaconing) connection to an external IP address within an Autonomous System Number (ASN) registered to a residential or mobile Internet Service Provider. The traffic pattern is highly regular, characterized by a low standard deviation in both the time interval between connections and the volume of data transferred per connection.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, VPN Concentrators, Core Switches, Egress points of the network",
            "action": [
              "1. Enrich all network flow logs (Zeek `conn.log`) with IP geolocation and ASN information, specifically flagging ASNs belonging to residential ISPs. Create a detection rule that triggers when a single internal host maintains a connection or series of connections to a single IP in a residential ASN on a non-standard port for a cumulative duration exceeding one hour in a 24-hour period.",
              "2. For each internal-source-to-external-destination communication pair where the destination is in a residential ASN, group connections into 1-hour windows. Calculate the standard deviation of the time delta between consecutive connection start times and the standard deviation of the originated payload size (`orig_bytes`). Generate an alert if both standard deviation values fall below a low threshold (e.g., less than 2 seconds for time and less than 10 bytes for size).",
              "3. For each internal host, create a time series of connection events to residential ASNs. Use an unsupervised anomaly detection algorithm (e.g., Isolation Forest) on features like connection frequency, duration, and byte counts. Trigger an alert when the algorithm identifies an anomalous cluster of activity that deviates from the host's normal traffic patterns to residential IPs, such as a sudden shift to a highly periodic 'heartbeat' pattern."
            ]
          },
          {
            "description": "A single external IP address, belonging to a residential ISP ASN, initiates connections to an unusually high number of distinct internal hosts or ports within a short time window (e.g., 5 minutes). This scanning activity may be followed by subsequent connections containing exploit signatures.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek scan.log",
              "Zeek http.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DMZ, Internet-facing Web Servers, External Firewall, Intrusion Detection/Prevention Systems (IDS/IPS)",
            "action": [
              "1. Create a detection rule that triggers when an external IP address appears in `notice.log` or `scan.log` with a `scan` notification. Correlate this IP address with other logs (e.g., `http.log`) within the next 15 minutes. Escalate to a high-severity alert if the same IP is observed attempting to access URIs or execute functions matching known exploit patterns.",
              "2. In a rolling 5-minute window, calculate two metrics for each external source IP: the count of distinct internal destination IPs and the count of distinct destination ports. Establish a baseline for these counts across all inbound traffic. Generate an alert for any external IP where both counts exceed the 99.9th percentile of their respective baselines.",
              "3. Ingest connection events into a stream processing engine. Use a density-based clustering algorithm (e.g., DBSCAN) on a feature set of [source_ip, destination_ip, destination_port, timestamp]. Generate an alert when a cluster is identified where a single source IP connects to a large number of destination IPs/ports in a short time frame, which the algorithm will identify as a dense cluster."
            ]
          },
          {
            "description": "A mismatch is observed where an internal host resolves multiple, distinct FQDNs via DNS, but the subsequent HTTP/TLS traffic, identified by the HTTP Host header or TLS SNI, is consistently directed to a single, different IP address. This IP address is often in a residential ASN and does not match any of the resolved IPs from the DNS queries, indicating traffic is being proxied.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Internet Gateway, Endpoint Network Logs, Core Network Taps",
            "action": [
              "1. For each internal host, correlate DNS logs (`dns.log`) with subsequent connection logs (`ssl.log`, `http.log`) within a 2-minute window. Create a rule to identify when the destination IP in `conn.log` does not match any of the IPs returned in the preceding `dns.log` response for the same domain name (found in `ssl.log` SNI or `http.log` Host header). Generate a medium-severity alert if this mismatch occurs and the destination IP belongs to a residential ASN.",
              "2. For each internal host, calculate a 'Traffic Funneling Ratio' over a rolling 1-hour window. The ratio is defined as $$ R = \\frac{\\text{count(distinct destination IPs)}}{\\text{count(distinct FQDNs resolved)}} $$. Establish a historical baseline for this ratio for each host. Trigger an alert when a host's ratio $$ R $$ drops significantly, for example, below the 5th percentile of its own baseline.",
              "3. Construct a bipartite graph where nodes represent internal hosts and external FQDNs. Use a community detection algorithm (e.g., Louvain Modularity) to find groups of hosts and domains that interact. For each community, check if the actual destination IPs are concentrated on a single or small number of 'hub' IPs not directly associated with the domains. Trigger an alert when a community's traffic is funneled through an anomalous external hub IP, especially one in a residential ASN."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]