[
  {
    "information_requirement": "Is the adversary leveraging botnet infrastructure for operations targeting our organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.005",
        "name": "Botnet",
        "evidence": [
          {
            "description": "Inbound or outbound network connections are made to or from IP addresses, domains, or other network indicators that are present on high-confidence threat intelligence feeds of known botnet command and control (C2) infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, firewall and proxy logs, DNS servers",
            "action": "Symbolic: Continuously correlate source IPs of all inbound traffic and destination IPs/domains of all outbound traffic from Zeek conn.log and dns.log against subscribed CTI feeds for known botnet C2s. Generate a high-severity alert on any match. Statistical: For IPs not on a blocklist but present in reputation feeds, calculate a risk score. Alert if an internal host's cumulative risk score for outbound connections exceeds the 95th percentile of all internal host scores over a 24-hour period. Machine Learning: Train a classification model (e.g., Random Forest) using features from CTI feeds (e.g., IP reputation, ASN, country, domain age) to predict the likelihood that a new, unseen IP/domain is part of a botnet. Run all outbound connections through this model for real-time scoring and alert on high-probability results."
          },
          {
            "description": "Observed network traffic contains artifacts specific to known botnet malware families, such as unique HTTP User-Agent strings, specific SSL/TLS fingerprints (JA3/JARM), or protocol-specific command structures.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, web proxies, SSL/TLS inspection appliances",
            "action": "Symbolic: Create and maintain a watchlist of User-Agent strings, JA3/JA3S hashes, and JARM fingerprints associated with known botnet families (e.g., Qakbot, IcedID). Scan Zeek http.log and ssl.log for exact matches and alert immediately. Statistical: For every JA3 hash and User-Agent string observed, calculate its prevalence (rarity) across the enterprise over the last 30 days. Alert on connections using a JA3 or User-Agent that falls below a 1% prevalence threshold (i.e., is seen on less than 1% of hosts). Machine Learning: Use an anomaly detection algorithm (e.g., Isolation Forest) on features extracted from Zeek ssl.log (e.g., JA3 hash, cipher suites, certificate details, JARM) and http.log (User-Agent, request method, URI length) to identify connections that are outliers from established baseline traffic patterns."
          },
          {
            "description": "A sudden, high-volume spike in inbound connections from a large and diverse set of external IP addresses, targeting one or more internal services, indicative of a Distributed Denial of Service (DDoS) attack or coordinated reconnaissance.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, internet-facing application servers, public DNS servers, VPN concentrators",
            "action": "Symbolic: Monitor Zeek conn.log for a high rate of connections with a conn_state of 'S0' (connection attempt seen, no reply) or 'REJ' (connection rejected). Alert if connection attempts from many sources to a single destination exceed a predefined hard threshold (e.g., 10,000 connection attempts in 1 minute). Statistical: Calculate the Shannon entropy of source IP addresses connecting to any single destination host/port pair in a 5-minute window. A sharp increase in entropy compared to a 24-hour rolling average suggests a distributed attack. Alert if the entropy value exceeds 3 standard deviations from the mean. Machine Learning: Employ a time-series forecasting model (e.g., ARIMA) on key metrics like total inbound connection counts and unique source IPs per minute. Alert when the observed values significantly deviate from the forecasted values, indicating a volumetric anomaly consistent with a DDoS attack."
          },
          {
            "description": "An internal host initiates an anomalously high number of outbound connections to unique external destinations, or exhibits DNS query patterns indicative of domain generation algorithms (DGA), suggesting it is a bot performing scanning or C2 discovery.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations and servers), Domain Controllers, network egress points",
            "action": "Symbolic: Create a rule to detect if a single internal host connects to more than 500 unique external destination IPs on a common botnet port (e.g., 6667/IRC) within one hour, based on Zeek conn.log. Correlate the timestamp and host IP with Windows Event ID 4688 and 5156 to identify the responsible process. Statistical: For each internal host, calculate the number of unique destination IPs connected to per hour. Alert if a host's activity exceeds the 99th percentile of its own historical baseline. Additionally, calculate the Shannon entropy of second-level domains in DNS queries per host; a high entropy value exceeding a dynamically calculated baseline suggests DGA activity. Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on host network behavior features (e.g., total connections, unique destinations, bytes out, connection frequency). Hosts that do not fit into the large 'normal' cluster are flagged as anomalous and warrant investigation as potential bots."
          },
          {
            "description": "An internal host establishes outbound connections to a single external destination with highly regular time intervals and consistent data packet sizes, which is a strong indicator of C2 beaconing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, endpoint devices (workstations, servers)",
            "action": "Symbolic: Match outbound Zeek conn.log events against a threat intelligence list of known C2 servers. Additionally, search for connections where the protocol identified by Zeek (e.g., SSH) is on a non-standard port (e.g., SSH over port 443). Statistical: For each source-destination IP pair, extract the time delta between consecutive connections. Calculate the standard deviation of these time deltas over a 24-hour period. A standard deviation less than 1 second for a series of 10 or more connections indicates highly periodic, machine-generated beaconing. Machine Learning: Apply a Fast Fourier Transform (FFT) to the time series of connection events for each host-destination pair. A strong peak in the frequency domain indicates a dominant periodic signal characteristic of C2 beaconing, which is effective at finding beacons even with moderate network jitter. Alert on the presence of a strong periodic signal."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]