[
  {
    "information_requirement": "Is an adversary acquiring or using malicious domains to support operations against our organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.001",
        "name": "Domains",
        "evidence": [
          {
            "description": "An internal host initiates a DNS query for or a network connection to a domain present on a high-confidence threat intelligence feed of known malicious domains (e.g., C2, phishing, malware distribution).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Egress Web Proxies, Firewall Egress Logs",
            "action": [
              "Symbolic Logic: Continuously ingest threat intelligence feeds of malicious domains. Create a detection rule to generate a high-severity alert when a domain in the Zeek dns.log 'query' field or Zeek conn.log 'id.resp_h' field matches an indicator from the feed.",
              "Statistical Method: For domains matching the threat feed, analyze the frequency of communication from internal hosts over a 24-hour period. A single host communicating with multiple distinct malicious domains from the same feed within a short timeframe (e.g., > 3 domains in 5 minutes) should elevate the alert priority.",
              "Machine Learning: Use a time-series anomaly detection model on the volume of threat intelligence matches per hour. A sudden spike exceeding a learned threshold (e.g., 3 standard deviations above the rolling 24-hour average) can indicate a widespread campaign or a significant internal compromise that requires immediate investigation."
            ]
          },
          {
            "description": "An internal host resolves a domain that is algorithmically determined to be a typosquat or homograph variant of the organization's domains, partner domains, or popular web services. The domain may also be newly registered (e.g., within the last 90 days).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS Resolvers, Mail Gateway Logs, Egress Web Proxies",
            "action": [
              "Symbolic Logic: Maintain a pre-computed list of high-probability typosquatted and homograph variations of corporate domains. Create a detection rule to alert when a DNS query in Zeek dns.log matches an entry on this list.",
              "Statistical Method: For each domain in Zeek dns.log, calculate the Levenshtein distance against a list of corporate and partner domains. Flag any domain with a distance of 1 or 2 for review. Additionally, analyze the character set; the presence of non-ASCII characters in a domain designed to look like a standard corporate domain is highly suspicious.",
              "Machine Learning: Train a classification model (e.g., logistic regression) using features such as Levenshtein distance, Jaccard similarity, domain length, TLD popularity, and the presence of homoglyph characters. Use this model to score all resolved domains and alert on those classified as highly likely to be malicious typosquats."
            ]
          },
          {
            "description": "An internal host communicates with a domain that was registered within the last 30 days and/or uses a TLS certificate issued by a free or frequently abused Certificate Authority and has a short validity period (e.g., 90 days).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress Web Proxies, Corporate DNS Resolvers, Certificate Transparency Log Feeds",
            "action": [
              "Symbolic Logic: Create a detection rule that alerts when a connection is made to a domain that was both registered in the last 30 days (via passive DNS enrichment) AND uses a TLS certificate from a specified list of free or commonly abused CAs (e.g., Let's Encrypt) as seen in Zeek ssl.log.",
              "Statistical Method: For all domains accessed, calculate a risk score. Assign points for suspicious attributes: +10 for registration age < 30 days, +5 for WHOIS privacy, +5 for using a free TLS CA. Sum the points for each domain and alert on any domain exceeding a threshold (e.g., 15). Analyze the distribution of ASN reputations for accessed domains; connections to ASNs in the bottom 10th percentile of reputation scores should be flagged.",
              "Machine Learning: Develop a reputation scoring system for domains using a clustering algorithm (e.g., K-Means) on features enriched from passive DNS and WHOIS data, such as domain age, registrar, ASN, TLD, and associated SSL certificate attributes. Classify clusters as 'benign', 'suspicious', or 'malicious' based on known indicators. Alert when an internal host connects to a domain falling into a 'suspicious' or 'malicious' cluster."
            ]
          },
          {
            "description": "An internal host generates a statistically significant number of DNS queries that result in an NXDOMAIN response, where the queried domains exhibit high character entropy and are followed by a successful connection to a non-categorized or newly registered domain.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Processes, Corporate DNS Resolvers, Endpoint DNS Cache",
            "action": [
              "Symbolic Logic: Create a detection rule that triggers when a single source IP generates more than 20 NXDOMAIN responses within a 1-minute window from Zeek dns.log, and the process responsible (from Windows Event ID 4688) is not a known browser or trusted application.",
              "Statistical Method: For each source IP, calculate the ratio of NXDOMAIN responses to total DNS queries over a 5-minute window. Alert when this ratio exceeds a dynamic threshold (e.g., the 99th percentile of the host's historical baseline). Additionally, calculate the Shannon entropy of the second-level domain for all NXDOMAIN queries per host; an average entropy score significantly higher than the network-wide baseline indicates likely DGA.",
              "Machine Learning: Train a recurrent neural network (RNN) or Long Short-Term Memory (LSTM) model to distinguish between legitimate and algorithmically generated domain names based on their character sequences. Apply this model in near-real-time to all domains in Zeek dns.log that result in an NXDOMAIN. A high probability score for DGA from the model should trigger an alert for host investigation."
            ]
          },
          {
            "description": "A successful connection from an internal host to an external domain demonstrates a periodic 'heartbeat' (e.g., every 5 minutes +/- 10 seconds), uses a non-standard port for a common application protocol, or involves data transfer volumes that are statistical outliers compared to a learned baseline for that protocol.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Firewall Egress Logs, Egress Web Proxies, Network Sensor Taps",
            "action": [
              "Symbolic Logic: Create a detection rule that alerts when a connection's 'service' field in Zeek conn.log (e.g., 'http') does not match the IANA-assigned protocol for the 'id.resp_p' (destination port), for example, 'http' over port 4444.",
              "Statistical Method: For each unique source-destination-port combination in Zeek conn.log, perform a time-series analysis on the connection timestamps. Use the Fast Fourier Transform (FFT) to detect strong periodicity indicative of C2 beaconing. Alert on connections with a highly regular interval (low jitter). Separately, for common protocols (HTTP, HTTPS), baseline the 'orig_bytes' and 'resp_bytes' fields and alert when a connection's volume exceeds 3 standard deviations from the mean for its peer group.",
              "Machine Learning: Use an autoencoder to learn a model of normal network connections based on features from Zeek conn.log like duration, protocol, service, bytes sent, bytes received, and connection state. Apply the model to new connections; a high reconstruction error indicates an anomalous connection that deviates from the learned norm and should be flagged for investigation as potential C2 activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]