[
    {
        "information_requirement": "Is the adversary performing active scanning against our external infrastructure?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1595",
                "name": "Active Scanning",
                "evidence": [
                    {
                        "description": "Active scanning attempts originating from IP addresses present on threat intelligence feeds for known scanners, malicious actors, or suspicious proxies.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join the source IP addresses from inbound connection logs (Zeek conn.log) against a high-confidence, up-to-date Cyber Threat Intelligence (CTI) feed of known malicious scanners, C2 servers, TOR exit nodes, or anonymous proxies. Alert on any matches and correlate with other scanning behaviors from the same source."
                    },
                    {
                        "description": "Identification of known scanning tool artifacts, such as specific User-Agent strings, HTTP headers, or SSL/TLS client characteristics (JA3/JA3S), in traffic targeting external services.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek http.log for suspicious User-Agent strings commonly associated with scanning tools (e.g., 'Nmap', 'masscan', 'ZGrab', 'python-requests'). Use regular expression matching and frequency analysis to flag rare or known-bad User-Agents. In Zeek ssl.log, hunt for JA3 or JA3S hashes that are characteristic of specific scanning or exploitation tools. Maintain and update lists of these pattern-based indicators."
                    },
                    {
                        "description": "Detection of specific network scan techniques identified by anomalous TCP flag combinations (e.g., SYN, FIN, NULL, XMAS scans) or protocol malformations.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek weird.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for connection states indicative of scanning, such as 'S0' (SYN sent, no reply), 'REJ' (connection rejected), or 'RSTR' (responder sent RST). Analyze TCP flags for unusual combinations not typical of legitimate traffic (e.g., FIN/PSH/URG for XMAS scans). Review Zeek weird.log for events like 'bad_TCP_header_len' or other protocol anomalies that can be generated by fingerprinting tools. Correlate multiple such events from a single source IP."
                    },
                    {
                        "description": "Anomalously high volume of connection attempts or ICMP requests from a single external source targeting a wide range of destination hosts (horizontal scan) or ports on a single host (vertical scan).",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek icmp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate Zeek conn.log and icmp.log data by source IP over short time windows (e.g., 1-5 minutes). Calculate descriptive statistics for unique destination IPs and unique destination ports per source. Use the Inter-Quartile Range (IQR) method or percentile-based thresholds to identify source IPs exhibiting outlier behavior (e.g., a source IP connecting to > 99th percentile of unique hosts or ports). Create box-plots of these metrics to visually identify scanners."
                    },
                    {
                        "description": "Low-and-slow scanning activity characterized by an abnormally high diversity of destination ports or hosts contacted by a single external source over an extended period, without necessarily having high connection volume.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Over longer time windows (e.g., 1 hour, 24 hours), calculate the Shannon entropy of destination ports and destination IP addresses for each external source IP. Establish a baseline for normal entropy levels. Flag source IPs with abnormally high entropy, which indicates they are probing a wide, non-random set of targets, characteristic of stealthy reconnaissance. Use time series analysis to detect unusual periodic probing from a single source over days or weeks."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
