[
  {
    "information_requirement": "Is an adversary actively gathering our organization's IP address information for targeting purposes?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.005",
        "name": "IP Addresses",
        "evidence": [
          {
            "description": "An external IP address, present on a high-confidence threat intelligence feed, initiates a statistically significant volume of connections or DNS queries to the organization's network perimeter.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter Firewalls, Internet Gateway, External DNS Servers, Cloud Network Gateways",
            "action": [
              "Join network logs (Zeek conn.log, dns.log) against a high-confidence CTI feed of known malicious IPs (e.g., scanners, C2 servers, TOR exit nodes). Generate a medium-severity alert for any matched connection or query from an external source.",
              "For all CTI-matched source IPs, calculate the total count of connections and DNS queries per 5-minute window. Identify and flag any source IP whose activity count exceeds the 95th percentile of all CTI-matched sources observed over the last 24 hours to prioritize investigation of the most active threats.",
              "Apply a time series forecasting model (e.g., ARIMA, Prophet) to the total volume of CTI-matched events per hour. Generate a high-severity alert if the observed event count significantly exceeds the forecasted upper confidence interval, indicating a potential large-scale or coordinated reconnaissance campaign."
            ]
          },
          {
            "description": "An external source interacts with public-facing services using User-Agent strings, protocol handshakes, or DNS query patterns that match signatures of known reconnaissance tools (e.g., Nmap, Masscan, Nuclei).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Application Delivery Controllers, External DNS Servers, VPN Concentrators",
            "action": [
              "Create and maintain a ruleset of regular expressions and signatures for artifacts associated with scanning tools. Scan http.log for anomalous user_agent strings, ssl.log for known malicious JA3/JA3S hashes, and dns.log for suspicious query patterns. Generate an alert on any match.",
              "For each external source IP in conn.log, calculate the Shannon entropy of the destination ports contacted within a 1-minute window. A very high entropy score suggests a broad port scan, while a very low score suggests a targeted probe of a single service. Flag source IPs in the top and bottom 5th percentile for analyst review.",
              "Train a classification model (e.g., Random Forest, Gradient Boosting) on labeled network sessions (benign vs. recon). Use features such as TCP flags, payload size, connection duration (duration in conn.log), and user_agent from http.log. Deploy the model to score new sessions in real-time and alert on those classified as likely reconnaissance."
            ]
          },
          {
            "description": "An external source IP exhibits scanning behavior, defined by a high count of connection attempts to distinct hosts/ports or a high ratio of failed (e.g., REJ, S0) to successful connections.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network DMZ, Perimeter Firewalls, Cloud Security Groups, VPC Flow Logs",
            "action": [
              "Implement a SIEM rule that alerts when a single external source IP (id.orig_h) in conn.log generates connections with a conn_state of 'REJ', 'RSTO', or 'S0' to more than 100 unique destination IPs (id.resp_h) within a 10-minute window.",
              "For each external source IP, calculate the ratio of failed connections (conn_state is 'REJ', 'RSTO', 'S0') to total connections over a 5-minute interval. Flag any source whose failure ratio exceeds 3 standard deviations above the mean for all external traffic in the same period.",
              "Apply a clustering algorithm (e.g., DBSCAN) to external source IPs using features such as count(distinct id.resp_h), count(distinct id.resp_p), and the failed connection ratio. Isolate and investigate clusters identified as anomalies or noise, as they likely represent scanning activity deviating from normal traffic patterns."
            ]
          },
          {
            "description": "An external source initiates targeted network probes, identified by short-lived connections to specific service ports followed by protocol anomalies or non-standard data exchanges indicative of service fingerprinting.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dpd.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Application Servers (e.g., Web, VPN, RDP), Internet Gateway, External-facing Container Platforms",
            "action": [
              "Generate a medium-severity alert for any event in notice.log with a note enum of Scan::Port_Scan, SSL::Invalid_Server_Cert, or PacketFilter::Drop where the source IP is external. Correlate with dpd.log for protocol_violation notices.",
              "For each external source IP connecting to a high-value port (e.g., 443, 3389, 22), calculate the median connection duration and total bytes transferred (orig_bytes + resp_bytes). Flag sources where these metrics fall below the 10th percentile of all connections to that port, as this may indicate a quick fingerprinting probe rather than a legitimate session.",
              "Apply time series analysis to the event count from dpd.log for dynamic protocol detection mismatches on standard ports (e.g., non-HTTP traffic on port 80). An anomalous spike in these events from a specific source IP indicates a coordinated service fingerprinting attempt."
            ]
          },
          {
            "description": "An external source generates anomalous DNS queries against organizational domains, characterized by zone transfer requests (AXFR/IXFR), a high ratio of NXDOMAIN responses, or an unusually high frequency of lookups for non-existent subdomains.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative External DNS Servers, Recursive DNS Resolvers, Cloud DNS Services (e.g., Route 53)",
            "action": [
              "Create a high-priority alert that triggers for any DNS query observed in dns.log where the query type (qtype_name) is 'AXFR' or 'IXFR' and the query targets an organizational domain.",
              "For each external source IP querying organizational domains, calculate the ratio of NXDOMAIN responses to total queries over a 15-minute window. Flag any source where this ratio exceeds the 98th percentile, as this strongly indicates subdomain enumeration or brute-forcing.",
              "Train a one-class SVM or Isolation Forest model on features of normal external DNS query behavior (e.g., query frequency, query type distribution, query name length, NXDOMAIN rate per source). Apply the model to new query patterns to detect outliers that represent anomalous reconnaissance activity."
            ]
          },
          {
            "description": "An internal host initiates outbound connections to an anomalously high number of distinct external IP addresses or ports, indicating a compromised system is being used for external reconnaissance or pivoting.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint Devices, Internal Server Segments, Egress Firewalls, Cloud Compute Instances (e.g., EC2)",
            "action": [
              "Create a rule to alert when a single internal host (that is not a designated proxy or authorized scanner) initiates connections to more than 50 unique external IP addresses on non-standard ports (not 80/443) within one hour, based on conn.log. Correlate with Windows Event ID 4688 to identify the parent process responsible for the network activity.",
              "For each internal host, establish a baseline for the number of distinct external IPs contacted per day using a 30-day moving average and standard deviation. Generate a high-severity alert if a host's daily count exceeds 4 standard deviations above its established moving average.",
              "Use time series decomposition (e.g., STL) on the outbound connection count per host to separate trend, seasonality, and residuals. Apply an anomaly detection algorithm (e.g., Z-score on residuals) to the residual component to identify sudden spikes in outbound scanning activity not explained by normal user or system behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]