[
  {
    "information_requirement": "Is the adversary gathering information about our organization's software?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1592.002",
        "name": "Software",
        "evidence": [
          {
            "description": "A connection event is logged from an external IP address that matches an entry on a current threat intelligence feed for reconnaissance tools, scanners, or known adversary C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter/internet gateway, Firewall logs, External-facing DNS servers",
            "action": [
              "Symbolic: Correlate source IP addresses from all inbound Zeek conn.log traffic against a threat intelligence feed of known scanners, TOR exit nodes, malicious proxies, and threat actor C2 infrastructure. Generate an alert for any match.",
              "Statistical: For each external source IP, calculate the ratio of connections to unique destination ports versus total connections within a 5-minute window. Flag IPs in the top 99th percentile of this ratio, as this indicates port scanning behavior.",
              "Machine Learning: Utilize a pre-trained IP reputation classification model to score all inbound source IPs based on features like ASN, geolocation, and historical activity. Use time series forecasting on the volume of connections from high-risk IP categories; alert on observed volumes that significantly exceed the forecasted upper confidence bound."
            ]
          },
          {
            "description": "An inbound HTTP/S request is logged with a User-Agent string, URI path, or JA3/JA3S hash that matches signatures of known scanning tools (e.g., Nmap, Nikto, Metasploit) or probes for specific software vulnerabilities.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web servers, Reverse proxies, Web Application Firewalls (WAFs)",
            "action": [
              "Symbolic: Match inbound User-Agent strings in Zeek http.log and JA3/JA3S hashes in Zeek ssl.log against a curated list of indicators associated with scanning tools (e.g., Nmap, Nikto, ZGrab, Metasploit). Use regular expressions to search for URI patterns probing for sensitive files (e.g., /.git/config, /.env). Alert on any match.",
              "Statistical: For each source IP, calculate the Shannon entropy of the requested URI paths within a 10-minute window from Zeek http.log. A high entropy score suggests directory or file enumeration. Flag source IPs with entropy scores exceeding the 98th percentile of the baseline for external traffic.",
              "Machine Learning: Train a logistic regression classifier to distinguish between benign and scanning-related HTTP requests using features such as URI length, number of special characters in the URI, and User-Agent string rarity. Apply the model to live traffic and alert on requests classified as malicious with high confidence."
            ]
          },
          {
            "description": "A single external source IP address generates connection attempts to a high number of unique destination ports or a high volume of requests to non-existent web paths (e.g., HTTP 404 responses) within a short time frame, indicating automated scanning.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Demilitarized Zone (DMZ), Network edge firewalls, Public-facing application servers",
            "action": [
              "Symbolic: Define a rule that triggers an alert when a single external source IP generates more than 100 connections to distinct destination ports on one or more servers within one minute, as observed in Zeek conn.log.",
              "Statistical: For each external source IP, calculate the rate of HTTP 404 'Not Found' responses over a 5-minute window from Zeek http.log. Establish a baseline for the 95th percentile of this rate and alert on any IP whose 404 rate exceeds this threshold.",
              "Machine Learning: Use a density-based clustering algorithm (e.g., DBSCAN) on connection events, using features like source IP, destination port, and protocol. Identify and alert on anomalous, sparse clusters of activity that represent targeted scanning from a single source across multiple ports, which deviate from dense clusters of normal traffic."
            ]
          },
          {
            "description": "An HTTP response to an external source IP contains content indicative of a verbose error (e.g., stack trace, database error) or a specific software banner and version number, often triggered by a malformed or crafted request.",
            "data_sources": [
              "Zeek http.log",
              "Windows Application Event Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web servers and applications, Application-level logging systems",
            "action": [
              "Symbolic: Create and apply signatures to search HTTP response bodies in Zeek http.log and Windows Application Event Logs for keywords indicative of verbose errors (e.g., 'stack trace', 'ODBC Driver Error', 'fatal error') and regular expressions matching common software version banners (e.g., 'Apache/2.4.54', 'nginx/1.23.3', 'IIS/10.0'). Alert when these are found in responses to external requests.",
              "Statistical: Establish a baseline distribution of HTTP status codes (e.g., 200, 301, 404, 500) per application. Use a Chi-squared test to alert on significant deviations from this baseline, such as a sudden spike in 5xx server errors correlated with a single source IP.",
              "Machine Learning: Apply a time series anomaly detection model (e.g., LSTM autoencoder) to the stream of server response sizes for each application. An unusually large response size, which could contain a verbose error message, will generate a high reconstruction error and trigger an alert."
            ]
          },
          {
            "description": "An internal endpoint initiates a DNS query and subsequent outbound connection to a domain that is either newly registered (e.g., registered less than 30 days ago) or matches threat intelligence for hosting reconnaissance frameworks like ScanBox, indicating a potential watering hole attack.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal user workstations, DNS resolvers, Egress points/Network proxy servers",
            "action": [
              "Symbolic: Correlate outbound DNS queries from Zeek dns.log against a threat feed of domains known to host fingerprinting scripts (e.g., ScanBox framework components) or known malicious infrastructure. Alert on any internal host resolving such a domain.",
              "Statistical: For each internal host, calculate the daily count of DNS queries to newly registered domains (NRDs, e.g., registered < 30 days ago). Establish a baseline and alert on hosts whose NRD query count exceeds 3 standard deviations above the mean for their peer group.",
              "Machine Learning: Use a random forest classifier to score the risk of an outbound web connection based on features such as domain age, domain reputation score, and whether the domain is an NRD. Alert on connections that are classified as high-risk."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]