[
  {
    "information_requirement": "Is the adversary conducting reconnaissance via phishing for information?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1598",
        "name": "Phishing for Information",
        "evidence": [
          {
            "description": "An incoming email's metadata (sender IP, sender domain, or URLs in body) matches an entry on a high-confidence threat intelligence feed for known phishing infrastructure.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter Firewall, Network DNS Resolvers, Web Proxy",
            "action": [
              "Symbolic: Correlate the `id.orig_h` (source IP) and `from` (sender domain) fields from `Zeek smtp.log` against a threat intelligence feed of known phishing IPs and domains. Alert on any match.",
              "Statistical: For domains observed in `Zeek dns.log` that are not on an allowlist, calculate the historical query frequency for each domain across the enterprise. A domain with a very low historical query count (e.g., below the 5th percentile) that suddenly appears in mail traffic is suspicious.",
              "Machine Learning: Use a pre-trained classification model (e.g., a logistic regression or random forest classifier) to score the reputation of sender IPs and domains. Input features can include IP/domain age, ASN information, historical query count, and presence on public blocklists. A reputation score exceeding a predetermined threshold triggers an alert."
            ]
          },
          {
            "description": "An incoming email fails SPF/DKIM/DMARC validation, originates from a newly registered domain (NRD), or uses a look-alike domain visually similar to the organization's or a partner's domain.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Network DNS Resolvers",
            "action": [
              "Symbolic: From `Zeek smtp.log` headers, create a rule to alert on any incoming email where the `Authentication-Results` header contains 'spf=fail', 'dkim=fail', or 'dmarc=fail'.",
              "Statistical: For all sender domains in `Zeek smtp.log`, query their registration date via external WHOIS data. Calculate the distribution of domain ages for all incoming mail. Flag sender domains that fall below a low percentile threshold (e.g., 10th percentile, corresponding to domains registered within the last 30-60 days).",
              "Machine Learning: Implement a string similarity model using Levenshtein distance to compare all external sender domains against a list of internal and partner domains. Use a clustering algorithm (e.g., DBSCAN) to group visually similar domains. Manually review clusters to identify and block look-alike domains used for phishing."
            ]
          },
          {
            "description": "A single external sender IP or domain sends emails to a high number of unique internal recipients within a short time frame, where the sender has little to no previous communication history with the organization.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Mail Transfer Agent (MTA)",
            "action": [
              "Symbolic: Create a rule to alert when a single source IP (`id.orig_h` in `Zeek smtp.log`) sends emails to more than 50 unique internal recipients (`rcpt_to` field) within a 1-hour window.",
              "Statistical: For each external sender domain in `Zeek smtp.log`, calculate the ratio of unique recipients to total emails sent over a rolling 1-hour window. Establish a baseline for this ratio across all legitimate external senders. Alert when a new or rare sender's ratio exceeds a high percentile threshold (e.g., 98th percentile), indicating a broadcast-style campaign.",
              "Machine Learning: Use time-series analysis (e.g., ARIMA) to model the expected volume of email from known external sender domains. Anomaly detection on this time-series can flag sudden, unexplained spikes in email volume from a specific domain, which could indicate the start of a mass phishing campaign."
            ]
          },
          {
            "description": "An email is sent to a high-value target (HVT) from an external domain that is not on an established allowlist and is either a newly registered domain, a look-alike domain, or has a subject line suggesting a reply to a non-existent thread.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Executive Mailboxes, Finance Department Endpoints, IT Administrator Workstations",
            "action": [
              "Symbolic: Maintain a list of HVT email addresses. Create a high-priority alert for any email sent to an HVT where the sender domain is not on a pre-approved partner/vendor allowlist and the SPF/DKIM/DMARC result is 'fail'.",
              "Statistical: For the HVT group, establish a baseline of typical sender domains and communication patterns. Calculate the entropy of sender domains communicating with this group. A sudden communication from a domain with very low historical frequency (a statistical outlier) should be flagged for review.",
              "Machine Learning: Train a classification model specifically on emails to HVTs. Features should include sender reputation, domain age, string similarity to known domains, and presence of urgency-inducing keywords ('urgent', 'invoice', 'password'). The model's output 'spearphish probability' score can be used to prioritize analyst review."
            ]
          },
          {
            "description": "An outbound email is sent to an external domain recently identified as suspicious (e.g., NRD, look-alike, IOC match), and the message size is a statistical outlier compared to the user's baseline, or it is followed by an anomalous file transfer.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, Network Egress Points, Mail Transfer Agent (MTA)",
            "action": [
              "Symbolic: If an inbound email from a source IP/domain triggers a phishing alert, create a subsequent rule to monitor for any outbound `Zeek smtp.log` or `Zeek conn.log` traffic from the recipient's internal IP back to the suspicious source IP/domain within the next 24 hours.",
              "Statistical: For each user, establish a baseline of outbound email size using `Zeek smtp.log` data. Monitor for outbound emails where the message size is a significant outlier (e.g., > 3 standard deviations above the user's mean outbound email size), especially when the recipient domain is new or has a low reputation score.",
              "Machine Learning: Use a sequence analysis model to detect anomalous user behavior patterns. A suspicious sequence might be: (Inbound email from suspicious domain) -> (HTTP connection to URL from email) -> (Process creation of a web browser - Windows Event ID 4688) -> (Outbound email to suspicious domain). Train the model on benign sequences to detect deviations that represent a likely phishing response."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]