[
  {
    "information_requirement": "Has the adversary leveraged information from closed sources to conduct reconnaissance or prepare for initial access?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1597",
        "name": "Search Closed Sources",
        "evidence": [
          {
            "description": "A successful or failed login attempt using an account identifier (e.g., username, email address) that is present on a list of credentials known to be exposed in a third-party data breach.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services (e.g., VPN, OWA, M365), Domain Controllers",
            "action": [
              "Symbolic: Maintain and ingest a watchlist of employee credentials exposed in data breaches from a threat intelligence provider. Create a rule to generate a high-severity alert when a login attempt (Windows Event ID 4624 or 4625) matches an account on this watchlist and originates from an external IP address (context from Zeek conn.log).",
              "Statistical: For accounts on the breach watchlist, calculate the historical rate of failed logins (Event ID 4625) from external IPs over a 30-day baseline. Flag any account that experiences a sudden spike in failed logins exceeding 3 standard deviations above its individual baseline within a 24-hour period.",
              "Machine Learning: Train a logistic regression classifier on historical login data, using features such as 'on_breach_list' (binary), 'is_external_ip' (binary), 'time_of_day', 'day_of_week', and 'source_ASN_rarity'. Use the model to score new login events in real-time for their likelihood of being a credential stuffing attempt."
            ]
          },
          {
            "description": "A high ratio of unique destination usernames to total failed login attempts (Windows Event ID 4625) originating from a single external source IP address within a defined time window, indicative of password spraying.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services, Perimeter firewalls and network gateways",
            "action": [
              "Symbolic: Create a rule that triggers when a single source IP address (from Zeek conn.log) generates failed logins (Windows Event ID 4625) for more than 20 unique user accounts within a 10-minute window.",
              "Statistical: For each external source IP, calculate the Shannon entropy of the target usernames within a 1-hour sliding window from Windows Event ID 4625 logs. A high entropy score, exceeding the 99th percentile of the historical distribution for all external IPs, indicates the IP is targeting a wide and varied set of users.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on login event data, with features such as source IP, timestamp, and a numerical representation of the target username. A dense cluster of failed logins from a single IP to many different users would be isolated as an anomalous cluster indicative of a password spray attack."
            ]
          },
          {
            "description": "A successful authentication event (Windows Event ID 4624) for a user account whose 'lastLogonTimestamp' is older than a defined threshold (e.g., 90 days), especially from an external source.",
            "data_sources": [
              "Windows Event ID 4624",
              "Active Directory logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Active Directory servers, Externally-facing authentication services",
            "action": [
              "Symbolic: Maintain a dynamic list of accounts considered dormant (e.g., no successful login for >90 days based on Active Directory's lastLogonTimestamp). Create a rule to alert on any successful login (Windows Event ID 4624) from this list, with elevated severity if the login originates from an external IP address (identified via Zeek conn.log).",
              "Statistical: For each user account, calculate the average time delta between logins. Flag a new login event where the time since the last login is a significant outlier (e.g., > 3 standard deviations from the user's mean inter-login time) for review.",
              "Machine Learning: Use a time series anomaly detection model (e.g., ARIMA) for each user's login frequency. A successful login after a long period of predicted inactivity would be flagged as a temporal anomaly, suggesting the use of old, stolen credentials."
            ]
          },
          {
            "description": "One or more connection attempts (e.g., SYN packets in Zeek conn.log with state 'S0') from an external, untrusted IP address to a host or port on a pre-defined list of non-public assets.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network DMZ, Cloud environment subnets hosting non-public services, Perimeter firewalls",
            "action": [
              "Symbolic: Maintain a watchlist of IP addresses and ports corresponding to non-public infrastructure (e.g., staging servers, management interfaces). Create a high-severity alert for any connection attempt logged in Zeek conn.log from an external IP to an asset on this watchlist.",
              "Statistical: Calculate the baseline daily connection attempt volume for all non-public assets from external sources (this should be near zero). Flag any day where the connection count to these assets from a single external IP exceeds a predefined low threshold (e.g., >5 attempts), which may also be reported in Zeek notice.log as scanning.",
              "Machine Learning: Train a One-Class SVM (Support Vector Machine) on features of 'normal' network traffic to the DMZ (e.g., destination port, protocol, packet count). Traffic destined for non-public assets, having features like unusual port numbers or originating from low-reputation IPs, would be classified as an anomaly, suggesting reconnaissance based on privileged information."
            ]
          },
          {
            "description": "A successful login (Windows Event ID 4624) with a combination of anomalous properties, such as a source IP from a new geographic location, a new ASN, or occurring at an unusual time, when compared to the user's established baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Externally-facing authentication services, VPN concentrators, Domain Controllers",
            "action": [
              "Symbolic: For each user, maintain a list of known safe countries/ASNs based on their last 30 days of activity. Create a rule to alert on any successful login (Windows Event ID 4624) from a country/ASN not on the user's safelist.",
              "Statistical: For each user, build a historical profile including a set of source countries, a set of source ASNs, and the distribution of login hours. Assign a risk score to new logins based on deviations (e.g., +1 for new country, +1 for login hour > 2 standard deviations from mean). Alert when the cumulative score exceeds a threshold (e.g., >2).",
              "Machine Learning: Employ an unsupervised learning model like an Isolation Forest on user login data, using features such as 'hour_of_day', 'day_of_week', 'source_country_rarity', and 'source_ASN_rarity'. The model will learn a user's normal 'cluster' of activity and flag logins that fall far outside this cluster as anomalous."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]