[
  {
    "information_requirement": "Is the adversary performing reconnaissance by searching public digital certificate data against our organization?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.003",
        "name": "Digital Certificates",
        "evidence": [
          {
            "description": "A single internal host initiates network connections to or resolves DNS names for multiple domains or IP addresses present on a threat intelligence feed for certificate reconnaissance services or known adversary C2 infrastructure within a short time frame.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Network Egress Points (e.g., Firewalls, Proxies), Endpoints",
            "action": [
              "Continuously ingest threat intelligence feeds identifying domains/IPs of reconnaissance tools (e.g., crt.sh, censys.io) and adversary infrastructure. Create a detection rule to trigger a high-severity alert when any DNS query (Zeek dns.log) or network connection (Zeek conn.log) from an internal host matches an indicator on this list. Correlate with process creation logs (Windows Event ID 4688) to identify the parent and child process responsible for the network activity.",
              "For each host, establish a 30-day rolling baseline of the number of unique known recon domains contacted per hour. Group hosts by role (e.g., developers, security, general users) to create peer group baselines. Generate an alert if a host's hourly count exceeds the 98th percentile of both its own baseline and its peer group's baseline, indicating a statistically significant deviation.",
              "Deploy a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the total volume of connections from the internal network to a watchlist of known reconnaissance domains. The model should account for weekly and daily seasonality. Flag any event identified as an anomaly by the model for analyst review, as it represents a deviation from predictable traffic patterns."
            ]
          },
          {
            "description": "An internal host generates HTTP/S requests to known Certificate Transparency (CT) log domains, where the requests exhibit characteristics of automated tools, such as non-standard User-Agent strings, scripted URI query patterns, or a high request frequency.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Proxies with SSL/TLS Decryption, Network Egress Points, Endpoint Detection and Response (EDR) agents",
            "action": [
              "Develop and apply a set of regular expressions against decrypted HTTP traffic (Zeek http.log) to detect reconnaissance tool signatures. Match on User-Agent strings like 'masscan', 'censys', 'sublist3r', or common Python/Go HTTP library defaults. Also, match on URI patterns like '/?q=%.example.com' or '/?identity=%.example.com' directed at known CT log domains (e.g., crt.sh, ct.googleapis.com). A match should generate a medium-severity alert.",
              "For each internal host, calculate the Shannon entropy of its User-Agent strings observed in requests to CT log domains over a rolling 1-hour window. Establish a 30-day baseline entropy value for each host. An entropy score exceeding 3 standard deviations from the host's historical mean suggests the use of multiple or randomized tools and should trigger an alert for investigation.",
              "Train a Random Forest or Gradient Boosting classifier on features extracted from HTTP requests to CT log domains. Use features such as: User-Agent string length and entropy, presence of specific keywords in URI, ratio of query parameters to path length, and inter-request time delta. Label data using known benign (browser) and malicious (tool) traffic samples. Apply the trained model to classify outbound traffic in near-real-time and flag requests classified as 'malicious' with a probability score > 0.9."
            ]
          },
          {
            "description": "An internal host generates a statistically anomalous volume and diversity of DNS queries for known Certificate Transparency (CT) log domains, inconsistent with its historical behavior and that of its peer group.",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS Resolvers, Domain Controllers, Endpoint Devices",
            "action": [
              "Define a 'low-risk' group of hosts (e.g., finance, HR) that should have no business querying CT logs. Create a detection rule to generate a high-severity alert if any host from this group makes a single DNS query (Zeek dns.log) to a known CT log domain. Correlate the connection event (Windows Event ID 5156) with the process that initiated it (Windows Event ID 4688).",
              "For each host, compute two metrics hourly: 1) total DNS query count to CT domains, and 2) the entropy of the second-level domains (e.g., 'crt', 'googleapis') of those queries. Establish a 30-day baseline for both metrics. Generate an alert if a host's hourly values for both query count and domain entropy simultaneously exceed the 99th percentile of their respective historical baselines, indicating both high volume and high diversity.",
              "For each host, use a one-class Support Vector Machine (SVM) model trained on its historical DNS query patterns to CT domains (features could include query volume, unique domains, and time of day). This model defines a boundary of 'normal' behavior. Any new query pattern that falls outside this boundary is flagged as an anomaly, indicating a deviation from the host's established profile without relying on fixed thresholds."
            ]
          },
          {
            "description": "A single external source IP address establishes an abnormally high number of SSL/TLS sessions to the organization's public-facing servers, requesting certificates for a wide and diverse range of hostnames via the Server Name Indication (SNI) field within a compressed timeframe.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network DMZ, Public-facing Web Servers, Edge Routers, Load Balancers, Cloud-hosted Application Frontends",
            "action": [
              "Ingest and maintain a high-confidence threat intelligence feed of IPs known for internet-wide scanning and reconnaissance. Create a rule to generate a high-severity alert and potentially trigger an automated block if any external IP on this list initiates an SSL/TLS handshake (Zeek ssl.log) with any server in the DMZ or public cloud environment.",
              "For each external source IP, aggregate two counts over a 5-minute window: 1) the number of unique destination hosts contacted, and 2) the number of unique 'server_name' values requested in the SNI field (from Zeek ssl.log). Calculate the 99.5th percentile for both metrics across all external traffic. Generate a medium-severity alert if a source IP exceeds the threshold for unique SNIs, and a high-severity alert if it exceeds the thresholds for both unique SNIs and unique destination hosts.",
              "Use the DBSCAN clustering algorithm on connection events from external IPs. Use features like source IP, destination port, number of unique SNIs per 5-minute window, and average time between connections. DBSCAN will automatically group 'normal' traffic (e.g., CDN crawlers, search engine bots) into large clusters. Flag all points classified as 'noise' or belonging to very small, dense clusters as anomalous scanning activity requiring investigation, as they represent behavior that does not conform to any large, common pattern."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]