[
  {
    "information_requirement": "Is the adversary conducting reconnaissance to identify business tempo, or leveraging this knowledge for malicious activity?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1591.003",
        "name": "Identify Business Tempo",
        "evidence": [
          {
            "description": "Confirmed network communication with infrastructure (IPs, domains) or exhibiting network fingerprints (JA3/JA3S hashes) associated with known reconnaissance tools or services.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, forward/reverse proxies, public-facing DNS servers, and external-facing web application firewalls (WAFs).",
            "action": [
              "Symbolic Logic: Query network logs (Zeek conn.log, dns.log, ssl.log) to continuously match source/destination IPs, requested domains, and JA3/JA3S hashes against a threat intelligence feed of known reconnaissance infrastructure. Generate a high-priority alert for any match.",
              "Statistical Method: For any IP address flagged by threat intelligence, profile its connection behavior over a 7-day window. Calculate the total connection count and compare it to the overall distribution of connection counts from all external IPs. Flag IPs that fall below the 10th percentile for connection volume but persist over 3+ days, indicating potential low-and-slow reconnaissance.",
              "Machine Learning: Develop a supervised classification model (e.g., Random Forest) to score inbound connections. Engineer features from Zeek logs such as connection duration, bytes sent/received, protocol, connection state (e.g., 'S0', 'SF'), and a binary feature for a threat intelligence match. Train the model on labeled data of known benign and reconnaissance traffic to predict the likelihood of new connections being malicious reconnaissance."
            ]
          },
          {
            "description": "An external source IP establishes a repeating pattern of connections to public-facing authentication services (e.g., VPN, OWA) over an extended period (days/weeks) without any associated successful or failed login events from that IP or its subnet.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Windows Event ID 4625",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, Outlook Web Access (OWA) portals, single sign-on (SSO) platforms, and other external-facing authentication gateways.",
            "action": [
              "Symbolic Logic: Join network connection logs (Zeek conn.log) with authentication logs (Windows Event ID 4624, 4625) on source IP. Create a rule to alert when a source IP connects to a predefined list of authentication service IPs/ports more than 20 times in a 14-day period but has a zero count of associated login attempts (successful or failed).",
              "Statistical Method: For each source IP connecting to authentication services, calculate the inter-arrival time (time between connections) for all its connections over 30 days. Identify IPs with an abnormally low standard deviation in their inter-arrival times, suggesting automated, periodic probing. Flag IPs in the bottom 5th percentile for this metric.",
              "Machine Learning: Apply time series anomaly detection (e.g., using an LSTM autoencoder) to the stream of connection events for each high-value authentication service. The model should learn the normal patterns of connection volume, including time-of-day and day-of-week seasonality. Flag periods where connection volume deviates significantly from the model's prediction, especially low-volume, persistent deviations from unknown sources."
            ]
          },
          {
            "description": "A single external IP address conducts low-frequency, high-variety port scanning over a long duration (weeks/months), touching a wide range of distinct services without engaging in deep application-layer interaction.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network DMZ, public cloud subnets (VPCs/VNETs), public-facing application servers, and external DNS servers.",
            "action": [
              "Symbolic Logic: For each external source IP, count the number of unique destination ports contacted over a 30-day period. Create a rule to alert if an IP contacts more than 10 unique ports but generates less than 1KB of total traffic to each, and is not on an approved scanner/service allowlist.",
              "Statistical Method: Over a 30-day window, calculate two metrics for each external source IP: 1) the Shannon entropy of the destination ports it connected to in `Zeek conn.log`, and 2) the total number of connections. Isolate and investigate IPs that are in the top 98th percentile for port entropy (high port variety) but in the bottom 25th percentile for total connection count (low frequency).",
              "Machine Learning: Use a density-based clustering algorithm like DBSCAN on all external source IPs from the last 30 days. Engineer features for each IP, such as total connection count, unique destination port count, unique destination IP count, average bytes transferred, and the standard deviation of inter-connection arrival times. Investigate IPs that are classified as noise or form small, distinct clusters, as they do not conform to the behavior of normal users or common internet scanners."
            ]
          },
          {
            "description": "Privileged account activity, such as interactive logon, command execution, or sensitive file access, occurs during defined non-business hours (e.g., 22:00-06:00 local time, weekends, holidays) and deviates from the user's established activity baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, certificate authorities, critical file servers, privileged user workstations, database servers, and hypervisor management consoles.",
            "action": [
              "Symbolic Logic: Create a high-severity alert that triggers when a logon event (Windows Event ID 4624 with Logon Type 2 or 10) for a member of a privileged group (e.g., Domain Admins) is immediately followed by a process creation event (Windows Event ID 4688) for a discovery tool (e.g., `net.exe`, `whoami.exe`, `nltest.exe`, `gpresult.exe`) during a company-defined non-business period.",
              "Statistical Method: For each user, build a 90-day historical baseline of activity, calculating the mean and standard deviation for login times, processes executed, and servers accessed. Assign a risk score to new activities based on the number of standard deviations they fall outside the user's normal baseline (e.g., +1 for login >2 std dev from mean time, +1 for rare process). Sum the scores and alert on activities exceeding a risk threshold.",
              "Machine Learning: Develop a one-class SVM (Support Vector Machine) model for each privileged user based on their historical activity features (e.g., hour of logon, source workstation, processes launched, servers connected to). Use the trained model to classify new activity events as either 'inlier' (normal) or 'outlier' (anomalous). Investigate all outlier events, especially those occurring during off-hours."
            ]
          },
          {
            "description": "A new or modified scheduled task or system service is configured to execute during non-business hours, and the associated action involves a suspicious command, script, or location.",
            "data_sources": [
              "Windows Event ID 4698",
              "Windows Event ID 4702",
              "Microsoft-Windows-TaskScheduler/Operational Event ID 106",
              "Windows Event ID 4688",
              "Windows Event ID 4697"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Windows endpoints and servers, particularly Domain Controllers, application servers, and administrator workstations.",
            "action": [
              "Symbolic Logic: Alert on the creation of a new scheduled task (Windows Event ID 4698) or service (Windows Event ID 4697) where: 1) the trigger is set for non-business hours (e.g., via XML `TimeTrigger` or service start type) AND 2) the action/executable path involves a script interpreter (`powershell.exe`, `cscript.exe`), a living-off-the-land binary in a non-standard path, or a command with obfuscation (`-enc`, `-w hidden`).",
              "Statistical Method: For each host, calculate a baseline frequency of scheduled task/service creation events over 90 days. Alert when a host exceeds the 99th percentile of this frequency. Additionally, for each new task/service, calculate the Shannon entropy of its command line/executable path string. Flag tasks/services with entropy scores significantly higher than the host's historical average, as this may indicate obfuscation or randomization.",
              "Machine Learning: Train a gradient boosting classification model (e.g., XGBoost) to determine if a new scheduled task or service is malicious. Features should include: run-as user context (e.g., SYSTEM, user), task trigger details (e.g., is_off_hours, is_logon_trigger), entropy of the command line, rarity of the executable name, and whether the parent process that created the task is unusual (e.g., `winword.exe`)."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]