[
  {
    "information_requirement": "Is the adversary gathering information about our host hardware during reconnaissance?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1592.001",
        "name": "Hardware",
        "evidence": [
          {
            "description": "An external IP address, present on a threat intelligence feed of known scanners or malicious actors, initiates connections to multiple internal hosts or ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, perimeter firewalls, public-facing web servers, DMZ subnets",
            "action": "Symbolic: Ingest high-confidence threat intelligence feeds for malicious IPs, TOR exit nodes, and scanning services (e.g., Shodan). Create a rule to alert on any inbound connection attempt in Zeek conn.log where the originator's IP ('id.orig_h') matches an IP on these feeds. Statistical: For all external source IPs, calculate the fan-out ratio (count of unique destination hosts) and port scan ratio (count of unique destination ports) within a 10-minute window. Flag source IPs that fall into the 99th percentile for either metric, as this indicates horizontal or vertical scanning. Machine Learning: Use a classification model (e.g., Random Forest) trained on labeled network traffic features (connection duration, bytes transferred, protocol, flags, service) to classify incoming connections as 'benign', 'scan', or 'malicious'. Feed alerts from the 'scan' class into an analyst workflow for investigation."
          },
          {
            "description": "The execution of a command or script (e.g., 'systeminfo', 'Get-ComputerInfo') used for hardware enumeration on a host, especially by an anomalous user or parent process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain controllers, database servers, developer workstations, executive endpoints, web servers",
            "action": "Symbolic: Monitor Windows Event ID 4688 for process creation events where the 'NewProcessName' or 'CommandLine' field contains known hardware reconnaissance commands such as 'systeminfo', 'dxdiag', 'msinfo32', or PowerShell cmdlets like 'Get-ComputerInfo' and 'Get-WmiObject -Class Win32_ComputerSystem'. Alert if the parent process is a web server process (e.g., 'w3wp.exe') or a Microsoft Office application. Statistical: Profile the execution frequency of these commands for each user and host. Generate a risk score when a command is executed by a user for the first time or on a host where it is historically rare. Alert when this rarity score exceeds the 95th percentile of all command executions across the environment. Machine Learning: Deploy a pre-trained Isolation Forest model to baseline normal parent-child process relationships and command-line arguments. Feed all Event ID 4688 logs into the model and alert on any process creation event that the model flags as an anomaly, particularly those involving reconnaissance commands."
          },
          {
            "description": "A single external IP address initiates a high volume of failed or short-lived connections across many distinct internal hosts or ports, consistent with network sweeping.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, internet-facing network sensors, network backbone taps",
            "action": "Symbolic: Create a rule that triggers if a single external source IP ('id.orig_h') generates more than 100 rejected ('REJ') or reset ('RSTO', 'RSTR') connections in Zeek conn.log within a 5-minute window. Statistical: For each external source IP, calculate the entropy of destination ports ('id.resp_p') in a 1-minute window. A high entropy score suggests the IP is iterating through ports. Alert on source IPs with an entropy score in the top 98th percentile. Also, track the ratio of successful ('SF') to failed connections per source IP; a very low ratio is indicative of scanning. Machine Learning: Apply time series anomaly detection (e.g., using an LSTM autoencoder) to the volume of inbound connection attempts from new, unseen external IP addresses. This can detect low-and-slow scanning activity that may not trigger simple threshold-based rules by identifying deviations from the learned pattern of 'background noise'."
          },
          {
            "description": "Queries using information-rich protocols like SNMP or SMB originate from an external IP address or from an internal host not authorized for network administration or scanning.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb_mapping.log",
              "Zeek snmp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal server subnets, network management segments, legacy equipment zones",
            "action": "Symbolic: Maintain an explicit allowlist of authorized internal scanners and management servers. Generate a high-priority alert for any SNMP (UDP/161) or SMB (TCP/445) traffic in Zeek logs that crosses the network perimeter from an external source, or that originates internally from a host not on the allowlist. Statistical: Establish a baseline of normal internal SMB/SNMP activity by counting source-destination communication pairs over a 30-day period. Alert if a new, previously unseen communication pair appears, or if the connection count for an existing pair exceeds 3 standard deviations from its daily average. Machine Learning: Model the internal network as a graph, where hosts are nodes and communications are edges. Use a community detection algorithm (e.g., Louvain) to identify normal clusters of activity (e.g., a file server and its clients). An alert is triggered if a host begins communicating via SMB/SNMP with an unusually high number of nodes outside its typical community, indicating potential internal reconnaissance."
          },
          {
            "description": "A hardware enumeration command is executed on a host, and within 60 seconds, the same host initiates an outbound network connection to an external, low-reputation IP address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical application servers, administrator workstations, endpoints handling sensitive data",
            "action": "Symbolic: Create a stateful correlation rule that triggers when a hardware reconnaissance process (e.g., 'systeminfo.exe' in Event ID 4688) is followed within 60 seconds by a network connection event (Event ID 5156 or Zeek conn.log) from the same host to an external destination IP that has a poor reputation score from a threat intelligence provider. Statistical: For a given host, calculate the baseline probability of an outbound connection occurring within 60 seconds of any process execution. If a hardware recon command is run, and a subsequent outbound connection occurs, flag the event if its conditional probability is statistically significant (e.g., p-value < 0.01) compared to the baseline, suggesting the events are linked. Machine Learning: Use a sequence analysis model, such as a Hidden Markov Model (HMM), trained on sequences of process creation and network connection events. The model learns the probability of transitioning between different states (e.g., 'benign process' -> 'benign network activity'). An alert is generated if the model observes a low-probability sequence, such as 'reconnaissance process' -> 'external data exfiltration'."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]