[
  {
    "information_requirement": "Is the adversary conducting reconnaissance to determine the organization's physical locations? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1591.001",
        "name": "Determine Physical Locations",
        "evidence": [
          {
            "description": "An external IP address, present on a threat intelligence feed for reconnaissance or malicious activity, establishes one or more connections to a public-facing web server on ports 80 or 443.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors at the internet egress/ingress point (e.g., DMZ), logs from public-facing web servers and load balancers",
            "action": [
              "Create a detection rule that continuously joins Zeek conn.log id.orig_h with a cyber threat intelligence (CTI) feed of known malicious IPs. Generate an alert for any match where id.resp_h is a registered public-facing asset and id.resp_p is a web port (e.g., 80, 443).",
              "Aggregate Zeek conn.log data over 24-hour windows. For each window, calculate the percentage of total inbound connections that originate from IP addresses listed on a CTI feed. Establish a 30-day rolling baseline of this percentage. Alert if the daily percentage exceeds the 95th percentile of the baseline, indicating a potential targeted reconnaissance campaign.",
              "Train a supervised classification model (e.g., Random Forest, Gradient Boosting) on labeled historical Zeek conn.log data. Use features such as: CTI match (boolean), ASN owner, source IP geolocation (country, city), time of day, and historical connection frequency from the source IP. The model should output a probability score for each connection being 'reconnaissance'. Alert on connections with a score above a predefined threshold (e.g., 0.8)."
            ]
          },
          {
            "description": "A series of HTTP requests from a single source IP to a public-facing web server exhibits characteristics of automated scanning, such as a User-Agent string matching a known reconnaissance tool, a high request rate for location-specific URIs (e.g., '/about-us', '/contact'), and a low ratio of fetched page resources (CSS, JS, images) to HTML pages.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web application servers, Web application firewalls (WAFs), Reverse proxy servers",
            "action": [
              "Develop a signature-based rule to scan the user_agent field in Zeek http.log for strings associated with reconnaissance tools (e.g., 'sqlmap', 'nmap', 'Recon-ng', 'FOCA', 'dirb', 'GoBuster'). Alert on any match targeting a public-facing asset.",
              "For each source IP address (id.orig_h) in Zeek http.log, calculate the Shannon entropy of the requested URIs over a 5-minute sliding window. Also, count the number of requests in the same window. Establish a baseline for these two metrics across all source IPs. Alert on source IPs that fall into the bottom 5th percentile for URI entropy and the top 5th percentile for request count simultaneously, as this indicates repetitive, automated scanning.",
              "For each public-facing web application, train a time series anomaly detection model (e.g., SARIMA, Prophet) on the volume of HTTP requests per minute. The model will learn the normal daily and weekly traffic patterns. Alert when the observed request volume significantly exceeds the model's forecasted upper confidence interval, and enrich the alert with the top requested URIs during the anomaly period to check for reconnaissance patterns."
            ]
          },
          {
            "description": "An internal host generates a statistically anomalous volume or frequency of DNS queries and subsequent connections to external services related to geolocation, mapping, or public records.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, network traffic from user subnets, egress filtering points, and web proxy logs",
            "action": [
              "Maintain a watchlist of domains and subdomains associated with mapping, public records, and geolocation services (e.g., 'maps.google.com', 'bing.com/maps', 'openstreetmap.org', public data aggregators). Correlate Zeek dns.log and conn.log. Alert if an internal host resolves and connects to more than 10 unique domains from this watchlist within a 1-hour period.",
              "For each internal host, establish a 30-day rolling baseline of (a) the number of unique DNS queries to domains on the location-reconnaissance watchlist and (b) the total bytes sent (orig_bytes) to the resolved IPs. Calculate the daily Z-score for both metrics against the host's own historical baseline. Alert if either Z-score exceeds 3, indicating a significant deviation from normal behavior.",
              "Apply a clustering algorithm (e.g., DBSCAN, K-Means) to all internal hosts based on features derived from a 24-hour period of Zeek dns.log and conn.log data. Features should include: number of DNS queries to watchlist domains, total bytes sent to those domains, number of unique external IPs contacted, and average session duration. Hosts that form a small, distinct cluster separate from the main 'benign' user cluster should be flagged for investigation as potential outliers performing reconnaissance."
            ]
          },
          {
            "description": "A user account accesses an unusually high number of sensitive internal files or repositories containing physical location information, deviating from established individual and peer group baselines.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File servers hosting Facilities, Security, or HR data, SharePoint sites for corporate planning, Domain Controllers for audit policies",
            "action": [
              "Tag sensitive files and folders containing keywords like 'blueprint', 'facility', 'address list', 'evacuation plan' and enable SACL auditing. Create a rule to trigger a high-severity alert if a user account accesses more than 3 of these tagged resources within a 10-minute window.",
              "For each user, establish a 30-day rolling baseline of their daily access count to files tagged as sensitive location data (from Event ID 4663). Also, establish a similar baseline for the user's peer group (e.g., their department). Alert if a user's daily access count exceeds the 99th percentile of their own historical activity AND the 99th percentile of their peer group's activity.",
              "For each user group with legitimate access to location data, train an anomaly detection model (e.g., One-Class SVM or Isolation Forest) on their normal file access patterns from Event ID 4663. Features should include: time of day of access, number of files accessed in a session, access frequency, and the specific files accessed. The model creates a profile of normal behavior. Any access activity that the model flags as a significant outlier should trigger an alert for manual review."
            ]
          },
          {
            "description": "A process, spawned from a non-standard parent (e.g., an Office application or script interpreter), is immediately followed by network connections to location-related websites or access to sensitive internal location files.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Critical application servers, Virtual Desktop Infrastructure (VDI) instances",
            "action": [
              "Create a correlation rule that triggers when a process creation event (Event ID 4688) with a parent process of 'winword.exe', 'excel.exe', or 'powershell.exe' is followed within 60 seconds by a network connection from the same host to a domain on the location-reconnaissance watchlist (from Zeek conn.log) or a file access event (Event ID 4663) for a tagged sensitive location file.",
              "From historical Event ID 4688 and Zeek conn.log data, build a frequency table for process parent-child-network destination combinations. Calculate the probability of each combination occurring. Create a rule that flags any combination observed in real-time that has a historical probability below a very low threshold (e.g., <0.001%), indicating a statistically rare and suspicious event chain.",
              "Construct a dynamic behavior graph where nodes represent processes, files, and network destinations, and edges represent interactions (e.g., process spawns file, process connects to destination). Use a graph-based anomaly detection algorithm to identify rare or suspicious paths in this graph. For example, a path `winword.exe -> powershell.exe -> maps.googleapis.com` would be flagged as anomalous if it is structurally different from common benign graphs observed in the environment."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]