[
  {
    "information_requirement": "Is the adversary conducting reconnaissance to identify our organization's network trust dependencies?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.003",
        "name": "Network Trust Dependencies",
        "evidence": [
          {
            "description": "An external source IP, not associated with a known partner, generates a high volume of network connections or DNS queries to internal resources, or a known partner IP exhibits traffic patterns that deviate significantly from its established baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet Gateway, Cloud Egress Points, External DNS Resolvers, VPN Concentrators",
            "action": [
              "Correlate source/destination IPs from Zeek conn.log and queried domains from Zeek dns.log against threat intelligence feeds of known reconnaissance infrastructure. Generate an alert for any match.",
              "For external traffic not on an approved partner allowlist, establish a baseline of normal partner communication patterns. Calculate the Jaccard similarity between the set of destination ports/domains for a given source IP and the baseline set for legitimate partners. Generate an alert for sources with a similarity score below a dynamically calculated threshold, such as the 10th percentile.",
              "Implement a time-series anomaly detection model (e.g., ARIMA) on the volume of connections and bytes transferred from known third-party and partner IP ranges. Generate an alert if the observed traffic volume significantly deviates (e.g., exceeds the 99% confidence interval) from the model's prediction, suggesting a compromised partner network is being used for reconnaissance."
            ]
          },
          {
            "description": "A user account associated with a trusted partner executes reconnaissance commands or utilizes tools to enumerate domain trusts, users, and groups from an IP address authenticated to the internal network.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, ADFS Servers, Partner-accessible Application Servers, Jump Boxes",
            "action": [
              "Monitor Windows Event ID 4688 (Process Creation) logs for processes initiated from partner-associated accounts or IP ranges. Generate an alert upon the execution of specific reconnaissance commands (e.g., `nltest /domain_trusts`, `net group 'Domain Admins' /domain`, `AdFind.exe -f objectcategory=trusteddomain`) or for suspicious User-Agents (e.g., 'Nmap Scripting Engine', 'PowerShell-AD-Recon') in Zeek http.log.",
              "For each partner user account, establish a baseline of commonly executed processes and command-line argument patterns. Calculate the entropy of the command line for each new process execution. Generate an alert if the entropy score for a command exceeds the 95th percentile of the user's historical activity, particularly if the process is not on their typical execution list.",
              "Train a one-class SVM or Isolation Forest model on tokenized command-line arguments historically used by partner accounts. Classify new command executions in real-time. Generate an alert for any command whose arguments are flagged as an outlier by the model, indicating novel or suspicious tool usage inconsistent with established trust relationships."
            ]
          },
          {
            "description": "An IP address from an external or partner network demonstrates network or port scanning behavior, characterized by a high fan-out of connections to many unique hosts or ports, often with a high rate of failed or unanswered connection attempts.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Perimeter Firewalls, DMZ Segments, VPN Concentrators, Cloud Security Group Logs",
            "action": [
              "Continuously correlate source IPs from Zeek conn.log against public and internal blocklists of known internet scanners (e.g., Shodan, Censys, GreyNoise) and previously identified malicious actors. Generate a high-priority alert for any matches exhibiting a high connection rate.",
              "In a 5-minute sliding window, calculate the fan-out ratio (unique destination IPs / total connections) and the Shannon entropy of destination ports for each external source IP in Zeek conn.log. Generate an alert for any source IP where these metrics exceed 3 standard deviations from the established baseline for its network segment. Increase the alert's priority if the ratio of failed connection states (e.g., 'REJ', 'S0') for that source IP is also anomalously high.",
              "Apply a DBSCAN clustering algorithm to connection metadata from Zeek conn.log, using features such as source IP, destination port, connection state, duration, and total bytes. Identify source IPs that are classified as noise points or form small, distinct clusters, as their behavior deviates from the large clusters representing legitimate traffic patterns, indicating potential scanning activity."
            ]
          },
          {
            "description": "An external or partner source IP initiates DNS queries indicative of enumeration, including zone transfer requests (`AXFR`), or exhibits a statistically significant increase in subdomain query entropy or the rate of NXDOMAIN responses.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative and Recursive DNS Servers, Domain Controllers",
            "action": [
              "Create a high-priority alert for any DNS query of type `AXFR` or `IXFR` observed in Zeek dns.log originating from an IP address not on an explicit allowlist of authorized DNS servers or administrative hosts.",
              "For each external source IP, calculate the Shannon entropy of the queried subdomains (e.g., entropy of `[api, www, ftp]` for `example.com`) and the ratio of NXDOMAIN responses to total queries within a 1-minute window. Generate an alert if either the entropy score or the NXDOMAIN ratio exceeds the 98th percentile of the historical baseline for that network segment.",
              "Train a Gradient Boosting or Random Forest classifier to distinguish between benign and malicious DNS query sequences from a single source. Use features such as query type distribution, query name length statistics, subdomain entropy over a window, and the time delta between consecutive queries. Apply the trained model to real-time query streams to classify source IP behavior as potential reconnaissance."
            ]
          },
          {
            "description": "An authenticated partner account accesses an anomalously high number of distinct network shares or files, deviating significantly from both their individual behavioral baseline and the typical behavior of their assigned peer group.",
            "data_sources": [
              "Windows Event ID 5140",
              "Windows Event ID 4663",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File Servers, SharePoint Sites, Code Repositories accessible by partners",
            "action": [
              "Deploy and monitor a honeypot network share (e.g., a share named `_Confidential-Partner-Access-Keys`) with detailed file access auditing enabled (Windows Event IDs 5140, 4656, 4663). Generate a high-fidelity alert for any access attempt, as no legitimate traffic should ever target this resource.",
              "For each authenticated partner account, establish a baseline of the number of unique network shares accessed (Event ID 5140) per hour. Generate an alert if the number of unique shares accessed in a single hour exceeds 3 standard deviations above the user's 30-day rolling average, indicating unusually broad enumeration activity.",
              "Utilize peer group analysis by clustering partner accounts based on their resource access patterns (features: set of shares accessed, access time-of-day distribution, read/write ratios). An alert is generated if a user's activity vector causes them to shift significantly away from their established cluster's centroid or be reclassified into a different peer group, indicating a behavioral deviation from their established role."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]