[
  {
    "information_requirement": "Is an adversary performing WHOIS reconnaissance against our organization's domains or related infrastructure? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.002",
        "name": "WHOIS",
        "evidence": [
          {
            "description": "An internal host establishes a connection over TCP port 43 or to a known web-based WHOIS service, where the destination IP or domain is flagged on a threat intelligence feed as malicious or associated with reconnaissance campaigns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Web Proxies)",
            "action": [
              "Create and maintain a watchlist of malicious WHOIS service IPs and domains from threat intelligence feeds. Query Zeek conn.log for destination port 43 and Zeek http.log for destination hosts. Generate an alert when a destination matches the watchlist.",
              "For all outbound connections on port 43 or to known WHOIS sites, calculate the daily connection count per source host. Establish a 30-day baseline for all hosts. Flag any host whose daily count exceeds the 95th percentile of its historical activity or its peer group's activity (e.g., 'Developer Workstations').",
              "Apply a pre-trained classification model (e.g., Random Forest) to score the reputation of WHOIS destination domains. Use features such as domain age, registration details, SSL certificate attributes from Zeek ssl.log, and historical query volume from internal logs. Alert on any destination domain receiving a 'malicious' score above a predefined confidence threshold."
            ]
          },
          {
            "description": "An outbound HTTP/S request to a WHOIS lookup website contains a User-Agent string matching a known reconnaissance tool (e.g., 'python-whois', 'recon-ng'), or the URL query parameters suggest rapid, automated enumeration of domains.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Proxy Servers and DNS Resolvers",
            "action": [
              "Maintain a list of User-Agent strings associated with reconnaissance tools. Create a detection rule to search the 'user_agent' field in Zeek http.log for matches in requests to known WHOIS sites (identified via SNI in ssl.log or a static list). Alert on any match.",
              "For each source IP making WHOIS queries, calculate the Shannon entropy of the queried second-level domains within a 5-minute window using Zeek dns.log or http.log. Alert if the entropy score exceeds 3 standard deviations above the host's 30-day baseline, indicating non-random, automated enumeration.",
              "Train a sequence classification model (e.g., LSTM) on URL query parameter sequences from Zeek http.log, using labeled benign (manual lookups) and malicious (automated enumeration) data. Deploy the model to classify new query sequences in real-time and alert on those classified as 'suspicious' or 'automated'."
            ]
          },
          {
            "description": "An internal host initiates WHOIS queries (via TCP port 43 or web requests) at a volume or frequency that is a statistical outlier compared to its own historical baseline or the baseline of its assigned peer group.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points and Endpoint Devices",
            "action": [
              "Implement a simple threshold rule to alert if any single host generates more than 50 WHOIS queries (identified via destination port 43 in conn.log or destination host in http.log) within a 1-hour period. Tune threshold based on organizational norms.",
              "For each host, compute a 30-day moving average and standard deviation of its hourly WHOIS query volume. Generate an alert if the current hourly query count exceeds the moving average by more than 3 standard deviations.",
              "For each host, apply a time series forecasting model (e.g., ARIMA or Prophet) to its WHOIS query volume. Generate an alert when the observed query count significantly deviates from the forecasted value's confidence interval, indicating a break from the established temporal pattern."
            ]
          },
          {
            "description": "A host not belonging to an authorized group (e.g., Security Operations, Network Engineering) is observed performing WHOIS queries against the organization's own domains, IP ranges, or known typosquatted variations.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Network Segments and Identity and Access Management (IAM) Systems",
            "action": [
              "Maintain a list of the organization's critical assets (domains, IP ranges, typosquats) and a list of authorized user/host groups. Create a SIEM rule to alert when a WHOIS query for a critical asset originates from a host not in the authorized group.",
              "Analyze the distribution of source subnets for WHOIS queries targeting internal assets. If a specific asset is suddenly queried from a subnet that has historically shown zero or near-zero activity for this behavior (e.g., a jump from the 10th to the 99th percentile of activity), flag for investigation.",
              "Use unsupervised clustering (e.g., k-means) to group internal hosts based on network behavior profiles (e.g., protocols used, services accessed). If a host from a 'low-privilege' or 'standard-user' cluster initiates a WHOIS query for a sensitive internal asset, classify this as a high-fidelity anomaly and alert."
            ]
          },
          {
            "description": "A WHOIS query from an internal host is temporally correlated with subsequent network scanning or connection attempts from the same host to the infrastructure identified in the query result, indicating a 'recon-to-action' behavioral chain.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints, Internal Network Segments, and Network Egress Points",
            "action": [
              "Create a stateful correlation rule that triggers if Event A (a WHOIS query from source IP 'X') is followed within 15 minutes by Event B (a port scan, indicated by many connections to different ports, or numerous failed connections from source IP 'X' to a new destination), using Zeek conn.log and Windows Event ID 5156.",
              "For each host performing a WHOIS query, calculate the ratio of connections to 'new' destination IPs (not seen in the host's 24-hour baseline) versus 'old' IPs in the subsequent 30-minute window. A ratio exceeding the 95th percentile of the host's historical norm suggests discovery-driven targeting.",
              "Develop and apply a Hidden Markov Model (HMM) where states represent adversary tactics ('Recon', 'Scan', 'Connect') and observations are log events (e.g., 'whois_query', 'port_sweep_detected', 'new_connection_failure'). Alert when a sequence of observations from a single host transitions from a 'whois_query' to a 'Scan' or 'Connect' state with high probability."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]