[
  {
    "information_requirement": "Is the adversary using network address translation traversal to evade defenses and access restricted network segments? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1599.001",
        "name": "Network Address Translation Traversal",
        "evidence": [
          {
            "description": "A network connection is established from an internal host to an external IP address and port combination that is present on a threat intelligence feed and categorized as a malicious STUN, TURN, or NAT traversal service.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Routers)",
            "action": [
              "Query Zeek conn.log and Windows Event ID 5156 logs for connections where the destination IP (`id.resp_h` or `DestinationAddress`) is present on a threat intelligence feed categorized as 'NAT-Traversal' or 'Malicious Infrastructure'. Generate an alert for any match, prioritizing connections to destination ports 3478 (STUN) or 5349 (STUN-TLS).",
              "For each host, calculate a 24-hour rolling ratio of connections to malicious NAT-related IPs versus total external connections. Establish peer group baselines (e.g., workstations, developers, servers) and alert when a host's ratio exceeds the 95th percentile for its group.",
              "Develop and apply a Random Forest classification model to real-time connection data. Use features from Zeek conn.log and Windows Event ID 5156 (e.g., destination port, protocol, data volume, connection duration) enriched with threat intelligence labels to score and predict the likelihood that a new connection is facilitating malicious NAT traversal."
            ]
          },
          {
            "description": "The presence of STUN protocol messages, identified by the magic cookie 0x2112A442 in the UDP payload, is observed in network traffic originating from assets not authorized for WebRTC or VoIP services, such as database servers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek stun.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Network Segments (e.g., Server VLANs, User Subnets)",
            "action": [
              "Implement and monitor a SIEM rule or Zeek signature that inspects UDP payloads for the STUN magic cookie (0x2112A442). Generate a high-priority alert if the source IP belongs to a list of unauthorized assets (e.g., database servers, domain controllers) or a subnet where P2P communication is forbidden by policy.",
              "For each host, calculate a 1-hour moving average and standard deviation of STUN message counts from `stun.log`. Generate an alert when a host's STUN activity exceeds 3 standard deviations (a Z-score > 3) above its moving average, indicating a sudden and anomalous spike.",
              "Apply an Isolation Forest anomaly detection model to features from `stun.log` and `conn.log`, including source port, transaction ID entropy, and request frequency. Train the model on a baseline of legitimate STUN traffic (e.g., from approved VoIP or collaboration tools) to identify and alert on outlier sessions that do not conform to established patterns."
            ]
          },
          {
            "description": "An SSDP (UDP port 1900) M-SEARCH or NOTIFY message from an internal host not on the UPnP-authorized allowlist results in a new, externally-accessible port mapping.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek ssdp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Gateway Devices and Internal Host Subnets",
            "action": [
              "Create a correlation rule that triggers when an SSDP M-SEARCH or NOTIFY message (UDP port 1900) is observed from a host not on the UPnP-authorized allowlist. Correlate this event with subsequent inbound connections from an external IP to the original source host to confirm a successful unauthorized port mapping.",
              "Maintain an allowlist of hosts authorized for UPnP. For all hosts, calculate the daily count of new UPnP port mapping events. Alert on any request from a host not on the allowlist or when an authorized host's daily request count exceeds the 99th percentile of its own 30-day historical distribution.",
              "Utilize an ARIMA or similar time-series forecasting model on the aggregate volume of UPnP/SSDP traffic (from `Zeek ssdp.log` or traffic to UDP port 1900) for critical subnets. Generate an alert when the observed traffic volume significantly deviates from the model's predicted confidence interval, suggesting anomalous or coordinated UPnP activity."
            ]
          },
          {
            "description": "A temporal correlation is observed between STUN/TURN protocol usage from an internal host and a subsequent, long-duration (>1 hour) UDP or TCP connection between the same internal host and a new, non-CDN external IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek stun.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points",
            "action": [
              "Implement a stateful correlation rule that first identifies an internal host using STUN/TURN protocols (via `stun.log`). If that same host then establishes a long-duration (>1 hour) TCP or UDP connection to a new external IP not known to be a CDN or legitimate STUN/TURN server, generate an alert.",
              "For every connection that occurs within 5 minutes after a STUN transaction by the same host, calculate the Z-score for both the connection duration and the total bytes transferred, using the host's historical baseline for that protocol. Generate an alert if both the duration and byte count Z-scores are greater than 2.5, indicating an unusually long and high-volume session.",
              "Apply a DBSCAN clustering algorithm to post-STUN connection data. Use features like connection duration, total bytes, and destination IP reputation to group sessions into clusters. Treat connections that are flagged as noise (i.e., do not belong to any major cluster) as high-confidence anomalies indicative of atypical P2P or C2 channels."
            ]
          },
          {
            "description": "A connection from an internal host to an external IP address is logged on the endpoint but is not observed at the designated network egress point, indicating a routing policy violation or a compromised routing device.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoints, Internal Network Segments, and Network Egress Points",
            "action": [
              "Join endpoint connection logs (Windows Event ID 5156) with perimeter network logs (Zeek conn.log from an egress sensor) on a composite key (source IP, dest IP, dest port, protocol) over a 1-minute window. Generate an alert for any external connection logged by the endpoint that does not have a corresponding record at the perimeter.",
              "For critical server subnets, sample connection data hourly. Calculate the percentage of external connections that are successfully logged at both the endpoint (Windows Event ID 5156) and the perimeter (Zeek conn.log). Alert if this percentage drops below a statistically significant threshold (e.g., below the 1st percentile of its historical daily values).",
              "Construct a network graph where nodes are hosts and edges represent observed communication paths. Use a pathfinding algorithm to identify the standard egress path for each subnet. Train a model to recognize these paths. Apply the model in real-time to flag any connection from a host to an external IP that deviates from its subnet's established egress path."
            ]
          },
          {
            "description": "A single internal source IP initiates outbound UDP connections to more than 50 distinct, high-numbered destination ports (>1024) on one or more external IPs within a 60-second time frame, consistent with a UDP hole punching attempt.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal Host Subnets and Network Egress Points",
            "action": [
              "Create a SIEM rule that counts distinct destination ports per source IP for outbound UDP traffic over a 60-second window. Generate an alert if a single source IP (`id.orig_h` or `SourceAddress`) connects to >50 unique destination ports above 1024.",
              "For each internal host, calculate the Shannon entropy of destination ports for all outbound UDP connections within a 5-minute sliding window. Establish a per-host baseline entropy value. Generate an alert when a host's port entropy exceeds the 98th percentile of its historical baseline, indicating a high degree of randomness characteristic of hole punching.",
              "Train a One-Class SVM model using features from normal outbound UDP traffic, such as packets-per-second, unique destination ports per minute, and destination port entropy. Apply the model to classify 1-minute windows of each host's activity as 'normal' or 'anomalous', with 'anomalous' indicating a likely hole punching attempt."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]