[
    {
        "information_requirement": "Is the adversary performing reconnaissance using spearphishing links?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1598.003",
                "name": "Spearphishing Link",
                "evidence": [
                    {
                        "description": "Outbound network traffic from user endpoints to domains or IP addresses known to be associated with phishing or reconnaissance campaigns.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate domains queried (Zeek dns.log), destination IPs connected to (Zeek conn.log), and hosts requested (Zeek http.log 'host' header) against a high-confidence threat intelligence feed of known phishing, credential harvesting, or reconnaissance infrastructure, updated at least daily. Generate an alert for any matches from user subnets and investigate the associated user and endpoint."
                    },
                    {
                        "description": "User-initiated DNS queries or HTTP requests for URLs exhibiting common phishing or obfuscation patterns, such as typosquatting, use of URL shorteners, or inclusion of credential-related keywords.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek dns.log for queried domains that are visually similar to legitimate company or popular service domains (typosquatting). Monitor Zeek http.log for requests to known URL shortening services that could hide malicious destinations. Use regular expressions to search HTTP request URIs for patterns common in phishing URLs, such as 'login', 'password', 'verify', 'account', combined with the company name. Use entropy measures on subdomain labels or URL paths to find randomized/generated strings common in large-scale phishing campaigns."
                    },
                    {
                        "description": "An unusual spike in outbound connections from multiple distinct user endpoints to a single, newly observed, or low-reputation external domain, suggesting a coordinated spearphishing campaign.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate DNS queries (Zeek dns.log) and connections (Zeek conn.log) by destination domain/IP across the entire user base. Establish a baseline for normal traffic patterns. Use time series analysis to detect sudden spikes in requests to a single destination from multiple distinct internal sources within a short time frame (e.g., minutes to hours). For newly seen domains, check domain age and reputation; flag traffic to domains that are very new (<30 days) and receiving anomalous request volumes. Use descriptive statistics (e.g., frequency counts, percentiles) to identify destination domains that are statistical outliers in terms of the number of unique internal clients connecting to them."
                    },
                    {
                        "description": "A browser process on an endpoint, shortly after being launched, makes an HTTP POST request containing form data to a newly observed or low-reputation external domain.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process creation events (Windows Event ID 4688) for browsers (e.g., chrome.exe, firefox.exe, msedge.exe) with subsequent network connections from that endpoint. Monitor Zeek http.log for HTTP POST requests originating from user subnets. Join this data on timestamp and source IP. Flag instances where a browser process makes a POST request to an external domain that is newly observed, has a low reputation, or is a statistical outlier (i.e., a low-frequency destination for POST requests across the enterprise). This behavior is highly indicative of credential submission to a phishing page."
                    },
                    {
                        "description": "A user endpoint makes a DNS query to a suspicious domain, followed immediately by a short-lived connection with minimal data transfer, potentially indicating a reconnaissance 'pingback' to validate the target.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log for queries to suspicious domains (e.g., newly registered, high entropy, known dynamic DNS providers). Correlate the DNS response with a subsequent TCP/UDP connection in Zeek conn.log from the same source IP to the resolved destination IP within seconds. Analyze the connection details: flag sessions with a completed TCP handshake followed by a quick termination (FIN/RST) and minimal or zero application data bytes transferred. Use correlation analysis to link the DNS query and the short-lived connection, and descriptive statistics on the 'orig_bytes' and 'resp_bytes' fields to identify these low-data connections as potential reconnaissance pings."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
