[
  {
    "information_requirement": "Is an adversary actively gathering information about our organization's domain properties for targeting? (PIR)",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.001",
        "name": "Domain Properties",
        "evidence": [
          {
            "description": "An external IP address, present on a high-confidence threat intelligence feed, performs a DNS query for a corporate domain or initiates a connection to a public-facing corporate service.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External-facing DNS Resolvers, Network Perimeter Firewalls, Web Application Firewalls",
            "action": [
              "Join Zeek dns.log and conn.log on the source IP (`id.orig_h`). Compare this IP against a threat intelligence feed of known malicious scanners or command and control servers. Generate a high-severity alert for any match.",
              "For source IPs not on a threat list, calculate the historical query count per source Autonomous System Number (ASN) against your domain. Establish a baseline (e.g., 95th percentile). Generate an alert when a source IP from a previously unseen or rare ASN exceeds this query count baseline in a 1-hour window.",
              "Train a supervised classification model (e.g., Random Forest) using labeled data of past benign and malicious reconnaissance IPs. Engineer features such as source ASN, source country, time of day, number of connections, and number of DNS queries in a 5-minute window. Use the trained model to classify new, unseen source IPs in near real-time and alert on those classified as malicious."
            ]
          },
          {
            "description": "An HTTP/S request targeting a public-facing web server or cloud API endpoint contains a User-Agent string or URI parameter that matches a known domain reconnaissance tool signature.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing Web Servers, Cloud API Gateways, Reverse Proxies",
            "action": [
              "Apply a list of regular expressions for known reconnaissance tool signatures (e.g., 'aquatone', 'ffuf', 'gobuster', 'sublist3r') to the `user_agent` and `uri` fields in Zeek http.log. Generate a medium-severity alert on any match.",
              "For each source IP, calculate the Shannon entropy of the requested URI paths over a 5-minute sliding window. Establish a baseline entropy value for normal traffic. Generate an alert when a source IP's URI entropy exceeds the 99th percentile of the baseline, which indicates probable automated directory or subdomain enumeration.",
              "Develop and apply a character-level Convolutional Neural Network (CNN) to classify `user_agent` strings. Train the model on a large dataset to distinguish between legitimate browsers, benign automated clients (e.g., search engine crawlers), and malicious reconnaissance tools. Flag any User-Agent classified as malicious, especially those not caught by symbolic signatures."
            ]
          },
          {
            "description": "Execution of a network utility (e.g., nslookup.exe, whois.exe, Resolve-DnsName) with command-line arguments targeting external domains, originating from an unusual user context or parent process.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Endpoint Workstations, Member Servers, Privileged Access Workstations",
            "action": [
              "Create a detection rule that triggers on a process creation event (Windows Event ID 4688) for `nslookup.exe`, `whois.exe`, or PowerShell's `Resolve-DnsName` cmdlet where the parent process is not `explorer.exe`, `cmd.exe`, or `powershell.exe`, or where the executing user account type is a service account.",
              "For each host, establish a 30-day baseline of the frequency and command-line argument patterns for network utility executions. Generate an alert if the daily count of such executions by a single user or on a single host exceeds three standard deviations from its mean, or if the command-line arguments contain an unusual number of distinct domains.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to process execution events. Use features such as process name, command-line argument length and entropy, parent process name, and user session type (interactive vs. non-interactive). Isolate and investigate clusters that represent outliers from the main clusters of normal administrative and user activity."
            ]
          },
          {
            "description": "A single external source IP generates a high volume of DNS queries for an organization's domain, resulting in a high ratio of NXDOMAIN (non-existent domain) responses within a short time frame.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External-facing DNS Resolvers, Internal Recursive DNS Servers that log queries",
            "action": [
              "For each external source IP (`id.orig_h`), create a rule that alerts if the count of DNS queries with an `NXDOMAIN` response (`rcode_name`) for the same second-level domain exceeds a static threshold (e.g., 50 queries in 1 minute).",
              "Within a 5-minute window, calculate two metrics per external source IP: 1) The ratio of NXDOMAIN responses to total queries for your domain. 2) The Shannon entropy of the queried subdomain labels. Generate an alert if the NXDOMAIN ratio exceeds the 98th percentile of the baseline for all external sources AND the subdomain entropy is anomalously high.",
              "Implement a time-series anomaly detection model (e.g., Seasonal-ARIMA or LSTM) to forecast the expected volume of DNS queries and the NXDOMAIN rate from external sources. Monitor the forecast error (residual). A significant, sustained spike in the residual for a specific source IP indicates an anomaly that should be investigated."
            ]
          },
          {
            "description": "An external source IP establishes connections to an anomalously high number of distinct internal hosts or distinct service ports within a short time frame, indicative of a network sweep or service scan.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Perimeter Firewalls, Demilitarized Zone (DMZ) segments, Public-facing Application Servers",
            "action": [
              "Generate an alert for any event logged by Zeek's built-in portscan detector in `portscan.log` where the scan originates from an external IP address. This provides a low-fidelity but immediate signal.",
              "From Zeek conn.log, group by external source IP (`id.orig_h`) and count the number of distinct destination hosts (`id.resp_h`) and distinct destination ports (`id.resp_p`) within a 5-minute window. Alert if either count exceeds the 99.5th percentile of a 7-day rolling baseline for external traffic, indicating horizontal or vertical scanning.",
              "Use an unsupervised clustering model (e.g., K-Means or a Gaussian Mixture Model) on aggregated connection data per source IP. Engineer features for each 5-minute window: count of distinct destination IPs, count of distinct destination ports, ratio of SYN packets to total packets, and average connection duration. Identify and alert on clusters that represent scanning behavior."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]