[
  {
    "information_requirement": "(PIR) Is an adversary conducting active network reconnaissance against our external perimeter?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590",
        "name": "Gather Victim Network Information",
        "evidence": [
          {
            "description": "An external source IP address, listed on a high-confidence threat intelligence feed as malicious or a known scanner, initiates one or more connections to any IP address within the organization's registered external network ranges.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network perimeter firewalls, cloud security groups, web application firewalls, and VPN concentrators.",
            "action": [
              "Join network connection logs (Zeek conn.log) against a threat intelligence database of known malicious IP addresses. Generate a high-priority alert for any connection where the source IP (`id.orig_h`) matches an entry in the threat intelligence feed.",
              "For any IP matching the threat intelligence feed, calculate the number of distinct destination ports and distinct destination hosts contacted within a 1-hour window. Compare these counts to a pre-computed baseline for all external traffic. Flag any source IP exceeding the 95th percentile for either metric as potentially hostile scanning activity.",
              "Utilize a pre-trained classification model (e.g., Random Forest, Logistic Regression) to score connection events from threat intelligence-matched IPs. Features should include connection count, destination port diversity, packet size statistics (mean, stdev), protocol, and the threat intelligence category (e.g., 'scanner', 'C2', 'TOR'). A probability score exceeding a defined threshold (e.g., 0.85) indicates a high likelihood of malicious reconnaissance."
            ]
          },
          {
            "description": "Network traffic from a single external source IP contains artifacts uniquely associated with reconnaissance tools (e.g., Nmap, Masscan, Nuclei) within a 5-minute window. Artifacts include specific HTTP User-Agent strings, TLS JA3/JA3S hashes, or protocol handshake anomalies.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web servers, application load balancers, and reverse proxies.",
            "action": [
              "Continuously monitor the `user_agent` field in Zeek http.log against a list of regular expressions for known scanner tools (e.g., 'Nmap Scripting Engine', 'masscan', 'zgrab', 'nuclei', 'sqlmap'). Additionally, monitor Zeek notice.log for native alerts such as `Scan::Port_Scan` or `Nmap::OS_Scan`.",
              "For each source IP, calculate the ratio of requests containing a scanner signature to the total number of requests from that IP within a 10-minute window. Flag any IP where this ratio exceeds 0.5 and the total request count is > 10. Also, track the count of unique tool signatures per IP; an IP using multiple different scanner signatures in a short time frame is highly suspicious.",
              "Implement a time series anomaly detection model (e.g., Seasonal ARIMA or LSTM) on the aggregate count of all scanner signature matches per minute across the entire network perimeter. An alert is triggered when an observed spike in signature matches significantly exceeds the model's forecasted upper confidence bound, indicating a potential large-scale or coordinated scanning campaign."
            ]
          },
          {
            "description": "A single external source IP exhibits scanning behavior, defined as either a horizontal scan (connecting to >20 unique hosts on the same port in <1 minute) or a vertical scan (connecting to >50 unique ports on the same host in <1 minute).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek scan.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All network egress and ingress points, including physical datacenter firewalls, cloud network boundaries (e.g., VPCs), and DMZ segments.",
            "action": [
              "Leverage Zeek's built-in scan detection by monitoring `scan.log` for `Scan::Port_Scan` and `Scan::Address_Scan` notices. For manual verification, query Zeek conn.log to count distinct `id.resp_h` per `id.orig_h` and `id.resp_p` over 1-minute windows (horizontal), and distinct `id.resp_p` per `id.orig_h` and `id.resp_h` (vertical). Alert if counts exceed defined thresholds (e.g., 20 hosts, 50 ports).",
              "For each external source IP, calculate the Shannon entropy of the destination IP addresses and destination ports it connects to in a 5-minute sliding window. A high entropy score for destination IPs (e.g., >3.0) on a single port suggests a horizontal scan. A high entropy score for destination ports on a single destination IP suggests a vertical scan. Compare scores against a baseline of normal traffic to identify significant deviations.",
              "Apply a density-based clustering algorithm (e.g., DBSCAN) to connection data tuples of (Source IP, Destination IP, Destination Port). Normal traffic patterns will form dense clusters. Scanning activity, characterized by a single source connecting to many disparate destinations, will be identified by the algorithm as noise or outlier points. Automatically tag these outlier connection events as potential reconnaissance for analyst investigation."
            ]
          },
          {
            "description": "An external source IP generates a high ratio of HTTP client error responses (4xx) to success responses (2xx), such as a ratio greater than 5:1 with over 100 total requests in 10 minutes, indicative of forced browsing or content discovery.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web servers, APIs, and content delivery networks (CDNs).",
            "action": [
              "Scan the `uri` field in Zeek http.log for requests from external IPs that match a watchlist of sensitive file paths, directories, or extensions (e.g., `/.git/`, `/.env`, `/wp-config.php`, `/.bak$`, `/api/v1/users`). Generate a high-priority alert for any match.",
              "For each external source IP in Zeek http.log, compute the ratio of 4xx status codes to 2xx status codes over a 10-minute sliding window. Flag any IP where this ratio exceeds 5:1 and the total request count is > 100. Additionally, establish a 99th percentile baseline for the count of 404 Not Found responses per source IP over 24 hours and alert on any IP exceeding this threshold within a single hour.",
              "Train a time series forecasting model (e.g., Prophet, which handles seasonality well) on the historical volume of 4xx errors per minute for the entire web server farm. The model will predict the expected error count and a confidence interval. An observed error count that significantly breaches the upper bound of the prediction interval suggests an anomalous event, such as a large-scale forced browsing attack, and should trigger an alert."
            ]
          },
          {
            "description": "An external source IP either (1) issues an unauthorized DNS zone transfer request (AXFR/IXFR), or (2) generates a large volume of DNS queries resulting in NXDOMAIN responses (e.g., >100 in 5 minutes), indicating subdomain enumeration.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative external and internal DNS servers, and recursive DNS resolvers.",
            "action": [
              "Create a watchlist of authorized DNS servers permitted to perform zone transfers. Monitor Zeek dns.log for any query where `qtype_name` is 'AXFR' or 'IXFR' and the source IP (`id.orig_h`) is not on the authorized watchlist. Generate an immediate, high-severity alert for any such attempt.",
              "For each source IP in Zeek dns.log, count the number of responses where `rcode_name` is 'NXDOMAIN' within a 5-minute sliding window. Establish a dynamic threshold at the 99th percentile of the NXDOMAIN count from all external IPs over the preceding 24 hours. Alert if any source IP's count exceeds this dynamic threshold.",
              "Employ an unsupervised anomaly detection model (e.g., Isolation Forest) to profile normal DNS query behavior for external sources. Features for the model should include query rate, distribution of query types (A, AAAA, MX, etc.), query name length, and the rate of NXDOMAIN responses. The model will assign an anomaly score to new query patterns; a score exceeding a tuned threshold indicates a significant deviation from normalcy, consistent with subdomain brute-forcing, and should be flagged for review."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]