[
  {
    "information_requirement": "Is the adversary performing reconnaissance by searching open websites and domains for information about our organization?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1593",
        "name": "Search Open Websites-Domains",
        "evidence": [
          {
            "description": "A connection from an external source IP or using a User-Agent string that matches a known malicious signature from a threat intelligence feed, targeting a public-facing web asset.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web servers and reverse proxies",
            "action": [
              "Symbolic: Query Zeek http.log and conn.log for source IPs and User-Agent strings that match a high-confidence threat intelligence feed of known malicious scanners and reconnaissance tools (e.g., ZGrab, Nuclei, specific nmap scripts).",
              "Statistical: For traffic to public web servers, establish a baseline of common User-Agent strings. Calculate the rarity of each observed User-Agent. Flag User-Agents that are statistically rare (e.g., seen in less than 0.1% of requests) and originate from IPs not associated with legitimate services like search engine crawlers.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled datasets of benign and malicious web requests, using features like User-Agent string characteristics, source IP reputation, and request headers. Apply the model in real-time to classify incoming requests and alert on those predicted as malicious reconnaissance."
            ]
          },
          {
            "description": "A single external source IP address generates a high volume of HTTP requests to a public web server, where the ratio of client errors (e.g., HTTP 404, 403) to successful requests (HTTP 200) exceeds a defined threshold (e.g., > 75%) within a short time window (e.g., 5 minutes).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Public-facing web servers",
            "action": [
              "Symbolic: Create a rule to alert when a single source IP generates more than 100 requests resulting in a 404 status code within a 1-minute window to any public web server.",
              "Statistical: For each source IP interacting with public web servers, calculate the 95th percentile of the request rate and the ratio of 4xx/5xx to 2xx status codes over a 10-minute sliding window. Alert on IPs exceeding these statistical baselines by more than 3 standard deviations.",
              "Machine Learning: Use a time-series anomaly detection model (e.g., ARIMA) on the volume of 404 errors per source IP. The model, trained on historical data, will forecast expected error counts. Alert when the observed count significantly deviates from the forecasted range, indicating a potential brute-force or enumeration attack."
            ]
          },
          {
            "description": "An unauthorized external IP address requests a DNS zone transfer (AXFR), or a single external IP generates a high rate of DNS queries for the organization's domain, resulting in a high ratio of NXDOMAIN responses.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "External DNS servers",
            "action": [
              "Symbolic: Monitor Zeek dns.log for any DNS query with qtype 'AXFR' or 'IXFR' originating from an IP not on an approved list of secondary DNS servers and generate a high-priority alert.",
              "Statistical: For each source IP querying the external DNS server, calculate the entropy of the requested subdomains (qname field in Zeek dns.log) over a 5-minute window. A sustained entropy score above a pre-calculated baseline threshold indicates a likely subdomain enumeration attempt. Also, flag IPs where the ratio of NXDOMAIN responses exceeds 80% of their total queries.",
              "Machine Learning: Develop a clustering model (e.g., K-Means) to group external source IPs based on DNS query features like query rate, NXDOMAIN ratio, and qname entropy. Periodically analyze clusters and flag those exhibiting characteristics of reconnaissance (high rate, high NXDOMAIN ratio, high entropy) as anomalous."
            ]
          },
          {
            "description": "A statistically significant increase in failed authentication attempts (Windows Event ID 4625) against external-facing services for a set of user accounts, where the increase occurs within 30 days following the appearance of those accounts' credentials in a monitored public data breach.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, Externally-facing authentication servers (e.g., ADFS, Exchange), Remote Desktop Gateway servers",
            "action": [
              "Symbolic: Cross-reference the usernames from a breached credential intelligence feed against authentication logs (Windows Event ID 4625) for externally-facing services. Generate an alert for any failed login attempt for a username that appears on the breach list within the last 90 days.",
              "Statistical: For each user account, establish a baseline of failed login attempts per hour. After an account appears in a public breach, monitor for a statistically significant increase (e.g., count exceeding 3 standard deviations above the mean) in failed logins for that specific account. Correlate with Zeek conn.log to verify the attempts are from external IP addresses.",
              "Machine Learning: Apply a change point detection algorithm to the time series of failed login events for high-value user accounts or accounts known to be in recent breaches. An algorithm-detected change point, indicating a sudden and sustained shift in the rate of failed logins, should be flagged for investigation as a potential credential stuffing attack."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]