[
  {
    "information_requirement": "Is the adversary gathering information about our organization via its Content Delivery Networks (CDNs)?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.004",
        "name": "CDNs",
        "evidence": [
          {
            "description": "An HTTP request to a CDN-hosted asset originates from an IP address on a threat intelligence blocklist, or the request contains a User-Agent string matching a known reconnaissance tool (e.g., Nuclei, Nmap, Zgrab, Dirb), as observed in network logs.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Web application firewalls (WAFs), CDN management consoles, Network Security Monitoring (NSM) sensors",
            "action": [
              "Symbolic: Correlate the `id.orig_h` field from Zeek conn.log and the `user_agent` field from Zeek http.log against subscribed threat intelligence feeds for malicious scanners, TOR exit nodes, and reconnaissance tools. Generate an alert for any match.",
              "Statistical: For source IPs not on a blocklist, calculate the request rate to CDN assets per minute. Compare each IP's request rate to the 95th percentile of request rates for all external IPs over the last 24 hours. Flag IPs with rates exceeding this dynamic threshold for review.",
              "Machine Learning: Deploy a pre-trained classification model (e.g., logistic regression) that scores incoming HTTP requests on a scale of 0 to 1. Features should include source IP reputation, ASN, User-Agent string rarity, request header count, and presence of anomalous headers. A probability score greater than 0.9 indicates a likely reconnaissance attempt."
            ]
          },
          {
            "description": "An external source IP makes one or more HTTP requests to sensitive or non-public URL paths on a CDN-hosted asset (e.g., /.git/config, /.env, /actuator/health), particularly if the server responds with an HTTP 4xx or 5xx status code.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web servers hosting CDN content, Application log aggregators, SIEM",
            "action": [
              "Symbolic: Maintain a watchlist of sensitive URI paths (e.g., `/.git/config`, `/.env`, `/actuator/health`, `/phpinfo.php`). Implement a detection rule that triggers an alert when the `uri` field in Zeek http.log for a request from an external IP matches an entry on this list.",
              "Statistical: For each external source IP, calculate the ratio of HTTP 4xx/5xx responses to total requests within a 5-minute window, provided the IP has made at least 10 requests. Flag IPs whose error rate exceeds 3 standard deviations above the mean error rate for all external IPs in the same period, suggesting enumeration.",
              "Machine Learning: Utilize a sequence analysis model (e.g., LSTM) to analyze the sequence of `uri` paths requested by a single source IP. Train the model on benign user browsing sequences from historical Zeek http.log data. Flag sequences that the model identifies as having a low probability of being a normal user session, indicating automated probing."
            ]
          },
          {
            "description": "A single external source IP exhibits scanning behavior, characterized by either a high volume of DNS queries for varied subdomains (subdomain enumeration) or HTTP requests to a large number of unique URL paths with high character entropy (directory bruteforcing) within a short time frame.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authoritative and recursive DNS servers, Internet gateway, Network Security Monitoring (NSM) sensors",
            "action": [
              "Symbolic: Implement a rule that alerts when a single source IP in Zeek dns.log is the source of more than 50 queries that result in an NXDOMAIN response within a 1-minute window, indicating potential subdomain enumeration.",
              "Statistical: For each source IP in Zeek http.log, calculate the Shannon entropy of the character set in the `uri` field across all requests within a 10-minute window. Establish a baseline for normal entropy from typical user traffic. Flag IPs with entropy scores exceeding the 98th percentile, as high entropy suggests randomized or brute-force scanning.",
              "Machine Learning: Apply a density-based clustering algorithm (e.g., DBSCAN) to web traffic data aggregated per source IP. Use features like request count, ratio of unique URIs, and average time between requests. Identify and alert on clusters of outlier IPs that do not belong to the large, dense cluster representing normal user behavior."
            ]
          },
          {
            "description": "An external IP address, not associated with a known CDN provider, establishes a direct TCP/TLS connection to an organization's origin server IP, bypassing the CDN infrastructure. This may be confirmed by observing a TLS handshake where the certificate details match the public-facing service.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Origin web servers, Network perimeter firewalls, Network taps monitoring server-to-internet traffic",
            "action": [
              "Symbolic: Maintain a list of origin server IP addresses and the serial numbers of their public TLS certificates. Create a rule that alerts when Zeek ssl.log shows a connection from an external, non-CDN IP directly to an origin server IP where the certificate serial number matches a known public certificate.",
              "Statistical: Establish a baseline of normal, expected source ASNs for traffic to origin server IPs (e.g., known CDN ASNs, corporate VPNs). Monitor Zeek conn.log for connections to these IPs. Flag any source ASN that has a historically zero or near-zero connection count to the origin servers for review.",
              "Machine Learning: Train a time-series forecasting model (e.g., ARIMA or Prophet) on the daily volume of non-CDN traffic to origin servers. Generate an alert when the observed traffic volume significantly exceeds the forecasted volume's upper confidence bound, indicating an anomalous spike in direct-to-origin connections."
            ]
          },
          {
            "description": "An internal, non-administrative host (e.g., user workstation) generates DNS queries for CDN provider management portals or executes command-line processes to search local files or repositories for CDN-related secrets (e.g., 'origin_server', 'cdn_api_key').",
            "data_sources": [
              "Zeek dns.log",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Developer workstations, CI/CD pipeline servers, Internal DNS servers, Version control systems, Endpoint Detection and Response (EDR) agents",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 for process creation of `grep.exe`, `findstr.exe`, `ack`, or `git.exe`. Alert if the `Process Command Line` contains keywords like 'origin_server', 'cdn_api_key', 'CNAME', or specific origin IP ranges, and the process is initiated by a non-developer account or outside a designated CI/CD server.",
              "Statistical: For internal DNS queries in Zeek dns.log, calculate the rarity of each (query, source_host) pair based on a 30-day history. Profile normal DNS behavior for different host roles (e.g., developer, finance). Flag queries from a host that are statistical outliers for its role, such as a finance workstation querying a CDN provider's API endpoint (e.g., query falls in the bottom 1st percentile of frequency for that host role).",
              "Machine Learning: Implement a peer group analysis model to establish behavioral baselines for file access (Windows Event ID 4663) and process execution (Windows Event ID 4688) for users within the same role or department. Flag a user as an outlier if their activity, such as accessing network configuration files or running network reconnaissance tools, deviates by more than 2 standard deviations from the group's established behavioral profile."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]