[
    {
        "information_requirement": "Is the adversary performing reconnaissance against the network's DNS infrastructure?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1590.002",
                "name": "DNS",
                "evidence": [
                    {
                        "description": "DNS queries targeting organizational domains originating from IP addresses known to be malicious or part of reconnaissance botnets/proxies, as identified by threat intelligence.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate source IP addresses of DNS queries in Zeek dns.log against a high-fidelity, regularly updated cyber threat intelligence (CTI) feed categorizing IPs known for reconnaissance activities, malicious operations, or as open proxies/VPN endpoints frequently abused for scanning. Alert on queries from such IPs targeting the organization's authoritative domain names or internal DNS servers. Investigate the nature and target of these queries."
                    },
                    {
                        "description": "Attempted or successful DNS Zone Transfer requests (AXFR/IXFR query types) from unauthorized external IP addresses targeting internal DNS servers.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Windows Event ID 5504 (Microsoft-Windows-DNS-Server-Service/Audit)"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log for DNS queries with opcodes or query types explicitly indicating AXFR or IXFR. On Windows DNS Servers, monitor for Event ID 5504 (which logs zone transfer requests and completions). Maintain an explicit allow-list of authorized IP addresses/servers permitted to perform zone transfers. Alert immediately on any AXFR/IXFR requests originating from unauthorized external IPs or directed at internal DNS resolvers not configured to serve authoritative zones externally. Investigate source IP and scope of transfer."
                    },
                    {
                        "description": "DNS queries exhibiting patterns characteristic of reconnaissance tools, such as rapid enumeration of non-existent subdomains (NXDOMAIN flood), specific sequences of diverse query types, or use of 'ANY' query type, observed in network traffic or on DNS server logs.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Windows DNS Server Log (e.g.",
                            "Microsoft-Windows-DNSServer/Analytical Event IDs 256/257 for query received",
                            "or Microsoft-Windows-DNS-Server-Service/Audit Event ID 5505 for basic query logging if analytic logs are unavailable)"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek dns.log and/or Windows DNS Server analytic/audit logs for: (1) A high rate of NXDOMAIN responses (DNS RCODE 3) for queries to the organization's domain(s) originating from a single external IP. (2) Use of the 'ANY' query type (QTYPE 255) from external IPs. (3) Sequences of queries from an external IP systematically attempting to resolve common or dictionary-based subdomain names (often lexicographically or with minor variations). (4) Queries for sensitive SRV records (e.g., `_ldap._tcp`, `_kerberos._tcp`) from unexpected external sources. Use frequency analysis on qnames and qtypes, and correlation of NXDOMAIN responses to source IPs over short time windows (e.g., 1-5 minutes). Employ descriptive statistics (e.g., count, mean, standard deviation of NXDOMAINs per source IP) to baseline normal activity and flag significant deviations using percentile or standard deviation thresholds."
                    },
                    {
                        "description": "Anomalously high volume of diverse DNS queries (many unique hostnames or varied record types) from a single external IP address or subnet towards organizational DNS infrastructure, deviating from established baselines.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish baselines for typical external DNS query behavior against organizational DNS servers. Metrics include: query volume per source IP, count of unique hostnames queried per source IP, distribution of query types (qtype), and rate of NXDOMAIN responses per source IP. Use historical Zeek dns.log data for baselining. Monitor for external source IPs or subnets whose current activity significantly exceeds these baselines (e.g., using Z-scores, Inter-Quartile Range (IQR) for outlier detection, or percentile thresholds). Calculate entropy of queried hostnames or record types from a source IP; a sudden increase in entropy can indicate broad scanning. Time series analysis (e.g., ARIMA, Holt-Winters) can help detect abnormal spikes in query rates from specific sources."
                    },
                    {
                        "description": "Sustained or unusually focused querying for sensitive DNS record types (e.g., MX, TXT for SPF/DKIM/DMARC, SRV records for specific services) from external sources not whitelisted as legitimate partners or services.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dns.log for queries from external IPs targeting sensitive record types (MX, TXT - especially those containing SPF/DKIM/DMARC information, specific SRV records like `_autodiscover._tcp`, `_sip._tls`, etc.) for organizational domains. Maintain a whitelist of known legitimate partner, customer, or service IPs that are expected to query these records. For unwhitelisted external IPs, analyze the frequency, duration, and specificity of these queries. Use correlation analysis to identify if a single external IP is systematically querying multiple sensitive record types or enumerating many hosts for such records over a defined period (e.g., hours to days). Calculate frequency of queries for these record types per external IP and flag those with unusually high, sustained interest using descriptive statistics and outlier detection methods."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
