[
  {
    "information_requirement": "Is the adversary bypassing network defenses through unauthorized network boundary bridging?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1599",
        "name": "Network Boundary Bridging",
        "evidence": [
          {
            "description": "A connection is established to a network boundary device's management interface (e.g., SSH, HTTPS, Telnet) from an IP address present on a threat intelligence feed, or network traffic destined for the device matches a known vulnerability signature.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Perimeter firewalls, VPN concentrators, Internal network segmentation gateways (e.g., routers, layer-3 switches)",
            "action": [
              "Create a rule to join Zeek conn.log with a threat intelligence feed of known malicious IP addresses. Alert when `id.resp_p` on a boundary device is a known management port (e.g., 22, 23, 443, 8443) and `id.orig_h` matches an IP on the feed.",
              "For all connections to management interfaces, calculate the rarity of the source Autonomous System Number (ASN) and country. Establish a baseline of normal administrative source locations. Alert on connections originating from ASNs or countries not seen in the last 90 days or those falling below a 1st percentile frequency.",
              "Train a time-series model (e.g., ARIMA) on the volume of connection attempts to management interfaces per hour. Alert on anomalies where the observed volume significantly exceeds the forecasted volume, indicating a potential scanning or brute-force attempt from a single or multiple sources."
            ]
          },
          {
            "description": "A process creation event is logged on a multi-homed host, where the command line includes utilities and arguments specifically for creating or modifying a network bridge (e.g., `netsh bridge add adapter`).",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Multi-homed servers (e.g., web servers in a DMZ with an internal management interface), Developer workstations with multiple network adapters (e.g., physical and virtual)",
            "action": [
              "Create a detection rule for Windows Event ID 4688 that triggers when `ProcessName` is `netsh.exe` and `CommandLine` contains the substrings 'bridge', 'add', and 'adapter'.",
              "On multi-homed hosts, establish a baseline of normal `netsh.exe` command-line argument frequency. Calculate the entropy of arguments used over a rolling 24-hour window. Alert when entropy spikes, indicating the use of unusual or more complex commands than the established baseline.",
              "Use a classification model (e.g., Random Forest) trained on command-line logs to distinguish between benign and malicious `netsh.exe` usage. Feature engineer the command line by tokenizing arguments and flags. Alert when a command is classified as malicious with high confidence."
            ]
          },
          {
            "description": "A multi-homed host is observed receiving traffic on one network interface and initiating a corresponding outbound connection from a second interface in a different subnet, where this relay behavior deviates from a baseline of normal, expected activity.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network taps monitoring traffic to/from DMZ segments, Core switch SPAN ports, Multi-homed servers",
            "action": [
              "For a known multi-homed host, identify inbound connections from Zeek conn.log. Within 1 second of an inbound connection, search for a new outbound connection from the same host to a different destination. Alert if the destination subnet of the outbound connection is different from the source subnet of the inbound connection, and this traffic pattern is not on an explicit allowlist.",
              "For each multi-homed host, profile the typical ratio of inbound to outbound connections and bytes transferred per protocol/port pair across its interfaces. Alert if the observed ratio for a given time window (e.g., 5 minutes) deviates by more than 3 standard deviations from the historical mean, suggesting anomalous traffic relay.",
              "Use a clustering algorithm (e.g., DBSCAN) on connection features from multi-homed hosts (source port, destination port, protocol, bytes in, bytes out, duration). Identify clusters of normal behavior (e.g., web server traffic, database traffic). Alert on connections that are flagged as noise or outliers by the model, as they do not fit any established pattern of normal traffic relay."
            ]
          },
          {
            "description": "One or more network connections are logged that directly violate a predefined network segmentation policy, such as traffic from a user-VLAN to a server-VLAN on a port other than 443.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segmentation boundaries (e.g., between PCI and corporate LANs), DMZ perimeter, Internet egress/ingress points",
            "action": [
              "Define a matrix of allowed traffic (source zone, destination zone, destination port, protocol). Ingest Zeek conn.log and enrich with zone information based on source/destination subnets. Alert on any connection that does not match an entry in the allowed traffic matrix.",
              "For each allowed inter-zone communication path (e.g., User VLAN to Web Server VLAN on port 443), calculate the 95th percentile for daily connection volume and total bytes transferred. Alert if the daily observed values exceed this threshold, indicating a potential misuse of an allowed path.",
              "Train a time-series forecasting model on the volume of denied connections at a network boundary. An unexpected drop to zero in denied connections, when traffic is still expected, could indicate that a firewall policy was disabled or modified to be overly permissive. Alert when observed denials fall significantly below the forecasted lower bound."
            ]
          },
          {
            "description": "A login to a network boundary device from an anomalous source or at an anomalous time is followed within 60 minutes by network traffic that violates the established segmentation policy.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624",
              "Network Device Syslog"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Firewall management interfaces, Router and switch management interfaces, Configuration management servers, Network taps at segmentation boundaries",
            "action": [
              "Alert when a successful login (e.g., from device syslog or Windows Event ID 4624 on a jump box) to a network device's management interface originates from a source IP not on the pre-approved administrator list. Correlate this alert with any subsequent policy violation alerts from the same boundary device within the next 60 minutes.",
              "Profile the login times and source subnets for all administrative access to network devices. Calculate a risk score for each login based on the rarity of the time-of-day and source subnet (e.g., using z-scores). If a login's risk score exceeds a set threshold (e.g., > 3), trigger a high-priority alert and automatically query for any subsequent policy-violating traffic from that boundary.",
              "Use an autoencoder trained on features of legitimate administrative sessions (e.g., source IP, geo-location, time of day, duration, bytes transferred). A login session that results in a high reconstruction error is flagged as anomalous. Use this anomaly flag as a trigger to initiate a real-time, focused analysis of all traffic passing through the associated network boundary, comparing it against the known policy rules."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]