[
    {
        "information_requirement": "Has the adversary collected sensitive data from configuration repositories?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1602",
                "name": "Data from Configuration Repository",
                "evidence": [
                    {
                        "description": "Access attempts or queries to configuration repositories (e.g., SNMP, network management systems) originating from known malicious IP addresses or using known compromised credentials.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek snmp.log",
                            "Windows Event ID 4624",
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log and specific protocol logs like Zeek snmp.log for queries/connections to identified configuration repository systems (e.g., network devices supporting SNMP, dedicated management servers). Correlate source IP addresses with continuously updated threat intelligence feeds of known malicious IPs. For repositories with authentication mechanisms (e.g., web frontends, SSH access), monitor Windows Event IDs 4624 (successful logon) and 4625 (failed logon) on relevant servers. Cross-reference authenticating user accounts and source IPs against lists of known compromised credentials or suspicious entities. Alert on any confirmed matches."
                    },
                    {
                        "description": "Queries to configuration repositories using specific SNMP OIDs known to retrieve sensitive bulk configuration data (e.g., Cisco running-config OIDs) or using network traffic patterns indicative of reconnaissance tools targeting these repositories.",
                        "data_sources": [
                            "Zeek snmp.log",
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek snmp.log for SNMP GET, GETNEXT, or GETBULK requests targeting specific Object Identifiers (OIDs) known to yield sensitive configuration data (e.g., `1.3.6.1.4.1.9.9.92` for Cisco private config, MIB-2 system group OIDs, routing table OIDs, ARP cache OIDs). Monitor for sequences of SNMP requests characteristic of tools like `snmpwalk` originating from non-administrative systems or unauthorized network segments by analyzing request patterns and source IPs in Zeek snmp.log and conn.log. On Windows hosts, monitor Windows Event ID 4688 (Process Creation) for execution of `snmpwalk.exe` or similar network query tools with target IPs of configuration repositories, especially if initiated by unexpected user accounts or parent processes. Maintain and regularly update a list of high-risk OIDs and network reconnaissance tool usage patterns."
                    },
                    {
                        "description": "Anomalous network access patterns to configuration repositories, such as access from unusual internal/external IP addresses, non-standard ports, or devices not typically interacting with these repositories.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek snmp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal access patterns to configuration repositories (e.g., SNMP-enabled devices, network management system servers), including typical source subnets, client devices, protocols, and ports (e.g., UDP/161 for SNMP). Monitor Zeek conn.log and snmp.log for deviations. Use statistical analysis (e.g., frequency counts for source IPs, percentile analysis for connection rarity by IP or port, entropy of source IPs accessing a repository) to identify access from IP addresses or on ports that are statistically rare or fall outside established communication channels. Correlate with asset inventory data to flag access from unauthorized device types or network segments."
                    },
                    {
                        "description": "Unusually large volumes of data transferred from configuration repositories or a high frequency of queries inconsistent with normal administrative activity, potentially indicating bulk data collection.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek snmp.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Baseline normal data transfer volumes (Zeek conn.log: `orig_bytes`, `resp_bytes`) and query frequencies (Zeek snmp.log: request PDU counts, response PDU counts) for each configuration repository and its legitimate clients/administrators. Monitor for significant deviations using time series analysis (e.g., ARIMA, Holt-Winters) to detect spikes or sustained increases in data outflow from repositories or query rates towards them. Calculate Inter-Quartile Range (IQR) or Z-scores for byte counts and query frequencies per session or per defined time window to identify statistical outliers. Investigate sessions or source IPs responsible for transferring significantly more data than typical administrative interactions or making an abnormally high number of queries."
                    },
                    {
                        "description": "Anomalous authentication behavior associated with configuration repositories, such as logins from atypical geolocations, unusual time-of-day, or a high rate of failed attempts followed by success for administrative accounts.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4625",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For configuration repositories or their management systems that utilize Windows authentication or have web-based logins monitored by network traffic, establish baselines for administrative account login behavior (source IP, geolocation if external, time-of-day, frequency). Monitor Windows Event IDs 4624 (successful logon) and 4625 (failed logon) on relevant servers, and Zeek conn.log for access to web frontends. Detect deviations such as logins from new or rare geolocations, 'impossible travel' scenarios, or logins occurring significantly outside normal administrative hours using percentile analysis or clustering techniques. Identify potential brute-force or password spraying attacks by detecting high failed login counts (Event ID 4625) from a specific source IP or against a specific account, potentially followed by a success (Event ID 4624). Use descriptive statistics (e.g., counts, ratios of failed to successful logins) and thresholding."
                    },
                    {
                        "description": "Direct access attempts to sensitive configuration files, backup archives, or specific data objects within configuration repository systems by unauthorized users or unusual processes.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4656",
                            "Zeek files.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Implement and monitor System Access Control Lists (SACLs) on critical configuration files (e.g., router configs, switch configs, policy files), backup archives, or specific registry keys on servers hosting or managing configuration repositories. This generates Windows Event IDs 4663 (Attempted Access to an Object) and 4656 (A handle to an object was requested). Alert on access by non-administrative user accounts, unexpected processes (cross-reference `ProcessName` in Event ID 4663 with known administrative tools and scripts), or access originating from unusual network locations. Correlate host-based file access events with network logs (Zeek conn.log, Zeek files.log) if access involves network file transfer protocols (e.g., SMB, FTP, SCP, TFTP) to detect exfiltration of these files. Use frequency analysis of access to specific sensitive files; a sudden spike in access to a rarely touched configuration backup by an unusual process or to an external destination is highly suspicious."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
