[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by disabling cryptographic hardware on network devices? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1600.002",
        "name": "Disable Crypto Hardware",
        "evidence": [
          {
            "description": "A successful administrative connection (e.g., SSH, Telnet) to a network device from an IP address that is either present on a threat intelligence feed or absent from a pre-defined allow-list of authorized management subnets/hosts.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, management subnets, jump boxes, log aggregation platforms (SIEM)",
            "action": [
              "Symbolic: Maintain an explicit allow-list of IP addresses/subnets for network device management. Create a rule that joins the source IP (`id.orig_h`) from Zeek conn.log records where the destination port (`id.resp_p`) is 22 or 23 with both the allow-list and a threat intelligence feed. Generate a high-severity alert for any connection from an IP not on the allow-list or present on the threat intelligence feed.",
              "Statistical: Profile the Autonomous System Number (ASN) and country of origin for all administrative connections over a 30-day baseline. Calculate the frequency of each ASN/country pair. Alert on connections originating from an ASN or country that falls below a 5th percentile frequency threshold, indicating a rare or first-seen source.",
              "Machine Learning: Train a one-class SVM (Support Vector Machine) or Isolation Forest model on features from historical, legitimate administrative connections (source IP, subnet, ASN, time of day, day of week). Apply the model to new connections in real-time to classify them as 'inlier' (normal) or 'outlier' (anomalous). Investigate all outlier connections."
            ]
          },
          {
            "description": "The execution of a command on a network device's command-line interface (CLI) that contains strings associated with disabling hardware cryptography, such as 'no crypto engine', 'crypto engine software', or modifying crypto-maps.",
            "data_sources": [
              "Device Syslog",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network devices (routers, switches, firewalls), centralized syslog servers, management servers/jump boxes",
            "action": [
              "Symbolic: Create a detection rule that uses regular expressions to search network device syslog and command-line audit logs (e.g., Windows Event ID 4688 on a jump box) for exact-match or partial-match strings indicative of disabling crypto hardware (e.g., `/(no\\s+crypto\\s+engine|crypto\\s+engine\\s+software)/i`). Trigger a high-severity alert upon a match.",
              "Statistical: For each administrator, calculate the Shannon entropy of their command sequences over a rolling 7-day window. A sudden, significant spike in command entropy for a user who typically runs routine commands may indicate exploratory or malicious activity. Alert when entropy for a session exceeds 2 standard deviations above the user's historical average.",
              "Machine Learning: Use a Natural Language Processing (NLP) topic modeling technique like Latent Dirichlet Allocation (LDA) on historical command logs to identify 'topics' of normal administrative activity (e.g., 'interface configuration', 'routing updates'). Classify new command sessions against these topics. A session that does not fit well into any established topic, or that maps to a newly created, low-probability topic containing suspicious crypto-related commands, should be flagged for review."
            ]
          },
          {
            "description": "A successful administrative login to a network device that deviates from an established user-specific baseline across multiple dimensions simultaneously, such as a login from a rare geographic location, at an unusual time-of-day, and from a previously unseen source device.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Active Directory, RADIUS, TACACS+), management servers/jump boxes, network gateway (for geolocation)",
            "action": [
              "Symbolic: For each user, create a rule that alerts if their successful login (Windows Event ID 4624) to a network device occurs outside of their designated on-call or business hours (e.g., 7 PM - 6 AM on a weekday for a 9-5 employee).",
              "Statistical: For each user, establish a multi-faceted baseline including: 1) typical login hours (mean and standard deviation), 2) a set of common source subnets/countries, and 3) average session duration from Zeek conn.log. Generate a risk score by assigning points for deviations (e.g., +1 for login >2 STDs from mean hour, +2 for new country, +1 for session duration >3 STDs from mean). Alert when the cumulative risk score for a single session exceeds a defined threshold.",
              "Machine Learning: Train a K-Means clustering algorithm on historical login data, using features like hour-of-day, day-of-week, source ASN, and session duration. This will create clusters of 'normal' login behavior (e.g., 'weekday-work-hours-from-corporate-IP'). A new login that falls far from any cluster centroid is anomalous and should be alerted on."
            ]
          },
          {
            "description": "A statistically significant decrease in the ratio of encrypted traffic (e.g., TLS, IPsec) to total traffic volume, or a sudden increase in unencrypted management protocol traffic (e.g., Telnet, FTP), observed at a network chokepoint immediately following a configuration change on an upstream network device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network backbone switches, internet gateways, datacenter core routers, VPN concentrators",
            "action": [
              "Symbolic: Create a rule that triggers an alert if the `service` field in Zeek conn.log shows 'telnet' for a connection to a network device's management IP, as this indicates a fallback to an insecure protocol.",
              "Statistical: Calculate a time series of the ratio of TLS connections (from ssl.log count) to total TCP connections (from conn.log count) in 10-minute intervals. Establish a baseline mean and standard deviation for this ratio. Alert if the ratio drops more than 3 standard deviations below the baseline for two or more consecutive intervals.",
              "Machine Learning: Use a time series anomaly detection model (e.g., ARIMA or Prophet) to forecast the expected volume of TLS traffic. Continuously compare the actual observed TLS traffic volume against the forecasted volume and its confidence interval. An actual value that falls consistently below the lower bound of the confidence interval indicates a significant negative anomaly that should be investigated."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]