[
  {
    "information_requirement": "Is an adversary using SEO poisoning to stage malicious websites and lure internal users into drive-by-compromise or supply chain attacks?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608.006",
        "name": "SEO Poisoning",
        "evidence": [
          {
            "description": "An internal host communicates with a domain or IP address matching a high-confidence threat intelligence feed of indicators associated with active SEO poisoning or Gootloader campaigns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway/proxy servers, Corporate DNS resolvers, Threat Intelligence Platform",
            "action": [
              "Join Zeek dns.log queries and Zeek conn.log destination IPs against a threat intelligence feed containing domains and IPs known to be associated with SEO poisoning campaigns. Generate a high-severity alert for any match.",
              "For all domains queried in Zeek dns.log, calculate their organizational prevalence (number of unique hosts querying the domain / total hosts). Flag domains with low prevalence (<0.1%) that are accessed by multiple hosts (>3) within a 1-hour window and have a suspicious TLD (e.g., .zip, .mov, .xyz).",
              "On all newly observed domains from Zeek dns.log, apply a pre-trained domain generation algorithm (DGA) detection model. Correlate domains classified as DGA with high confidence against Zeek http.log to identify if the traffic originated from a search engine referrer. Escalate positive, correlated findings for investigation."
            ]
          },
          {
            "description": "A user browsing session, initiated from a known search engine referrer (e.g., google.com, bing.com), involves a rapid chain of three or more HTTP 3xx redirects within a 5-second window.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web content filters, Internet gateway/proxy servers",
            "action": [
              "From Zeek http.log, identify sessions where the `referer` header is a major search engine. Within these sessions, alert if a single source IP experiences a sequence of three or more HTTP 3xx status codes to different `host` headers within a 5-second timeframe.",
              "For all HTTP sessions, establish a baseline distribution of redirect chain lengths per session. Alert on any session originating from a search engine where the redirect chain length exceeds the 99th percentile of the 30-day historical baseline.",
              "Train a classification model (e.g., Random Forest) using features from HTTP sessions, such as redirect chain length, time delta between redirects, change in user-agent across requests, and reputation of the final destination domain. Apply the model in real-time to sessions originating from search engines to classify them as either a benign or a malicious redirection chain."
            ]
          },
          {
            "description": "Following a web request with a search engine referrer, a high-risk file type is downloaded, and a browser process subsequently spawns a suspicious child process on an endpoint.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, laptops), Internet gateway/proxy servers, EDR Platform",
            "action": [
              "Correlate Zeek http.log records having a search engine referrer with Zeek files.log records by session ID. Alert if a downloaded file's MIME type is 'application/zip', 'application/x-iso9660-image', or 'application/javascript' and the download source domain was registered in the last 90 days.",
              "Using Windows Event ID 4688, baseline the frequency of child processes spawned by browser executables (e.g., chrome.exe, msedge.exe). Alert when a browser spawns a statistically rare child process (e.g., wscript.exe, powershell.exe) that falls below the 1st percentile of observed child processes. Also, calculate the command-line entropy for all child processes and alert if it exceeds the 98th percentile for that specific process name.",
              "Deploy a supervised classifier on endpoint process creation events (Windows Event ID 4688). Use features from the process and its command line, such as argument length, character distribution entropy, and presence of keywords (e.g., 'IEX', 'DownloadString', '-enc'), to score the likelihood of maliciousness. Escalate high-scoring events where the parent process is a browser for immediate review."
            ]
          },
          {
            "description": "Multiple distinct internal hosts are referred from a search engine to a common, newly observed, or low-reputation domain within a 24-hour period, indicating a successful flocking event.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, Internet gateway/proxy servers, Centralized SIEM/Log Aggregator",
            "action": [
              "For domains first seen in Zeek dns.log within the last 30 days, generate an alert if more than 10 distinct internal source IPs are observed in Zeek http.log accessing the domain with a search engine `referer` within a single 24-hour period.",
              "For each external domain accessed via a search engine referrer, calculate a 30-day rolling baseline of unique internal visitors per day. Use a Z-score to detect daily visitor counts that are statistically significant outliers (e.g., Z-score > 3.5), indicating an anomalous spike in traffic.",
              "Apply a time-series clustering algorithm (e.g., k-shape) to daily unique visitor counts for all external domains. Isolate and investigate the cluster of domains exhibiting a 'sudden burst' access pattern, prioritizing those with low reputation scores or recent registration dates."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]