[
    {
        "information_requirement": "Is the adversary executing commands via container administration services?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1609",
                "name": "Container Administration Command",
                "evidence": [
                    {
                        "description": "Network connections to container administration APIs from known malicious IP addresses, or deployment of containers using known malicious image names/tags.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate source IP addresses from network connections to container API ports (e.g., Docker 2375/2376, K8s 6443/443, kubelet 10250) in Zeek conn.log against a cyber threat intelligence (CTI) feed of malicious IPs. Additionally, monitor process creation logs (Windows Event ID 4688) for `docker run` or `kubectl run` commands and match the specified container image name and tag against a list of known malicious container images. Alert on any matches."
                    },
                    {
                        "description": "Execution of container administration commands (`docker exec`, `kubectl exec`) containing command-line patterns indicative of reverse shells, credential access, or sensitive file retrieval.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process command-line arguments in Windows Event ID 4688 for `docker exec` or `kubectl exec`. Apply regular expression matching to detect suspicious sub-commands and arguments, such as patterns for reverse shells (`/bin/bash -i`, `/dev/tcp`), credential access (`cat /etc/shadow`), or web-based data transfer (`curl`, `wget` with external IPs). Maintain and update a list of these high-fidelity malicious patterns."
                    },
                    {
                        "description": "Creation of containers using command-line flags that enable host-level access or override security defaults, such as privileged mode or host volume mounts.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze command-line arguments in Windows Event ID 4688 for `docker run` or `kubectl apply/run` commands. Specifically flag the use of high-risk arguments that break container isolation, such as `--privileged`, `--host=pid`, `--host=net`, or volume mounts of sensitive host directories like `-v /:/hostroot` or `-v /var/run/docker.sock:/var/run/docker.sock`. Correlate the usage of these flags with the executing user and source host to identify unauthorized or risky container deployments."
                    },
                    {
                        "description": "Container administration commands executed by unusual users, such as non-administrative accounts or service accounts, or at anomalous times outside of established operational windows.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of typical users and system accounts that execute `docker` and `kubectl` commands on container hosts and developer workstations. Using Windows Event ID 4688, identify and alert on executions by users outside of this baseline (e.g., standard user accounts, web service accounts). Use time series analysis on command execution timestamps to identify activity occurring outside of normal business hours or deployment windows, flagging deviations using percentile analysis or Z-scores."
                    },
                    {
                        "description": "Anomalous network access patterns to container administration APIs, such as connections from unexpected internal network segments, external sources, or a sudden increase in connection volume.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Profile normal network traffic to container administration ports (e.g., Docker 2375, K8s 6443) using Zeek conn.log to establish a baseline of expected source subnets and connection frequencies. Use statistical analysis to detect anomalies, such as connections from new or rare subnets (e.g., user VLANs connecting to a production Kubernetes API). Employ time series analysis to detect sudden spikes in connection volume or duration from a single source, which may indicate scanning or interactive malicious access. A box-plot of connection counts per source IP can identify outliers."
                    },
                    {
                        "description": "A sudden increase in the rate or a change in the diversity of commands executed via container administration tools by a single user or on a single host, indicating automated or exploratory malicious activity.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each user and host, track the rate of `docker` or `kubectl` command executions over time using Windows Event ID 4688. Apply time series analysis to detect sudden, sustained increases in command frequency, which could indicate scripted attacks. Additionally, calculate the entropy of the commands being executed (e.g., the diversity of `exec` sub-commands or `run` arguments) within a given time window. A sharp increase in entropy can signify a shift from routine tasks to broad, exploratory discovery activity. Compare these metrics against a learned baseline for the user or host."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
