[
  {
    "information_requirement": "Is an adversary using SEO poisoning to stage malicious websites and lure internal users into drive-by-compromise or supply chain attacks?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608.006",
        "name": "SEO Poisoning",
        "evidence": [
          {
            "description": "An internal host communicates with a domain or IP address matching a high-confidence threat intelligence feed of indicators associated with active SEO poisoning or Gootloader campaigns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway/proxy servers, Corporate DNS resolvers",
            "action": [
              "Symbolic: Continuously join Zeek dns.log queries and Zeek conn.log destination IPs against a threat intelligence feed of known SEO poisoning C2s, droppers, and redirector domains. Generate a high-severity alert upon any match.",
              "Statistical: Calculate the prevalence of each queried domain across the organization. Flag domains that are rare overall (<0.01% of total queries) but are queried by multiple distinct hosts within a short time window (e.g., 1 hour), especially if the TLD is suspicious (.xyz, .online).",
              "Machine Learning: Use a pre-trained domain generation algorithm (DGA) detection model on all newly observed domains from Zeek dns.log. Domains classified as DGA with high confidence, which also receive traffic from search engine referers, should be investigated."
            ]
          },
          {
            "description": "A user session originating from a search engine exhibits characteristics of malicious redirection, such as rapid redirect chains or content cloaking, to deliver a malicious payload.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web content filters, Internet gateway/proxy servers",
            "action": [
              "Symbolic: Filter Zeek http.log for entries where the referer header indicates a major search engine. From this subset, alert on sessions containing a chain of three or more HTTP 3xx redirects within five seconds, especially if the final destination is a non-allowlisted domain.",
              "Statistical: For all sessions originating from search engines, calculate the distribution of redirect chain lengths. Alert on any session where the redirect chain length exceeds the 99th percentile of the historical 30-day distribution for the organization.",
              "Machine Learning: Train a sequence model (e.g., LSTM) on legitimate browsing sequences (URI paths, referers, user agents). Apply the model in real-time to new sessions originating from search engines to detect anomalous sequences indicative of malicious redirection chains."
            ]
          },
          {
            "description": "Following a web navigation from a search engine, a user's endpoint downloads a high-risk file (e.g., .iso, .zip containing a .lnk) from a low-reputation domain, or a browser process spawns a suspicious child process.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, laptops), Internet gateway/proxy servers",
            "action": [
              "Symbolic: Correlate Zeek http.log traffic from a search engine referer with subsequent Zeek files.log entries. Alert if a file with a high-risk extension (.iso, .zip, .js, .hta) is downloaded from a domain registered within the last 90 days.",
              "Statistical: On endpoints, baseline the parent-child process relationships for browsers (e.g., chrome.exe). Alert when a browser spawns a child process (captured in Windows Event ID 4688) that is statistically rare, such as `powershell.exe` or `cscript.exe`, falling outside the 99th percentile of normally observed child processes for that parent.",
              "Machine Learning: Use a classifier trained on process command-line arguments to identify malicious script execution. Analyze the command lines of processes spawned by browsers, using features like argument entropy, length, and keyword matches ('-enc', 'IEX', 'downloadstring'), to flag suspicious post-download activity."
            ]
          },
          {
            "description": "A statistically significant number of distinct internal users, referred from a search engine, begin accessing a common, low-reputation, or newly registered domain within a short period, indicating successful 'flocking' behavior from a poisoned search result.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, Internet gateway/proxy servers",
            "action": [
              "Symbolic: Identify domains first seen in Zeek dns.log within the last 30 days. If traffic to one of these new domains, where the referer is a search engine, is observed from more than 10 distinct internal hosts within a 24-hour period, generate an alert for investigation.",
              "Statistical: For each domain visited via a search engine, establish a daily baseline of unique internal visitors. Use a Z-score or modified Z-score on the visitor count to detect a statistically significant spike (e.g., Z-score > 3.5) compared to the domain's trailing 30-day average.",
              "Machine Learning: Apply a time-series clustering algorithm (e.g., k-shape) to group external domains by their daily unique visitor patterns. Manually inspect domains that fall into clusters representing 'sudden burst' or 'viral' traffic behavior, prioritizing those with low reputation scores or recent registration dates."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]