[
  {
    "information_requirement": "Is an adversary attempting to transfer externally staged malware into the network?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608.001",
        "name": "Upload Malware",
        "evidence": [
          {
            "description": "A network connection or file transfer occurs involving a destination IP address, domain, or URL that matches a threat intelligence feed of known malware staging or distribution points.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, network egress points, forward and reverse web proxies.",
            "action": [
              "Symbolic: Create a detection rule that joins network connection logs (Zeek conn.log `id.resp_h`) and HTTP logs (Zeek http.log `host` and `uri` fields) with a high-confidence threat intelligence feed of known malicious indicators. Generate an alert for any match.",
              "Statistical: For all domains contacted, calculate the historical frequency of access from across the enterprise. Profile the rarity of a domain using the inverse document frequency (IDF) model. A connection to a domain that is both present on a threat feed and has a very high rarity score (e.g., accessed by only one host ever) should be prioritized as a high-fidelity alert.",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) on labeled historical network data, using features such as IP/domain reputation, ASN, country, and connection metadata. Use the model to predict the probability that a new, unseen connection is malicious. Flag connections exceeding a high probability threshold (e.g., > 0.9) for immediate investigation."
            ]
          },
          {
            "description": "A file with a high-risk extension or MIME type (e.g., .exe, .ps1, application/x-msdownload) is downloaded from a domain categorized as a non-sanctioned public file-sharing service or a newly registered domain (NRD).",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, network egress points, web proxies.",
            "action": [
              "Symbolic: Maintain watchlists for non-sanctioned file-sharing domains and high-risk file types. Create a rule that triggers when a file download event (Zeek files.log or http.log) shows a `host` from the watchlist AND a `mime_type` or file extension from the high-risk list. Separately, query DNS logs (Zeek dns.log) enriched with WHOIS data to identify domains registered in the last 30-60 days and alert on high-risk file downloads from them.",
              "Statistical: For each domain visited, calculate the entropy of the subdomain or URI path. High entropy can indicate algorithmically generated names used for content delivery. Establish a baseline for entropy scores across common domains. A high-risk file download from a domain with an anomalously high entropy score (e.g., > 95th percentile) should be flagged for review.",
              "Machine Learning: Use a time series forecasting model (e.g., ARIMA, Prophet) on daily DNS query volumes for domains that are not in the top 1 million. Anomaly detection on this time series can reveal a sudden spike in queries to a previously dormant or non-existent domain, which, when correlated with a high-risk file download, indicates potential staging activity."
            ]
          },
          {
            "description": "An internal host downloads a high-risk file from an external source that presents multiple low-reputation indicators, such as a self-signed TLS certificate, an anomalous server header, or an IP address with a poor reputation score.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, certificate transparency logs, external threat intelligence platforms.",
            "action": [
              "Symbolic: Create a detection rule that correlates a file download (Zeek files.log) with TLS session metadata (Zeek ssl.log). Alert if a file with a high-risk MIME type is downloaded over a TLS session where `validation_status` is 'self-signed certificate' or 'unable to get local issuer certificate'.",
              "Statistical: Develop a composite risk score for each download event. Assign points for risk factors: +1 for high-risk file type, +2 for self-signed cert, +1 for uncategorized domain, +2 for IP on a reputation blocklist, +1 for an unusual HTTP `User-Agent`. Sum the points and flag any download exceeding a statistically determined threshold (e.g., score > 4, or any score in the top 1% of all scores observed daily).",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., K-Means, DBSCAN) on features extracted from download events (file MIME type, TLS cert validity, server header, ASN, country). Identify clusters of activity that deviate from the main, large 'benign' cluster. Manually investigate these outlier clusters to identify novel or evasive malware download patterns."
            ]
          },
          {
            "description": "A process is created (Windows Event ID 4688) on an endpoint where the process name or command line corresponds to a file recently downloaded from an external source (Zeek files.log), and this new process subsequently initiates one or more outbound network connections (Zeek conn.log).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers), domain controllers, network egress points.",
            "action": [
              "Symbolic: Create a correlation rule that joins network file download logs (Zeek files.log) with endpoint process creation logs (Windows Event ID 4688) on the host IP and file name. Trigger an alert if a process is created from a file path matching a downloaded file within a short time window (e.g., less than 5 minutes).",
              "Statistical: For processes that initiate network connections, calculate the Jaccard similarity or Levenshtein distance between the process name and known legitimate system processes (e.g., svchost.exe, lsass.exe). A process that was recently downloaded and has a name that is a close but not exact match to a system process (e.g., 'svch0st.exe') should be flagged, as this is a common masquerading technique.",
              "Machine Learning: Apply time series analysis to the outbound network connections (Zeek conn.log) initiated by a newly created process. Model the inter-arrival times and data volumes of connections. A regular, periodic pattern (beaconing) detected by an algorithm like Fourier Transform or autocorrelation, especially with a fixed payload size, is a strong indicator of command and control activity from the executed malware."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]