[
  {
    "information_requirement": "Is an internal system downloading or executing a malicious payload staged on external infrastructure?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1608.001",
        "name": "Upload Malware",
        "evidence": [
          {
            "description": "A network connection is established or a file is transferred from an internal host to a destination IP address, domain, or URL that is present on a threat intelligence feed of known malware hosting or command-and-control infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateways, network egress points, forward and reverse web proxies.",
            "action": [
              "Continuously query network logs (Zeek conn.log, http.log) against an IOC list of known malicious IPs, domains, and URLs. Generate a high-severity alert upon any match, including the source host, destination indicator, and timestamp.",
              "For every domain contacted that matches a threat intelligence feed, calculate its historical prevalence across the enterprise (e.g., number of unique hosts contacting it in the last 90 days). Prioritize alerts for IOC matches where the domain is also statistically rare (e.g., contacted by fewer than 3 hosts), as this indicates a targeted rather than widespread threat.",
              "Utilize a pre-trained classification model (e.g., XGBoost, Random Forest) that predicts the maliciousness of a network connection. Enrich connection data (Zeek conn.log) with features like ASN, geographic location, IP/domain reputation, and TLS certificate details (from Zeek ssl.log). Flag connections with a predicted probability score exceeding a high-confidence threshold (e.g., >0.90) for analyst review."
            ]
          },
          {
            "description": "A file with a high-risk MIME type (e.g., 'application/x-msdownload', 'application/vnd.microsoft.portable-executable') or file extension (e.g., .exe, .dll, .ps1, .vbs) is downloaded from a domain that is either a non-sanctioned public file-sharing service or was registered within the last 60 days (Newly Registered Domain).",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek files.log",
              "WHOIS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS servers, network egress points, web proxies.",
            "action": [
              "Create and maintain watchlists of high-risk file MIME types and non-sanctioned file-sharing domains. Generate an alert when a file download event (Zeek files.log) matches both a high-risk file type and a domain from the watchlist. Separately, enrich DNS logs (Zeek dns.log) with WHOIS creation dates and alert on high-risk file downloads from any domain younger than 60 days.",
              "For all downloaded files, calculate the Shannon entropy of the URI path from the HTTP request (Zeek http.log `uri`). Establish a baseline entropy distribution for legitimate downloads. Flag downloads of high-risk file types from URIs with an entropy score in the 98th percentile or higher, as this often indicates use of content delivery networks with algorithmically generated links.",
              "Implement a time series anomaly detection model (e.g., SARIMA) on the daily query volume for each requested domain (from Zeek dns.log), excluding high-traffic domains. If an anomalous spike in query volume is detected for a domain, correlate this with file download logs (Zeek files.log) from the same timeframe. An alert should be generated if the spike corresponds to a high-risk file download."
            ]
          },
          {
            "description": "An internal host downloads a file with a high-risk MIME type over a TLS session exhibiting weak or suspicious characteristics, such as a self-signed certificate, a short-lived certificate (e.g., valid for < 90 days), or a certificate issued by a non-standard Certificate Authority.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, certificate transparency logs, external threat intelligence platforms.",
            "action": [
              "Create a detection rule that joins file download events (Zeek files.log `fuid`) with TLS session logs (Zeek ssl.log `uid`). Generate an alert if a high-risk file type is downloaded and the corresponding `validation_status` is 'self-signed certificate' or the `issuer` field does not match a list of trusted Certificate Authorities.",
              "Develop a composite risk score for each file download. Assign weighted points for risk factors: +3 for self-signed cert, +2 for an IP on a low-reputation list, +1 for an unusual HTTP User-Agent, +2 for a certificate validity period of less than 90 days. Sum the points and flag any download event whose total score exceeds a threshold determined by the 99th percentile of all download scores over a 24-hour period.",
              "Apply an unsupervised clustering algorithm (e.g., DBSCAN) to all file download events. Use features such as file MIME type, TLS certificate issuer, TLS certificate subject, destination ASN, and destination country. Isolate and investigate small, dense clusters that do not belong to the large primary cluster of 'normal' activity, as these represent potentially novel attack patterns."
            ]
          },
          {
            "description": "A process is created on an endpoint (e.g., via Windows Event ID 4688 or Sysmon Event ID 1) where the executable file matches a file recently downloaded from an external source, and this new process subsequently establishes one or more outbound network connections to an external IP address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices (workstations, servers), domain controllers, network egress points.",
            "action": [
              "Correlate file download logs (Zeek files.log) with process creation logs (Windows Event ID 4688, Sysmon Event ID 1) by joining on host IP and filename within a 10-minute window. If a match is found, further join with network connection logs (Sysmon Event ID 3, Zeek conn.log) on the Process ID/GUID. Alert if the newly created process initiates any external network connection.",
              "For any process created from a recently downloaded file, compare its name to a reference list of common Windows system processes (e.g., 'svchost.exe', 'lsass.exe'). Calculate the Levenshtein distance between the new process name and all names in the reference list. Flag any process with a distance greater than 0 but less than 3 (e.g., 'svch0st.exe'), as this suggests potential masquerading.",
              "For a process spawned from a downloaded file, analyze the time series of its subsequent outbound network connections (from Zeek conn.log or Sysmon Event ID 3). Use autocorrelation or Fourier analysis to detect periodicity in connection timings and data volumes. A strong, regular signal indicates automated beaconing characteristic of C2 communication, warranting a high-severity alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]