[
  {
    "information_requirement": "Is the adversary evading defenses by downgrading system images on network devices? (TA0005 - Defense Evasion)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1601.002",
        "name": "Downgrade System Image",
        "evidence": [
          {
            "description": "A file transfer event is observed where the SHA256 hash of the transferred file matches a pre-compiled list of hashes corresponding to known-vulnerable or non-standard network device firmware/OS images.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core routers and switches, Network management servers, Firmware distribution points, Network traffic at aggregation points",
            "action": [
              "Symbolic Logic: Create and maintain a watchlist of SHA256/MD5 hashes for all known-vulnerable and outdated OS/firmware images for network devices in the environment. Query Zeek files.log for all transferred files, calculate their hashes in near-real time, and generate an alert on any match against the watchlist.",
              "Statistical Method: For each network device model, establish a baseline of file transfer sources (IPs/subnets) and protocols (e.g., TFTP, SCP, FTP) used for legitimate firmware updates. Monitor Zeek conn.log and files.log. Calculate the frequency of firmware file transfers (e.g., .bin, .img) from non-baseline sources. Alert if the frequency from a new or rare source IP exceeds the 95th percentile of historical activity for that device type.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from Zeek files.log and conn.log, such as is_local, file_mime_type, seen_bytes, source_is_admin_host, and transfer_time_of_day. Label historical legitimate updates as 'benign' and any known unauthorized updates as 'malicious'. Use the trained model to classify new firmware file transfers and alert on those classified as 'malicious' with high confidence."
            ]
          },
          {
            "description": "A command is logged from a network device's management interface that explicitly modifies the boot configuration to point to a new or different system image file not on the approved list.",
            "data_sources": [
              "Zeek syslog.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Syslog servers, Network device command line interfaces (CLIs), Network management workstations, SIEM/Log aggregation platform",
            "action": [
              "Symbolic Logic: Using regular expressions, search Zeek syslog.log for command patterns indicative of boot configuration changes on network devices (e.g., `boot system flash`, `set system image`). Alert if the image file specified in the command does not match the approved image name for that device model, as defined in a configuration management database (CMDB).",
              "Statistical Method: For each network device and administrative user, baseline the frequency and timing of boot configuration commands. Calculate the entropy of commands issued by each user; a sudden spike in entropy or the appearance of rare configuration commands could indicate anomalous activity. Alert when a user issues a boot configuration command outside of their normal activity window (e.g., time of day, day of week) or if the command's rarity score exceeds a statistical threshold (e.g., > 3 standard deviations from the mean command frequency).",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) to learn normal sequences of administrative commands on network devices. A legitimate sequence might be `login -> show version -> configure terminal -> [benign changes] -> exit`. An anomalous sequence might be `login -> boot system flash:/old_image.bin -> reload`. Train the model on legitimate administrative sessions and use it to score new sessions, alerting on those with a low probability of being legitimate."
            ]
          },
          {
            "description": "A network device, upon reboot, logs a system version or image name that is different from, and chronologically older than, the version recorded in the authoritative configuration baseline.",
            "data_sources": [
              "Zeek syslog.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Syslog servers, Configuration Management Database (CMDB), Network devices",
            "action": [
              "Symbolic Logic: Parse boot-up messages from network devices in Zeek syslog.log to extract the hostname and running OS version. For each event, perform an automated lookup against a CMDB or asset inventory. Trigger an alert if `(logged_version != cmdb_version)` AND `(logged_version_date < cmdb_version_date)`.",
              "Statistical Method: Periodically poll network devices for their version information or parse periodic status messages. Track the version for each device over time as a state machine. Alert on any state change where the new version is older than the previously recorded version. This simple state change detection does not require a complex baseline, only a memory of the last known-good state.",
              "Machine Learning: Apply time-series forecasting to the dataset of device version check-in events. A sudden, unexpected change in the reported version string, especially one that deviates from a projected steady state (i.e., the version is not expected to change), can be flagged as an anomaly by the model. The model can learn that versions only change during planned maintenance windows, making any other change highly suspicious."
            ]
          },
          {
            "description": "A file with a common firmware extension (e.g., .bin, .img, .swi) is transferred to a network device's management IP address, and the transfer's metadata (source IP, time of day, protocol) deviates significantly from an established baseline for legitimate update activity.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic at aggregation points (e.g., core switch SPAN port), Network management subnet, Internet gateway",
            "action": [
              "Symbolic Logic: Create a rule that alerts when a file is transferred to an IP in the network device range and `file_extension` is in `[.bin, .img, .swi, .pkg]` AND `source_ip` is NOT in the pre-approved list of network management servers or administrative workstations.",
              "Statistical Method: For each network device, create a multi-faceted baseline of firmware transfers from Zeek conn.log and files.log including `source_ip`, `protocol`, `hour_of_day`, and `file_size_bytes`. Use a scoring system for new transfers. Add points for deviations: +2 for external source IP, +1 for transfer outside maintenance window, +1 for unusual file size. Alert if the total risk score for a transfer exceeds a percentile-based threshold (e.g., 98th percentile of all historical scores).",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on firmware transfer events, using features like source IP, destination IP, protocol, file size, and time of day. Legitimate transfers from management servers during maintenance windows should form a dense cluster. Any transfer that is flagged as noise or falls into a sparse, separate cluster should be considered anomalous and trigger an alert for investigation."
            ]
          },
          {
            "description": "A correlated sequence of events for a single network device, occurring within a short time window (e.g., under 60 minutes): 1) a firmware file transfer, 2) a boot configuration command, and 3) a system reboot log message.",
            "data_sources": [
              "Zeek files.log",
              "Zeek syslog.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SIEM/Log aggregation platform, Network management servers, Core network devices, Windows hosts used for network administration",
            "action": [
              "Symbolic Logic: In a SIEM, create a correlation rule that triggers when, for the same device IP, Event A (Zeek files.log transfer of `.bin` or `.img`), Event B (Zeek syslog.log 'boot system' command), and Event C (Zeek syslog.log 'reboot' or 'bootup' message) all occur within a 60-minute window. Escalate the alert priority if the activity occurs outside of a pre-defined maintenance window.",
              "Statistical Method: Calculate the probability of the event sequence (firmware file transfer -> boot config change -> device reboot) occurring for a given device outside a maintenance window. Establish a baseline of this sequence's frequency. Alert if the sequence is observed and it is not within a scheduled maintenance window, or if its frequency for a particular device or subnet exceeds a statistical threshold (e.g., more than 1 occurrence per quarter).",
              "Machine Learning: Develop a graph-based analysis model where nodes are entities (users, devices, IPs) and edges are actions (file transfer, login, command execution). A legitimate update might have a graph structure like: `Admin_User -> logs_in_to -> Mgmt_Server -> transfers_file_to -> Switch_1 -> issues_boot_cmd_to -> Switch_1`. An attack might look different: `External_IP -> compromises -> User_Workstation -> transfers_file_to -> Switch_1`. By analyzing the structure, sequence, and timing of these graphs, an ML model can identify and alert on subgraphs that match known attack patterns or deviate significantly from normal administrative activity graphs."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]