[
  {
    "information_requirement": "Is the adversary attempting to collect network device configurations? (PIR)",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1602.002",
        "name": "Network Device Configuration Dump",
        "evidence": [
          {
            "description": "A process execution (Windows Event ID 4688) on a management host, where the process hash matches a known IOC for a network reconnaissance tool, is correlated with an outbound network connection (Zeek conn.log) to a known malicious C2 server IP or domain (Zeek dns.log) within a 5-minute window.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Management jump boxes, DNS resolvers, Internet gateway firewall, Network device management interfaces",
            "action": [
              "Symbolic: Correlate Windows Event ID 4688 process creation events against a threat intelligence feed of file hashes for known network configuration dumping tools. If a hash match is found, query network logs (Zeek conn.log, Zeek dns.log) for any outbound connections from that host to known malicious IPs or domains within 5 minutes of the process execution and alert.",
              "Statistical: For network connections originating from network management subnets (from Zeek conn.log), analyze the entropy of requested domain names (from Zeek dns.log). A high entropy score, exceeding the 95th percentile of the historical baseline for that subnet, may indicate DGA-based C2 communication for data exfiltration and should be flagged for investigation.",
              "Machine Learning: Use a trained classification model (e.g., Random Forest) to predict if a network connection is malicious exfiltration. Features should include data volume, destination IP reputation, destination port, JA3/JA3S hash, and connection duration. Flag connections originating from management systems that the model classifies with a high probability as malicious."
            ]
          },
          {
            "description": "A process creation event on a host not designated as a network administration workstation, where the command line includes network management utilities like 'plink.exe', 'tftp.exe', 'scp', 'ssh', or 'telnet' followed by IP addresses of network devices and configuration-related commands like 'show running-config'.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "General user workstations, Application servers, Network device management interfaces",
            "action": [
              "Symbolic: Create a detection rule that triggers on process creation (Windows Event ID 4688 or Sysmon Event ID 1) when the process command line contains keywords ('show running-config', 'copy running-config', 'tftp.exe', 'plink.exe') AND the source host is not in the pre-defined list of authorized administration hosts.",
              "Statistical: For each host, calculate the frequency of command-line execution of network management utilities. Establish a baseline for each host role (e.g., developer workstation, marketing laptop). Generate an alert when a host shows a command execution frequency that is a significant statistical outlier (e.g., > 3 standard deviations above its role's mean).",
              "Machine Learning: Use an anomaly detection model (e.g., Isolation Forest) on enriched command-line logs. Features can include command length, character distribution, presence of IP addresses, and keyword counts. Train the model on normal administrative activity to identify command-line invocations that are structurally different from legitimate use."
            ]
          },
          {
            "description": "An unencrypted file transfer (e.g., FTP, TFTP, HTTP) is observed via Zeek's files.log where the file content contains high-confidence keywords ('enable secret', 'snmp-server community', 'password') or the filename matches common configuration file names ('running-config', 'startup-config').",
            "data_sources": [
              "Zeek files.log",
              "Zeek ftp.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network backbone sensors, Unencrypted file transfer servers (FTP/TFTP), Core network switches",
            "action": [
              "Symbolic: Using Zeek's file analysis framework, for files transferred over unencrypted protocols (identified in files.log), link to the connection via the 'fuid' and check if the destination is a network device. Scan the file content using a regular expression for keywords like 'enable secret', 'password', 'snmp-server community', or 'crypto key'. Alert on any match.",
              "Statistical: Analyze Zeek files.log for files transferred over unencrypted protocols. Calculate a 'sensitivity score' for each file based on the frequency of configuration-related keywords. Establish a baseline score for typical file transfers and flag files with scores exceeding the 99th percentile.",
              "Machine Learning: Train a Naive Bayes classifier on a labeled dataset of network device configuration file snippets and benign text files. Apply the classifier in near real-time to the content of files transferred over unencrypted protocols to classify them as 'config' or 'benign', detecting partial or obfuscated configuration data."
            ]
          },
          {
            "description": "A network connection to a network device on a management port (e.g., TCP/22, TCP/23, UDP/161) where the source IP is not on an approved list of management hosts, the connection occurs outside of pre-defined business hours, or the volume of data transferred significantly exceeds the baseline for a typical management session.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek snmp.log",
              "Firewall Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network device management interfaces, Core network switches, Internet gateway, Firewall concentrators",
            "action": [
              "Symbolic: Create a SIEM rule that triggers an alert when a connection is observed in Zeek conn.log or firewall logs with a destination port of 22, 23, or 161, AND the destination IP is in the network device range, AND the source IP is NOT in the authorized network management host group.",
              "Statistical: For each network device, create a baseline of daily/hourly connection counts to its management ports from Zeek conn.log. Alert if the connection count in a given time window exceeds a statistically significant threshold (e.g., 3 standard deviations above the moving average) for that specific device and time of day.",
              "Machine Learning: Apply time-series forecasting (e.g., ARIMA) to the volume of data transferred (orig_bytes + resp_bytes in Zeek conn.log) to/from management ports for the entire network device segment. Generate an alert when the observed data volume significantly deviates from the forecasted volume and its confidence interval, indicating a potential bulk configuration dump."
            ]
          },
          {
            "description": "A single source IP address or user account establishes successful connections to a number of distinct network devices that exceeds a defined threshold within a short time window (e.g., >10 devices in 5 minutes), indicating automated fan-out activity.",
            "data_sources": [
              "Zeek ssh.log",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "RADIUS Authentication Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "RADIUS/TACACS+ authentication servers, Management jump boxes, Network device management interfaces, Domain Controllers",
            "action": [
              "Symbolic: In a 5-minute window, count the number of distinct destination IPs (in the network device range) a single source IP connects to on ports 22 or 23 (from Zeek conn.log). If the count is greater than 10 and the source is not a designated network monitoring tool, generate an alert.",
              "Statistical: For each user account (from RADIUS logs or Windows Event ID 4624) or source IP, calculate the number of distinct devices they authenticate to per hour. Establish a baseline distribution for all users and flag any user whose activity falls into the 99th percentile of this 'device fan-out' metric.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on authentication events over a defined time window using features such as (source_IP, destination_IP_prefix, user_account). Normal administrative activity will form dense clusters. Automated scanning or fan-out activity from a single compromised host or account will be identified as noise points or a distinct, sparse cluster."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]