[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by weakening encryption?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1600",
        "name": "Weaken Encryption",
        "evidence": [
          {
            "description": "A TLS/SSL connection is established with an external IP address or domain present on a threat intelligence feed of known adversary command and control (C2) infrastructure. The risk is elevated if the connection originates from a network infrastructure device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, such as firewalls and web proxies, and management interfaces of network devices (routers, switches, VPN concentrators).",
            "action": [
              "1. (Symbolic Logic): Implement a SIEM correlation rule that ingests threat intelligence feeds of known adversary C2 IP addresses and domains. Generate a high-severity alert when a destination IP in `Zeek conn.log` or a `server_name` in `Zeek ssl.log` matches an entry. Enrich alerts with GeoIP and WHOIS data for the destination IP to provide immediate context.",
              "2. (Statistical Method): For all outbound TLS connections, analyze the JA3 and JA3S hash pairs from `Zeek ssl.log`. Establish a 30-day rolling baseline of the frequency of each hash. Flag connections using JA3/JA3S hashes that fall below the 1st percentile of frequency, as this indicates non-standard client or server software potentially used for C2.",
              "3. (Machine Learning): Train a time-series forecasting model (e.g., ARIMA, Prophet) on the volume of outbound TLS connections per internal host and per destination ASN. Use the model to detect anomalous spikes in new TLS sessions that deviate significantly from the forecast, which could indicate C2 beaconing activity."
            ]
          },
          {
            "description": "A TLS/SSL session is observed utilizing a deprecated protocol version (e.g., SSLv3, TLS 1.0), a weak cipher suite (e.g., containing RC4, 3DES, EXPORT), or an insufficient certificate key length (e.g., RSA < 2048 bits), in direct violation of established security policy.",
            "data_sources": [
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All network segments, with a focus on traffic to/from critical assets (e.g., authentication servers, database servers, application servers) and all network egress points.",
            "action": [
              "1. (Symbolic Logic): Create and maintain an explicit watchlist of deprecated protocol versions (e.g., 'SSLv3', 'TLSv10'), weak cipher suite identifiers (e.g., containing 'RC4', 'DES', 'NULL', 'EXPORT'), and minimum key-length requirements. Query `Zeek ssl.log` records in real-time where the `version`, `cipher`, or certificate `key_alg`/`key_len` fields violate this policy and generate a high-severity alert.",
              "2. (Statistical Method): Establish a network-wide baseline for the ratio of policy-compliant TLS sessions to non-compliant sessions. Calculate this ratio hourly. Generate an alert if the proportion of non-compliant sessions increases by more than 3 standard deviations from the 30-day moving average, which could indicate a systemic downgrade attack or widespread misconfiguration.",
              "3. (Machine Learning): Use a classification model (e.g., Random Forest, Gradient Boosting) trained on labeled features from `Zeek ssl.log` (`version`, `cipher`, `resumed`, `established`, certificate validity) to classify each new session as 'compliant' or 'non-compliant/suspicious'. This model can identify complex patterns of non-compliance that simple rules might miss."
            ]
          },
          {
            "description": "Detection of unencrypted, cleartext protocol traffic (e.g., HTTP on port 80, FTP on port 21, Telnet on port 23) communicating with a critical asset (e.g., domain controller, database server, administrative web portal) where encrypted communication is mandated by policy.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ftp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments containing designated critical assets, such as data center networks, management VLANs, and segments hosting authentication servers (e.g., Active Directory Domain Controllers).",
            "action": [
              "1. (Symbolic Logic): Define a list of critical asset IP addresses and a watchlist of cleartext protocol ports (e.g., 21, 23, 80, 110, 143). Create a SIEM rule that triggers an immediate, high-priority alert when a `Zeek conn.log` record shows a connection to a critical asset IP on a cleartext port from any source not on a pre-approved exception list.",
              "2. (Statistical Method): For each critical network segment, establish a baseline of protocol usage. Calculate the daily ratio of encrypted traffic volume (e.g., bytes on port 443, 993) to unencrypted traffic volume (e.g., bytes on port 80, 143). Generate an alert if this ratio drops by a statistically significant amount (e.g., more than 2 standard deviations from the 30-day rolling average).",
              "3. (Machine Learning): Use a clustering algorithm (e.g., K-Means, DBSCAN) on `Zeek conn.log` data, using features like `id.orig_h`, `id.resp_p`, `proto`, `duration`, `orig_bytes`, and `resp_bytes`. Identify clusters representing normal, expected cleartext traffic. Monitor for critical asset IPs appearing in a cleartext cluster, which would represent a high-confidence anomaly."
            ]
          },
          {
            "description": "An unauthorized or anomalous modification is detected on a Windows Registry key or system file that controls system-wide or application-specific cryptographic settings. Key targets include the `HKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\SCHANNEL` registry path and its subkeys.",
            "data_sources": [
              "Windows Event ID 4657",
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical servers (especially web servers), domain controllers, and administrator workstations where system-wide cryptographic policies are managed.",
            "action": [
              "1. (Symbolic Logic): Enable SACL auditing on critical cryptographic registry keys (e.g., `SCHANNEL` and its subkeys `Ciphers`, `Hashes`, `KeyExchangeAlgorithms`). Create a rule to alert on any modification event (Windows Event ID 4657) to these objects. Correlate with the parent process (via Event ID 4688) and alert if the modifying process or user is not on an explicit allowlist (e.g., trusted patch management software).",
              "2. (Statistical Method): Profile the normal frequency, timing, and responsible processes for modifications to these settings, which typically align with predictable patch cycles. Calculate a rarity score for each modification based on the user account, process name, and time of day. A high score, indicating a rare combination, should trigger an alert for investigation.",
              "3. (Machine Learning): Train a one-class SVM or Isolation Forest model on event log sequences (e.g., Event ID 4688 followed by 4657) representing normal administrative activity on cryptographic objects. Any new activity sequence that the model flags as an outlier (i.e., falls outside the learned boundary of normal behavior) is flagged as a high-confidence anomaly."
            ]
          },
          {
            "description": "An authenticated session to a network device's management interface (e.g., SSH, HTTPS) originates from an IP address not on an approved list of administrative hosts, or the session exhibits anomalous characteristics such as unusual time-of-day or data transfer volume.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Management VLANs, administrator jump boxes, and the network interfaces of core network infrastructure like firewalls, routers, and VPN concentrators.",
            "action": [
              "1. (Symbolic Logic): Maintain a strict allowlist of authorized IP addresses for administrative jump boxes/subnets. Create a rule to alert on any connection in `Zeek conn.log` to a network device's management IP/port from a source IP not on this list. Correlate with successful authentications (Windows Event ID 4624) on the jump box if possible.",
              "2. (Statistical Method): For each administrator account, baseline the distribution of login times, source subnets, and session data volumes (`orig_bytes`, `resp_bytes` in `Zeek conn.log`) to management interfaces. Generate an alert if a new login creates a multi-dimensional outlier (e.g., > 3 standard deviations from the user's mean login hour and > 98th percentile of data transferred).",
              "3. (Machine Learning): Use an autoencoder trained on vectors of session features (`duration`, `orig_bytes`, `resp_bytes`, `hour_of_day`, `day_of_week`) from normal administrative sessions captured in `Zeek conn.log`. Flag any new session that has a high reconstruction error, indicating it does not conform to the learned patterns of normal administrative activity."
            ]
          },
          {
            "description": "A file is transferred from a network infrastructure device (e.g., firewall, router) to a destination not on an approved list of configuration backup or management servers. This is especially suspicious if the file has a high-entropy name or if the transfer occurs outside a scheduled maintenance window.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network infrastructure devices, configuration backup servers, TFTP/FTP servers, and network egress points.",
            "action": [
              "1. (Symbolic Logic): Create a rule that alerts on any file transfer identified in `Zeek files.log` or a connection on ports 21 (FTP), 22 (SCP), or 69 (TFTP) in `Zeek conn.log` where the source IP is a network device and the destination IP is not on an explicit allowlist of backup/management servers. The rule should trigger a high-severity alert.",
              "2. (Statistical Method): For each network device, baseline the typical size of configuration backup files. Alert on any file transfer from these devices that significantly exceeds the 99th percentile of historical file sizes. Additionally, calculate the Shannon entropy of filenames in `Zeek files.log` where the source is a network device; an entropy score > 4.0 suggests obfuscation and warrants investigation.",
              "3. (Machine Learning): Train a classification model (e.g., a decision tree) with features from `Zeek files.log` and `conn.log` (e.g., `fuid`, `tx_hosts`, `rx_hosts`, `conn_uids`, `source`, `mime_type`, `total_bytes`, `is_orig`) to distinguish between 'legitimate backup' and 'anomalous transfer'. This can identify subtle deviations from normal backup patterns that may indicate exfiltration of a modified firmware image."
            ]
          }
        ]
      }
    ],
    "version": "2.3",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]