[
  {
    "information_requirement": "Has an adversary successfully enumerated objects in our designated cloud storage environments (e.g., AWS S3, Azure Blob, Google Cloud Storage)?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1619",
        "name": "Cloud Storage Object Discovery",
        "evidence": [
          {
            "description": "A successful API call for object enumeration (e.g., AWS ListObjectsV2, Azure List Blobs) originates from an IP address present on a threat intelligence feed of known malicious IPs, anonymizing proxies, or TOR exit nodes.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Provider Egress IPs, Network Egress/Internet Gateway, Threat Intelligence Platforms",
            "action": [
              "Symbolic: Continuously monitor cloud audit logs (e.g., AWS CloudTrail eventName:ListObjectsV2) for enumeration API calls. Join the source IP address from these events with a high-confidence, frequently updated threat intelligence feed of known malicious IPs, anonymizing proxies, and TOR exit nodes. Generate a high-severity alert upon any match.",
              "Statistical: For all enumeration API calls, calculate the rarity of the source Autonomous System Number (ASN) and country of origin. Establish a baseline of common source ASNs/countries for your organization's legitimate traffic. Alert when an enumeration call originates from an ASN or country that falls below the 5th percentile of historical frequency.",
              "Machine Learning: Train a logistic regression classifier on historical enumeration events, using features such as source IP reputation, ASN, country, time of day, and user agent. Use the model to score new enumeration events in real-time for their likelihood of being malicious. Investigate events with a probability score above a predetermined threshold, such as 0.85."
            ]
          },
          {
            "description": "A process creation event (Windows Event ID 4688) contains command-line arguments specific to known cloud discovery tools (e.g., 's3scanner', 'cloud_enum'), or a network request to a cloud API endpoint (observed in Zeek http.log) contains a User-Agent string associated with such tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Endpoints, DevOps/Cloud Engineering Workstations, CI/CD Pipeline Servers, Virtual Desktop Infrastructure (VDI)",
            "action": [
              "Symbolic: Monitor Windows Event ID 4688 process creation events for command-line arguments matching a curated list of regular expressions for cloud discovery tools (e.g., 's3scanner', 'cloud_enum', 'aws s3 ls --recursive'). Concurrently, monitor Zeek http.log for User-Agent strings matching a known-bad list for these tools. Alert immediately on any match.",
              "Statistical: Calculate the Shannon entropy of command-line arguments for processes making network connections to cloud API endpoints (e.g., aws.exe, az.cmd). A sudden spike in entropy for a user's process may indicate the use of obfuscated or complex discovery commands. Alert when the entropy score for a command exceeds 3 standard deviations from the user's historical baseline.",
              "Machine Learning: Develop a One-Class Support Vector Machine (OC-SVM) model trained on 'normal' User-Agent strings seen in requests to cloud APIs from your environment. Use the model to identify anomalous User-Agent strings that deviate from this learned normality, which could indicate the use of a new or custom discovery tool. Flag these anomalies for analyst review."
            ]
          },
          {
            "description": "The rate of object or container listing API calls (e.g., ListObjects, ListBlobs) from a single identity (user, role, or service principal) or source IP address exceeds a statistically-derived threshold over a defined time window (e.g., > 1000 list calls in 5 minutes).",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Provider IAM Infrastructure, Authentication Logs, Network Flow Collectors",
            "action": [
              "Symbolic: Create a SIEM rule that counts the number of cloud enumeration API calls (e.g., eventName:ListObjectsV2, operationName:Microsoft.Storage/storageAccounts/listKeys/action) per source IP and user identity over a sliding 10-minute window. Alert if the count exceeds a hard-coded threshold (e.g., 500 events) that is known to be abnormal for the environment.",
              "Statistical: For each user identity, establish a baseline of the hourly number of enumeration API calls using historical cloud audit log data. Use a percentile-based approach to detect anomalies. Generate an alert when a user's hourly call count exceeds their own 99th percentile, or the 99th percentile of their assigned role peer group.",
              "Machine Learning: Implement a time series forecasting model (e.g., ARIMA) for the overall volume of enumeration API calls across the entire cloud environment. Use the model to predict the expected volume for the next hour. Alert when the actual observed volume significantly exceeds the model's predicted upper confidence interval, indicating a potential widespread discovery campaign."
            ]
          },
          {
            "description": "A user account or service principal, which has no historical record of performing discovery actions, executes an object enumeration API call for the first time. Alternatively, an identity performs enumeration against a storage container or resource type it has never interacted with before.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Google Cloud Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud IAM Roles and Policies, User Directory and Group Membership Data, Cloud Audit Logs",
            "action": [
              "Symbolic: Maintain a list of all identities that have performed enumeration actions in the last 90 days. Generate an alert whenever an identity not on this 'first time access' list performs an enumeration API call.",
              "Statistical: For each user and role, create a profile of normal activity, including a set of API calls they typically make. Use a Jaccard Index to measure the similarity between the set of API calls made in a given hour and their historical set. Alert when the similarity score drops below a threshold (e.g., 0.5), and the new, unseen calls include enumeration actions.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) to group users into peer groups based on their API call patterns and IAM roles. Identify outliers within each cluster who perform enumeration activities that are anomalous for their peer group. These outliers represent a deviation from their established role-based baseline and warrant investigation."
            ]
          },
          {
            "description": "A specific user identity or source IP address issues one or more object enumeration calls (e.g., ListObjectsV2), which is followed within a short time window (e.g., 30 minutes) by a high volume of data retrieval calls (e.g., GetObject) or permission modification calls (e.g., PutBucketPolicy) from the same identity/IP.",
            "data_sources": [
              "AWS CloudTrail",
              "Azure Activity Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud Storage Buckets/Containers, Cloud Audit Logs, Network Egress Points",
            "action": [
              "Symbolic: Create a stateful correlation rule that triggers when a specific source IP/user performs a 'List*' API call. If the same source IP/user then performs more than 10 'Get*' or 'Put*' API calls on related resources within the next 15 minutes, generate an alert for a 'Discovery followed by Collection/Modification' chain.",
              "Statistical: When a discovery event is detected, begin tracking the volume of data egress (e.g., `bytes_resp` in Zeek conn.log or `responseElements.bytesTransferred` in cloud logs) associated with the source identity/IP. Compare this egress volume in the 30 minutes post-discovery to the identity's historical baseline. Alert if the data transfer volume exceeds the 98th percentile of their typical activity.",
              "Machine Learning: Model adversary behavior as a sequence of events. Use a sequence-aware algorithm like a Hidden Markov Model (HMM) trained on benign sequences of API calls. Feed real-time streams of API calls per user into the model. An alert is generated when the model encounters a sequence (e.g., ListObjectsV2 -> GetObject -> GetObject -> ...) that has a low probability under the benign model, indicating a likely attack chain."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]