[
  {
    "information_requirement": "Is the adversary performing discovery on the network, specifically for Group Policy settings?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1615",
        "name": "Group Policy Discovery",
        "evidence": [
          {
            "description": "Execution of a process whose file hash matches a known malicious GPO discovery tool.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All domain-joined endpoints and member servers",
            "action": "Symbolic Logic: Create a detection rule that monitors process creation events (Windows Event ID 4688) and triggers an alert when the process image's hash (e.g., SHA256) matches a known malicious signature from a threat intelligence feed for tools like PowerView or BloodHound. Statistical: For processes that perform GPO discovery (e.g., gpresult.exe) but do not match a known hash, analyze the parent-child process relationship. Calculate the rarity of the parent process (e.g., winword.exe, outlook.exe) spawning the discovery tool. An alert should be generated if the parent process falls outside the 99th percentile of common parent processes, indicating anomalous execution. Machine Learning: Develop a supervised classification model (e.g., random forest) trained on features from process execution events (process name, parent process name, command-line length, user context). The model will classify each GPO-related execution as benign or suspicious, flagging activity that deviates from established baselines of administrative behavior."
          },
          {
            "description": "Execution of native utilities or PowerShell with command-line arguments characteristic of GPO enumeration.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All domain-joined endpoints and member servers, especially those used by administrators",
            "action": "Symbolic Logic: Deploy a SIEM rule that monitors process creation events (Windows Event ID 4688) for the execution of gpresult.exe, powershell.exe, or pwsh.exe. The rule should trigger on specific high-risk command-line argument patterns, such as `gpresult /z`, `Get-GPO -All`, or `Get-NetGPO`. Statistical: For all observed GPO-related command-line executions, calculate the entropy of the command-line string. Establish a baseline of command-line entropy for legitimate administrative scripts. A command with unusually high entropy (e.g., exceeding the 95th percentile) may indicate obfuscation. Additionally, perform frequency analysis on the user-host-command combination, flagging executions that are rare for a specific user or host. Machine Learning: Use a time-series anomaly detection model (e.g., ARIMA) to monitor the hourly frequency of GPO discovery commands per user. Train the model on historical data to learn normal administrative patterns. An alert should be generated when the model detects a significant spike in activity inconsistent with the user's established baseline."
          },
          {
            "description": "A statistically significant increase in LDAP queries from a single source host targeting objects of class 'groupPolicyContainer'.",
            "data_sources": [
              "Zeek ldap.log",
              "Windows Event ID 4661"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers and network segments containing Domain Controllers",
            "action": "Symbolic Logic: Create a rule to detect and alert on LDAP search queries containing a filter for `(objectClass=groupPolicyContainer)`. While legitimate, this specific query is a foundational step for tools like BloodHound and PowerView. Correlating this with other suspicious activity from the same source IP should increase the alert's priority. Statistical: Monitor Zeek ldap.log or Windows Event ID 4661. For each source host, establish a baseline of the hourly count of queries targeting 'groupPolicyContainer' objects over a 30-day rolling window. Generate an alert if the query count from a single host in a one-hour period exceeds 3 standard deviations (Z-score > 3) above its baseline mean. Machine Learning: Implement an unsupervised clustering algorithm (e.g., DBSCAN) on LDAP query data. Features for clustering should include source IP, query frequency, and query filter complexity. The model can group activity into clusters of 'normal administrative behavior' and 'anomalous enumeration', allowing analysts to focus on the anomalous clusters."
          },
          {
            "description": "A high volume of read operations on files within the SYSVOL 'Policies' directory, originating from a non-administrative user or a non-Domain Controller host.",
            "data_sources": [
              "Windows Event ID 5140",
              "Windows Event ID 4663",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "SYSVOL share on all Domain Controllers",
            "action": "Symbolic Logic: Create a rule that alerts whenever a user account not in a predefined 'GPO Admins' or 'Domain Admins' security group accesses more than 5 unique files in the `\\\\SYSVOL\\<domain>\\Policies\\` directory within a 10-minute window. Statistical: From Zeek smb_files.log or Windows Event ID 4663, for each user session accessing the SYSVOL share, calculate the total number of unique policy files read. Establish a distribution of this metric for all users over a 30-day period. Flag any session where the number of files read exceeds the 98th percentile of the distribution. Machine Learning: Train a One-Class SVM model on features of legitimate SYSVOL access, including source host, user account, number of files accessed, and time of day. The model learns the boundary of 'normal' activity. Any new access event that falls outside this learned boundary is flagged as an anomaly, effectively detecting novel enumeration methods."
          },
          {
            "description": "A single source host performing LDAP queries for 'groupPolicyContainer' objects, immediately followed by SMB access to the `\\SYSVOL\\...\\Policies` share.",
            "data_sources": [
              "Windows Event ID 4661",
              "Windows Event ID 5140",
              "Zeek ldap.log",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers and network segments connecting endpoints to Domain Controllers",
            "action": "Symbolic Logic: Implement a stateful correlation rule. IF a source IP generates an LDAP query with filter `(objectClass=groupPolicyContainer)` (from Zeek ldap.log or Windows Event ID 4661), THEN start a 5-minute timer. IF the same source IP is observed accessing the `\\\\SYSVOL\\...\\Policies` share (from Zeek smb_files.log or Windows Event ID 5140) within that window, THEN generate a high-severity alert. Statistical: Build a transition probability matrix for common sequences of network events. Calculate the probability of an 'LDAP GPO Query' event being followed by an 'SMB SYSVOL Access' event from the same source within 5 minutes. If this transition probability is historically very low (e.g., P < 0.01), flag it as a statistically significant behavioral anomaly. Machine Learning: Use a sequence analysis model, such as a Hidden Markov Model (HMM), to learn common sequences of user actions. The model can calculate the likelihood of an observed sequence. The specific sequence of 'LDAP GPO Query' -> 'SMB SYSVOL Access' will be assigned a very low probability by a trained model, and any occurrence will be flagged as a high-confidence anomaly."
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]