[
  {
    "information_requirement": "Has the adversary escalated privileges by escaping from a container or virtualized environment to the underlying host?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1611",
        "name": "Escape to Host",
        "evidence": [
          {
            "description": "A process is created on a container host where the process executable's hash or name matches a known container escape tool or payload.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Container Host Servers",
            "action": [
              "Symbolic: Query process creation events (Windows Event ID 4688) on container hosts. Alert if the ProcessName or the calculated hash of the NewProcessName executable matches a threat intelligence list of known container escape tools (e.g., 'deepce.sh', 'pwn.sh') or malware.",
              "Statistical: For each process created on a host, analyze the command line arguments. Calculate the entropy of the command line. A high entropy score, exceeding the 95th percentile for the host's historical command line entropy, may indicate obfuscated or packed payloads often used in exploits.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on features from process creation events, including parent process, command line length, and argument entropy. Use the model to classify each new process as benign or suspicious, flagging those with characteristics similar to historical escape payloads."
            ]
          },
          {
            "description": "A sequence of events on a container host matches a known container escape vulnerability pattern, such as a containerized process writing to a mounted host path followed by a host process executing the written file.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Container Host Servers",
            "action": [
              "Symbolic: Create a correlation rule that triggers when: (1) A file write event (Windows Event ID 4663) occurs on a sensitive host path from a known container process, and (2) a process creation event (Windows Event ID 4688) executes that same file path within a 60-second window. Alert on this specific write-then-execute sequence.",
              "Statistical: Establish a baseline of file write locations for each container image. Monitor for write events (Windows Event ID 4663) from containerized processes to host directories that are statistical outliers (i.e., directories not in the top 99% of typical write locations for that image). A subsequent execution from that rare location significantly increases the risk score.",
              "Machine Learning: Use a sequence analysis model (e.g., Hidden Markov Model) trained on event logs to identify anomalous sequences of process creation and file modification events. The model should learn normal operational sequences and flag deviations that resemble known multi-stage exploit chains for container escapes."
            ]
          },
          {
            "description": "A process is created on the host OS whose parent process is identified as running within a container context, indicating a direct process tree breakout.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Container Host Servers",
            "action": [
              "Symbolic: For every new process (Windows Event ID 4688), inspect its parent process. If the parent process is a known container runtime process (e.g., 'containerd-shim-runc-v2.exe') or is running in a container security context, but the new child process is not, flag this as a breakout.",
              "Statistical: Build a profile for each container host of normal parent-child process relationships. Calculate the frequency of each unique parent-child pair. Alert when a new parent-child pair appears that has a frequency of zero in the historical baseline, especially if the parent is container-related and the child is a sensitive host process (e.g., 'powershell.exe').",
              "Machine Learning: Use a graph-based anomaly detection model on the process tree. Represent processes as nodes and parent-child relationships as edges. The model can identify anomalous edges that cross the logical boundary between a 'container' subgraph and the 'host' subgraph, which would not be present in normal operations."
            ]
          },
          {
            "description": "A containerized process communicates with the Docker control socket/pipe, followed by the creation of a privileged container or execution of a command on the host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Container Host Servers",
            "action": [
              "Symbolic: Monitor for process creation events (Windows Event ID 4688) for 'docker.exe' with suspicious command line arguments like '--privileged', '-v /:/host', or '--pid=host'. Correlate this with preceding network connections (Windows Event ID 5156) to the Docker named pipe ('\\\\.\\pipe\\docker_engine') from a process inside a container.",
              "Statistical: Profile the commands executed via 'docker.exe' on each host. Calculate the frequency of each command and its arguments. Alert when a command's arguments (e.g., the mounted volume path) are a statistical outlier or have a historical frequency of zero, especially if the command is initiated by a non-administrative user.",
              "Machine Learning: Apply Natural Language Processing (NLP) techniques to the command line arguments of 'docker.exe' executions. Train a model to classify command lines as benign or malicious based on the combination and structure of flags and arguments. This can detect novel combinations of arguments designed to achieve an escape."
            ]
          },
          {
            "description": "A process running within a container context is observed accessing or modifying sensitive host system files or registry keys that are not part of its declared volume mounts.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Container Host Servers",
            "action": [
              "Symbolic: Create an alert that triggers if any file or registry access event (Windows Event ID 4663, 4657) from a process identified as containerized (via parent process correlation with Windows Event ID 4688) targets a highly sensitive host file (e.g., 'C:\\Windows\\System32\\config\\SAM') or registry key ('HKLM\\SECURITY').",
              "Statistical: For each container image, build a baseline of all file paths and registry keys it normally accesses. Alert when a container process accesses a file or key that falls below a rarity threshold (e.g., in the bottom 1% of access frequencies), indicating it is accessing something highly unusual for its profile.",
              "Machine Learning: Use unsupervised learning (e.g., clustering) to group container processes based on their file and registry access patterns. An escape attempt may manifest as a process that is suddenly re-classified into a different cluster or is identified as a significant outlier from all known clusters."
            ]
          },
          {
            "description": "A process, identified as having escaped a container via parent-child process analysis, initiates one or more outbound network connections to an external IP address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points (e.g., Firewalls, Gateways)",
            "action": [
              "Symbolic: If a process is flagged as a potential container escape, immediately query network connection logs (Zeek conn.log) for any connections originating from its Process ID and host IP. Alert if the destination IP is external and not on an allowlist of known-good destinations.",
              "Statistical: For any process flagged as a potential escape, analyze its network connections (Zeek conn.log). Compare the destination country, ASN, and port against the host's historical baseline. Alert if any of these features are statistical outliers (e.g., connection to a country never before seen from this host).",
              "Machine Learning: Apply time series analysis to the network traffic volume (bytes out) from a host. If a container escape is suspected at time T, look for an anomalous spike in outbound traffic shortly after T. A time series forecasting model can predict expected traffic, and a significant deviation from the forecast would be a strong corroborating signal for C2 or exfiltration."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]