[
  {
    "information_requirement": "Has the adversary accessed credentials by stealing or forging authentication certificates?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1649",
        "name": "Steal or Forge Authentication Certificates",
        "evidence": [
          {
            "description": "A process execution event where the process file hash matches a known hash of a certificate theft tool, or a network connection is observed using a TLS certificate whose thumbprint matches a known malicious certificate.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Certificate Authority Servers, All Endpoints, Network Egress Points",
            "action": [
              "Create a SIEM rule that joins the process hash from process creation events (Windows Event ID 4688) with a threat intelligence watchlist of file hashes for known certificate manipulation tools (e.g., Certipy, Mimikatz, Rubeus). Separately, create a rule that joins the certificate thumbprint (`id` field) from Zeek x509.log against a watchlist of known malicious certificate thumbprints. Generate a high-severity alert on any match.",
              "For each host, profile the execution frequency of legitimate certificate management tools (e.g., certutil.exe, certlm.msc). Establish a baseline execution count per hour for different host roles (e.g., workstation, DC, CA server). Generate an alert when the execution count for a given host exceeds the 99th percentile of its established baseline, particularly if correlated with an anomalous user account.",
              "Train a supervised classification model (e.g., XGBoost) on enriched process execution events (Windows Event ID 4688). Features should include process name, parent process name, command-line argument entropy, user context, and a binary feature indicating if the hash is on an internal known-good list. Use the model to assign a risk score to all new process executions, flagging those with a high probability of being malicious for analyst review."
            ]
          },
          {
            "description": "A process creation event is recorded with command-line arguments containing patterns indicative of certificate enumeration, request, export, or theft using known offensive security tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Certificate Authority Servers, All Endpoints with PowerShell/CMD access",
            "action": [
              "Implement a SIEM detection rule using regular expressions to scan command-line arguments from process creation events (Windows Event ID 4688) and PowerShell script block logs (Event ID 4104). Search for patterns associated with tools like Certipy (`find -vulnerable`, `auth -pfx`), Mimikatz (`crypto::certificates`, `crypto::export`), and Rubeus (`asktgs /pfx`). Generate a high-severity alert upon any regex match.",
              "For each user and host combination, calculate a baseline entropy score for command-line arguments associated with `powershell.exe`, `cmd.exe`, and `certutil.exe`. A command whose argument entropy exceeds 3 standard deviations from the established baseline for that user/host pair should be flagged for review, as this may indicate obfuscated or packed commands.",
              "Deploy a Natural Language Processing (NLP) model, specifically a transformer-based classifier fine-tuned on a labeled dataset of malicious and benign command lines. The model will analyze the semantic structure of command lines from Event ID 4688 and 4104 to classify them as benign, suspicious, or malicious, enabling the detection of novel or obfuscated attack variations that regex might miss."
            ]
          },
          {
            "description": "A certificate enrollment request is logged on a Certificate Authority (CA) server where the requestor, requested template, or specified Subject Alternative Name (SAN) violates security policy or deviates from established baselines.",
            "data_sources": [
              "Windows Event ID 4886",
              "Windows Event ID 4898",
              "Windows Event ID 4887"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Certificate Authority (CA) Servers",
            "action": [
              "Create a SIEM rule that monitors certificate request events (Windows Event ID 4886). The rule should check against a strict allow-list of (User/Group, Certificate Template) pairings. Generate a critical alert for any request where a user specifies a Subject Alternative Name (SAN) on a template that allows it (potential for ESC1), or any request for a 'Cross-CA' or 'Sub-CA' template from a non-CA machine.",
              "For each certificate template, establish a baseline of the set of unique users/machines that typically request it. Use a rarity score for each new (requester, template) pair. A request pair with a very high rarity score (e.g., a user requesting a web server certificate for the first time) should be flagged. Additionally, track the rate of failed requests (Event ID 4887) per user; a sudden spike exceeding 3 standard deviations from their personal baseline could indicate probing for misconfigurations.",
              "Develop a multivariate time-series anomaly detection model (e.g., VAR or LSTM) monitoring CA activity. The model should track the volume of successful requests (Event ID 4898) and failed requests (Event ID 4887) per template over time. An anomalous spike in requests for a sensitive template (e.g., Domain Controller Authentication) or a sudden increase in the failure rate for a specific template could indicate an automated abuse attempt."
            ]
          },
          {
            "description": "An event is logged indicating a cryptographic key was accessed or exported by a process or user account not authorized for certificate management, or file system auditing shows access to protected key storage by an unusual process.",
            "data_sources": [
              "Windows Event ID 5058",
              "Windows Event ID 5059",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "All Endpoints and Servers, especially Domain Controllers and Certificate Authority Servers",
            "action": [
              "Create a SIEM rule that monitors for key export events (Windows Event ID 5058 with Operation 'Export of persistent key'). Correlate the Process ID from this event with process creation events (Event ID 4688) to identify the process name. Alert if the process name is not on a pre-defined allow-list of applications approved for key export (e.g., certlm.msc, lsass.exe for specific operations).",
              "Establish a baseline of users who perform key access or export operations. Alert when a user performs a key export (Event ID 5058) for the first time. Separately, monitor file access events (Event ID 4663) to key storage directories (e.g., C:\\ProgramData\\Microsoft\\Crypto\\RSA\\MachineKeys) and alert if the number of access events from a single process within a 1-minute window exceeds the 98th percentile for that host.",
              "Train an unsupervised anomaly detection model (e.g., Isolation Forest) using features derived from key access events (5058, 5059) and file access events (4663). The feature set should include user account, process name, target key/file path, and time of day (as cyclical features). The model will learn normal access patterns and identify rare combinations that represent anomalous behavior, such as a non-system process accessing machine keys outside of business hours."
            ]
          },
          {
            "description": "A successful certificate-based logon (Kerberos PKINIT or Schannel) occurs with multiple anomalous characteristics, such as originating from a geographically rare location, being the first certificate-based logon for that user, or occurring from a device never before seen for that user.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain Controllers, Authentication Servers (RADIUS/NPS), VPN Concentrators, Network Gateways",
            "action": [
              "Create a SIEM rule that triggers on successful logon events (Windows Event ID 4624) where the Logon Type is 'Network' or 'RemoteInteractive' and the Authentication Package is `Kerberos` or `Schannel` with certificate usage indicated. Maintain a watchlist of privileged accounts or service accounts not expected to use certificate-based interactive logon. Generate an alert if any of those accounts successfully authenticates via this method.",
              "For each user account, build a historical profile of successful certificate-based logons, including source IP addresses, source hostnames, and logon times. Use geolocation data from Zeek conn.log to enrich the source IP. Alert on a new logon if the great-circle distance from the previous logon's location creates an 'impossible travel' scenario. Also, alert if the logon's source Autonomous System Number (ASN) has never been seen for that user.",
              "Implement a peer group analysis model using clustering (e.g., K-Means or DBSCAN). Group users based on their roles and organizational structure. The model analyzes authentication behavior (logon types, target systems, source networks, protocols) to define normal activity for each peer group. An alert is generated when a user's certificate authentication behavior significantly deviates from the established centroid of their peer group, such as an HR user authenticating to a CA server."
            ]
          },
          {
            "description": "File system auditing logs show a process creating or modifying a file with a certificate extension (e.g., .pfx, .p12, .pem) in a non-standard directory (e.g., network share, user's temp folder), immediately followed by an outbound network connection from the same process.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User Workstations, File Servers, Web Servers, Network Egress Points",
            "action": [
              "Configure and deploy a File System Object Access SACL on sensitive directories and common staging areas (e.g., %TEMP%, C:\\Users\\Public) to monitor for write events (Event ID 4663) on files with extensions `.pfx`, `.p12`, `.pem`, `.crt`, `.cer`. Create a SIEM rule to alert when such a write is performed by a process not on an explicit allow-list (e.g., browser, cert-enrollment client).",
              "Analyze Zeek files.log to baseline the frequency and volume of files transferred with MIME type `application/x-pkcs12` or `application/x-x509-ca-cert`. Alert when the hourly volume of these files being transferred outbound exceeds a dynamic threshold based on the 95th percentile of the trailing 30-day average. Correlate with Zeek conn.log to identify the destination IP and flag if it is uncategorized or has a low reputation score.",
              "Develop a sequence analysis model to detect the specific chain of events indicating certificate theft and exfiltration. The model should trigger a high-severity alert if the following sequence occurs for a single process (by Process GUID or PID) within a short time window (e.g., 2 minutes): 1. Process writes a file with a .pfx or .pem extension (Event ID 4663). 2. The same process initiates an outbound network connection (Zeek conn.log). 3. A file is transferred over the network with a MIME type matching certificates (Zeek files.log)."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]