[
  {
    "information_requirement": "Has the adversary abused serverless computing for arbitrary code execution? (PIR)",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1648",
        "name": "Serverless Execution",
        "evidence": [
          {
            "description": "Outbound network connection from a known serverless IP range to an external IP or domain present on a threat intelligence feed, with data transfer volume exceeding 1MB.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Cloud provider serverless environments, Internet gateways, DNS resolvers.",
            "action": [
              "Symbolic: Join Zeek conn.log `id.orig_h` with a maintained list of cloud provider serverless IP ranges. For matching records, inner join Zeek dns.log `id.resp_h` or conn.log `id.resp_h` against a threat intelligence feed of known malicious domains and C2 IPs. Alert on any match.",
              "Statistical: For traffic originating from serverless IP ranges, calculate the entropy of destination ports and destination IPs per 1-hour window. Alert if entropy scores exceed a dynamic baseline (e.g., > 3 standard deviations from the historical mean), suggesting scanning or DGA activity.",
              "Machine Learning: Train a classification model (e.g., Random Forest) on labeled Zeek conn.log records, using features like `duration`, `orig_bytes`, `resp_bytes`, `proto`, and destination port. Use the model to classify new outbound connections from serverless IPs as 'benign' or 'malicious C2'. Flag connections classified as malicious with high confidence."
            ]
          },
          {
            "description": "A process (Windows Event ID 4688) is created by a service account associated with a serverless function, and the process command line contains patterns associated with reconnaissance, credential dumping, or living-off-the-land binaries (LOLBAS).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Domain controllers, Application servers, Endpoint devices of privileged users.",
            "action": [
              "Symbolic: Correlate successful logons by known serverless service accounts (Windows Event ID 4624) with subsequent process creation events (Windows Event ID 4688) by the same Logon ID. Scan the `CommandLine` field using regular expressions for known malicious tools (`mimikatz.exe`), reconnaissance commands (`whoami`, `nltest /dclist:*`), or LOLBAS usage (`certutil -urlcache`, `rundll32.exe javascript:...`). Alert on any match.",
              "Statistical: For each serverless service account, build a frequency distribution of executed processes and command-line arguments from historical Windows Event ID 4688 data. Calculate a rarity score for each new execution based on its historical frequency. Alert when a process or argument combination has a rarity score above the 95th percentile for that account.",
              "Machine Learning: Model normal process execution sequences for serverless service accounts using a Markov chain or n-gram analysis on Windows Event ID 4688 data. Use the model to calculate the probability of a new observed sequence of process creations (e.g., `script.py` -> `powershell.exe` -> `net.exe`). Alert when a sequence has a probability below a learned threshold, indicating a deviation from normal behavior."
            ]
          },
          {
            "description": "A service account associated with a serverless function authenticates to or establishes a network connection with an internal host or service for the first time, or the total number of unique connections in a 24-hour period exceeds a dynamically established baseline by more than 3 standard deviations.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments, Authentication servers (e.g., Domain Controllers), High-value data repositories.",
            "action": [
              "Symbolic: Maintain an access control list (ACL) or allow-list of internal hosts that each serverless service account is expected to connect to. Correlate Zeek conn.log traffic and Windows authentication events (Event ID 4624) with this list. Alert on any connection or authentication attempt from a serverless account to a host not on its specific allow-list.",
              "Statistical: For each serverless service account, establish a baseline of daily unique destination hosts contacted using Zeek conn.log `id.resp_h` or Windows Event ID 4624 `TargetServerName`. Calculate the mean and standard deviation over a 30-day rolling window. Alert if the number of unique hosts contacted in a 24-hour period exceeds the mean by more than 3 standard deviations.",
              "Machine Learning: Use unsupervised clustering (e.g., DBSCAN) on features such as destination port, protocol, and data volume (`orig_bytes`) for connections made by serverless service accounts. Identify clusters of 'normal' activity. Alert when a new connection does not belong to any existing cluster, flagging it as a potential anomaly indicative of lateral movement."
            ]
          },
          {
            "description": "A process spawned by a serverless service account's activity has an anomalous parent process, such as `powershell.exe` being spawned by a Python script interpreter, where this relationship has not been observed historically.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application servers, Database servers, Critical infrastructure hosts.",
            "action": [
              "Symbolic: Create a ruleset of forbidden parent-child process relationships for processes initiated by serverless accounts (e.g., Parent: `w3wp.exe`, Child: `cmd.exe`; Parent: `python.exe`, Child: `powershell.exe`). Monitor Windows Event ID 4688 records where the `CreatorProcessName` and `NewProcessName` match a forbidden pair and the user context is a serverless service account. Alert on any match.",
              "Statistical: For each serverless service account, build a baseline of all observed parent-child process pairs from Windows Event ID 4688 data. Calculate the frequency of each pair. Alert when a new pair is observed for the first time or if a historically rare pair (e.g., frequency < 1%) occurs.",
              "Machine Learning: Train a graph-based anomaly detection model on process execution trees from Windows Event ID 4688 data. Represent normal activity as a graph where nodes are processes and edges are parent-child relationships. Analyze new process trees generated by serverless accounts and identify anomalous subgraphs or structural deviations that indicate malicious execution flow."
            ]
          },
          {
            "description": "A network session initiated by a host recently accessed by a serverless function shows outbound data transfer volume (e.g., `orig_bytes` in Zeek conn.log) to an external destination that is more than 3 standard deviations above the established baseline for that host-destination pair.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress Points, Data staging servers, File shares.",
            "action": [
              "Symbolic: Monitor Zeek conn.log for connections to known cloud storage provider domains (e.g., pastebin.com, mega.nz, S3 buckets outside the organization's control) not on an approved list. Correlate the source IP of these connections with hosts that have recently authenticated a serverless service account (Windows Event ID 4624). Alert on any correlated, unapproved transfer.",
              "Statistical: For each internal host, baseline the volume of outbound data (`orig_bytes` in Zeek conn.log) per destination over a 30-day period. Use a percentile-based threshold (e.g., 99th percentile) for data sent in a single session. Alert if a host, within minutes of a serverless account logon, initiates a session where `orig_bytes` exceeds this threshold, suggesting data staging or exfiltration.",
              "Machine Learning: Use a time-series forecasting model (e.g., Prophet, LSTM) to predict the expected outbound traffic volume for critical internal servers on an hourly basis. Ingest serverless function execution logs or on-prem service account activity as a regressor. Alert when the actual observed traffic volume significantly exceeds the model's prediction, indicating a data transfer event potentially triggered by a serverless function."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]