[
  {
    "information_requirement": "Is the adversary using impersonation tactics to evade defenses or trick users?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1656",
        "name": "Impersonation",
        "evidence": [
          {
            "description": "An inbound email's source IP, 'From' address domain, or an embedded URL matches an entry on a subscribed threat intelligence feed of known malicious indicators.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, DNS Resolvers, Web Proxy",
            "action": [
              "Symbolic Logic: Continuously correlate the `from` header and source IP from `smtp.log` and the `query` field from `dns.log` against a threat intelligence feed of known malicious domains and IPs. Generate a high-severity alert on any match.",
              "Statistical Method: Calculate the historical rarity of all sender domains across the organization. Flag domains that are present on a 'grey' intelligence list (e.g., newly registered domains) and also fall below the 5th percentile of domain frequency in the last 90 days, indicating a rare and potentially suspicious sender.",
              "Machine Learning: Employ a pre-trained classification model to score incoming emails based on features including sender IP reputation, domain age, SPF/DKIM/DMARC validation status, and presence on threat feeds. An email with a score exceeding a dynamically adjusted threshold (e.g., > 0.85) is flagged as a high-risk impersonation attempt."
            ]
          },
          {
            "description": "An email's 'From' header contains a display name matching a high-value internal identity (e.g., executive, finance personnel), but the sender's email address domain is external and not on an approved partner list.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Directory Services",
            "action": [
              "Symbolic Logic: Maintain and query a list of high-value target display names (e.g., 'CEO Name', 'CFO Name'). For each inbound email, parse the `from` header. If the display name matches an entry on the list AND the sender's domain is not the internal domain or a known-partner domain, generate an alert for display name spoofing.",
              "Statistical Method: For emails with display names matching internal figures, calculate the Levenshtein distance between the display name and the username part of the sender's email address (e.g., 'Jane Doe' vs 'j.doe123'). Flag emails where this distance exceeds the 95th percentile of historical values for that recipient, indicating a potential mismatch.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features extracted from the 'From' header: display name string, sender domain, and top-level domain (TLD). Identify clusters of anomalous emails that group together, separate from the large cluster of legitimate mail, which may represent a coordinated spoofing campaign."
            ]
          },
          {
            "description": "An inbound email is received from a sender domain that has a low Levenshtein distance (e.g., 1-2 character difference) to the organization's primary domain or a known partner's domain, indicating potential typosquatting.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, DNS Resolvers",
            "action": [
              "Symbolic Logic: For each inbound email's sender domain from `smtp.log`, check if it is an exact match for an approved domain. If not, calculate the Levenshtein distance to all approved internal and partner domains. Alert if the distance is 1 or 2.",
              "Statistical Method: Profile the frequency of all sender domains. A domain that is both typosquatted (low Levenshtein distance) and has a very low occurrence frequency (e.g., below the 1st percentile) is highly suspicious. Use a scoring system where $$ score = (1 / \\text{frequency}) * (1 / \\text{levenshtein\\_distance}) $$ and flag scores above a set threshold.",
              "Machine Learning: Use a one-class SVM (Support Vector Machine) trained on legitimate, frequently observed sender domains. Present new, unseen domains to the model. Domains that the model classifies as anomalies are candidates for typosquatting and should be flagged for analyst review."
            ]
          },
          {
            "description": "An email's subject or body contains high-urgency keywords (e.g., 'urgent', 'payment', 'wire transfer') and targets individuals in sensitive roles (e.g., finance, HR), or contains a high-risk file attachment.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Endpoint Devices, File Servers",
            "action": [
              "Symbolic Logic: Scan the `subject` field in `smtp.log` for a list of high-risk keywords ('invoice', 'password reset', 'urgent request'). Concurrently, scan `files.log` for email attachments with extensions like `.iso`, `.img`, `.html`, or double extensions. Alert on a match, with severity increased if the recipient is in a high-risk user group.",
              "Statistical Method: Calculate the Shannon entropy of email subject lines. Unusually high entropy can indicate randomized text to evade filters, while low entropy can indicate repetitive attack subjects. Flag subjects with entropy scores more than 2 standard deviations from the mean for the recipient's department.",
              "Machine Learning: Use a fine-tuned NLP model (e.g., BERT) to analyze email content and classify intent into categories like 'Financial Request' or 'Credential Request'. Flag emails classified as high-risk that also deviate from the sender's baseline communication style, if a baseline exists."
            ]
          },
          {
            "description": "An authenticated internal user account sends emails that deviate significantly from its established baseline of activity, such as sending to an abnormally high number of recipients or at an unusual time, especially when correlated with a recent anomalous login event.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Authentication Servers, Endpoint Devices",
            "action": [
              "Symbolic Logic: Correlate a successful login event (Windows Event ID 4624) from a non-standard IP address (geolocation from `conn.log`) with a subsequent burst of email activity from that user account in `smtp.log`. An example rule is: `(Login from untrusted ASN) AND (Email volume > 50 in 10 minutes)`.",
              "Statistical Method: For each user, build a baseline of email activity using `smtp.log` (e.g., average recipients/email, emails/hour, time-of-day distribution). Use a moving average and standard deviation to detect anomalies. Flag accounts where the number of recipients in an email exceeds the 99th percentile of their history.",
              "Machine Learning: Use time-series analysis (e.g., ARIMA) on a per-user basis to model their email sending volume. Flag any user whose current activity is a significant anomaly according to the forecast model (i.e., the actual value falls far outside the model's prediction interval), indicating a potential compromise."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]