[
  {
    "information_requirement": "Is the adversary attempting to impact network or data availability/integrity using email bombing? (PIR)",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1667",
        "name": "Email Bombing",
        "evidence": [
          {
            "description": "An inbound email contains a sender IP, domain, or subject line that matches an entry on a threat intelligence feed for known spam or email bombing services.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Transfer Agent (MTA) servers, Email security gateway, Perimeter firewalls",
            "action": [
              "Symbolic Logic: Create a SIEM rule that queries Zeek smtp.log and conn.log data in real-time. The rule will trigger an alert if the sender IP (`id.orig_h`), sender domain (`from`), or subject line (`subject`) matches an entry in a high-confidence threat intelligence feed specifically tracking email bombing campaigns or spam-as-a-service providers.",
              "Statistical Method: For each recipient, calculate the 95th percentile for the number of distinct sender domains per hour. If an IOC match occurs (from the symbolic rule), check if the recipient is also experiencing a number of distinct sender domains above this statistical baseline. A concurrent alert significantly increases the confidence of a targeted attack.",
              "Machine Learning: Train a supervised classification model (e.g., Logistic Regression, Naive Bayes) on historical email metadata labeled as malicious (from past incidents/threat intel) or benign. Features should include sender domain reputation, IP geolocation, and text-based features from the subject line (e.g., TF-IDF). Use this model to score all incoming emails; an IOC match on a high-scoring email should be a critical alert."
            ]
          },
          {
            "description": "A single recipient receives emails with identical or near-identical subjects from an anomalously high number of unique sender domains or IP addresses within a short time frame (e.g., 5 minutes).",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Transfer Agent (MTA) servers, Email security gateway",
            "action": [
              "Symbolic Logic: Create a rule that triggers if a single recipient email address (`rcpt_to`) receives emails from more than 20 unique sender IPs (`id.orig_h`) with the exact same subject line (`subject`) within a 5-minute window.",
              "Statistical Method: For each 5-minute window per recipient, calculate the Shannon entropy of the sender domains (`from`). Concurrently, calculate the Jaccard similarity or use ssdeep fuzzy hashes on the subject lines. Alert when the sender domain entropy is unusually high (e.g., > 3.0) while the average subject similarity is also very high (e.g., > 0.95), indicating many different senders are sending the same message.",
              "Machine Learning: Use an unsupervised clustering algorithm (e.g., DBSCAN) on incoming email metadata. Use features like recipient address, subject hash, and sender domain. A dense cluster forming around a single recipient with a consistent subject hash but widely varying sender domains would represent a subscription bomb event. The algorithm can dynamically identify these patterns without pre-defined thresholds."
            ]
          },
          {
            "description": "An internal host makes an unusually high number of HTTP POST requests containing an internal email address to multiple unique domains, consistent with automated newsletter or service sign-ups.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxies, DNS resolvers, Egress points of the network",
            "action": [
              "Symbolic Logic: Create a search to identify HTTP POST requests in `Zeek http.log` where the request body contains a company email address (`@yourcompany.com`). Alert if a single source IP (`id.orig_h`) makes more than 10 such requests to distinct domains (`host` field) within a 10-minute period.",
              "Statistical Method: For each internal source IP, establish a baseline for the daily count of unique domains to which it POSTs data containing an email address. Alert if this count exceeds 3 standard deviations above the host's own 30-day moving average, indicating a sudden change in subscription-like behavior.",
              "Machine Learning: Develop a time-series forecast model (e.g., Prophet, ARIMA) for the volume of HTTP POST requests containing email addresses originating from the internal network. An alert is generated when the observed volume significantly exceeds the model's predicted upper confidence interval, suggesting a coordinated or automated registration campaign is underway."
            ]
          },
          {
            "description": "The volume of emails or new SMTP connections for a specific recipient, or for the mail server infrastructure as a whole, exceeds a statistically significant threshold compared to its established historical baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mail Transfer Agent (MTA) servers, Email security gateway, Network load balancers",
            "action": [
              "Symbolic Logic: Implement a simple threshold rule: alert if any single recipient's mailbox (`rcpt_to`) receives more than 100 emails in a 1-minute window, or if the mail server's total inbound SMTP connections (port 25/587/465) exceed 500 new connections per minute.",
              "Statistical Method: For each recipient and the server overall, calculate a 30-day rolling baseline of email volume per 5-minute interval. Use percentile-based alerting: trigger a high-severity alert if volume exceeds the 99th percentile of the historic baseline for that same time window (e.g., Tuesday at 2 PM). This accounts for normal daily and weekly fluctuations.",
              "Machine Learning: Employ a time-series anomaly detection model (e.g., Isolation Forest, LSTM Autoencoder) trained on historical email volume data from `Zeek smtp.log`. The model learns the normal traffic patterns, including seasonality. It will flag any period of traffic that deviates significantly from the learned normal behavior as an anomaly, which is more robust than fixed statistical thresholds."
            ]
          },
          {
            "description": "During a confirmed email bombing event targeting a specific user, that user's host initiates anomalous network connections, such as connections to known malicious IPs, rare domains, or using non-standard ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User endpoints, Domain Controllers, Internal network segments, DNS resolvers",
            "action": [
              "Symbolic Logic: When an email bomb alert triggers for a user, automatically run a query that checks all network connections (from `Zeek conn.log` or `Windows Event ID 5156`) from that user's IP/host in the +/- 15 minute window of the alert. Alert if any connection destination IP is on a blocklist or if a process (`Windows Event ID 4688`) known to be associated with remote access tools is launched.",
              "Statistical Method: For the affected user's host, compare its network activity during the bombing event to its own 30-day baseline. Calculate the frequency of destination ports, domains, and IP geolocations. Alert if the host connects to a port it has never used before, a domain ranked in the bottom 1% of organizational requests (rarity), or an IP from a country it has never connected to before.",
              "Machine Learning: Use a peer group analysis model. When a user is targeted by an email bomb, compare their real-time process execution (`Windows Event ID 4688`) and network connection patterns (`Zeek conn.log`) against the aggregated behavior of their departmental peers. An alert is generated if the user's behavior deviates significantly from their peer group, such as running a command-line utility or connecting to an IP that is anomalous for that group, suggesting activity hidden by the email flood."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.2",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]