[
  {
    "information_requirement": "Is the adversary using hidden infrastructure for Command and Control? (PIR)",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1665",
        "name": "Hide Infrastructure",
        "evidence": [
          {
            "description": "A network connection event where the destination IP address, domain name, or SSL/TLS certificate hash matches an entry on a threat intelligence feed specifically tracking C2 redirectors, malicious proxies, or abused CDN infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (e.g., firewalls, proxies), DNS resolvers.",
            "action": [
              "Symbolic (IOC Match): Continuously correlate network logs (Zeek conn.log, dns.log, ssl.log) against threat intelligence feeds for known malicious IPs, domains, and SSL certificate hashes associated with C2 redirectors, proxies, and VPNs. Generate an alert for any match.",
              "Statistical (Outlier Detection): Aggregate connections by destination IP ASN and IP reputation category (e.g., 'Proxy', 'VPN', 'Hosting'). Calculate the 95th percentile for the number of distinct internal hosts connecting to any single non-corporate ASN. Flag ASNs that exceed this threshold and have a high proportion of IPs categorized as proxies or VPNs, as this may indicate a newly stood-up block of malicious infrastructure.",
              "Machine Learning (Classification): Train a decision tree or logistic regression classifier on enriched network connection data. Use features such as: threat intel match (boolean), destination port, protocol, connection duration, bytes sent/received, IP geolocation (is rare?), IP reputation category, and SSL certificate properties (is self-signed?, issuer). The model will classify each connection as 'benign' or 'suspicious C2'. Investigate high-confidence 'suspicious C2' classifications."
            ]
          },
          {
            "description": "An SSL/TLS session where the certificate issuer is a known free provider (e.g., Let's Encrypt) or is self-signed, AND the destination IP address belongs to a non-whitelisted public cloud provider ASN, AND/OR the JA3/JA3S hash is rare or associated with known C2 frameworks.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, SSL/TLS inspection points.",
            "action": [
              "Symbolic (Rule-Based): From Zeek ssl.log, identify sessions where `issuer` contains 'Let\\'s Encrypt' or where `issuer` equals `subject`. Correlate with Zeek conn.log to get the destination IP. If the IP's ASN is a public cloud provider not on an approved list, and the JA3/JA3S hash matches a known malicious fingerprint, generate an alert.",
              "Statistical (Rarity Analysis): For all connections using free or self-signed certificates to non-whitelisted cloud providers, establish a baseline of JA3/JA3S hash prevalence. Calculate the frequency of each hash across the enterprise. Flag any JA3/JA3S hash that is in the bottom 5th percentile of prevalence (i.e., extremely rare) for further investigation, as this may indicate a unique or custom C2 client.",
              "Machine Learning (Anomaly Detection): Use an anomaly detection algorithm (e.g., Isolation Forest) on SSL/TLS session data. Features should include: certificate validity period (short periods are suspicious), destination port, free/self-signed status (boolean), destination ASN, and the rarity score of the JA3/JA3S hash. The model will flag sessions that are highly anomalous compared to the organization's typical encrypted traffic patterns."
            ]
          },
          {
            "description": "A DNS query for a domain hosted on a dynamic DNS provider, OR a DNS query where the subdomain exhibits high character entropy, OR a DNS query with an unusual record type (e.g., TXT) and a large response size.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, DNS forwarders.",
            "action": [
              "Symbolic (List Match): Monitor Zeek dns.log for queries to domains matching a curated list of known dynamic DNS providers (e.g., no-ip.com, duckdns.org). Alert on any internal host making such a query.",
              "Statistical (Entropy & Size Analysis): For all DNS queries in Zeek dns.log, calculate the Shannon entropy of the subdomain label. Flag queries where the subdomain entropy exceeds the 98th percentile, as this is a strong indicator of a Domain Generation Algorithm (DGA). Separately, monitor the size of DNS responses, particularly for TXT records, and flag responses with a size greater than 3 standard deviations above the mean for that record type.",
              "Machine Learning (Time Series Forecasting): Implement a time series analysis on the volume of DNS queries per source host per second. Use a model like SARIMA or Prophet to forecast expected query volume. Generate an alert when the observed query volume significantly deviates from the forecast, especially if correlated with high-entropy or large-response-size queries, which can indicate DNS tunneling activity."
            ]
          },
          {
            "description": "An HTTPS session where the TLS Server Name Indication (SNI) field value does not match the `Host` header value in the decrypted HTTP request, OR a temporal sequence of connections from a single host first to a high-reputation CDN followed immediately by a connection with C2-like characteristics.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Web proxies with SSL/TLS decryption capabilities.",
            "action": [
              "Symbolic (Mismatch Detection): In environments with TLS decryption, compare the `host` field from Zeek http.log with the `server_name` field from Zeek ssl.log for the same session. Generate a high-priority alert if they do not match, as this is a definitive indicator of domain fronting.",
              "Statistical (Transition Probability): Without decryption, identify connections to high-reputation CDN domains (via DNS/SSL logs). For each source host, create a time-sequenced graph of connections. Calculate the probability of transitioning from a CDN connection to a connection with known C2 characteristics (e.g., long duration, low byte count, destination is a non-corporate IP). Flag host transition probabilities that are statistical outliers (e.g., > 3 standard deviations from the mean), suggesting the CDN is being used as a redirector.",
              "Machine Learning (Sequence Analysis): Use a sequence-based classification model (like an LSTM or Hidden Markov Model) trained on session metadata. The model learns normal sequences of network connections (e.g., user browses to news site, CDN assets are loaded). It will then flag anomalous sequences, such as a connection to a CDN followed by a connection to a rare, non-categorized IP address, which is indicative of a C2 redirector."
            ]
          },
          {
            "description": "A series of connections from a single internal host to a single external destination IP, categorized as a proxy or VPN, where the time delta between connections is nearly constant (with or without jitter), the connection duration is long, and the volume of data transferred is consistently low.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Endpoint devices (for process context).",
            "action": [
              "Symbolic (Categorical Match): Enrich Zeek conn.log with IP reputation data. Create a rule to alert on any connection from an internal host to a destination IP address explicitly categorized as 'TOR Exit Node', 'Malicious Proxy', or a known C2 provider, especially if the connection occurs over a non-standard port for HTTP/S traffic.",
              "Statistical (Beaconing Analysis): For each source-destination IP pair, calculate the standard deviation of the inter-arrival time (time between connections) and the mean/standard deviation of bytes sent. A very low standard deviation in inter-arrival time combined with a low mean byte count is characteristic of C2 beaconing. Score and flag pairs exceeding a percentile-based threshold (e.g., 99th percentile of beaconing scores).",
              "Machine Learning (Clustering): Apply a clustering algorithm (e.g., DBSCAN) to connection data using features like `log(bytes_sent)`, `log(connection_duration)`, `inter-arrival_time_stdev`, and destination port. Investigate clusters that are separate from the main 'bulk traffic' cluster and exhibit C2 characteristics. Correlate hosts in these clusters with process creation logs (Windows Event ID 4688) to identify the responsible process."
            ]
          },
          {
            "description": "A domain that, over a short period (e.g., 24 hours), resolves to a large number of unique IP addresses with low TTL values, where the IP addresses belong to multiple disparate ASNs and geographic locations.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Network egress points.",
            "action": [
              "Symbolic (IOC Match): Maintain a list of domains known to use fast-flux DNS from threat intelligence. Monitor Zeek dns.log for any internal host querying these domains and alert immediately.",
              "Statistical (Flux Scoring): For each domain queried in Zeek dns.log over a rolling 24-hour window, calculate a 'flux score' = (Unique IPs * Unique ASNs) / (Average TTL + 1). Flag domains that exceed the 99th percentile of this flux score, indicating potential fast-flux activity.",
              "Machine Learning (Classification): Train a classifier (e.g., Random Forest) to identify fast-flux domains. Features for each domain would include the statistical metrics (unique IP count, unique ASN count, avg TTL) as well as features of the domain name itself (length, entropy, presence of numbers). The model learns to distinguish between legitimate high-volume domains and malicious fast-flux domains."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]