[
  {
    "information_requirement": "Is the adversary employing email spoofing for defense evasion?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1672",
        "name": "Email Spoofing",
        "evidence": [
          {
            "description": "An inbound email where the source IP, or domains within the 'From', 'Reply-To', or 'Return-Path' headers, match a high-confidence threat intelligence feed of known malicious indicators.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Network Egress/Ingress Points, Threat Intelligence Platform",
            "action": [
              "Symbolic: Correlate the source IP ('id.orig_h' in conn.log) and header domains ('from', 'reply_to', 'path' in smtp.log) of all inbound emails against a threat intelligence feed of known malicious IPs and domains. Generate a high-severity alert upon any match.",
              "Statistical: Calculate a reputation score for the source IP and sender domain using multiple threat intelligence feeds. Flag any email where the weighted average score exceeds a statistically determined threshold (e.g., the 80th percentile of scores seen from historically malicious emails).",
              "Machine Learning: Train a classification model (e.g., Logistic Regression, Random Forest) on features including the source IP's ASN, country, threat intelligence score, and domain age. Use the model to predict the probability of an email being malicious based on these IOC-related features. Flag emails with a probability score above a predefined threshold (e.g., > 0.9)."
            ]
          },
          {
            "description": "An inbound email that fails SPF or DKIM checks, or originates from a domain with a DMARC policy of 'p=none', especially when the 'From' header purports to be from a high-value domain (e.g., internal, partner, financial).",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Internal Mail Server, DNS Servers",
            "action": [
              "Symbolic: Create a rule to alert on any inbound email where the 'From' header domain is an internal or predefined partner domain, and the SPF/DKIM authentication result is 'fail'. Also, alert if the DMARC policy for the sending domain is 'p=none'.",
              "Statistical: For each external sending domain, calculate the historical ratio of SPF/DKIM failures to total emails. Identify domains whose failure rate suddenly spikes above its baseline (e.g., exceeds the 95th percentile of its historical daily failure rate).",
              "Machine Learning: Use a time-series anomaly detection model (e.g., ARIMA) on the daily count of emails failing authentication checks, segmented by sender domain. An alert is triggered when the model flags a significant deviation from the forecasted volume of failures, indicating a potential large-scale spoofing campaign."
            ]
          },
          {
            "description": "An inbound email where the domain in the 'From' header (RFC5322.From) mismatches the domain in the SMTP envelope 'MAIL FROM' (RFC5321.MailFrom), and the 'From' header domain is the organization's own domain or a domain on a list of trusted partners.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Email Gateway, Mail Transfer Agent (MTA)",
            "action": [
              "Symbolic: For each inbound email, extract the domain from the 'from' and 'mailfrom' fields in smtp.log. Trigger an alert if domain(from) != domain(mailfrom) AND domain(from) is in a predefined list of internal or high-value partner domains.",
              "Statistical: Calculate the frequency of (domain(from), domain(mailfrom)) pairs over a 30-day baseline. Identify new or rare pairs where domain(from) is a trusted domain. Flag pairs that fall below a low frequency threshold (e.g., seen less than 5 times historically) as suspicious.",
              "Machine Learning: Train a one-class SVM or an autoencoder on historical (domain(from), domain(mailfrom)) pairs from legitimate emails. Use the trained model to identify anomalous new pairs in real-time. Anomaly scores exceeding a dynamically adjusted threshold would indicate a likely spoofing attempt."
            ]
          },
          {
            "description": "A statistically significant increase in the volume of inbound emails from a single source IP address where the 'From' header claims to be a specific trusted domain (internal or partner), compared to a historical baseline.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, Email Gateway",
            "action": [
              "Symbolic: Define a hard threshold for the number of emails received from a single IP claiming to be from a trusted domain within a short time window (e.g., > 100 emails in 5 minutes). Generate an alert if this threshold is breached.",
              "Statistical: For each (Source IP, From Domain) tuple, establish a baseline of email volume per hour using a 30-day rolling average. Trigger an alert if the current hourly volume exceeds 3 standard deviations above the baseline average, indicating a statistically significant spike.",
              "Machine Learning: Employ a seasonal time-series decomposition model (e.g., STL) to model the normal daily and weekly patterns of email volume for each (Source IP, From Domain) pair. An alert is generated when the residual component (observed - seasonal - trend) is a significant outlier, indicating an anomaly unexplained by normal patterns."
            ]
          },
          {
            "description": "An inbound email from a trusted 'From' domain that originates from an IP address, Autonomous System Number (ASN), or geographic country that has not been associated with that domain in a historical baseline of legitimate communication.",
            "data_sources": [
              "Zeek smtp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network Egress/Ingress Points, GeoIP and ASN Databases",
            "action": [
              "Symbolic: Maintain a watchlist of 'approved' Source Country/ASN combinations for high-value partner domains. Trigger an alert if an email is received from a high-value domain but originates from a country or ASN not on its approved list.",
              "Statistical: For each 'From' domain, create a profile of its legitimate source ASNs and countries from a 90-day history. For each new email, if its source ASN/country is not in the historical profile, flag the email as suspicious, assigning a risk score based on the overall rarity of the source ASN/country.",
              "Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on the feature space of source IP geolocation (latitude/longitude) and ASN for each trusted sender domain. Legitimate emails form dense clusters. A new email that is flagged as noise by the algorithm (i.e., does not belong to any existing cluster) is a strong candidate for a spoofed email from an anomalous origin."
            ]
          }
        ]
      }
    ],
    "version": "2.2",
    "date_created": "2025-05-04",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]