[
  {
    "information_requirement": "Is the adversary capturing audio from mobile devices to collect sensitive information? (TA0035 - Collection)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1429",
        "name": "Audio Capture",
        "evidence": [
          {
            "description": "A mobile application activates the device microphone while in a background state, immediately followed by an outbound network connection to a destination matching threat intelligence or exhibiting anomalous characteristics.",
            "data_sources": [
              "MDM Microphone Access Events",
              "MDM Application State Logs",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Company-managed mobile devices, BYOD devices with corporate profiles, Network egress points (e.g., firewalls, proxies), MDM/MTD management servers",
            "action": "1. (Symbolic) Ingest and correlate MDM logs with network logs. Trigger a high-severity alert when a microphone activation event from a backgrounded application is followed within 60 seconds by a network connection (from Zeek conn.log) to a destination IP or domain found on a threat intelligence feed. 2. (Statistical) For each application, establish a baseline for normal background microphone activation duration and frequency. Alert when a new activation's duration exceeds the 95th percentile for that app. Concurrently, baseline the volume of data sent in the 5 minutes following a background activation. Alert if the data sent exceeds the 95th percentile of that application's baseline. 3. (Machine Learning) Develop a time-series anomaly detection model (e.g., LSTM) that processes sequences of events per device (e.g., app_backgrounded, mic_on, network_out, mic_off, data_volume). Train the model on historical data to learn normal behavioral patterns. Generate an alert when the model flags a sequence of events as having a high anomaly score, indicating a significant deviation from expected behavior."
          },
          {
            "description": "A non-system, third-party Android application's manifest contains the 'CAPTURE_AUDIO_OUTPUT' permission, or an application's request for microphone access ('RECORD_AUDIO' on Android, 'NSMicrophoneUsageDescription' on iOS) is incongruous with its stated purpose and developer reputation.",
            "data_sources": [
              "MDM Application Inventory",
              "Mobile App Static Analysis Report"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate application stores and repositories, All managed mobile devices, Application vetting and sandboxing environments",
            "action": "1. (Symbolic) Continuously scan application inventories from MDM for all managed devices. Create a critical-severity alert that triggers immediately if a non-system, third-party Android application is found with the 'CAPTURE_AUDIO_OUTPUT' permission. 2. (Statistical) Develop a risk score for each application requesting microphone access. Calculate the score using features such as: application category (e.g., 'Game' vs. 'Communication'), developer reputation, number of other risky permissions requested, and application age. Flag applications with a risk score in the top 5% (95th percentile) across the enterprise for manual review by an analyst. 3. (Machine Learning) Implement a classification model (e.g., Random Forest) trained on a labeled dataset of benign and malicious mobile application packages (APKs/IPAs). Use features from static analysis, including permissions requested, API calls, and embedded strings. Automatically classify all new and updated applications as 'benign,' 'suspicious,' or 'malicious,' and route non-benign applications for sandboxed dynamic analysis or automatic blocking."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]