[
  {
    "information_requirement": "Is an adversary performing active network discovery on a compromised mobile device? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1422.001",
        "name": "Internet Connection Discovery",
        "evidence": [
          {
            "description": "A process execution event on a mobile endpoint where the command line contains strings such as 'netstat', 'ping', 'ifconfig', or 'getprop net.dns1', and the parent process is not in an established allowlist of system or administrative tools. This includes execution via a remote shell like Android Debug Bridge (ADB) not associated with authorized administrative sessions.",
            "data_sources": [
              "Mobile EDR process execution logs",
              "Android Debug Bridge (ADB) logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (Android, iOS), Mobile Device Management (MDM) servers, Endpoint Detection and Response (EDR) platform consoles",
            "action": "1. Symbolic Logic: Define a rule to alert when a process creation event on a mobile endpoint contains 'netstat', 'ping', 'ifconfig', or 'getprop' in the command line AND the parent process name is not on a pre-defined allowlist (e.g., 'system_server', approved IT tools). Enrich alerts with MDM data for device owner and context. 2. Statistical Method: For each mobile device, create a baseline of all command-line executions over 30 days. Calculate the fleet-wide rarity (inverse document frequency) for each command. Trigger an alert if a network discovery command is executed and its rarity score is high, OR if its daily execution count for a single device exceeds the 99th percentile of that device's typical daily command volumes. 3. Machine Learning: Train a decision tree or random forest classifier using labeled process execution data. Use features like parent process name, command-line arguments, process privileges, execution time, and a binary feature for 'is_remote_shell' (e.g., from ADB logs). A model prediction score exceeding a threshold (e.g., 0.90) indicates a high probability of malicious discovery."
          },
          {
            "description": "A series of network events from a single mobile device IP address within a 60-second window, characterized by: 1) more than 10 DNS queries to diverse, high-availability domains (e.g., google.com, cloudflare.com, apple.com), 2) corresponding TCP/UDP connections with a duration of less than 1 second, and 3) a total transferred data volume (orig_bytes + resp_bytes) of less than 1024 bytes per connection, indicating connectivity checks rather than content transfer.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, corporate Wi-Fi controllers, VPN concentrators, Internal DNS resolvers",
            "action": "1. Symbolic Logic: Create a rule that triggers when an IP from the mobile device VLAN/subnet makes an outbound connection to an IP on a threat intelligence list of known C2 or proxy infrastructure. Enrich the alert with reverse DNS lookups and device context from DHCP/MDM logs. 2. Statistical Method: For each mobile device IP, aggregate Zeek conn.log and dns.log data into 1-minute tumbling windows. Calculate a composite risk score based on: a) count of unique destination domains, b) entropy of destination IPs, and c) ratio of DNS queries to established connections. Establish a 30-day baseline for this composite score for each device. Alert when the score exceeds 3 standard deviations from the mean or the 98th percentile. 3. Machine Learning: Implement an Isolation Forest or Local Outlier Factor model on features extracted from 1-minute windows of network activity per device. Features should include connection count, total bytes transferred, ratio of short-duration connections ($$<1s$$), and destination port entropy. Anomalies identified by the model represent significant deviations from normal network behavior and warrant investigation for discovery activity."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]