[
  {
    "information_requirement": "Is an adversary enumerating local or adjacent networks from a managed mobile device? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1421",
        "name": "System Network Connections Discovery",
        "evidence": [
          {
            "description": "An application on a managed mobile device makes API calls associated with network discovery (`WifiInfo`, `BluetoothAdapter`, `TelephonyManager`) that meet two conditions: 1) the call frequency in a one-hour window exceeds a statistical baseline (e.g., 99th percentile) for that specific application, and 2) the application's assigned category (e.g., 'Calculator', 'Game') is inconsistent with the functional need for network discovery permissions.",
            "data_sources": [
              "Mobile EDR API call monitoring logs",
              "Android Logcat output captured by MDM/EDR",
              "Mobile Device Management (MDM) application inventory and categorization data",
              "MDM application permission grant logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform console, Mobile Threat Defense (MTD) platform console, Corporate-managed mobile endpoints (Android/iOS)",
            "action": "1. (Symbolic) Continuously ingest Mobile EDR/MDM logs. Create a SIEM rule to generate a high-severity alert if an application making discovery API calls has a package name or cryptographic hash matching a known-bad IOC list from threat intelligence feeds. 2. (Statistical) For each application package name, establish a 30-day rolling baseline of the hourly count of discovery API calls. Generate a medium-severity alert if the count in an hour exceeds the 95th percentile for that app. In parallel, establish a baseline for app categories (e.g., 'Productivity'). Generate a low-severity alert if an app's call frequency exceeds the 95th percentile for its category. A high-severity alert is triggered if an app from a non-obvious category (e.g., 'Utilities') makes any discovery calls and is not on an approved list. 3. (Machine Learning) Train an isolation forest or Local Outlier Factor (LOF) model on features extracted from API call events, including: hour of day, day of week, application category, application install date, number of permissions granted, and the specific API call being made. Use the model to score all discovery API call events in real-time. Events with a high anomaly score indicate potentially malicious discovery activity that evades static rules and thresholds."
          },
          {
            "description": "A mobile device initiates network discovery API calls (`WifiInfo`, `BluetoothAdapter`, `TelephonyManager`) and, within a 5-minute window, makes an outbound network connection (observed via DNS query or TCP/UDP session) to a destination that is either: 1) a known malicious indicator on a threat intelligence list, or 2) a domain registered within the last 30 days.",
            "data_sources": [
              "Mobile EDR API call monitoring logs",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek notice.log",
              "Threat Intelligence Platform domain/IP feeds",
              "Passive DNS records",
              "WHOIS lookup data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate wireless network and internet gateway, DNS resolvers, Network SIEM / Data Lake for log correlation, Threat Intelligence Platform",
            "action": "1. (Symbolic) Correlate Mobile EDR API logs with network logs (Zeek) on device IP and timestamp. Create a SIEM rule that triggers a high-severity alert when a device's network discovery API call event is followed within 5 minutes by a DNS query (Zeek dns.log) or connection (Zeek conn.log) to a destination domain/IP present on a C2 threat intelligence list. Enrich the alert with a WHOIS lookup; if the domain was registered in the last 30 days, elevate the priority. 2. (Statistical) After a device performs discovery calls, monitor its subsequent DNS requests in Zeek dns.log for a 10-minute window. Alert if: a) the ratio of unique domains queried to the number of connections made exceeds a 95th percentile baseline, or b) a connection is made to a domain seen by fewer than 5 other devices in the enterprise over the last 30 days (long-tail analysis), or c) the Shannon entropy of the requested subdomain labels in a 1-minute window exceeds 4.0 (suggests DGA). 3. (Machine Learning) After a discovery event, use a pre-trained graph neural network (GNN) model that represents normal device communication patterns (nodes=devices/IPs, edges=connections). If a new connection initiated post-discovery significantly alters the device's graph centrality score or connects to a previously isolated subgraph, classify it as anomalous. This can detect attempts to contact unusual C2 infrastructure."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]