[
  {
    "information_requirement": "Is an adversary attempting to gather detailed system and hardware information from our mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1426",
        "name": "System Information Discovery",
        "evidence": [
          {
            "description": "An adversary's attempt to discover system information is evidenced by one of two primary network patterns originating from a mobile device: (A) A single HTTP/S connection where the outbound data is minimal (< 5 KB), the destination is a low-reputation or newly registered domain, the URI contains a high-entropy string (> 4.0), and the TLS client fingerprint (JA3) is anomalous. (B) A DNS query for a high-entropy or algorithmically generated subdomain, followed by a small data transfer, suggesting the use of DNS as a C2 channel for exfiltrating device details.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek ja3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points for corporate and guest Wi-Fi, VPN concentrators, enterprise DNS resolvers, and secure web gateways where mobile device traffic is inspected.",
            "action": "As an analyst, execute the following three-part detection strategy using SIEM queries on Zeek logs from the specified NAIs:\n1. Symbolic Detection (IOC Matching): Continuously monitor `dns.log` and `http.log` for connections from the mobile device IP space to domains or IPs matching threat intelligence feeds for C2 or known fingerprinting services. Also, filter for domains flagged by a Newly Registered Domain (NRD) feed (e.g., registered < 90 days ago). Generate a high-severity alert on any match.\n2. Statistical Anomaly Detection: For each mobile device IP, perform parallel statistical analyses: a) For HTTP/S traffic, flag connections in `conn.log` with `orig_bytes` between 1 and 5120 bytes. In `http.log`, calculate the Shannon entropy of the `uri` field and flag scores > 4.0. In `ja3.log`, flag JA3 hashes that are rare (<5% prevalence across the fleet). b) For DNS traffic, calculate Shannon entropy on the subdomain in `dns.log` and flag scores > 4.5. Also, flag devices making anomalous counts of TXT or NULL queries (e.g., > 3 standard deviations above the user's baseline). A high risk score is assigned when a device triggers multiple correlated statistical flags (e.g., small outbound connection to a high-entropy URI) within a 5-minute window.\n3. Machine Learning-Based Detection: Deploy two models: a) A DGA detection model based on n-gram character frequency analysis of DNS queries to flag algorithmically generated domains. b) A JA3 fingerprint classification model trained to identify malicious clients. Correlate outputs from these models with the statistical alerts from the previous step. For example, an event where a DGA-flagged domain is queried (from the DGA model) and is associated with a rare JA3 hash (from the JA3 model and statistical analysis) should be escalated as a high-confidence incident requiring immediate investigation."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]