[
  {
    "information_requirement": "Has an adversary compromised a user's corporate account access by performing a SIM swap? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful user authentication to a corporate service occurs within a 4-hour window immediately following a Mobile Device Management (MDM) system log indicating a loss of cellular connectivity or a change in the device's SIM identity (IMSI). The authentication event exhibits at least two statistically significant anomalous characteristics, such as a source IP from a previously unseen country or Autonomous System Number (ASN), a user-agent string inconsistent with the user's device history, or a login time more than 3 standard deviations from the user's established mean login hour.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Mobile Device Management (MDM) logs",
              "Azure AD Sign-in logs",
              "VPN logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Domain Controllers, ADFS), Cloud Identity Provider Platforms (Azure AD, Okta), VPN Concentrators, MDM Servers, Internet Gateways",
            "action": "1. (Symbolic) Create a SIEM correlation rule that joins MDM logs with authentication logs (e.g., Windows Event ID 4624, Azure AD Sign-in). Trigger a high-severity alert if the MDM log shows a SIM-related event (e.g., 'SIM not present', 'Cellular connection lost', 'IMSI changed') for a user, AND within the subsequent 4 hours, a successful authentication for that same user is recorded from an IP address present on a threat intelligence feed of known anonymizing services (e.g., Tor exit nodes, commercial VPNs). 2. (Statistical) For each user, ingest authentication logs and Zeek conn.log data to build a 90-day rolling baseline of behavior. Features must include: login hour-of-day, source country, source ASN, and client user-agent string. Calculate the 5th and 95th percentile for login hour, and maintain a historical set of seen countries, ASNs, and user-agents. For each new successful login, assign risk points for deviations: +1 for login hour outside the 5th-95th percentile range, +2 for a new source ASN, +3 for a new source country. If a login's total risk score exceeds a threshold (e.g., 4) AND it occurs within 4 hours of an MDM SIM-related event for that user, generate an alert. 3. (ML) For each user, develop a feature vector from authentication events including: time since last login, hour of day (as sine/cosine transformed values), day of week, source IP geolocation (latitude/longitude), source ASN, and a one-hot encoding of the user-agent. Train an unsupervised anomaly detection model, such as an Isolation Forest or a one-class SVM, on each user's historical feature vectors to learn their normal authentication profile. Score each new login in real-time. If the model flags a login as an anomaly, cross-correlate this with MDM logs. An anomaly detected within 4 hours of a SIM-related event for the user constitutes a high-confidence alert for a potential account takeover."
          }
        ]
      },
      {
        "technique_id": "T1566",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A user interacts with an email containing keywords related to mobile carriers or account security (e.g., 'SIM swap', 'port-out', 'T-Mobile alert'). The user then clicks a link leading to a non-whitelisted domain, and a subsequent HTTP POST request from the user's machine to that domain is observed in Zeek http.log containing form data field names associated with PII (e.g., 'ssn', 'dob', 'securityPin', 'maidenName', 'motherMaidenName', 'mmn').",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Email gateway logs",
              "Web proxy logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate email gateway, Enterprise DNS resolvers, Web proxies/Internet gateways, Endpoint devices",
            "action": "1. (Symbolic) Ingest email gateway logs and scan email subjects and bodies for keyword combinations such as ('T-Mobile' AND 'account security'), ('Verizon' AND 'port-out request'), or ('AT&T' AND 'SIM swap'). For matching emails, extract all URLs and check their domains against a threat intelligence feed of known phishing sites. Create a SIEM rule that alerts if a user clicks a link from a keyword-matching email that also resolves to a known malicious domain. 2. (Statistical) For all DNS queries in Zeek dns.log to domains not on an organizational allow-list, calculate two metrics on the `query` field: the Shannon entropy of the query name and the Levenshtein distance between its second-level domain and the domains of known mobile carriers (e.g., 't-mobile', 'verizon', 'att'). Flag domains with an entropy score in the top 5% of all queries (potential DGA) or a Levenshtein distance less than 3 (potential typosquatting). Correlate these flagged DNS queries with subsequent Zeek http.log events from the same source IP. If an HTTP POST to the flagged domain is observed, escalate for analysis. 3. (ML) Collect a labeled dataset of phishing and benign emails. Engineer features from each email, including: header information (SPF/DKIM/DMARC validation status), sender reputation, character-level TF-IDF of the subject, word-level TF-IDF of the body, count of urgency-related words, and structural features of URLs (domain age, path depth, count of special characters). Train a supervised classifier (e.g., Gradient Boosting) to predict the probability that an email is a PII-phishing attempt. Deploy the model to score incoming emails. If an email receives a score above a high-confidence threshold (e.g., > 0.95) and email gateway logs show a user clicked a link within it, generate a high-priority alert."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]