[
  {
    "information_requirement": "Is an adversary encrypting data on corporate mobile devices for impact? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1471",
        "name": "Data Encrypted for Impact",
        "evidence": [
          {
            "description": "A single mobile application process generates file creation, modification, or renaming events for user data file types (e.g., .jpg, .png, .doc, .pdf, .mov, .mp4) at a rate exceeding 3 standard deviations above its own 30-day baseline or the 95th percentile of all non-system applications on the device within a 5-minute window.",
            "data_sources": [
              "Mobile EDR File System Telemetry",
              "MDM Application Audit Logs",
              "File access audit logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data directories on managed mobile devices, including Android standard directories (e.g., /storage/emulated/0/DCIM, /storage/emulated/0/Documents, /storage/emulated/0/Pictures) and iOS App Sandbox container directories.",
            "action": "1. (Symbolic) Continuously monitor file system events for rapid file renaming to extensions commonly associated with ransomware (e.g., .crypted, .locked, .enc, .xyz, .pay). Trigger a high-severity alert if a single process renames more than 10 files with sensitive extensions (.jpg, .doc, .pdf) in one minute. 2. (Statistical) For each non-system application, establish a 30-day rolling baseline of file modification events per minute. Alert when an application's file modification count in a 1-minute window exceeds the 99th percentile for its own history or the 95th percentile of its application peer group (e.g., 'communication apps', 'photo editors'). 3. (Machine Learning) Employ a time-series anomaly detection model (e.g., Isolation Forest or ARIMA) for each application's file I/O rate, trained on historical data. Generate an alert when the observed I/O rate significantly exceeds the forecasted value's confidence interval for a sustained period (e.g., > 3 minutes)."
          },
          {
            "description": "The creation of one or more files with filenames matching known ransom note patterns (e.g., 'recovery_instructions.txt', 'HOW_TO_DECRYPT.html') or file content containing keywords associated with extortion ('ransom', 'decrypt', 'bitcoin', 'payment').",
            "data_sources": [
              "Mobile EDR File Creation Events",
              "MDM File Integrity Monitoring Logs",
              "File content analysis from EDR agent"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Root of user-accessible storage on mobile devices (e.g., /sdcard/, /storage/emulated/0/), directories containing recently modified user data, and application-specific data directories.",
            "action": "1. (Symbolic) Scan all file creation events in real-time. Use a comprehensive regex list (`/(readme|recover|decrypt|help|instruction|restore).*(txt|html)$/i`) to match filenames against known ransom note conventions. A match generates a critical alert. 2. (Statistical) For any process creating a file matching a ransom note pattern, calculate the 'directory fan-out' by counting the number of unique directories the note is written to within 60 seconds. A fan-out value greater than 5 is a high-confidence indicator of widespread ransom note distribution and should escalate the alert severity. 3. (Machine Learning) Deploy a pre-trained text classification model (e.g., Naive Bayes or a small transformer model) to scan the content of newly created .txt and .html files. If the model classifies a file as 'ransom_note' with a confidence score >0.90 based on TF-IDF scores of keywords ('bitcoin', 'payment', 'encrypt', 'private key'), trigger an automated incident response workflow."
          },
          {
            "description": "A mobile application, within 5 minutes of exhibiting anomalous file I/O activity, initiates an outbound network connection to an IP address or domain that is present on a threat intelligence feed, was registered within the last 30 days, uses a self-signed TLS certificate, or communicates over a non-standard port.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Mobile EDR Network Connection Events"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, and cloud-based secure web gateways (SWG) that process mobile device traffic.",
            "action": "1. (Symbolic) Upon a high-I/O alert for a device, query network logs (Zeek conn.log, Zeek ssl.log) for that device's IP. Cross-reference all destination IPs, domains (from Zeek dns.log), and JA3/JA3S hashes against threat intelligence feeds. A match on a C2, malware, or known-malicious JA3 hash is a critical finding. 2. (Statistical) For the suspicious device, analyze DNS queries in dns.log. Calculate the Shannon entropy of queried FQDNs in a 1-minute window; a score over 3.5 suggests DGA. Additionally, check the WHOIS registration date of resolved domains; connections to domains registered < 30 days ago should elevate the device's risk score. 3. (Machine Learning) Correlate the file I/O anomaly alert with a network anomaly alert. Use a one-class SVM model trained on benign mobile network traffic features (destination port, domain reputation, bytes out, protocol, JA3 hash). Flag any connection from the device that the model identifies as an outlier, as this strongly indicates C2 for key exfiltration or status reporting."
          },
          {
            "description": "An application installed from an untrusted source (side-loaded) or possessing a rare combination of high-risk permissions (e.g., read/write external storage and internet access) is the source of high-volume file modification events.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Mobile OS Permission Grant Logs",
              "MDM Policy Compliance Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform database and logs; Endpoint OS security and application logs on managed devices.",
            "action": "1. (Symbolic) Maintain a dynamic watchlist of applications installed from 'unknown sources' or not present in the corporate app catalog. Generate a high-priority alert if any application on this list is the source process for a file-renaming or high-volume file-writing alert. 2. (Statistical) Profile permission grants across the device fleet. Calculate the rarity of a specific permission (e.g., Android's `MANAGE_EXTERNAL_STORAGE`) for each application category (e.g., 'Games', 'Productivity'). An application with a permission rarity in the 99th percentile that also correlates with high file I/O activity is a high-confidence indicator. 3. (Machine Learning) Use a clustering algorithm (e.g., K-Means or DBSCAN) on application features (permissions requested, installation source, network traffic patterns, CPU/memory usage). Identify and label clusters of anomalous applications. Flag any device where a new application falls into an anomalous cluster and correlates with file encryption alerts, triggering device isolation."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]