[
  {
    "information_requirement": "Has the adversary established external command and control (C2) channels on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1481.001",
        "name": "Dead Drop Resolver",
        "evidence": [
          {
            "description": "A network connection from a mobile device to a known public web service (e.g., social media, content-hosting site) is followed within 60 seconds by a connection to a destination domain that is statistically rare (e.g., in the bottom 5th percentile of domains accessed across the enterprise) or has a poor reputation score.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi egress points, VPN concentrators handling mobile device traffic, and network segments dedicated to guest or BYOD mobile devices.",
            "action": "From Zeek logs, identify all connections from mobile device IP ranges (defined by DHCP scopes for Wi-Fi/BYOD or VPN client pools) to a curated list of potential dead drop resolver services (e.g., pastebin.com, github.com, social media APIs). For each initial connection, search for all subsequent outbound connections from the same source IP within a 60-second window. Apply a multi-faceted detection approach to the second connection: 1. (Symbolic) Match the destination IP and domain against a threat intelligence feed of known C2 infrastructure. A direct match generates a high-severity alert. 2. (Statistical) Using a 30-day baseline from Zeek dns.log, calculate the enterprise-wide access frequency (popularity rank) for every destination domain. Flag any subsequent connection where the destination domain's popularity is in the bottom 5th percentile. 3. (Machine Learning) Construct a feature vector for each connection-pair including: time delta between connections, bytes transferred in the second connection, destination domain popularity rank, destination ASN, a binary flag for a threat intel match, and the reputation of the resolver service. Feed this vector into a pre-trained Random Forest or Gradient Boosting classifier. A prediction score above a tuned threshold (e.g., 0.85) indicates a likely dead drop resolver event and should be escalated for analyst investigation."
          },
          {
            "description": "A mobile device makes a DNS query for a legitimate content-hosting domain, and the TLS Server Name Indication (SNI) in the subsequent connection matches. The response body (from unencrypted HTTP or decrypted TLS) contains an IP address or domain which is then contacted by the same device within a 2-minute window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with L7 visibility, DNS resolvers, and web proxies serving mobile device traffic.",
            "action": "From Zeek logs, correlate DNS requests (dns.log) with subsequent TLS handshakes (ssl.log) and HTTP requests (http.log) originating from mobile IP ranges. For unencrypted traffic (http.log) or traffic where content is captured (files.log), use regular expressions to extract potential IPv4 addresses and FQDNs from response bodies. Correlate these extracted indicators with subsequent outbound connections (conn.log) from the same source IP within a 2-minute window. Apply a multi-faceted detection approach to these extracted and contacted indicators: 1. (Symbolic) Match all extracted IPs and domains against a threat intelligence list of known malicious indicators. A match on a subsequent connection triggers an immediate alert. 2. (Statistical) For extracted domains, calculate the Shannon entropy of the hostname; flag any with a score over 3.5 as potential DGA. Separately, calculate the access frequency of each contacted domain across the enterprise and flag any in the bottom 1st percentile. 3. (Machine Learning) Aggregate request counts per hour from the mobile device fleet to the known dead-drop resolver domains (e.g., api.twitter.com, gist.github.com). Employ a time-series anomaly detection model (e.g., SARIMA, Prophet) to establish a baseline with weekly/daily seasonality. A sudden spike in requests that deviates more than 3 standard deviations from the forecasted volume should be flagged as a potential coordinated campaign and trigger an investigation into the requesting devices."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]