[
  {
    "information_requirement": "Is an adversary leveraging legitimate external web services for one-way command and control against corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1481.003",
        "name": "One-Way Communication",
        "evidence": [
          {
            "description": "A corporate mobile device establishes highly periodic, low-volume outbound connections to a legitimate web service (e.g., social media, file sharing). The standard deviation of the inter-arrival time between connections is anomalously low (e.g., < 5 seconds), the 95th percentile of outbound data size is minimal (e.g., < 1KB), and the ratio of outbound to inbound bytes is abnormally high, suggesting automated C2 beaconing rather than interactive browsing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators handling mobile device traffic, forward proxy servers, and network egress points (Internet gateways) where mobile device traffic is logged.",
            "action": "1. (Symbolic Logic) Using a SIEM, query Zeek dns.log and ssl.log for connections from the mobile device IP address space to domains or server names matching a threat intelligence feed of known C2 endpoints hosted on legitimate services (e.g., a specific GitHub repository or Pastebin user account). 2. (Statistical Method) For each source mobile IP, aggregate Zeek conn.log data in 1-hour windows, grouping by destination server name (from ssl.log). Calculate the standard deviation of inter-arrival time, the 95th percentile of outbound bytes (`orig_bytes`), and the ratio of total outbound to inbound bytes (`SUM(orig_bytes) / SUM(resp_bytes)`). Generate an alert if the standard deviation is < 5 seconds, the outbound byte percentile is < 1024, and the byte ratio is > 10, over a minimum of 10 connections. 3. (Machine Learning) Deploy a per-device time-series anomaly detection model (e.g., LSTM autoencoder) on features aggregated into 5-minute intervals from Zeek conn.log. Features should include connection count, total outbound bytes, total inbound bytes, and standard deviation of inter-arrival times. An alert is triggered when the model's reconstruction error for a time window exceeds a dynamically calculated threshold (e.g., 3 standard deviations above the mean error), indicating a significant deviation from the device's established normal communication pattern."
          },
          {
            "description": "A mobile device sends an HTTP/S request to a legitimate web service (e.g., GitHub, Pastebin) where the URI path exhibits high Shannon entropy (e.g., > 3.5) and/or contains keywords associated with raw content access (e.g., '/raw/', '/blob/'). The request's User-Agent string is anomalous or missing, and the server's response Content-Type (e.g., `text/plain`) is inconsistent with the typical content served by the domain (e.g., `text/html`).",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, and forward proxy servers that perform TLS inspection, providing visibility into HTTP headers and content for mobile device traffic.",
            "action": "1. (Symbolic Logic) In a SIEM with access to TLS-inspected Zeek http.log data, create a detection rule to flag any request from a mobile device IP to a domain in a watchlist (e.g., `pastebin.com`, `raw.githubusercontent.com`) where the URI path contains patterns like `/raw/` or matches regular expressions for known C2 frameworks. 2. (Statistical Method) For each HTTP request from a mobile device, calculate the Shannon entropy of the URI. Establish a per-host baseline and flag requests with entropy scores in the 99th percentile. Increase the risk score if the associated User-Agent string has a low frequency (<1%) in the last 30 days of logs or if the `resp_mime_types` is `text/plain` for a host that predominantly serves `text/html`. 3. (Machine Learning) Implement a supervised classification model (e.g., XGBoost) to score each HTTP/S request from mobile devices. Train the model using features from Zeek logs, including: URI length, URI Shannon entropy, query parameter count, User-Agent string entropy, JA3 hash (from ssl.log), and one-hot encoded `resp_mime_types`. The model will output a probability score (0.0-1.0) of the request being malicious C2, enabling analysts to prioritize investigation of the highest-scoring events."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]