[
  {
    "information_requirement": "Is an adversary establishing command and control with a mobile device using a non-standard port? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1509",
        "name": "Non-Standard Port",
        "evidence": [
          {
            "description": "A connection originating from a mobile device IP address utilizes a service (e.g., 'ssl' as identified by Zeek) on a destination port that is not the IANA standard for that service (e.g., 'ssl' on port 8080 instead of 443).",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and guest Wi-Fi network segments, VPN termination points, Mobile Device Management (MDM) traffic inspection points, and Internet gateway proxies where mobile device traffic is visible.",
            "action": "1. (Symbolic) Query Zeek conn.log for connections where the source IP is within a mobile device subnet. Join results with a threat intelligence feed of known malicious C2 IP addresses. Alert on any match where the destination port ('id.resp_p') is not the standard port for the protocol identified in the 'service' field. 2. (Statistical) From 30 days of Zeek conn.log data, create a frequency table of all observed (service, id.resp_p) tuples. Calculate the percentile rank for each tuple's frequency. Query for new connections from mobile device subnets and alert on any connection whose (service, id.resp_p) tuple falls below the 5th percentile, indicating a statistically rare pairing. 3. (Machine Learning) Assemble a labeled training dataset from historical Zeek conn.log data, including features like destination port, protocol, Zeek service, connection duration, total bytes, and a boolean for mobile source IP. Train a logistic regression or random forest classifier to predict malicious C2 activity. Apply the trained model to score all new connections from mobile devices in real-time and alert on connections with a predicted probability of being malicious above a defined threshold (e.g., 0.85)."
          },
          {
            "description": "A mobile device establishes a pattern of periodic network connections (beaconing) to a single external destination IP on a non-standard port. This is characterized by a low standard deviation in the time interval between connections (e.g., < 5 seconds) and low variance in connection duration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points for all corporate and guest networks, specifically monitoring subnets allocated to mobile devices via DHCP for Wi-Fi or VPN pools.",
            "action": "1. (Symbolic) For connections from mobile subnets to non-standard ports, correlate the destination IP with domain requests in Zeek dns.log made just prior to the connection. Alert if the requested domain is present on a C2 threat intelligence list or has characteristics of a DGA domain (e.g., high character entropy, unusual TLD). 2. (Statistical) From Zeek conn.log, group connections by source IP, destination IP, and destination port over a 1-hour window. For each group containing more than 10 connections, calculate the standard deviation of the time deltas between consecutive connections. Alert on groups where the source IP is from a mobile subnet, the destination port is non-standard, and the standard deviation of the time delta is less than 5 seconds, indicating rhythmic beaconing. 3. (Machine Learning) For each source-destination-port tuple from mobile devices, create a time series of connection timestamps. Apply a time series forecasting model (e.g., ARIMA or Prophet) to predict the timestamp of the next connection. Calculate the prediction error (e.g., Mean Absolute Error) and flag tuples where the prediction error is consistently low (e.g., < 2 seconds), indicating a highly predictable, machine-generated pattern consistent with C2 beaconing on a non-standard port."
          },
          {
            "description": "An SSL/TLS session from a mobile device to an external destination on a non-standard port uses a self-signed certificate, a certificate with an anomalous issuer, or presents a JA3 client hash that is statistically rare in the environment.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network sensors with Deep Packet Inspection (DPI) at internet gateways, VPN concentrators, and forward proxies. Mobile Device Management (MDM) solutions with traffic inspection capabilities are also a key NAI.",
            "action": "1. (Symbolic) Join Zeek ssl.log and conn.log on the connection UID. Create an alert to trigger when a connection's source IP is from a mobile subnet, the destination port ('id.resp_p') is not 443, and the 'validation_status' in ssl.log is 'self-signed certificate' or 'unable to get local issuer certificate'. Further enrich this alert by checking the certificate issuer and subject against a deny-list of known malicious CAs or subjects. 2. (Statistical) Create a baseline of all JA3 client hashes from Zeek ssl.log over the past 30 days and calculate the frequency of each. For all new SSL/TLS connections originating from mobile subnets to non-standard ports, extract the JA3 hash. Alert if the observed JA3 hash is in the bottom 2nd percentile of frequency, indicating a rare client fingerprint. 3. (Machine Learning) Use an unsupervised clustering algorithm like DBSCAN on features extracted from Zeek ssl.log and conn.log for connections from mobile devices. Use features such as TLS version, cipher suite, certificate validity period, a one-hot encoded 'validation_status', destination port, and connection duration. Investigate small, dense clusters identified by the algorithm. A cluster characterized by non-standard ports, self-signed certificates, and short connection durations is a high-fidelity indicator of malicious C2 activity."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]