[
  {
    "information_requirement": "Is an adversary evading defenses by abusing accessibility services to perform actions on behalf of the user? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1516",
        "name": "Input Injection",
        "evidence": [
          {
            "description": "A mobile device establishes network connections to known malicious infrastructure or exhibits statistically anomalous network behavior within 15 minutes of a new application being granted 'BIND_ACCESSIBILITY_SERVICE' permission. Anomalous behavior includes command-and-control beaconing (highly periodic connections), horizontal scanning (connections to multiple IPs on the same subnet), or a sudden, large one-time data transfer inconsistent with legitimate application activity.",
            "data_sources": [
              "MDM Logs",
              "Zeek conn.log",
              "Zeek notice.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN terminators, Mobile Device Management (MDM) platform, and DNS resolvers used by mobile devices.",
            "action": "Correlate MDM logs recording 'BIND_ACCESSIBILITY_SERVICE' permission grants with network logs from the device's IP address in a 15-minute window following the event. 1. (Symbolic) Join MDM permission logs with Zeek dns.log and ssl.log data on device IP and timestamp. Match all requested domains and SSL certificate subjects against a threat intelligence feed of known mobile malware command-and-control (C2) infrastructure. Generate a high-severity alert upon a match. 2. (Statistical) For each permission-grant event, calculate the Shannon entropy of destination ports in the device's conn.log traffic within the analysis window. An entropy score exceeding the 98th percentile of the device's historical 30-day baseline suggests port scanning. Additionally, profile the periodicity of connections using the standard deviation of inter-arrival times; a very low standard deviation indicates automated beaconing. 3. (Machine Learning) Employ a one-class SVM or Isolation Forest model trained on a baseline of 'normal' post-install network behavior. Features should include session duration, total bytes, protocol, number of DNS queries, and the appearance of new or rare JA3/JA3S hashes. Apply this model to the 15-minute window after an accessibility service permission is granted to detect anomalous network sessions indicative of malicious activity."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary causing impact by programmatically interacting with sensitive applications (e.g., financial, messaging) to steal data or funds? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1516",
        "name": "Input Injection",
        "evidence": [
          {
            "description": "A mobile device exhibits network traffic to financial or cloud service APIs characterized by highly periodic, fixed-interval connections (e.g., every 30.0 ± 1 seconds), or initiates data transfers (outbound bytes) that are statistical outliers (e.g., > 3 standard deviations from the user's mean) for that specific service, suggesting automated interaction rather than human-driven use. Additionally, HTTP POST requests to these services contain unusual User-Agent strings or content lengths inconsistent with legitimate app functionality.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments for corporate and guest Wi-Fi, cloud service provider network ranges, known financial service IP blocks, and internet gateways.",
            "action": "Continuously monitor and analyze network flows from mobile devices to domains categorized as financial, corporate SSO, or cloud services. 1. (Symbolic) Filter http.log for traffic to sensitive API endpoints. Create rules to alert on sessions that use User-Agent strings associated with known malicious frameworks (e.g., Metasploit) or non-standard libraries not used by the legitimate application. Inspect ssl.log for connections to these services using self-signed certificates or certificates from issuers known to be abused by malware. 2. (Statistical) For each user-service pair, establish a baseline of outbound data volume (orig_bytes from conn.log) and trigger an alert if a new session's volume exceeds 3 standard deviations from the user's historical mean for that service. Separately, apply a Fourier transform to the time series of connection start times over a 24-hour period; a strong, single-frequency peak indicates automated, periodic C2 beaconing or 'keep-alive' traffic. 3. (Machine Learning) Use a supervised classification model (e.g., Random Forest) trained on labeled network flows to classify sessions as 'benign human' or 'automated malicious'. Features for the model should include: session duration, orig_bytes, resp_bytes, ratio of orig_bytes to resp_bytes, destination port, JA3 hash, SSL issuer, and the presence of an HTTP POST method. A high probability score for 'automated malicious' on traffic to a financial application should be a critical alert."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]