[
  {
    "information_requirement": "Is the adversary attempting to impair or disable security defenses on our mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629",
        "name": "Impair Defenses",
        "evidence": [
          {
            "description": "A managed mobile device, identified by its unique device ID, stops sending heartbeat signals to the MDM/MTD management server for a period exceeding its established baseline, and the MDM logs show no corresponding authorized 'unenroll' or 'decommission' event for that device ID.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/MTD Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway, Wi-Fi network infrastructure, and MDM/MTD Management Servers",
            "action": "1. (Symbolic) For each device that has missed a periodic check-in, query MDM/MTD audit logs for 'unenroll', 'wipe', or 'decommission' events associated with the device's ID within the missed check-in window. Generate an alert if no such authorized event is found. 2. (Statistical) Using MDM check-in logs or Zeek conn.log data, calculate the historical mean and standard deviation of the check-in interval for each device over a 30-day period. Trigger an alert if the time since the last successful check-in exceeds the mean by more than three standard deviations or exceeds the 99th percentile of its historical check-in intervals. 3. (Machine Learning) Train a per-device time-series anomaly detection model (e.g., ARIMA, LSTM) on the sequence of check-in timestamps. Generate an alert when the model predicts a check-in but no event is observed for a sustained period, indicating a statistically significant deviation from the learned pattern."
          },
          {
            "description": "A mobile device's network traffic, captured at the network gateway, shows one of the following: (1) a DNS query or direct IP connection to an indicator of compromise (IoC) from a threat intelligence feed, or (2) the download of an application package (e.g., .apk, .ipa) whose file hash matches a known malware signature.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Threat Intelligence Platform (TIP) Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway and Wi-Fi network infrastructure",
            "action": "1. (Symbolic) In real-time, compare all outbound DNS queries (from Zeek dns.log), destination IPs (from Zeek conn.log), and HTTP host headers (from Zeek http.log) against a curated threat intelligence feed of known malicious C2 servers, phishing sites, and unauthorized app stores. Match file hashes from Zeek files.log against a malware hash database. Generate a high-priority alert upon any match. 2. (Statistical) For all DNS queries to domains not on an organizational allowlist, calculate the Shannon entropy of the subdomain portion using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. Flag queries with an entropy score above 3.5 as potential DGA activity. Concurrently, calculate the prevalence of each requested domain across all mobile devices; flag connections to domains accessed by fewer than 1% of devices for review. 3. (Machine Learning) Utilize a pre-trained supervised classification model (e.g., Random Forest, Gradient Boosting) that uses features extracted from Zeek logs (e.g., DNS query length, entropy, TLD, HTTP User-Agent, connection duration, JA3 hash). Classify each new connection and generate an alert if the model's output probability of being malicious exceeds a calibrated threshold (e.g., 0.85)."
          },
          {
            "description": "An alert from an MTD or MDM system indicates one of the following on a managed device: (1) the unexpected termination of a monitored security process (e.g., the MTD agent itself) [1], (2) the unauthorized modification of a security configuration profile, or (3) an application being granted high-risk permissions (e.g., Android 'Device Administrator') outside of an approved workflow.",
            "data_sources": [
              "Mobile Threat Defense (MTD) Agent Logs",
              "Mobile Device Management (MDM) Compliance Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device endpoints and MDM/MTD Management Servers",
            "action": "1. (Symbolic) Configure a SIEM alert to trigger on specific event IDs or log messages from MTD/MDM sources that explicitly state: 'Process Terminated' (where process name is in a list of security agents), 'Compliance Policy Violation', or 'Privilege Escalation' (where the permission granted is 'Device Administrator' or equivalent). 2. (Statistical) For each device group (e.g., 'Sales Team', 'Developers'), establish a baseline for the rate of compliance alerts and high-privilege permission grants over a 30-day rolling window. Generate an alert for any individual device that exhibits a rate of such events exceeding the 95th percentile of its peer group. 3. (Machine Learning) Implement a UEBA system to model event sequences. The model should learn normal sequences of user and device behavior and generate a high-risk score and alert when an anomalous sequence is detected, such as: [App install from rare source] -> [App requests Device Admin rights] -> [MTD agent process terminates] -> [Outbound connection to known malicious IP]."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ],
    "references": [
      {
        "id": 1,
        "text": "Samsung Knox Mobile Threat Defense. Samsung. Retrieved September 29, 2025, from https://www.samsungknox.com/en/solutions/mobile-threat-defense"
      }
    ]
  }
]