[
  {
    "information_requirement": "Is an adversary preventing the removal of malicious applications on our managed mobile devices? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629.001",
        "name": "Prevent Application Removal",
        "evidence": [
          {
            "description": "An application whose package name is not on an approved corporate allow-list is granted 'Device Administrator' or 'Accessibility Service' permissions. The package name may also have a high Shannon entropy score compared to a baseline of legitimate applications or a low Levenshtein distance to a known legitimate application name, indicating potential typosquatting.",
            "data_sources": [
              "MDM/EMM Permission Grant Events",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM Management Server, Managed mobile devices, Centralized Log Aggregator (SIEM), Network Security Monitoring (NSM) Sensors at network egress points",
            "action": "1. (Symbolic) From MDM/EMM logs, continuously monitor for permission grant events for 'Device Administrator' or 'Accessibility Service'. For each grant, compare the application package name against a curated allow-list of approved applications. Trigger an alert for any grant to an application not on the list. 2. (Statistical) For any alerted application, calculate the Shannon entropy of its package name. Flag packages with an entropy score exceeding the 95th percentile of a baseline established from all legitimate applications in the environment. Additionally, calculate the Levenshtein distance between the package name and all names on a list of common, high-value corporate and public apps (e.g., 'com.google.chrome' vs. 'com.goggle.chrome'). Flag names with a distance of 1 or 2 as potential typosquatting. 3. (Machine Learning) Input features from the alerted application (package name length, character entropy, Levenshtein distance scores, number of requested permissions) into a pre-trained Gradient Boosting classifier to predict the probability of it being malicious. Prioritize alerts with a model confidence score above 0.85 for immediate investigation."
          },
          {
            "description": "A mobile device initiates network connections to a new or suspicious destination within 30 minutes of a high-risk permission grant. Suspicious activity is defined as: connections to domains registered within the last 30 days, communication using non-standard ports (e.g., DNS over port 8080), or a repeating pattern of small, similarly-sized data transfers to a single IP address (beaconing).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Network Gateway, Internal DNS Resolvers, Egress Web Proxies, Network Security Monitoring (NSM) Sensors",
            "action": "1. (Symbolic) For any device flagged with a suspicious permission grant, query Zeek dns.log for all DNS requests made by the device's IP address in the subsequent 30 minutes. Enrich query results with WHOIS data. Trigger an alert if a requested domain was registered within the last 30 days or if its name matches a known C2 threat intelligence feed. 2. (Statistical) From Zeek conn.log data for the flagged device, establish a 30-day baseline of connection metrics (duration, orig_bytes, resp_bytes). Alert if any connection post-permission-grant has metrics exceeding 3 standard deviations from the baseline mean. Separately, calculate the entropy of destination ports used by the device over a 5-minute window; a sudden drop in entropy may indicate tunneling or beaconing to a single port. From Zeek ssl.log, alert on the use of JA3 or JA3S hashes that are rare (<1% prevalence) across the enterprise. 3. (Machine Learning) Ingest the device's post-grant network data (bytes per minute, connections per minute, and protocol distribution from Zeek conn.log) into a time-series anomaly detection model, such as an LSTM Autoencoder. Generate an alert if the model's reconstruction error for the traffic pattern is statistically significant, indicating a deviation from normal behavior consistent with C2 beaconing."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]