[
  {
    "information_requirement": "Are adversaries accessing credentials stored on corporate mobile devices? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1634",
        "name": "Credentials from Password Store",
        "evidence": [
          {
            "description": "A device's compliance status changes to 'non-compliant' for 'jailbreak' or 'root' in MDM/UEM logs, and within 24 hours, the same device's IP address exhibits a significant spike in outbound data volume or connections to unusual ports or countries in network logs.",
            "data_sources": [
              "MDM/UEM device compliance logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/UEM management server; Network egress points instrumented with Zeek sensors; VPN concentrators; Corporate Wi-Fi Access Point Controllers.",
            "action": "1. Symbolic Match: Continuously query MDM/UEM logs for devices where `compliance_status` changes to 'non-compliant' and `reason` is 'jailbreak_detected' or 'root_detected'. For each flagged device, correlate its assigned IP address with Zeek conn.log within a 24-hour window and check for connections to IPs/domains on a threat intelligence blocklist or to non-standard ports (e.g., any port not in {80, 443, 53}). 2. Statistical Analysis: For each flagged device, establish a 30-day rolling baseline of its daily outbound data volume (`orig_bytes` in Zeek conn.log). Generate an alert if the daily volume exceeds 3 standard deviations from its own mean or the 95th percentile of all mobile devices. Additionally, calculate the daily count of distinct destination ports and destination countries; a sudden increase beyond 2 standard deviations from the user's baseline indicates scanning or anomalous communication. Also, monitor the ratio of outbound to inbound bytes (`orig_bytes` / `resp_bytes`); a ratio significantly greater than the historical norm for that user can indicate data exfiltration. 3. Machine Learning Application: Implement a time-series anomaly detection model (e.g., ARIMA, Prophet) on the per-device outbound byte count. A significant, unexplained spike in traffic following a jailbreak event should be flagged as high-risk. A pre-trained classification model (e.g., Random Forest) can also score the device's activity based on features like `is_jailbroken`, `outbound_bytes_24h_vs_30d_avg`, `destination_country_rarity_score`, `connection_count_vs_peer_group_percentile`, and `distinct_port_count` to classify the activity as potential credential exfiltration."
          },
          {
            "description": "An application not on the corporate allowlist, identified in MDM/UEM logs, generates DNS queries for algorithmically generated domains (high entropy) or initiates direct-to-IP connections with a periodic, 'heartbeat' pattern in network logs.",
            "data_sources": [
              "MDM/UEM application inventory logs",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate MDM/UEM management server; Corporate DNS resolvers logging to Zeek; Network egress points instrumented with Zeek sensors; Cloud Access Security Broker (CASB) logs.",
            "action": "1. Symbolic Match: Ingest MDM/UEM application inventory lists. For each new or updated application, compare its package name and signing certificate against a corporate allowlist and a threat intelligence feed of known malicious applications. Concurrently, monitor Zeek conn.log for connections from mobile device IP ranges that lack a preceding successful DNS query in Zeek dns.log within a 5-minute lookback window, indicating a potential direct-to-IP C2 connection. 2. Statistical Analysis: For any application not on the allowlist, analyze its associated DNS queries from Zeek dns.log. Calculate the Shannon entropy for all queried second-level domains; an entropy score greater than 3.5 suggests probable DGA activity. Additionally, for connections from unauthorized apps, analyze the inter-arrival time between connections to the same destination IP in Zeek conn.log. A low variance in these timings (e.g., connections every 60s +/- 5s) is a strong statistical indicator of C2 beaconing. 3. Machine Learning Application: Use a clustering algorithm (e.g., DBSCAN) on features extracted from Zeek conn.log for traffic originating from unauthorized apps. Features can include `protocol`, `destination_port`, `connection_duration`, `total_bytes_sent`, `periodicity_score` (from statistical analysis), and `dns_query_entropy_score`. Clusters that separate from the main body of 'normal' application traffic represent anomalous behavior requiring investigation. A supervised classifier can also be trained to identify beaconing behavior by analyzing features representing the periodicity, size, and destination of connections over time."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]