[
  {
    "information_requirement": "Is an adversary deleting files or wiping data on corporate mobile devices to evade detection or cause impact? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.002",
        "name": "File Deletion",
        "evidence": [
          {
            "description": "A log event from a Mobile Device Management (MDM) or Endpoint Detection and Response (EDR) solution records the granting of device administrator privileges to a mobile application whose package name or signing certificate hash is not present on an established corporate allowlist.",
            "data_sources": [
              "MDM privilege change logs",
              "EDR application inventory logs",
              "EDR process execution logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS, Android), Mobile Device Management (MDM) Platform, Application Vetting System, Corporate App Store",
            "action": "Query MDM logs for all events corresponding to a device administrator privilege grant. For each event, join the application's package name and signing certificate hash with the corporate application allowlist. Generate a high-severity alert for any application not found on the allowlist. Ingest MDM privilege grant events into a time-series database. Calculate a 30-day rolling baseline (mean and standard deviation) of daily privilege grants across the entire mobile device fleet. Generate a medium-severity alert if the number of grants in any 24-hour period exceeds the mean by more than 3 standard deviations. Train a Random Forest classification model using historical MDM and EDR data with features such as application category, number of requested permissions, user role, and time of day. Deploy the model to score new privilege grant events in real-time and flag any event with a predicted risk score greater than 0.8 for immediate analyst review."
          },
          {
            "description": "The count of file deletion events from a single process on a mobile device within a 5-minute window exceeds the 99th percentile of the historical baseline for that user or device type, excluding deletions associated with known application uninstallation or system cache clearing processes.",
            "data_sources": [
              "EDR file deletion events",
              "Android Logcat logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data partitions on corporate mobile devices, Application sandboxes on mobile devices, MDM/EDR management console",
            "action": "Create a SIEM rule that monitors EDR file deletion events from mobile devices and generates an alert if the initiating process name matches a known malicious process IOC list, excluding legitimate uninstaller and system cache clearing processes. For each mobile device, ingest EDR file deletion events into a streaming analytics platform, calculate a rolling 5-minute count of deletion events, and establish a per-device baseline using the 99th percentile of these counts over a 30-day period; generate an alert when the current count exceeds this threshold. For each device, deploy a time-series anomaly detection model, such as ARIMA, trained on at least 30 days of historical file deletion event counts, to generate an alert if the actual number of deletions significantly deviates from the model's predicted range."
          },
          {
            "description": "An EDR event indicates the deletion of one or more files with extensions from a 'critical' list (e.g., .pdf, .docx, .xlsx, .sqlite, .key) or from a 'sensitive' directory path (e.g., /Documents, /Download, /DCIM), where the initiating process is not on an allowlist of approved applications.",
            "data_sources": [
              "EDR file deletion events",
              "Application inventory logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Sensitive data storage locations on mobile devices, Endpoint devices of high-value targets (e.g., Executive and R&D department mobile devices)",
            "action": "Deploy a SIEM correlation rule that triggers an alert from EDR file deletion events when the deleted file's path matches a sensitive directory list, the file extension is on a critical list, AND the initiating process is not on the corporate application allowlist. For alerts generated by the symbolic rule, automatically calculate the Shannon entropy of the initiating process name; if the score is greater than 3.5, escalate the alert's priority to critical. Develop a file access pattern baseline for each user by applying a DBSCAN clustering algorithm to historical EDR data, using features like process name and file types accessed. If a deletion event is identified as an outlier from the user's established activity clusters, flag it as anomalous."
          },
          {
            "description": "Network flow logs show an outbound data transfer from a mobile device's IP address exceeding the 95th percentile of the user's daily outbound traffic baseline, destined for a low-reputation or newly-seen IP/domain. This network event is followed within 15 minutes by EDR alerts for high-volume file deletions on the same device.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "EDR file deletion events",
              "MDM device-to-IP mapping logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Our organization's internet gateway, Corporate-managed mobile devices, DNS resolvers, DHCP servers",
            "action": "Create a stateful SIEM correlation rule that triggers a critical alert if a Zeek conn.log event shows a connection from a mobile device IP to an external IP on a threat intelligence blocklist, AND within the next 15 minutes, an EDR file deletion alert is generated for the same device. For each mobile device, ingest Zeek conn.log data, calculate a 30-day rolling baseline of total daily outbound bytes (orig_bytes), and generate a medium-severity alert if a device's total outbound bytes exceeds its baseline by more than 3 standard deviations, enriching the alert with any subsequent file deletion events. Train a Recurrent Neural Network (RNN) on event streams from Zeek and EDR logs to learn normal sequences of user activity and alert on the low-probability sequence of a large outbound data transfer to a new domain followed by high-volume file deletions on the same device."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]