[
  {
    "information_requirement": "Is an adversary attempting to deny access to mobile endpoints? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1642",
        "name": "Endpoint Denial of Service",
        "evidence": [
          {
            "description": "A mobile device establishes a network connection to a destination IP address or resolves a domain name present on a threat intelligence feed and explicitly categorized as Command and Control (C2) infrastructure for mobile malware known to possess Endpoint DoS capabilities.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek intel.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's Wi-Fi network egress points (Corporate and Guest), Mobile Device Management (MDM) servers, DNS resolvers",
            "action": "1. (Symbolic) Continuously monitor Zeek intel.log for hits where the source IP is within the mobile device DHCP range. An intel.log entry indicates a match between observed network traffic (from conn.log or dns.log) and the loaded intelligence files. Trigger a high-severity alert on any match tagged with 'mobile_malware' or 'T1642'. 2. (Statistical) For all devices communicating with suspicious (but not confirmed malicious) IPs, calculate the connection frequency and data volume over a 24-hour sliding window. A device whose connection frequency to a low-reputation IP is in the 99th percentile compared to its own baseline and the peer group baseline is a candidate for investigation. 3. (Machine Learning) Deploy a pre-trained classification model (e.g., Logistic Regression) that uses features from Zeek conn.log (duration, protocol, service, bytes sent/received) and external enrichments (IP reputation, ASN) to score each connection's likelihood of being malicious. A score exceeding a predefined threshold (e.g., 0.9) for a mobile device should trigger an automated query to the MDM to check device health status."
          },
          {
            "description": "A mobile device issues DNS queries for domains characterized by high entropy scores (indicative of a DGA), or that are newly registered (e.g., age < 7 days), followed by a sudden and complete cessation of all network activity from the device's IP address for an extended period (e.g., > 1 hour).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's DNS resolvers and internet gateway",
            "action": "1. (Symbolic) Create a rule to flag any DNS query (Zeek dns.log) from a mobile IP range for a domain registered within the last 48 hours. Correlate this flag with a subsequent connection attempt in Zeek conn.log to the resolved IP. This sequence is a high-confidence indicator. 2. (Statistical) For each DNS query in Zeek dns.log, calculate the Shannon entropy of the query name (qname). Establish a baseline entropy for your environment's mobile traffic (typically between 2.0-3.0). Flag any query with an entropy score exceeding a dynamic threshold, such as 3 standard deviations above the mean or a fixed value like 4.0. A cluster of high-entropy queries from a single device within a short time frame (e.g., >5 in 1 minute) significantly increases the suspicion level. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., ARIMA or LSTM) on the volume of network traffic (total bytes or connection count per minute) for each mobile device. A sharp, sustained drop to zero that deviates significantly from the model's forecast constitutes a 'device offline' anomaly. Correlate this anomaly with preceding high-risk network indicators (like DGA or IOC matches) to automatically generate a T1642-specific alert."
          },
          {
            "description": "A corporate-managed mobile device initiates a network connection to a domain or IP address known to be associated with the distribution of mobile device rooting (Android) or jailbreaking (iOS) tools, indicating a compromised security posture that enables this attack.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek intel.log",
              "Zeek conn.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN concentrators, corporate Wi-Fi network segments, Mobile Device Management (MDM) servers",
            "action": "1. (Symbolic) Maintain and ingest a threat intelligence list of known jailbreak/rooting tool domains and IPs into your SIEM or Zeek Intel Framework. Generate a critical alert via Zeek intel.log when any device on a managed network segment resolves or connects to an indicator on this list. This represents a severe policy violation and a precursor to advanced attacks. 2. (Statistical) Analyze Zeek http.log for User-Agent strings from mobile devices. Identify the least frequent User-Agent strings across the mobile device population. Unusual or custom User-Agents can indicate the presence of non-standard software or device tampering. A device exhibiting a User-Agent seen on less than 0.1% of other mobile devices should be flagged for inspection. 3. (Machine Learning) Use an unsupervised clustering algorithm (e.g., K-Means or DBSCAN) on device-level network metadata. Feature engineering should include the diversity of destination ports, protocol mix (TCP/UDP/ICMP), and connection duration statistics. Devices that fall into a small, distinct cluster separate from the main population of 'normal' devices are anomalous and may be rooted/jailbroken. Cross-reference these devices with MDM compliance reports for validation."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]