[
  {
    "information_requirement": "Is an adversary leveraging compromised mobile devices to remove or deny access to corporate user accounts? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1640",
        "name": "Account Access Removal",
        "evidence": [
          {
            "description": "A user account experiences a statistically significant increase in lockout (Windows Event ID 4740) or password reset attempt (Windows Event ID 4724) events, where the source IP address is correlated via Zeek conn.log to a mobile network provider or exhibits a mobile device user-agent string.",
            "data_sources": [
              "Windows Event ID 4740",
              "Windows Event ID 4724",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Active Directory Domain Controllers, VPN Concentrators, Internet Gateway, Mobile Device Management (MDM) Platform",
            "action": "Define a watchlist of critical account management events: Windows Event ID 4740 (A user account was locked out) and Windows Event ID 4724 (An attempt was made to reset an account's password). 1. Symbolic Detection: Create a high-severity alert that triggers when Event ID 4724 is immediately followed by Event ID 4740 for the same 'TargetUserName' within a 60-second window, originating from a 'Source Network Address' that is not on an approved corporate IP range list. 2. Statistical Detection: For each user account, ingest event logs to establish a 30-day rolling baseline of the hourly count for events 4740 and 4724. Use Zeek conn.log to enrich each event with the source IP's ASN and geolocation. Calculate the 99th percentile for event counts per user. Generate a medium-severity alert if a user's hourly event count exceeds this threshold, and increase severity if the source ASN belongs to a mobile carrier or the geolocation is anomalous compared to the user's 30-day history. 3. Machine Learning Detection: Train a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) on event counts per user, aggregated into 5-minute intervals. The model should learn the normal rhythm of account lockouts and password resets. An anomalous spike flagged by the model should be correlated with source IP data from Zeek conn.log and user-agent data from Zeek http.log. An event is flagged as high-risk if the anomaly corresponds with a source IP from a mobile network and a user-agent not previously associated with that user."
          },
          {
            "description": "A source IP address, identified as a mobile device via its user-agent or ASN, generates a high volume of HTTP POST or DELETE requests to sensitive account management API endpoints at a rate exceeding statistical norms or exhibiting patterns indicative of automated scripting.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "API Gateway Servers, Web Application Firewalls (WAFs), Internet-facing application servers, Cloud Identity Provider Logs",
            "action": "Identify and list all critical account management API endpoints (e.g., /api/user/delete, /api/account/password, /api/auth/revoke). Ingest Zeek http.log and conn.log data for these endpoints. 1. Symbolic Detection: Create a high-severity alert that triggers when an HTTP DELETE request is sent to an account deletion endpoint from a source IP whose user-agent in Zeek http.log indicates a mobile device, and this action is not preceded by a multi-factor authentication confirmation event within the same session. 2. Statistical Detection: For each sensitive endpoint, profile the distribution of HTTP methods (GET, POST, etc.) and request rates per source IP. Calculate the Shannon entropy of the sequence of API endpoints requested by each source IP in a 5-minute window. Generate a medium-severity alert if an IP, identified as mobile via its ASN in Zeek conn.log, shows a request rate exceeding 3 standard deviations above the average or if its API path entropy suddenly spikes, suggesting automated enumeration. 3. Machine Learning Detection: Implement an Isolation Forest model to detect anomalous API requests. Train the model on a feature set for each request, including: URI path, HTTP method, request body length, user-agent, and time delta from the previous request by the same source IP. Any request flagged as an outlier by the model, especially a POST or DELETE request to a sensitive endpoint from an IP on a mobile network, should be considered a potential account access removal attempt and escalated for investigation."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]