[
  {
    "information_requirement": "Is an adversary using masqueraded applications or files on mobile devices to evade defenses? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1655",
        "name": "Masquerading",
        "evidence": [
          {
            "description": "A mobile application, identified by its HTTP User-Agent, generates network traffic where the destination domain is on a threat intelligence list of known C2 servers, has a Shannon entropy score above 3.5, or where the volume and port of traffic deviates by more than three standard deviations from an established baseline for that application's category (e.g., a 'calculator' app sending megabytes of data over port 8080).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi Network Egress Points, VPN Concentrators, DNS Resolvers, Mobile Device Management (MDM) Platforms",
            "action": "1. (Symbolic) Query Zeek dns.log and conn.log for connections originating from mobile device IP ranges to destination domains or IPs present in a threat intelligence feed of known command-and-control (C2) servers or newly registered domains (NRDs). Join with http.log on the connection UID to identify the User-Agent associated with the malicious traffic. 2. (Statistical) For each unique User-Agent in Zeek http.log, establish a multi-faceted baseline of network behavior including: 1) the 95th percentile of data sent (orig_bytes) and received (resp_bytes) per connection from conn.log, 2) the set of common destination ports, and 3) the average Shannon entropy of requested domain names in dns.log. Generate an alert when a connection from a mobile device exhibits behavior that significantly deviates from its User-Agent's baseline, such as data volume exceeding the 95th percentile, use of a rare port, or a DNS query with an entropy score > 3.5, which is indicative of DGA. 3. (Machine Learning) Train a time-series model (e.g., Prophet or ARIMA) on the volume of outbound traffic per device to detect anomalous spikes inconsistent with historical patterns. Concurrently, use an unsupervised clustering algorithm (e.g., DBSCAN) on features from Zeek conn.log (duration, protocol, service, orig_bytes, resp_bytes, destination port) to group connections. Investigate mobile device connections that are classified as noise or outliers by the model, as they represent statistically rare network behavior."
          },
          {
            "description": "A file transferred to a mobile device, identified by its User-Agent in HTTP logs, has a filename extension suggesting a benign document type (e.g., 'report.pdf', 'image.jpg', 'memo.docx') but a mime_type identified by Zeek as an Android or iOS application package ('application/vnd.android.package-archive', 'application/x-itunes-ipa').",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organizational Internet Gateway, Web Proxies, Email Gateways",
            "action": "1. (Symbolic) Create a SIEM rule to generate a high-severity alert when Zeek files.log records a file transfer where the `mime_type` is 'application/vnd.android.package-archive' or 'application/x-itunes-ipa' AND the `filename` ends in a non-executable extension (e.g., '.pdf', '.jpg', '.png', '.docx', '.txt', '.gif'). Correlate with http.log using the connection UID to confirm the `User-Agent` string corresponds to a mobile OS (Android, iOS). 2. (Statistical) For each user, track the count of file downloads with mismatched filename/MIME types (as defined in the symbolic rule) over a rolling 7-day period. Calculate the 99th percentile for this count across all users. Generate an alert for any user whose mismatched file count exceeds this organizational threshold, indicating they may be a target of a focused phishing campaign delivering malicious mobile apps. 3. (Machine Learning) Develop a classification model (e.g., Random Forest or Gradient Boosting) trained on labeled data from Zeek files.log and http.log. Use features such as `mime_type`, filename extension, `is_orig` (upload vs. download), file `size`, source IP reputation, ASN of source, and `Referer` header. The model will predict a 'masquerade_risk_score' for each file transfer. High scores (> 0.8) trigger an automated investigation workflow or an analyst alert."
          },
          {
            "description": "A high rate of failed authentication attempts (Windows Event ID 4625) for a single user account (brute-force) or from a single source IP against multiple accounts (password spray) originates from an IP address assigned to a mobile device on the corporate VPN. This suggests a compromised device with a malicious app masquerading as a legitimate tool is attempting lateral movement.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "VPN Concentrators, Authentication Servers, Domain Controllers, Active Directory, Internal File Servers",
            "action": "1. (Symbolic) Create a SIEM correlation rule that triggers when a single source IP from the mobile VPN address range generates more than 10 failed logon events (Windows Event ID 4625) within a 5-minute window. Differentiate the alert type: if the target username is the same, label it 'Potential Brute-Force from Mobile Device'; if the target usernames are different, label it 'Potential Password Spray from Mobile Device'. 2. (Statistical) Establish a baseline for the number of failed logons (Event ID 4625) per hour originating from the mobile VPN IP range, segmented by time of day (business vs. non-business hours). Use a moving average to track this metric for each segment. Generate an alert when the current rate of failures exceeds three standard deviations above the corresponding moving average, indicating an abnormal level of authentication failure activity. 3. (Machine Learning) Employ a User and Entity Behavior Analytics (UEBA) model trained on authentication logs. The model should learn normal patterns for each user, including typical login times, source IP geolocation/ASN, and target systems. An alert is generated when a high-risk anomaly is detected, such as a user account generating authentication failures from a mobile VPN IP at 3:00 AM when the user's normal activity is 9:00 AM to 5:00 PM from a corporate office IP. This can detect single, highly anomalous events that rate-based methods would miss."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]