[
  {
    "information_requirement": "Is an adversary leveraging virtualization solutions on corporate mobile devices to conduct malicious activities? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1670",
        "name": "Virtualization Solution",
        "evidence": [
          {
            "description": "The presence of an installed application on a managed mobile device whose package name is on a known virtualization tool blocklist and not on the corporate application allowlist.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Android Logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android mobile device fleet, Mobile Device Management (MDM) servers, SIEM",
            "action": "1. (Symbolic) Maintain a blocklist of package names for known Android virtualization applications (e.g., io.va.exposed, com.lbe.parallel.intl, com.dual.space.pro). Cross-reference this blocklist against the application inventory from MDM logs for all devices. Generate a high-severity alert for any device with an installed application that is on the blocklist and not on the corporate allowlist. 2. (Statistical) For all installed applications across the mobile fleet, calculate the installation prevalence percentage from MDM inventory logs. Establish a rarity threshold (e.g., installed on <1% of devices). Generate a medium-severity alert for any device that installs a non-allowlisted application falling below this rarity threshold, flagging it for review as a potential targeted or unauthorized tool. 3. (Machine Learning) Develop a supervised classification model (e.g., Random Forest) to predict if an application is a suspicious virtualization tool. Train the model using features from application metadata, such as: requested permissions count, package name string entropy, presence of keywords ('virtual', 'clone', 'parallel') in the app name, and developer signature information. Run all new, unclassified applications through the model; an application with a probability score >0.85 triggers an alert for manual investigation."
          },
          {
            "description": "Network traffic from a mobile device, as measured by metrics like connection volume, data egress, or DNS query patterns, is statistically inconsistent with the expected behavior of the legitimate application reported to be in the foreground by the MDM.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "MDM Application Usage Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi and VPN gateways, Enterprise DNS resolvers, MDM servers",
            "action": "1. (Symbolic) Ingest a threat intelligence feed of known malicious C2 domains and IP addresses. For every network connection in Zeek conn.log from a mobile device IP, check if the destination matches the feed. If a match occurs, correlate the timestamp with MDM application usage logs. If the foreground app is a trusted application (e.g., 'com.microsoft.outlook'), generate a high-severity alert for potential background or virtualized C2 activity. 2. (Statistical) For each device-application pair, establish a historical baseline of network behavior using Zeek logs, including bytes_out, connection_count, and DNS request entropy per 15-minute interval. Calculate the Shannon entropy of DNS requests using the formula $$ H(X) = -\\sum_{i=1}^{n} p(x_i) \\log_2 p(x_i) $$. Trigger a medium-severity alert if two or more metrics for a given foreground application deviate from their baseline by more than 3 standard deviations. 3. (Machine Learning) For each device, train a time-series anomaly detection model (e.g., LSTM autoencoder) on a feature set derived from 5-minute windows of Zeek logs, including: total bytes in/out, count of distinct destination IPs, ratio of UDP to TCP connections, and average connection duration. A high reconstruction error from the model signifies a deviation from the learned normal pattern. If a high error score coincides with a trusted application being in the foreground per MDM logs, escalate with a medium-severity alert."
          },
          {
            "description": "A mobile device establishes a network connection with a destination (domain, IP) or exhibits a network fingerprint (JA3/JA3S) that is a known indicator of compromise specifically associated with malware campaigns that leverage virtualization.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, Web proxies, DNS resolvers",
            "action": "1. (Symbolic) Ingest and continuously update a threat intelligence feed of IOCs (domains, IPs, JA3/JA3S hashes) specifically linked to virtualization-based malware. Create a SIEM rule to compare all mobile device traffic from Zeek logs (conn.log, dns.log, ssl.log) against this feed in real-time. Generate a high-severity alert upon any match. 2. (Statistical) From Zeek dns.log, maintain a fleet-wide list of all domains ever requested, with their first-seen timestamps. For any DNS query from a mobile device to a domain not on this historical list ('newly observed domain'), immediately query an external reputation service. Generate a medium-severity alert if a mobile device connects to a newly observed domain that also has a poor reputation score (e.g., flagged by >2 security vendors). 3. (Machine Learning) Implement a Domain Generation Algorithm (DGA) detection model that scores domain names based on linguistic and statistical features (e.g., character n-gram frequencies, entropy, name length, vowel-to-consonant ratio). Analyze all DNS requests from mobile devices in Zeek dns.log. Correlate a high DGA score (>0.9) with other risk factors, such as the domain being newly observed or having a rare TLD. A combination of these factors triggers a medium-severity alert for likely DGA-based C2 communication."
          }
        ]
      }
    ],
    "version": "1.2",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]