[
  {
    "information_requirement": "Is an adversary collecting PLC I/O image data to understand or prepare to manipulate the industrial process? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0877",
        "name": "I-O Image",
        "evidence": [
          {
            "description": "An IP address not on the explicit whitelist for a given PLC is observed sending ICS protocol read commands (e.g., S7COMM 'Read Var', Modbus 'Read Input/Holding Registers', EtherNet/IP 'Read Tag Service') to that PLC's I/O memory space.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments, specifically network traffic between Level 2 (Supervisory) and Level 1 (Control) zones, captured via SPAN ports or network taps on switches connected to PLCs.",
            "action": [
              "Define and maintain a static whitelist of authorized IP addresses (e.g., HMIs, EWS, Historians) for each PLC or PLC group. Ingest Zeek protocol logs into a SIEM. Develop a detection rule that generates a high-severity alert if the `id.orig_h` (source IP) in a read request is not present on the whitelist for the target `id.resp_h` (PLC IP).",
              "For each destination PLC, profile the set of source IPs observed performing read commands over a 30-day rolling window. Generate a medium-severity alert when a read command originates from a source IP never before seen communicating with that PLC ('first-seen' behavior).",
              "Develop a supervised classification model (e.g., Random Forest) trained on labeled historical network data. Features should include source IP, destination PLC IP, destination port, protocol, ICS function code, and categorical features derived from an asset inventory (e.g., source device type, destination device type). Deploy the model to classify new read requests as 'authorized' or 'unauthorized' and generate an alert for any event classified as 'unauthorized' with a model confidence score exceeding 0.95."
            ]
          },
          {
            "description": "An authorized source IP (e.g., EWS, HMI) sends a volume of ICS protocol read requests to a specific PLC that is statistically significant compared to its historical baseline, suggesting the legitimate host may be compromised and used for bulk data collection.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network tap points or SPAN ports on managed switches within PCN segments, monitoring traffic flows between Level 3 (Manufacturing Operations Management) devices like HMIs and EWS, and Level 2 (Control Systems) devices like PLCs.",
            "action": [
              "For each critical source-destination PLC pair, establish a hard threshold for the maximum number of read requests allowed per minute (e.g., 500 requests/min) based on operational requirements. Implement a detection rule that generates a high-severity alert if this count is exceeded within a 60-second sliding window.",
              "For each authorized source-destination PLC pair, establish a statistical baseline of read request counts per minute over a 30-day rolling window. Develop a detection rule that generates a medium-severity alert when the request count in a 1-minute window exceeds the 99th percentile or is more than 3 standard deviations above the historical average for that specific pair and time of day.",
              "For each high-consequence source-destination PLC pair, implement a time-series anomaly detection model (e.g., SARIMA, LSTM Autoencoder) trained on historical read request frequency data. The model should learn the normal cyclical patterns of communication. Generate an alert when the model's reconstruction error for the current time window exceeds a dynamically tuned threshold, indicating a significant deviation from learned normal behavior."
            ]
          },
          {
            "description": "An authorized source IP uses an ICS protocol function code for reading data that is not on the established whitelist of allowed functions for that specific source-destination communication path, such as using diagnostic or block-read commands where only simple reads are expected.",
            "data_sources": [
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Deep Packet Inspection (DPI) points on network taps or SPAN ports within PCN segments where Level 3 devices (e.g., EWS, HMIs) communicate with Level 2 devices (e.g., PLCs).",
            "action": [
              "For each authorized source-destination PLC pair, define a whitelist of accepted ICS protocol function codes based on vendor documentation and operational baselining. Create a detection rule to generate a high-severity alert upon observing a read request using a function code not on the explicit whitelist for that specific communication path.",
              "For each source IP communicating with PLCs, calculate the Shannon entropy of the distribution of function codes used within a rolling 60-minute window. Compare this value to a historical baseline of entropy scores for that source IP. Generate a medium-severity alert if the current entropy score exceeds the 95th percentile of its historical distribution, suggesting an unusual and more varied set of commands is being used.",
              "Develop an unsupervised anomaly detection model (e.g., Isolation Forest) for each authorized source device. Train the model on feature vectors representing the frequency distribution of ICS function codes used during normal operation over a fixed time window (e.g., 1 hour). Deploy the model to score new time windows of activity and generate an alert if the function code distribution for a given source is classified as an outlier."
            ]
          },
          {
            "description": "A network-based alert for anomalous PLC read activity is temporally correlated with suspicious host-based events on the source Engineering Workstation (EWS) or Human-Machine Interface (HMI), such as the execution of non-standard processes or unusual command-line arguments.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log",
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint devices identified as EWS or HMIs within the Level 3 (Manufacturing Operations Management) zone, and network tap points monitoring traffic between these endpoints and Level 2 (Control Systems) PLCs.",
            "action": [
              "Develop a correlation rule in the SIEM that triggers when a network-based PLC read anomaly alert is generated. The rule should automatically query host logs (Windows Event ID 4688) from the source IP address for a +/- 10 minute window. If a process execution event matches a blacklist of known hacking tools (e.g., `plink.exe`, `ncat.exe`) or contains suspicious command-line patterns (e.g., `-enc`, `whoami`), escalate the initial network alert to a critical incident.",
              "For each EWS/HMI, establish a baseline of common process names and parent-child process relationships from Windows Event ID 4688 data. When a network PLC read anomaly occurs, analyze process activity on the source host in the surrounding time window. Calculate a rarity score for each executed process and parent-child pair. Flag any process execution where the process name is 'first-seen' on that host or where the parent-child relationship is statistically rare (e.g., `powershell.exe` spawning from a document reader), and present this as correlated evidence.",
              "Construct a sequence-based anomaly detection model (e.g., using an LSTM) that learns patterns of combined network and host events. The model input should be a time-ordered sequence of event types, such as [PLC Read Request, Process Execution, New Network Connection]. Train the model on labeled data representing benign operational sequences and known attack paths. Deploy the model to score real-time event sequences, generating a high-confidence alert when a sequence is identified that strongly correlates with malicious activity."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.5",
    "date_created": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]