[
  {
    "information_requirement": "Has a user's mobile device, connected to the corporate network, been compromised via a watering hole or drive-by compromise? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1456",
        "name": "Drive-By Compromise",
        "evidence": [
          {
            "description": "A mobile device's HTTP session, identified by its 'uid' in Zeek logs, shows a request to a suspicious domain immediately following a request from a high-reputation domain (e.g., corporate intranet, major news site) acting as the 'Referer'. A suspicious destination is one that is: (1) present on a threat intelligence blocklist, (2) has a WHOIS registration age less than 30 days, or (3) has a domain name lexical entropy score exceeding the 95th percentile of all newly observed domains in the last 24 hours.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek conn.log",
              "Threat Intelligence Feed",
              "WHOIS Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, VPN concentrators, Cloud Access Security Broker (CASB) egress points, and central DNS resolvers used by mobile devices.",
            "action": [
              "Create a SIEM rule that joins Zeek http.log records with a threat intelligence feed of known malicious domains. Trigger a high-severity alert when http.log.host matches a malicious domain, the http.log.user_agent indicates a mobile OS, and the http.log.referer field contains a domain from a predefined list of trusted internal or high-traffic external sites.",
              "For all domains queried in Zeek dns.log that are not on an established allowlist, calculate their registration age. Maintain a 7-day rolling 5th percentile for registration age of newly seen domains. Alert when a request in http.log from a mobile User-Agent is made to a domain with a registration age below this percentile, especially if the referer is from a different, high-reputation domain.",
              "Deploy a pre-trained logistic regression model to score the malicious probability of all web requests from mobile User-Agents. Features should include: domain registration age, domain name entropy, a boolean for (Referer TLD != Destination TLD), ASN reputation, and IP geolocation rarity for the user. A predicted probability above a tuned threshold (e.g., 0.85) should generate an alert for analyst investigation."
            ]
          },
          {
            "description": "A JavaScript file transferred to a mobile device, identified by its 'fuid' in Zeek files.log, exhibits multiple anomalous characteristics such as: (1) a file size exceeding the 95th percentile for all previously seen JS files from that source domain, (2) a Shannon entropy score above a dynamic threshold (e.g., 4.5), indicating obfuscation, and (3) is associated with a 'large_file_in_small_buffer' notice in Zeek weird.log.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek weird.log",
              "Zeek signatures.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with Zeek sensors performing file extraction; Web Application Firewalls (WAFs) with file inspection capabilities; Mobile devices with MDM agents capable of network inspection.",
            "action": [
              "Configure Zeek to extract all files with MIME types 'application/javascript' and 'text/javascript'. Scan all extracted files with a YARA ruleset designed to detect mobile exploit frameworks (e.g., Pegasus-related artifacts) and common JavaScript obfuscation techniques. Generate a critical alert on any YARA match.",
              "For each unique source host in Zeek http.log, maintain a 30-day rolling baseline profile for downloaded JavaScript files, including mean and standard deviation for file size and Shannon entropy. Alert when a new JS file downloaded to a mobile device has a size and entropy score that both exceed 2 standard deviations from the mean for that specific source host. Escalate the alert if a corresponding Zeek 'weird.log' or 'signatures.log' event exists for the same session UID.",
              "Utilize a DBSCAN clustering algorithm on a feature space of all extracted JavaScript files. The feature vector for each file should include: file size, Shannon entropy, the ratio of obfuscated function calls (e.g., 'eval()', 'atob()', 'String.fromCharCode()') to file size, and the number of long, unbroken strings. Flag any files classified as noise (outliers) by the algorithm as highly suspicious and queue them for manual analysis."
            ]
          },
          {
            "description": "A sequence of HTTP requests from a single mobile client (linked by 'uid' in Zeek http.log) forms a rapid redirect chain of 3 or more hops (status codes 301/302/307). The chain starts from a known advertising network domain and terminates at a destination that is newly registered (< 30 days old), uncategorized by web filters, or hosted on a non-standard port.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Web Proxy Logs",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points instrumented with Zeek sensors, forward proxies, DNS resolvers, and upstream web proxies.",
            "action": [
              "Using Zeek http.log, correlate records by 'uid' to reconstruct redirect chains. Create a rule to alert when a chain from a mobile User-Agent: (1) has a length of 3 or more hops within 5 seconds, (2) the initial 'referer' matches a list of known ad network domains, and (3) the final destination 'host' is present on a malicious domain threat feed or has a 'server_name' in ssl.log that does not match the 'host' in http.log.",
              "For each mobile user, establish a 14-day rolling baseline of their redirect chain statistics, including average length and the standard deviation. Alert when a user experiences a redirect chain whose length exceeds 3 standard deviations from their personal average, or an absolute threshold of 5 hops. Prioritize alerts where the chain traverses more than two unique Autonomous Systems (ASNs).",
              "Train and apply a sequence-to-sequence (Seq2Seq) LSTM autoencoder on all observed HTTP redirect chains. The input sequence for the model should consist of feature vectors for each hop, including time delta from previous hop, HTTP status code, TLD, and ASN. A high reconstruction error score indicates an anomalous chain that deviates from normal browsing patterns and should be flagged for analyst review."
            ]
          },
          {
            "description": "An HTTP GET or POST request from a mobile User-Agent, recorded in Zeek http.log, contains a URI path or query string that matches a known mobile exploit kit signature (e.g., a regex for a Pegasus exploit). A strong corroborating indicator is that the request is for a script or binary file (e.g., .js, .apk) and lacks a 'Referer' header or has a 'Referer' from an unrelated domain.",
            "data_sources": [
              "Zeek http.log",
              "Zeek signatures.log",
              "Threat Intelligence Feed"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points with Zeek sensors; web proxies; and MDM/UEM management gateways.",
            "action": [
              "Continuously apply a curated set of regular expressions, sourced from threat intelligence on mobile exploit kits, against the 'uri' field in Zeek http.log. Generate a critical alert on any match from a request where the 'user_agent' string contains 'iOS' or 'Android'. The alert priority is elevated if the 'referer' field is null.",
              "For each domain, establish a baseline of its URI structure, including average path depth, average query parameter count, and the character entropy of the query string. Calculate a 'URI Anomaly Score' for each request from a mobile device based on the sum of standard deviations from these baselines. Alert on any request with a score exceeding a defined threshold (e.g., 5.0), especially if the domain is newly observed.",
              "Use a supervised Random Forest classifier, trained on labeled malicious and benign URLs, to score all incoming HTTP requests from mobile devices. The feature set should include URL length, path depth, number of query parameters, query string entropy, TLD reputation, a boolean for the presence of sensitive keywords ('apk', 'payload', 'exploit'), and the ratio of hexadecimal characters in the URI. A score above 0.90 triggers a high-severity alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-10-01",
    "version": "1.5",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]