[
  {
    "information_requirement": "Has the adversary accessed sensitive credentials stored in LSA secrets?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003.004",
        "name": "LSA Secrets",
        "evidence": [
          {
            "description": "Execution of a process matching the file name or hash of a known credential dumping tool capable of accessing LSA secrets.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events. Compare the created process name and its file hash against a maintained and frequently updated list of known credential dumping tools (e.g., mimikatz.exe, procdump.exe used on lsass, gsecdump.exe, pypykatz.exe) and their associated hashes from CTI feeds. Trigger a high-severity alert on any direct match."
          },
          {
            "description": "Command-line arguments or PowerShell script blocks containing strings and commands characteristic of LSA secret dumping techniques.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process command lines (Windows Event ID 4688) for patterns like 'lsadump::secrets', 'sekurlsa::LsaRetrievePrivateData', or 'lsadump /secrets'. Simultaneously, monitor PowerShell script blocks (Windows Event ID 4104) for obfuscated or clear-text strings and functions like 'Invoke-Mimikatz', 'Get-LsaSecret', or direct WinAPI calls to 'LsaRetrievePrivateData'. Use regular expression matching and correlation analysis to link suspicious script execution with process creation events."
          },
          {
            "description": "An unusual process, not typically associated with system or security administration, attempts to read from the LSA secrets registry key.",
            "data_sources": [
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable object access auditing on the 'HKEY_LOCAL_MACHINE\\SECURITY\\Policy\\Secrets' registry key. Monitor Windows Event ID 4656 for access attempts to this key. Establish a baseline of legitimate accessing processes and users (e.g., lsass.exe, system accounts, specific security tools). Alert on any access from a process or user not on the baseline. Use frequency analysis to identify rare process names attempting access, which could indicate a novel or renamed tool."
          },
          {
            "description": "A process with no legitimate purpose attempts to open a handle and read the memory of the Local Security Authority Subsystem Service (LSASS) process.",
            "data_sources": [
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Configure a System Access Control List (SACL) on the LSASS process object to audit handle requests, specifically for access rights like 'PROCESS_VM_READ'. Monitor Windows Event ID 4656 for events where 'ObjectName' is 'lsass.exe' and the 'AccessList' includes read permissions. Maintain a baseline of legitimate processes that access LSASS (e.g., csrss.exe, wininit.exe, services.exe, known EDR/AV tools). Use descriptive statistics on the frequency of the source 'ProcessName' to flag any rare or unexpected processes attempting to read LSASS memory and investigate immediately."
          },
          {
            "description": "Anomalous access to offline registry hive backups, indicating an attempt to extract LSA secrets without interacting directly with the LSASS process or live registry.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for anomalous read access (Windows Event ID 4663) to the SECURITY or SYSTEM registry hive files, especially from backup locations (e.g., '\\SystemRoot\\repair\\', '\\SystemRoot\\System32\\config\\RegBack\\'). Correlate this file access with preceding process creation events (Windows Event ID 4688) that created the backup, such as 'reg.exe save' or 'vssadmin create shadow'. Use correlation analysis to flag sequences where a backup is created and then immediately accessed by a different, unexpected process (e.g., PowerShell, a script host, or an unknown binary)."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]