[
  {
    "information_requirement": "Has the adversary attempted to dump credentials from compromised systems?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1003",
        "name": "OS Credential Dumping",
        "evidence": [
          {
            "description": "Detection of known credential dumping tool artifacts (e.g., specific executable names, file hashes associated with tools like Mimikatz) on systems or during network transfer.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events involving executable names commonly associated with credential dumping (e.g., 'mimikatz.exe', 'procdump.exe' used with LSASS targeting arguments, 'fgexec.exe'). Correlate with file creation/modification events if possible. Monitor Zeek files.log for network transfers of files matching known credential dumper names or MD5/SHA256 hashes from a threat intelligence feed. Maintain and regularly update lists of such indicators."
          },
          {
            "description": "Execution of PowerShell commands or scripts employing known credential dumping techniques, modules (e.g., Invoke-Mimikatz, PowerSploit), or suspicious API call patterns.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for PowerShell execution with command-line arguments containing keywords like 'Invoke-Mimikatz', 'Get-GPPPassword', 'sekurlsa::logonpasswords', 'LsaSecrets', 'DumpCreds', or patterns indicative of loading remote malicious scripts (e.g., IEX(New-Object Net.WebClient).DownloadString). Analyze deobfuscated script content from Windows Event ID 4104 (PowerShell Script Block Logging) for specific function names (e.g., 'MiniDumpWriteDump', 'LsaRegisterLogonProcess'), P/Invoke calls targeting LSASS, or structures common in credential dumping modules. Calculate entropy of script blocks to identify highly obfuscated scripts using descriptive statistics; correlate high entropy with suspicious keywords. Use regex matching for patterns and maintain a list of suspicious terms."
          },
          {
            "description": "Use of specific command-line utilities or sequences for accessing or exporting credential stores such as SAM, LSA secrets, or NTDS.dit.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for execution of command-line utilities and sequences like 'reg save hklm\\sam', 'reg save hklm\\system', 'vssadmin create shadow' followed by copying files from the shadow copy, 'esentutl.exe /y /vss' for volume shadow copy actions, 'ntdsutil.exe activate instance ntds ifm create full C:\\temp' for NTDS.dit extraction. Correlate sequences of these commands occurring within a short time window (e.g., 5-10 minutes) on the same host. Develop patterns for known tool command lines (e.g., common arguments for 'secretsdump.py' if invoked via cmd/powershell)."
          },
          {
            "description": "Network traffic patterns indicative of credential exfiltration from Linux systems, such as unexpected transfers of sensitive files (e.g., 'shadow', 'id_rsa') or anomalous SSH/Telnet session characteristics.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek ssh.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek files.log for transfers of common Linux credential filenames (e.g., 'shadow', 'passwd', '.ssh/id_rsa', '.gnupg/*key*') over unencrypted (FTP, HTTP) or unexpected protocols (e.g., DNS). Analyze Zeek ssh.log for anomalous SSH session characteristics like unusually short interactive sessions followed by large data transfers (Zeek conn.log), or SSH connections from unexpected internal sources to critical Linux servers. Use descriptive statistics on file transfer sizes and SSH session durations against baselines to identify outliers. Correlate with alerts from Windows systems if pivot activity is suspected."
          },
          {
            "description": "Anomalous process behavior involving LSASS (lsass.exe), such as access by non-standard processes, unusual access mask requests, or creation of LSASS memory dumps.",
            "data_sources": [
              "Windows Event ID 4656",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4656 (Object Access, requires SACL on lsass.exe) for non-whitelisted processes requesting handles to lsass.exe with potentially malicious access masks (e.g., PROCESS_VM_READ, PROCESS_ALL_ACCESS). Establish and maintain a baseline of legitimate processes interacting with LSASS. Monitor Windows Event ID 4688 for processes like 'procdump.exe' targeting 'lsass.exe' or any process creating files with '.dmp' extensions that might be LSASS dumps. Use time-series analysis to detect unusual spikes in LSASS access events. Correlate suspicious LSASS access with subsequent network activity (Zeek conn.log) from the source host using IP and timestamp correlation."
          },
          {
            "description": "Anomalous directory replication behavior, such as DCSync requests originating from non-domain controller systems or using non-standard administrative accounts.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "Servers (Domain Controllers)",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for MS-DRSR RPC traffic (identified by service UUIDs like E3514235-4B06-11D1-AB04-00C04FC2DCD2 for GetNCChanges) targeting Domain Controllers (DCs), originating from IP addresses not whitelisted as DCs. Correlate this network activity with Windows Event ID 4662 (Directory Service Object Access) on DCs for operations like 'Replicating Directory Changes' or 'Replicating Directory Changes All', particularly noting the Subject/Account Name initiating the request. Establish a baseline of legitimate replication sources (IPs) and accounts. Alert on replication requests from unexpected systems or by accounts not designated for replication tasks. Use frequency analysis and descriptive statistics (e.g., count of requests per source IP) to identify anomalous replication patterns."
          },
          {
            "description": "Unusual patterns of access or modification to credential storage locations (SAM file, LSA secrets registry keys) outside of normal system operations or patching windows.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4657",
              "Windows Event ID 4656"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal access patterns (processes, times, frequency) to the SAM file (%SystemRoot%/system32/config/SAM) using Windows Event ID 4663 (File Access), and to sensitive LSA registry keys (e.g., HKLM\\SECURITY\\Policy\\Secrets, HKLM\\SAM) using Windows Event ID 4657 (Registry Value Modified) and 4656 (Object Access). Monitor for access attempts or modifications by unusual processes (non-system, non-backup, non-security tools) or at anomalous times. Use statistical methods like IQR or percentile analysis on access frequency and timing to identify deviations from profiled normal behavior. Correlate with process creation events (Windows Event ID 4688) to identify the responsible process."
          },
          {
            "description": "LSASS process (lsass.exe) not running as a Protected Process Light (PPL) on systems where this security feature is configured and expected (Windows 8.1/Server 2012 R2 and later).",
            "data_sources": [
              "Windows System Event Log (Wininit Event ID 12)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "On Windows 8.1/Server 2012 R2 and newer systems, monitor the System event log for Wininit Event ID 12 at system startup. This event indicates whether LSA (lsass.exe) was launched as a protected process. Alert if LSASS is reported as not running as a protected process on systems where PPL is configured and expected. Investigate any unauthorized changes to the 'RunAsPPL' registry key (HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa). A change in PPL status or failure to start as PPL is a significant security degradation."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]