[
  {
    "information_requirement": "Is the adversary performing host or network discovery activities to check for Internet connectivity?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1016.001",
        "name": "Internet Connection Discovery",
        "evidence": [
          {
            "description": "Internet connectivity checks targeting known malicious C2 infrastructure, sinkhole domains, or specific IP addresses/domains frequently used by malware for connectivity validation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for outbound connections and Zeek dns.log for DNS queries to a curated and frequently updated list of known malicious C2 rendezvous points, sinkhole domains, or specific public IPs/domains (e.g., those hardcoded in malware for connectivity tests). Correlate with Windows Event ID 4688 if the connection attempt is initiated by a suspicious process or common connectivity testing utilities (ping, curl) targeting these selectors. Alert on any matches and investigate the source host for further compromise."
          },
          {
            "description": "Execution of common command-line utilities (e.g., `ping`, `tracert`, `curl`, `wget`, `nslookup`) or script equivalents (e.g., PowerShell's `Test-NetConnection`, `Resolve-DnsName`) specifically targeting well-known public internet addresses or default gateways.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for execution of 'ping.exe', 'tracert.exe', 'curl.exe', 'wget.exe', 'nslookup.exe', or PowerShell cmdlets like 'Test-NetConnection', 'Resolve-DnsName'. Analyze command-line arguments for specific targets such as public DNS servers (e.g., 8.8.8.8, 1.1.1.1), popular high-availability websites (e.g., google.com, cloudflare.com), or the host's default gateway IP. Establish baselines for legitimate use by administrative scripts or users and flag executions by unusual parent processes, from atypical script paths, with suspicious argument patterns (e.g., minimal packet count pings), or those exhibiting anomalous frequency using descriptive statistics (mean, median, IQR) per host/user."
          },
          {
            "description": "A burst of diverse internet connectivity checks (e.g., ICMP pings, DNS queries to public resolvers, HTTP/S GET requests to high-availability sites) from a single host within a short timeframe, especially if initiated by non-browser processes or following other suspicious host activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate multiple types of internet reachability tests from the same host: ICMP echo requests via ping/tracert (Windows Event ID 4688), DNS queries for common external domains to public DNS servers (Zeek dns.log), and HTTP/S GET requests to well-known internet sites (Zeek http.log, Zeek conn.log). Define a short time window (e.g., 1-5 minutes) and use statistical methods like event clustering or time series analysis of event frequency to detect a confluence of these activities. Prioritize alerts if these checks are initiated by processes not typically associated with browsing or system updates (e.g., `cmd.exe`, `powershell.exe`, unsigned binaries) or if temporally linked to other security alerts on the host (e.g., recent download, process injection)."
          },
          {
            "description": "Internet connectivity attempts originating from hosts, user accounts, or processes that do not typically require or exhibit internet access (e.g., critical servers, service accounts), or attempts using unexpected protocols/ports for simple connectivity checks.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish baselines of normal internet access patterns for different host roles (e.g., domain controllers, database servers, specific user workstations) and processes. Monitor Zeek conn.log for any outbound internet connections from hosts/subnets that should normally be restricted from direct internet access. Monitor Windows Event ID 4688 for connectivity test utilities (ping, tracert, curl) being run by service accounts or from unexpected processes on servers. Flag connections to common internet test sites (e.g., 8.8.8.8) using non-standard ports (e.g., TCP port 53 for non-DNS traffic, raw TCP to port 80/443 without valid HTTP/TLS handshakes). Use descriptive statistics and anomaly detection (e.g., comparing current activity against historical baselines using Z-scores or IQR) to flag significant deviations."
          },
          {
            "description": "Subtle, infrequent, or varied internet connectivity checks from a host to diverse, non-obvious external IP addresses or domains that are not known C2 infrastructure, potentially mimicking legitimate application traffic patterns as a low-and-slow discovery method.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for low-volume, diverse outbound connections from individual hosts to a wide range of previously uncontacted external IP addresses or domains using Zeek conn.log, dns.log, and http.log. Calculate the entropy of destination IPs/domains per host over rolling time windows (e.g., hourly, daily); a gradual increase or consistently moderate entropy without clear legitimate application drivers could indicate reconnaissance. Correlate these patterns with hosts that have recently exhibited other low-observable suspicious activities. Use linear regression or other trend analysis techniques to spot gradual changes in outbound connection diversity from sensitive hosts or those with limited typical internet activity. This is primarily a hunting technique based on behavioral hypothesis of stealthy discovery."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]