[
  {
    "information_requirement": "Is the adversary executing malicious code using scheduled tasks?",
    "tactic_id": "TA0002",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1053.003",
        "name": "Cron",
        "evidence": [
          {
            "description": "Network connection from a host running cron to an IP address, domain, or URL known to be malicious, occurring at a precise, repeating interval.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek conn.log and http.log for connections to destinations matching a CTI feed of known malicious IPs, domains, or URLs. For any matches, analyze the connection history from the source host. Use time series analysis or autocorrelation on the timestamps to determine if the connections occur at a fixed, repeating interval (e.g., every 30 minutes, every hour on the hour), which is highly indicative of a malicious cron job executing a payload."
          },
          {
            "description": "Execution of commands on a Windows host originating from a Linux/Unix system that match known remote execution tools (e.g., winexe, smbexec) at a regularly scheduled interval.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events associated with remote administration or execution tools (e.g., `PsExec.exe`, `wmic.exe`, `powershell.exe`) where the parent process is a remote service like `sshd.exe` or `services.exe` receiving a remote call. Correlate the timestamps of these executions over time to identify if they occur at a fixed, repeating interval. Use Zeek conn.log to correlate these events with incoming SMB (445) or SSH (22) traffic from a potential cron source host to the target Windows system."
          },
          {
            "description": "A Linux/Unix host initiating network connections at precise, repeating intervals (e.g., every hour on the hour, every day at 3:15 AM) that are anomalous compared to its baseline network behavior.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For hosts identified as Linux/Unix, baseline their network connection patterns. Use time series analysis on Zeek conn.log data (grouped by source IP) to detect activities with strong, statistically significant periodicity. Calculate the entropy of inter-arrival times for connections; a very low entropy suggests a scheduled task. Flag hosts initiating connections at highly regular intervals, especially to unusual ports or external destinations."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary maintaining persistence using scheduled tasks?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1053.003",
        "name": "Cron",
        "evidence": [
          {
            "description": "Persistent, scheduled network connections from an internal host to a known command-and-control (C2) server IP address or domain over an extended period.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join Zeek conn.log destination IPs/domains with a CTI feed of known C2 servers. For any matches, analyze the connection history from the internal source host. Use time series analysis to confirm if the connections occur at a fixed interval over an extended period (e.g., days or weeks), which is a strong indicator of a cron job used for persistent C2 beaconing. Examine Zeek ssl.log for known malicious JA3 hashes or self-signed certificates associated with these scheduled connections."
          },
          {
            "description": "A non-interactive user account on a Windows system (e.g., a service account) receiving recurring network logons at fixed intervals from a Linux/Unix host, indicating automated access.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4624 (Logon Type 3) for successful network logons. Filter for logons to service accounts or other non-interactive accounts. Group these events by source IP and target account, and analyze the timestamps to detect highly periodic logon patterns (e.g., every 30 minutes). A recurring logon from a Linux host to a Windows service account is a pattern suggestive of a cron job maintaining access or performing automated tasks on Windows resources."
          },
          {
            "description": "A host exhibiting a 'heartbeat' pattern of network traffic—small, regular connections over a long period—consistent with a persistent backdoor established via a cron job.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log data for long-term communication patterns. For each internal source IP, model its communication behavior. Identify hosts that exhibit low-volume, highly periodic outbound connections to the same destination over days or weeks. Use autocorrelation or Fourier analysis on the connection timestamps to find dominant frequencies corresponding to the schedule interval. Compare connection size; a consistent, small payload size is characteristic of a C2 heartbeat."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary escalating privileges using scheduled tasks?",
    "tactic_id": "TA0004",
    "tactic_name": "Privilege-Escalation",
    "indicators": [
      {
        "technique_id": "T1053.003",
        "name": "Cron",
        "evidence": [
          {
            "description": "A network connection pattern matching a known remote exploit for a privilege escalation vulnerability, occurring at a repeating interval.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Using Network Intrusion Detection System (NIDS) signatures integrated with Zeek, monitor for traffic between internal hosts that matches known remote exploits for privilege escalation. Correlate the timestamps of any such alerts to determine if the attempts are occurring at a fixed, repeating interval, which suggests a cron job is being used to repeatedly attempt exploitation."
          },
          {
            "description": "A Linux/Unix host initiating a scheduled, privileged remote logon (e.g., as Domain Admin) to a Windows Domain Controller or other critical server.",
            "data_sources": [
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4624 on high-value Windows assets (e.g., Domain Controllers, Certificate Authorities) for successful network logons (Type 3) by highly privileged accounts (e.g., members of Domain Admins, Enterprise Admins). Correlate the timestamps of these logons to identify if they occur at a fixed, recurring interval. A regularly scheduled logon by a privileged account originating from a non-Windows host is a strong pattern for automated, privileged access established via cron."
          },
          {
            "description": "A critical privileged action on a Windows system, such as new account creation in a privileged group, that occurs at a regular, repeating interval.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4732"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for user account creation (Windows Event ID 4720) and a user being added to a privileged group (Windows Event ID 4732). Analyze the timestamps of these critical events. Use time series analysis to detect if these events occur at a regular, repeating interval. A cron job running with elevated privileges on a compromised Linux host could use its access to execute a payload that creates a persistent, privileged account on a Windows system at a scheduled time to ensure access is maintained."
          },
          {
            "description": "A non-administrative Linux/Unix host initiating scheduled connections to sensitive internal Windows services that normally only accept connections from administrative users or servers (e.g., WinRM, RDP to a DC).",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Baseline normal traffic to sensitive Windows services (e.g., WinRM on port 5985, RDP on 3389) on critical servers to establish which source hosts are legitimate administrators. Identify and alert on connections originating from non-administrative Linux/Unix hosts. Analyze the timestamps of these connections using time series analysis to detect recurring, scheduled access. A cron job running with escalated privileges on a Linux host might be used to access Windows resources in a way that violates established access control policies."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]