[
  {
    "information_requirement": "Has the adversary gained access to credentials?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1056.001",
        "name": "Keylogging",
        "evidence": [
          {
            "description": "Detection of files (by hash) or specific registry entries (key/value pairs) known to be associated with keylogging malware.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Windows Event ID 4657",
              "Sysmon Event ID 12",
              "Sysmon Event ID 13"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Compare hashes of newly created or executed files (Sysmon Event ID 1 for execution, Sysmon Event ID 11 for creation) against a continuously updated CTI feed of known keylogger hashes. Monitor for specific registry modifications (Windows Event ID 4657, Sysmon Event ID 12 for key creation/deletion, Sysmon Event ID 13 for value set) matching known keylogger persistence mechanisms or configuration entries (e.g., specific AppInit_DLLs values, autorun keys used by known keyloggers). Alert immediately on confirmed matches."
          },
          {
            "description": "Suspicious Windows Registry modifications (e.g., AppInit_DLLs, Keyboard Layout, Accessibility features) or installation of unsigned/suspicious drivers/services often used by keyloggers for persistence or input capture.",
            "data_sources": [
              "Windows Event ID 4657",
              "Sysmon Event ID 12",
              "Sysmon Event ID 13",
              "Windows Event ID 4697",
              "Windows Event ID 7045",
              "Sysmon Event ID 6",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4657 and Sysmon Event IDs 12/13 for modifications to registry keys frequently abused by keyloggers (e.g., `HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs`, `HKLM\\SYSTEM\\CurrentControlSet\\Control\\Keyboard Layouts`, accessibility program paths for tools like `Utilman.exe` or `sethc.exe`). Monitor Windows Event IDs 4697/7045 (Service installation) and Sysmon Event ID 6 (Driver loaded) for new services or drivers that are unsigned, have suspicious names/paths, or are installed by unexpected processes (Windows Event ID 4688). Use descriptive statistics on the frequency of such modifications targeting sensitive areas across the environment to spot unusual patterns or targeted attacks."
          },
          {
            "description": "A newly created or untrusted process exhibiting characteristics common to keyloggers, such as running without a user interface, creating hidden files, or modifying system settings related to input devices, potentially with high entropy executable indicating packing.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Windows Event ID 4657",
              "Sysmon Event ID 7"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for newly created processes (Windows Event ID 4688, Sysmon Event ID 1) that lack typical user interface elements, create hidden files (Sysmon Event ID 11 with 'Hidden' attribute), modify registry keys associated with keyboard/input processing (Windows Event ID 4657), or load input-related DLLs anomalously (Sysmon Event ID 7, e.g., `user32.dll` by unexpected process). Analyze the entropy of the executable file associated with such processes; high entropy (e.g., >7.0) can indicate packing or encryption. Correlate these observations using a weighted scoring system or rule logic to flag suspicious processes warranting deeper investigation."
          },
          {
            "description": "An unknown or suspicious process creating files with patterns indicative of keystroke logging (e.g., frequent small writes, hidden files with sequential naming) especially after potential browser cookie deletion activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Sysmon Event ID 23"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for newly created processes (Windows Event ID 4688, Sysmon Event ID 1) from untrusted paths or with suspicious names that subsequently create files (Sysmon Event ID 11) in unusual locations or with hidden attributes. Analyze file I/O patterns for these processes for frequent, small append operations or sequentially named log files. Correlate this with recent file deletion events (Sysmon Event ID 23) targeting browser cookie stores by non-browser processes, which could indicate an attempt to force re-authentication to capture fresh credentials. Use time series analysis on file write frequency for suspect files."
          },
          {
            "description": "Anomalous deletion of browser cookies or cache data by an unexpected process (non-browser, non-updater), potentially to force user re-authentication for credential capture via keylogging.",
            "data_sources": [
              "Sysmon Event ID 23",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Sysmon Event ID 23 (FileDelete) for deletion events targeting common browser cookie/cache paths (e.g., Chrome, Firefox, Edge user profile directories). Identify the responsible process using Windows Event ID 4688 or Sysmon Event ID 1. Flag deletions initiated by non-browser processes, scripts (e.g., powershell.exe, cscript.exe), or tools not part of standard system maintenance or legitimate software updaters. Use frequency analysis (e.g., count of cookie deletions by unexpected processes per hour/day) to detect unusual spikes or activity occurring outside user interactive sessions."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary collecting sensitive information?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1056.001",
        "name": "Keylogging",
        "evidence": [
          {
            "description": "Detection of known keylogging software artifacts such as specific file hashes, registry keys/values, named pipes, or mutexes associated with documented keyloggers.",
            "data_sources": [
              "Sysmon Event ID 1",
              "Sysmon Event ID 11",
              "Sysmon Event ID 12",
              "Sysmon Event ID 13",
              "Sysmon Event ID 17",
              "Sysmon Event ID 18"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously scan for known keylogger indicators: compare file hashes of executed (Sysmon Event ID 1) or created (Sysmon Event ID 11) files against CTI. Monitor for the creation or modification of specific registry keys/values (Sysmon Event ID 12, 13) and named pipes (Sysmon Event ID 17 for creation, 18 for connection) known to be used by keyloggers. Correlate findings across multiple endpoints to identify widespread campaigns. Maintain and regularly update a list of these selector artifacts from threat intelligence providers and internal findings."
          },
          {
            "description": "Installation or loading of unsigned, newly compiled, or suspiciously named/located kernel-mode drivers or system services, particularly if initiated by non-system processes or processes with low reputation.",
            "data_sources": [
              "Sysmon Event ID 6",
              "Windows Event ID 7045",
              "Windows Event ID 4697",
              "Windows Event ID 4688",
              "Sysmon Event ID 1"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for the loading of unsigned drivers or drivers with very recent compilation timestamps (Sysmon Event ID 6 - ImageLoaded, filter for drivers). Track new service installations (Windows Event ID 7045 - Service Installed, Windows Event ID 4697 - Service Installed in System) with generic or suspicious names, descriptions, or binary paths (e.g., residing in temporary folders, user profiles). Correlate these driver/service events with the parent process (Windows Event ID 4688 or Sysmon Event ID 1) that initiated them. Baseline legitimate drivers/services and their typical installers; investigate deviations using descriptive statistics for properties like signer name prevalence or installation path frequency."
          },
          {
            "description": "A process, previously identified as suspicious or associated with keylogging indicators, establishing network connections to external or unusual internal destinations, potentially exfiltrating collected keystrokes.",
            "data_sources": [
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process execution events (Windows Event ID 4688, Sysmon Event ID 1) for processes flagged by other keylogging detection rules (Selectors/Patterns) with their subsequent network activity (Sysmon Event ID 3 - NetworkConnection, Zeek conn.log). Prioritize alerts for such processes making connections to external IP addresses not on organizational whitelists, or internal systems not typically accessed by the user/host associated with the process. Use statistical analysis (e.g., sum of bytes transferred, connection duration percentiles compared to baseline) to identify anomalous network behavior from these already suspicious processes."
          },
          {
            "description": "Periodic, small-volume network connections to external destinations from a non-browser process or a process lacking legitimate reasons for such communication, consistent with batched keystroke exfiltration.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Sysmon Event ID 3"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify processes (Windows Event ID 4688, Sysmon Event ID 1) that are not browsers or known communication/update tools, exhibiting periodic outbound network connections (Sysmon Event ID 3, Zeek conn.log). Analyze connection characteristics like destination IP/port, frequency (using time series analysis, e.g., Fourier transforms or autocorrelation, to detect regularity), and data volume (Zeek conn.log's `orig_bytes` and `resp_bytes`). Flag processes making regular, small data transfers (e.g., < 1-2 KB per connection) to untrusted external destinations. Correlate destination IPs with threat intelligence feeds for known C2 servers. Use entropy measures on destination port usage for a given process over time to detect unusual or fixed C2 channels."
          },
          {
            "description": "Anomalous increase in file I/O write activity to a specific hidden or unusually named log file by a suspicious process, followed by network exfiltration attempts of that file's contents.",
            "data_sources": [
              "Sysmon Event ID 11",
              "Windows Event ID 4688",
              "Sysmon Event ID 1",
              "Zeek conn.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for processes (Windows Event ID 4688, Sysmon Event ID 1) creating files (Sysmon Event ID 11) with hidden attributes or in atypical locations (e.g., user temp folders, AppData subfolders not matching application names). Track file write operations or significant increases in file size for these files. If a process exhibits sustained write activity to such a file, and that file's content (if captured by Zeek files.log) or a data transfer volume matching the file size (from Zeek conn.log) is observed in network traffic from the host shortly after file modification, it indicates potential staging and exfiltration of collected data. Use correlation analysis between file write events (timestamp, size) and network send events (timestamp, volume) for the specific file/process."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]