[
  {
    "information_requirement": "Is the adversary attempting to discover domain groups and permissions?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1069.002",
        "name": "Domain Groups",
        "evidence": [
          {
            "description": "Execution of processes with command-line arguments containing highly specific strings or flags unique to known malicious enumeration scripts or reconnaissance tools.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Scan process creation command lines (Windows Event ID 4688) and PowerShell script block content (Windows Event ID 4104) for unique, hardcoded strings, comments, function names, or parameter combinations known to be used by specific adversary enumeration tools (e.g., AdFind, specific PowerView forks, or custom scripts). Maintain and query against a list of these high-fidelity string selectors and alert on any match. This is distinct from general command patterns as it targets unique artifacts of specific malicious tools."
          },
          {
            "description": "Execution of common native Windows utilities, PowerShell cmdlets, or WMI queries in patterns known to be used for domain group enumeration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation (Windows Event ID 4688) and PowerShell script block logging (Windows Event ID 4104) for command patterns related to group enumeration. This includes commands like 'net group /domain', 'net localgroup', and PowerShell cmdlets such as 'Get-ADGroup', 'Get-ADGroupMember', 'Get-ADPrincipalGroupMembership', and PowerView functions like 'Get-NetGroup' or 'Find-LocalAdminAccess'. Use correlation analysis to link multiple, sequential discovery commands executed in a short time frame by the same user or on the same host."
          },
          {
            "description": "Anomalous volume or scope of LDAP queries targeting Active Directory group objects from a single source, characteristic of automated reconnaissance.",
            "data_sources": [
              "Zeek ldap.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek ldap.log for bind and search requests. Establish a baseline for normal LDAP query volume and the number of objects returned per user/host. Use time series analysis to detect unusual spikes in LDAP query rates from a single source. Use descriptive statistics (mean, standard deviation, percentiles) and box-plots on the number of group objects queried per session to flag sources performing significantly more enumeration than their peers or their own historical behavior. This is effective for detecting tools like BloodHound which generate thousands of queries."
          },
          {
            "description": "Anomalous read access or membership enumeration of highly sensitive Active Directory groups (e.g., Domain Admins, Enterprise Admins, Schema Admins).",
            "data_sources": [
              "Windows Event ID 4662"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable auditing (SACLs) on sensitive AD group objects (Domain Admins, Enterprise Admins, etc.) to log read access to properties like 'member' and 'memberOf' (Windows Event ID 4662). Establish a baseline of normal administrative access to these groups. Alert on any access from non-administrative users/hosts, or from legitimate administrators performing this action outside of established change windows or from non-standard workstations. Use frequency analysis to detect users or hosts querying these properties excessively compared to their normal activity baseline."
          },
          {
            "description": "Domain group enumeration activity originating from hosts or user accounts that do not typically perform such actions (e.g., non-IT users, web servers).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104",
              "Zeek ldap.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile hosts and user accounts to establish baselines of which roles and systems normally perform group enumeration. Use frequency analysis and statistical profiling to identify when enumeration commands ('net group', 'Get-ADGroup') or high-volume LDAP queries originate from unusual sources, such as a standard user workstation, a web server, or a service account. Use linear regression or other classification models to determine if certain user roles or device types predict this activity and flag significant deviations from the model's predictions."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]