[
  {
    "information_requirement": "Is the adversary collecting and staging data for exfiltration?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1074.002",
        "name": "Remote Data Staging",
        "evidence": [
          {
            "description": "Creation of archive files with filenames or hashes known to be used by specific threat actors or malware for staging data.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor file creation events (Windows Event ID 4663) and the associated process creation events (Windows Event ID 4688). Compare the filenames of newly created archives against a CTI list of known staging filenames. If possible, calculate the hash of newly created files in common staging directories (%TEMP%, %PUBLIC%) and compare them against a list of known malicious stager tools or output archives from known malware families. Alert on any matches."
          },
          {
            "description": "Creation of common archive file types (e.g., .zip, .rar, .7z) in unusual locations or by non-standard processes, deviating from normal backup or software activity.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor file creation events (Windows Event ID 4663) and use regular expressions to flag the creation of files with common archive extensions (.zip, .rar, .7z, .tar, .gz) in suspicious locations like user profile directories, temporary folders, or public shares. Correlate with the parent process (via Windows Event ID 4688) to determine if a legitimate backup tool or an unexpected process (e.g., cmd.exe, powershell.exe) created the file. Use frequency analysis to flag high-frequency creation by non-backup processes as highly suspicious."
          },
          {
            "description": "A surge in internal network traffic directed to a single host, immediately followed by the creation of large files or archives on that host, indicating it is being used as a central staging point.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor internal network traffic with Zeek conn.log. Use time series analysis to detect anomalous spikes in total bytes transferred or the number of connections to any single internal host from multiple other internal sources. Correlate these network spikes with subsequent large file creation (Windows Event ID 4663) or process execution of archiving tools (Windows Event ID 4688) on the destination host within a short time window (e.g., 5-15 minutes). Use correlation analysis to link network activity with on-host staging behavior to identify potential staging servers."
          },
          {
            "description": "An unusual process execution pattern where a script or command-line utility reads from numerous, disparate file system locations and writes to a single output file, characteristic of data collection.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze command-line arguments from process creation events (Windows Event ID 4688). Develop a baseline for normal file access patterns for common utilities (e.g., robocopy, powershell.exe). Use heuristics to parse command lines and identify processes that read from multiple distinct source directories (e.g., 'C:\\Users\\', 'D:\\Projects\\', '\\\\fileshare\\HR') and write to a single destination file, especially if that file is in a common staging location. Calculate the entropy or diversity of source paths; a high value indicates collection from many different places. Flag commands that deviate significantly from the established baseline."
          },
          {
            "description": "Anomalous file access patterns by a user account or process, such as reading a large number of files to which it has not previously had access, especially across different directories, within a short period.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable and collect file access auditing (Windows Event ID 4663, with 'ReadData' or 'ListDirectory' access masks). For each user/process, build a baseline of normally accessed file paths and directories. Use statistical methods to detect a sudden, high-volume of unique file read operations by a single process or user context within a short timeframe. Use time series analysis or a simple moving average to detect anomalous spikes in file access rates. Prioritize alerts for activity affecting directories the user/process does not typically interact with or containing sensitive data."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]