[
  {
    "information_requirement": "Is the adversary gathering system information about the network or hosts?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1082",
        "name": "System Information Discovery",
        "evidence": [
          {
            "description": "Execution of a file known to be a malicious system discovery tool, identified by its file hash.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 process creation events which include the file hash of the executed process image. Correlate this hash against a continuously updated threat intelligence feed of file hashes for known malicious discovery tools or scripts (e.g., Seatbelt.exe, WinPEAS.exe, PowerSploit modules). Alert immediately on any hash match and initiate incident response."
          },
          {
            "description": "Execution of common or chained system information gathering commands, or specific PowerShell/WMI queries known to be used by enumeration scripts.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for command-line arguments containing a single or a chain of common system discovery commands (e.g., `systeminfo`, `whoami`, `hostname`, `ipconfig /all`, `netstat -an`). Monitor Windows Event ID 4104 (PowerShell Script Block Logging) for specific enumeration cmdlets or WMI queries (e.g., `Get-ComputerInfo`, `Get-NetIPAddress`, `Get-WmiObject -Class Win32_ComputerSystem`). Flag executions, especially when chained together (e.g., using `&&`) or redirected to an output file, which is a common pattern in reconnaissance scripts."
          },
          {
            "description": "System information discovery commands executed by unexpected user accounts or from anomalous process lineages.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Profile normal system administration activity to establish a baseline of legitimate discovery. Monitor process creation (Event ID 4688) and PowerShell logs (Event ID 4104) for system discovery commands. Correlate the executing user account and parent process. Flag executions by non-administrative users, web server service accounts (e.g., NT AUTHORITY\\IUSR), or from parent processes that are not standard management tools or shells (e.g., discovery commands launched by `winword.exe` or `outlook.exe`). Use descriptive statistics to find rare and suspicious user/process/command combinations."
          },
          {
            "description": "An anomalous volume or frequency of system discovery commands originating from a single host, suggesting automated or intensive reconnaissance.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate system discovery events (from Event IDs 4688, 4104) by source host and user over time. Establish a baseline for the normal rate of such commands per host/user. Use time series analysis or statistical process control to detect unusual spikes in activity (e.g., alert if the count of discovery commands exceeds 3 standard deviations above the mean for a 1-hour window). This is particularly effective for identifying a compromised host being used for intensive local enumeration."
          },
          {
            "description": "A single source host or user account performing system information discovery across a large number of distinct destination hosts in a short period, indicating lateral reconnaissance.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify network connections associated with remote discovery (e.g., WinRM on ports 5985/5986, RPC, SMB). Correlate the source IP from Zeek conn.log with command executions (Event ID 4688) on the destination hosts. Count the number of unique destination hosts that a single source IP or user account queries within a defined time window (e.g., 1 hour). Use frequency analysis or box-plots to identify source hosts that are outliers in terms of the breadth of their discovery activity. Correlate this with a linear regression model to see if discovery breadth is increasing over time for any given host."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]