[
  {
    "information_requirement": "Is the adversary attempting to gain access to accounts via password guessing?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential-Access",
    "indicators": [
      {
        "technique_id": "T1110.001",
        "name": "Password Guessing",
        "evidence": [
          {
            "description": "Login attempts originating from IP addresses or using User-Agent strings known to be associated with password guessing tools or brute-force campaigns.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IP addresses from authentication logs (Windows Event IDs 4625 for failures, 4624 for successes on typically targeted accounts like admin or service accounts) and network connection logs (Zeek conn.log for SSH, RDP, FTP, Telnet, SMB/CIFS connections) against a frequently updated cyber threat intelligence (CTI) feed of IPs known for malicious scanning, brute-forcing, or credential abuse. For web-based authentication services (e.g., management interfaces, OWA, cloud SSO portals), inspect Zeek http.log for User-Agent strings associated with known password guessing tools (e.g., Hydra, Medusa, Ncrack, sqlmap for DBs, ffuf). Alert on any confirmed matches and investigate associated activity, including any successful logins from these sources."
          },
          {
            "description": "A pattern of failed login attempts systematically trying common or default usernames (e.g., 'admin', 'root', 'test', 'guest', vendor-default service accounts like 'oracle', 'postgres') across various services or systems, originating from a limited set of source IPs.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4625 (and equivalent data inferred from Zeek conn.log for non-Windows services like SSH, Telnet, FTP by observing repeated connection attempts to authentication ports) for failed login attempts. Maintain and regularly update a list of common, default, or high-risk usernames. Identify and count failed attempts using these specific usernames. Correlate these attempts across different target services/ports (e.g., 22, 23, 21, 3389, 445, 1433, 3306, common web app login paths found in Zeek http.log) originating from the same source IP or subnet. Use frequency analysis (e.g., count of distinct common usernames attempted per source IP) and set thresholds (e.g., >5 attempts with distinct common usernames from a single IP within 30 minutes) to detect this enumeration and guessing pattern. A box-plot analysis of common username failures per source IP can highlight outliers."
          },
          {
            "description": "Unusually high rate of failed login attempts from a single source IP targeting multiple user accounts (password spraying) or from multiple source IPs targeting a single user account (distributed brute-force), especially against common management services or cloud platforms.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Windows Event ID 4625 and Zeek conn.log (for services like SSH, RDP, SMB, FTP, Telnet, HTTP/S auth, and cloud login endpoints like login.microsoftonline.com). Define detection logic for: \n1. Password Spraying: Group failed login attempts by source IP. Count distinct target usernames attempted from each source IP within a defined time window (e.g., 1 hour). Alert if a source IP exceeds a threshold (e.g., >3 failed attempts each on >20 distinct accounts within 1 hour). \n2. Brute-Force (Single Account): Group failed login attempts by target username. Count distinct source IPs attempting to log in to each target username within a time window (e.g., 30 minutes). Alert if a target username experiences failed attempts from an unusually high number of distinct source IPs (e.g., >50 failed attempts from >10 distinct IPs within 30 minutes). \nUse time series analysis on overall failed login rates per service and per source IP/target account to detect surges. Employ statistical methods like Inter-Quartile Range (IQR) or standard deviations from baseline failure rates for adaptive thresholding."
          },
          {
            "description": "A significant increase in account lockout events (e.g., Windows Event ID 4740), particularly when correlated with preceding bursts of failed login attempts (Windows Event ID 4625) for the affected accounts originating from specific internal or external sources.",
            "data_sources": [
              "Windows Event ID 4740",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4740 (A user account was locked out). For each lockout event, retrieve and correlate associated Windows Event ID 4625 (failed logon) events for the same target account and originating workstation/source IP occurring within a defined lookback window (e.g., 15-30 minutes prior to lockout). Analyze the source IP(s) and the count of failed attempts leading to the lockout. Calculate the baseline rate of account lockouts (e.g., lockouts per hour/day) and use time series analysis or control charts (e.g., CUSUM, EWMA) to detect statistically significant increases. Correlate spikes in lockouts with source IPs identified in other password guessing alerts. Use descriptive statistics (mean, median, percentile of lockouts) to identify unusual periods or targeted accounts."
          },
          {
            "description": "Persistent, low-frequency failed login attempts ('low and slow') across many user accounts or against specific high-value accounts over an extended period from one or a few source IPs, potentially designed to evade rate-based detection thresholds.",
            "data_sources": [
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate failed login attempts (Windows Event ID 4625, and inferred failures from Zeek conn.log for relevant services) per source IP and per target account over longer time windows (e.g., 24 hours, 7 days). Establish baselines for 'normal' failed login counts for active accounts and typical source IP behavior. Use moving averages and standard deviation calculations on these longer-term counts to identify source IPs or target accounts with a persistently elevated, albeit low-rate, number of failures (e.g., an IP averaging 1 failed login attempt every 5-10 minutes consistently over 24 hours, targeting multiple accounts). Calculate the entropy of usernames attempted from a single source IP over an extended period; high entropy with low attempt frequency could indicate broad, slow guessing. Correlate source IPs involved in sustained low-and-slow attempts with any eventual successful logins (Windows Event ID 4624 or successful connections in Zeek) from those IPs to the same or different accounts."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]