[
  {
    "information_requirement": "Has the adversary collected sensitive data via local email files?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1114.001",
        "name": "Local Email Collection",
        "evidence": [
          {
            "description": "A process with a known malicious file hash or from a known malicious IP address accessing local email files (.ost, .pst).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor Windows Event ID 4688 for process creation events and Windows Event ID 4663 for object access events targeting files with .ost or .pst extensions. Extract the file hash (e.g., SHA256) of the process image. Inner join the observed hashes with a threat intelligence feed of known malicious file hashes. Alert on any match where a malicious process accesses email data files."
          },
          {
            "description": "Execution of command-line utilities or scripting interpreters with arguments explicitly targeting email files (.ost, .pst) for copying or reading.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation, focusing on `powershell.exe`, `pwsh.exe`, `cmd.exe`, `robocopy.exe`, and other scripting engines. Use regular expression matching on command-line arguments to detect patterns indicative of email file collection, such as `Copy-Item -Path '*\\Outlook\\*.pst'`, `robocopy.exe '*\\Outlook\\' C:\\temp\\ *.pst`, or any command referencing .ost or .pst file paths. Maintain a list of high-fidelity patterns for alerting."
          },
          {
            "description": "An unusual process (e.g., not outlook.exe, searchindexer.exe) reads a local email file and subsequently initiates an outbound network connection.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate events in sequence: 1) A file read operation on a .ost or .pst file (Windows Event ID 4663) by a process not on an approved list (e.g., Outlook, enterprise search tools). 2) An outbound network connection (Windows Event ID 5156 or Zeek conn.log) initiated by the same Process ID within a short time window (e.g., < 5 minutes). Use correlation analysis to link the file access event directly to the network connection event via Process ID to detect potential exfiltration."
          },
          {
            "description": "A large volume of local email data is read or copied, then staged in a temporary or world-writable directory.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4660"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for high-volume file read activity on .ost or .pst files (Windows Event ID 4663). Correlate these reads with subsequent file creation events (Windows Event ID 4660) where a large file (size comparable to the source .pst/.ost) is written to a common staging directory (e.g., `C:\\Users\\Public\\`, `C:\\Windows\\Temp\\`, `C:\\PerfLogs\\`). Use descriptive statistics to establish a baseline for normal file I/O and alert on significant outliers indicative of data staging behavior."
          },
          {
            "description": "Anomalous access to multiple distinct users' email files from a single source process or user account within a short timeframe.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor file access logs (Windows Event ID 4663) for read operations on .ost or .pst files across the environment. Aggregate access events by the source process name and user account over a defined time window (e.g., 1 hour). For each process/user, count the number of unique user profile paths (e.g., `C:\\Users\\<username>\\...`) being accessed. Use percentile analysis or standard deviation calculations on this count to identify any process or user accessing an abnormally high number of different users' email stores, which is indicative of widespread collection."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]