[
  {
    "information_requirement": "Is the adversary collecting data via audio capture?",
    "tactic_id": "TA0009",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1123",
        "name": "Audio Capture",
        "evidence": [
          {
            "description": "Execution of processes matching known malicious file hashes or names specifically associated with audio capture malware or spyware.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Defender Event Logs (e.g.",
              "Event ID 1116",
              "1117)"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for processes whose names or calculated hashes (if available through enhanced logging like AppLocker AppID events) match a curated list of known audio capture malware (e.g., specific spyware tools, RAT components). Cross-reference these lists with threat intelligence feeds. Monitor Windows Defender Event Logs (e.g., Event IDs 1116 - Malware Detected, 1117 - Remediation) for specific threat names associated with audio interception capabilities. Use descriptive statistics to track the frequency of known malicious process names if hashes are unavailable."
          },
          {
            "description": "Execution of command-line utilities or scripts with arguments and syntax patterns specifically indicative of invoking audio recording functionality (e.g., PowerShell using .NET audio APIs, ffmpeg for recording, specific arguments to soundrecorder.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Event Log (Event ID 4104)"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for command lines and Windows PowerShell Event Log Event ID 4104 (Script Block Logging) for script content containing: 1. Known audio capture tool names (e.g., `ffmpeg.exe`, `sox.exe`, `soundrecorder.exe`, or platform-specific tools like `arecord` if WSL is in use). 2. Specific PowerShell commands/cmdlets related to audio (e.g., `Add-Type -AssemblyName System.Media`, `New-Object Media.SoundPlayer`, WMI calls to `Win32_SoundDevice`, or direct API calls). 3. Command-line arguments for these tools that specify recording actions (e.g., `-f dshow -i audio=\"Microphone\" output.wav`, `-c 2 record.wav`). Maintain and update a library of such patterns using regular expressions. Use frequency analysis and entropy measures on command-line arguments for common processes to detect anomalous invocations."
          },
          {
            "description": "An unknown, unsigned, or atypically located process spawning legitimate applications known to use microphone/audio input (e.g., video conferencing, voice recorders), or a legitimate audio application exhibiting unusual child processes or network behavior.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) logs to: 1. Identify unsigned processes or processes running from unusual paths (e.g., %TEMP%, %PUBLIC%, user's Downloads folder) that are parent processes of known audio-using applications (e.g., `Zoom.exe`, `Teams.exe`, `Discord.exe`, `obs64.exe`, `SoundRecorder.exe`, `VoiceRecorder.exe`). 2. Detect known audio-using applications spawning unexpected child processes (e.g., `cmd.exe`, `powershell.exe`, `rundll32.exe`, or network utilities not typical for their operation). Establish baselines for parent-child process relationships and execution paths of common audio applications using descriptive statistics (e.g., frequency of parent-child pairs) and alert on deviations or low-frequency occurrences. Visualize process trees for suspicious instances."
          },
          {
            "description": "Creation of multiple files with characteristics of audio recordings (e.g., common audio file extensions, specific size patterns, periodic creation by the same process) by suspicious or non-standard processes.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Security Event ID 4663 (Object Access - File System",
              "if enabled)"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for suspicious processes (unsigned, unusual path, anomalous parent, or those matching audio capture patterns). If Windows Security Event ID 4663 (Audit File System for WriteData/AppendData) is configured for user directories or temp locations, correlate these file write events with suspicious processes identified via Event ID 4688. Look for: 1. Files created with common audio extensions (.wav, .mp3, .aac, .ogg, .m4a, .flac) or generic extensions often used for temporary storage (.dat, .tmp, .log) by these processes. 2. Periodic file creation by the same process signature (use time series analysis on file creation timestamps linked to a specific process name or path). 3. Files of sizes typical for short to medium audio recordings (e.g., 100KB – 10MB per few minutes of recording), using descriptive statistics (mean, median, IQR) to profile expected vs. anomalous file sizes. Analyze entropy of file names or look for sequential naming conventions."
          },
          {
            "description": "Anomalous outbound network traffic (e.g., to rare external destinations, large data volumes, non-standard ports/protocols for data transfer) originating from processes that have been linked to potential audio capture activity or are otherwise suspicious.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek files.log",
              "Zeek dns.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate processes flagged by other audio capture detections (e.g., suspicious command lines, anomalous process behavior, file creation patterns) with their network activity using Windows Event ID 4688 (to link process to network events) and Zeek logs (conn.log, http.log, files.log, dns.log). Monitor for: 1. Connections to IP addresses or domains with low reputation, newly registered domains, or those rarely seen in organizational traffic (use frequency analysis and correlate with Zeek dns.log for suspicious domain resolutions). 2. Unusually large data transfers (e.g., using IQR or percentile analysis on `orig_bytes` in Zeek conn.log) or long-duration connections from these processes. 3. Use of non-standard ports or protocols for exfiltration (e.g., data encoded in DNS queries, or HTTP POSTs to unusual URIs). 4. Evidence of files being transferred via Zeek files.log (e.g., matching names/sizes of suspected audio files, or files with high entropy). Use linear regression to correlate outbound data volume with the lifetime or activity period of suspicious processes."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]