[
  {
    "information_requirement": "Is the adversary maintaining persistence using browser extensions?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1176.001",
        "name": "Browser Extensions",
        "evidence": [
          {
            "description": "Network connections from browsers to domains or IP addresses known to be malicious.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate DNS queries (from Zeek dns.log) and established network connections (from Zeek conn.log on ports 80, 443, etc.) against a high-confidence, up-to-date threat intelligence feed of known malicious C2 domains and IP addresses. Generate an alert for any matches originating from user workstations, as this is a strong indicator of a malicious browser extension or compromise."
          },
          {
            "description": "Creation or modification of files within known browser extension paths by an unusual process or via scripted command-line execution.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation events with command lines that write to or modify files within specific browser extension directories (e.g., `...\\Google\\Chrome\\User Data\\Default\\Extensions\\`, `...\\Mozilla\\Firefox\\Profiles\\...\\extensions\\`, `...\\Microsoft\\Edge\\User Data\\Default\\Extensions\\`). Focus on parent processes other than the browser itself, such as `powershell.exe`, `cmd.exe`, `cscript.exe`, or `reg.exe` modifying browser policies to load extensions. Use correlation and frequency analysis to identify rare processes performing these actions."
          },
          {
            "description": "A browser process spawning suspicious child processes not associated with normal browsing activity, such as command shells or scripting engines.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 on endpoints. Filter for browser processes (e.g., chrome.exe, firefox.exe, msedge.exe) as the Parent Process Name. Alert on the creation of suspicious child processes, especially command shells (`cmd.exe`, `powershell.exe`), scripting engines (`wscript.exe`, `cscript.exe`), or other tools used for execution or lateral movement (`bitsadmin.exe`, `curl.exe`, `rundll32.exe`). Use frequency analysis on the parent-child process relationship to identify anomalies against an established baseline of normal activity."
          },
          {
            "description": "Anomalous network activity from an endpoint's browser, such as significant deviations in data volume, connection frequency, or traffic to rare domains, when compared to an established baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of network activity for each user workstation, including average data transfer volume, connection count per hour, and common destination domains using Zeek conn.log and dns.log. Employ time series analysis and statistical methods like Inter-Quartile Range (IQR) or Z-scores to detect significant spikes in data egress or connection frequency. Concurrently, analyze dns.log to identify queries for rare or new domains (low frequency of occurrence across the enterprise) using entropy measures, as this can indicate C2 communication."
          },
          {
            "description": "Browser processes initiating network connections to internal, non-routable IP addresses or sensitive internal services.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek conn.log for connections originating from user workstation IP ranges where the destination IP is within RFC1918 address space (e.g., 10.0.0.0/8, 172.16.0.0/12, 192.168.0.0/16). Exclude traffic to known internal web applications. Use frequency analysis to identify workstations that rarely or never access internal sites initiating such connections, as this may indicate a malicious extension performing internal network reconnaissance or attempting to access other resources. Correlate with host-based logs if possible to confirm the browser as the source process."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]