[
  {
    "information_requirement": "Has the adversary gained initial access via compromised hardware?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1195.003",
        "name": "Compromise Hardware Supply Chain",
        "evidence": [
          {
            "description": "Network traffic from newly provisioned or existing hardware to IP addresses or domains known to be associated with malicious firmware C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously inner join destination IP addresses and domains from Zeek conn.log and dns.log against a high-confidence threat intelligence feed of known C2 servers, particularly those linked to firmware or hardware-level implants. Place newly provisioned hardware in a monitoring group for heightened scrutiny during its initial operational period (e.g., first 30 days). Alert on any matches."
          },
          {
            "description": "Execution of drivers or software with file hashes known to be associated with specific hardware-based implants or supply chain compromises.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek files.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Extract file hashes of all newly executed processes (from Windows Event ID 4688) and files transferred over the network (from Zeek files.log), especially on newly provisioned systems. Correlate these hashes against a threat intelligence database of known malicious files associated with supply chain compromises. Alert on any matches."
          },
          {
            "description": "Network beaconing patterns or protocol usage matching known firmware implant characteristics, such as custom DNS query structures or unique JA3/JA3S hashes.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek dns.log for queries matching regex patterns of known DGA or C2 communication used by firmware implants. Analyze Zeek ssl.log for specific JA3/JA3S hashes linked to malicious implants. Use correlation analysis on Zeek conn.log data to detect connections with low data volume and highly regular intervals (e.g., every 60 minutes +/- 5 seconds) indicative of automated beaconing, especially from new hardware."
          },
          {
            "description": "Network connections originating from a host during the early boot process, specifically before the first successful interactive user logon event.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Network devices",
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a timeline for each host's boot sequence by correlating network activity from the host's IP (Zeek conn.log) with host-based logon events (Windows Event ID 4624, Logon Type 2 or 10). Flag any external network communication occurring before the first authenticated user session begins post-boot. Use time series analysis to baseline normal pre-login network chatter (e.g., DHCP, NTP, AD discovery) and apply statistical methods (e.g., IQR, Z-score) to detect outlier connections to unusual ports or destinations."
          },
          {
            "description": "Anomalous system boot events, such as Secure Boot validation failures or unexpected BitLocker recovery prompts, especially after the introduction of new hardware components.",
            "data_sources": [
              "Windows Event ID 1001",
              "Windows-Security-SPP Event ID 16384"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for events indicating boot integrity failures, such as generic boot failures (Event ID 1001), Secure Boot errors, or BitLocker recovery mode being triggered (Event ID 16384), which can be caused by unauthorized firmware or bootloader changes. Correlate the timing of these events with physical asset inventory changes. Use frequency analysis on boot error codes across the enterprise to spot new or unusual problems that may indicate a bad batch of hardware."
          },
          {
            "description": "A sequence of correlated anomalies, such as a boot error followed by the execution of an unsigned process and an unusual network connection, originating from the same host.",
            "data_sources": [
              "Windows Event ID 1001",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a composite alert by correlating multiple weak signals within a short time window (e.g., 5 minutes) on a single host. A high-fidelity alert would trigger if a host generates: 1) A boot error event, 2) An unsigned process execution event (Event ID 4688), and 3) An external network connection to a low-reputation or newly-seen IP (Zeek conn.log). Use linear regression or a simple scoring model to assess the risk of combined events."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]