[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by detecting virtualization or sandboxes?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1497.001",
        "name": "System Checks",
        "evidence": [
          {
            "description": "Execution of a command containing hardcoded, highly specific strings or arguments known to be used by a particular malware family for VM detection.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a threat intelligence list of unique, hardcoded command-line arguments or registry key paths used by specific malware families for evasion (e.g., a specific WMI query string, a non-standard device check). Monitor Windows Event ID 4688 process creation logs for exact matches to these atomic strings. Alert immediately on any match, as this indicates a high-confidence threat."
          },
          {
            "description": "A process queries or accesses a collection of common artifacts known to indicate a virtualized or sandbox environment (e.g., specific files, registry keys, services, or MAC addresses).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Windows Event ID 7036"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for processes accessing a watchlist of common VM/sandbox artifacts. For file/directory access (Event ID 4663), check for paths containing 'VMware', 'VirtualBox', 'VBoxGuest.sys'. For process commands (Event ID 4688), look for queries for processes like 'vmtoolsd.exe', services like 'VBoxService' (Event ID 7036), or MAC addresses with vendor prefixes for VMware (`00:50:56`, `00:0C:29`), VirtualBox (`08:00:27`), or Hyper-V (`00:15:5D`). Use correlation analysis to link multiple checks from a single process."
          },
          {
            "description": "A process performs a sequence of system checks, finds indicators of a sandbox, and then either terminates without performing its primary function or attempts to delete itself.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate events for individual processes over their lifetime. Identify a behavioral sequence: 1) A new process starts (Event ID 4688), especially if unsigned or from a temporary location. 2) The process performs one or more system checks for VM artifacts (from Event ID 4688 command lines or Event ID 4663 file access). 3) The process subsequently terminates without making any external network connections (absence of corresponding Zeek conn.log data) and/or its executable file is deleted by itself or its parent process. This sequence suggests successful evasion."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary performing system checks to discover the execution environment?",
    "tactic_id": "TA0007",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1497.001",
        "name": "System Checks",
        "evidence": [
          {
            "description": "An internal host makes a network connection attempt to a hardcoded, non-standard port or IP address known to be used by malware to test for specific sandbox network configurations.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for outbound connections from endpoints to the VMware 'backdoor' I/O port (TCP/UDP 5658) or other specific, hardcoded ports/IPs known from malware analysis reports to be used exclusively for sandbox detection. Maintain a watchlist of these atomic network indicators and alert on any matching connection attempt."
          },
          {
            "description": "Execution of common open-source reconnaissance scripts or utilities that include modules for discovering sandbox or virtual environments.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 process creation logs for command-line arguments and patterns characteristic of known discovery tools or frameworks (e.g., Seatbelt, BloodHound, PowerSploit). Maintain and use a library of regular expressions to match execution patterns, such as 'Seatbelt.exe -group=all', 'Get-VM', or specific encoded PowerShell commands associated with these tools. Flagging execution of these tools provides a strong pattern-based indicator of active discovery."
          },
          {
            "description": "An unusual process executes a high volume and variety of system queries in a short timeframe, gathering information about hardware, user activity, and system configuration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each new process, track the number and diversity of discovery-related actions within a short time window (e.g., 60 seconds). Actions include querying hardware (`wmic cpu get`, `wmic diskdrive get`), user activity (`query user`, checking recent file lists), system uptime, and environment specifics (`systeminfo`, `reg query HKLM\\...`). Calculate an entropy score based on the categories of checks performed (e.g., hardware, user, network, OS). Use time series analysis or a simple threshold on the count/entropy score to flag processes exhibiting hyperactive discovery behavior, especially if the process is unsigned or runs from a non-standard file path. A box-plot of query counts per process can reveal outliers."
          },
          {
            "description": "A process enumerates files and directories with names indicative of a security analysis environment, such as 'malware', 'sample', 'virus', or 'sandbox'.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4663 for file/directory access attempts (specifically ReadData/ListDirectory) targeting paths containing keywords like 'malware', 'sample', 'hash', 'sandbox', 'analysis', 'virus', or common security tool names. Correlate with Windows Event ID 4688 for commands (`dir`, `tree`, `Get-ChildItem -Recurse`) with arguments targeting user desktops or download folders, which are common locations for analysis samples. Use frequency analysis to identify rare access patterns or command arguments compared to a baseline of normal system and user activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]