[
  {
    "information_requirement": "Has the adversary attempted to impact external systems through defacement?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1491.002",
        "name": "External Defacement",
        "evidence": [
          {
            "description": "Detection of known defacement signatures (text, HTML, image hashes), malicious scripts, or known bad IFRAMEs injected into external web pages, or network connections from IPs/domains associated with known defacement campaigns.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Network devices",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For network-based detection: Analyze Zeek http.log (for HTML content, script tags, IFRAMEs) and Zeek files.log (for images, scripts being served) for matches against a database of known defacement page textual/HTML signatures, malicious script content, or hashes of known defacement images/files. For server-based detection: Use file modification events (Windows Event ID 4663) as a trigger to scan modified files in web directories against the same signature/hash database. Correlate source IPs initiating connections that led to defacement or modifications (from Zeek http.log or server logs if available) with threat intelligence feeds of IPs/domains used by known defacement groups. Alert on confirmed matches."
          },
          {
            "description": "Network traffic containing common web vulnerability exploitation patterns (e.g., SQL injection, Cross-Site Scripting, command injection strings) or known web shell upload patterns targeting external web servers, which could precede defacement.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek http.log URI parameters, headers, and HTTP request bodies for specific string patterns indicative of common web exploits (e.g., ' OR '1'='1', <script>, ../../, ;id;, whoami, etc.). Monitor POST requests for filenames, content types, or content snippets matching signatures of known web shells (e.g., c99.php, r57.php, webshell.aspx). Maintain and regularly update a list of these exploit and web shell patterns. Use regular expression matching and correlate suspicious requests with HTTP response codes indicating success (e.g., 200) or error messages that might reveal vulnerability. Use frequency analysis on detected patterns per source IP."
          },
          {
            "description": "Anomalous modification of web content files (HTML, JS, CSS, images) in web server directories, detected by deviations in frequency, time of day, source process, or unexpected file types being altered.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4663 (An attempt was made to access an object) for write, delete, or rename operations on files within web root directories. Establish baselines for normal modification activity (e.g., frequency during legitimate deployment windows, typical file types modified). Alert on modifications occurring outside these windows, by unexpected user accounts, or by unusual processes (identified via correlation with Windows Event ID 4688 - Process Creation). Use time series analysis on the count of file modification events to detect abnormal spikes or sustained unusual activity. Calculate entropy of file extensions being modified within a time window; a sudden change might indicate mass replacement with defacement files."
          },
          {
            "description": "Execution of suspicious or unexpected processes (e.g., command shells, scripting engines like powershell.exe or python.exe, network utilities like curl/wget) on web servers, particularly if temporally correlated with web file modifications or inbound network connections from untrusted sources.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) on web servers for the execution of processes like cmd.exe, powershell.exe, bash, wscript.exe, cscript.exe, wget.exe, curl.exe, or other scripting/utility tools not part of normal server operations or authorized administrative tasks. Correlate these process creation events with nearby file modification events (Windows Event ID 4663, particularly writes/renames) in web directories or with preceding anomalous inbound network connections (from Zeek conn.log) to the server from external or untrusted IPs. Use descriptive statistics on process names and command-line arguments (e.g., rare argument combinations) to identify suspicious executions. Develop a baseline of normal server processes using process name and parent process relationships, and alert on deviations using correlation analysis."
          },
          {
            "description": "Anomalous HTTP POST requests to web servers, characterized by unusual size, target file extension (e.g., .php, .asp, .jsp uploads to image or static content directories), or high frequency from a single source, potentially indicating web shell upload or direct defacement content delivery.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek http.log for HTTP POST requests targeting web servers. Establish baselines for typical POST request sizes, target URLs/file extensions, and source IP behavior for different parts of the web application. Flag POST requests with unusually large bodies (using Inter-Quartile Range (IQR) or percentile analysis on size compared to historical data for that URL/server type), or those targeting non-standard file types for uploads (e.g., executable scripts to image folders, unexpected extensions in web root). Monitor for a high frequency of POSTs from a single IP to various URIs or a single vulnerable URI. Correlate with Zeek conn.log to analyze overall session characteristics (duration, total bytes transferred, connection state). Use linear regression to model expected POST request sizes for common submission points and flag significant positive residuals as outliers."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]