[
  {
    "information_requirement": "Is the adversary attempting to cause denial of service by exhausting service resources?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1499.002",
        "name": "Service Exhaustion Flood",
        "evidence": [
          {
            "description": "Connections to a targeted service originating from source IP addresses known to be part of active botnets or DoS-for-hire services.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IP addresses in Zeek conn.log that are connecting to critical services against a high-confidence, frequently updated cyber threat intelligence feed of known botnet command and control (C2) nodes, open proxies, or compromised endpoints used in DoS attacks. Generate high-priority alerts for any confirmed matches from these selector lists."
          },
          {
            "description": "Traffic patterns matching known application-layer DoS attack tools or techniques, such as slow-read/slow-write attacks or a high volume of requests to computationally expensive API endpoints.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for connections with unusually long durations but very low data transfer rates, a pattern characteristic of slow-read/slow-write attacks (e.g., Slowloris). Analyze Zeek http.log for a high frequency of incomplete HTTP requests or repeated requests to specific, known resource-intensive API endpoints (e.g., search functions, report generation). Maintain and use a library of regular expressions or signatures to detect these known attack patterns."
          },
          {
            "description": "A statistically significant and sustained spike in connection rate or traffic volume targeting a specific service, originating from a large number of unique source IPs.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a dynamic baseline of normal traffic volume, connection rates, and unique source IP counts per minute/hour for critical services using historical Zeek conn.log data. Use time series analysis (e.g., ARIMA, Holt-Winters) to detect significant deviations from this baseline. Calculate the entropy of source IP addresses connecting to the service; a sudden, sharp increase in entropy can indicate a distributed flood. Alert when volume and unique source IP count exceed a threshold (e.g., >3 standard deviations above the mean) for a sustained period."
          },
          {
            "description": "Anomalous protocol usage or connection states indicating server-side resource exhaustion, such as a high ratio of new connection attempts to successfully established connections or an abnormal distribution of connection states.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the `history` and `conn_state` fields in Zeek conn.log for the targeted service. Monitor for an abnormally high number of connections in states like `S1` (SYN sent, no reply), `REJ` (connection rejected), or `RSTO` (connection reset by originator), which can indicate the server's SYN backlog is full. Calculate the ratio of successful (`SF`) to failed connections; a sharp decrease in this success ratio suggests the service is unable to accept new legitimate connections. For SSL/TLS services, monitor Zeek ssl.log for a high rate of handshake failures or repeated renegotiation attempts from multiple sources."
          },
          {
            "description": "Measurable degradation in service quality metrics, such as increased server response times, high rates of connection timeouts, or a surge in server-side error codes.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for connections to the targeted service. Calculate and track a moving average of server response times (time between request and first response packet) and the rate of HTTP 5xx error codes. In Zeek conn.log, monitor the average connection duration and the rate of connections terminated with a reset flag without being fully established. Use time series analysis and statistical process control charts to alert when these degradation metrics cross a predefined threshold (e.g., response time increases by 200%, error rate exceeds 5%), indicating the service is failing under load."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]