[
  {
    "information_requirement": "Is the adversary maintaining persistence using a malicious transport agent?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1505.002",
        "name": "Transport Agent",
        "evidence": [
          {
            "description": "Presence of transport agent DLLs with known malicious file hashes on an Exchange server or outbound connections from Exchange transport processes to known malicious C2 infrastructure.",
            "data_sources": [
              "Windows Event ID 4663",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable file system auditing on Exchange transport agent directories to generate Windows Event ID 4663 for new file creation. Calculate the hash of any new DLL files written to these directories and inner join the hashes against a threat intelligence database of known malicious file hashes. Concurrently, monitor Zeek conn.log for outbound connections from Exchange transport processes (e.g., `edgetransport.exe`) and correlate destination IP addresses with a CTI feed of known malicious C2 servers. Alert on any matches from either data source."
          },
          {
            "description": "Execution of Exchange management shell cmdlets (`Install-TransportAgent`) or direct modification of registry keys associated with transport agent registration.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for process creation of `powershell.exe` or `wsmprovhost.exe` with command-line arguments containing `Install-TransportAgent`. Flag installations with unusual agent names (e.g., random characters), library paths (e.g., temp directories), or those occurring outside of planned maintenance windows. Additionally, enable and monitor registry auditing (Windows Event ID 4657) on `HKLM\\SOFTWARE\\Microsoft\\ExchangeServer\\v15\\TransportRoles\\agents\\` for any unexpected creation of new agent subkeys or modification of existing agent priorities."
          },
          {
            "description": "Anomalous file write activity by an Exchange transport process, such as writing executable files or scripts to sensitive or staging directories.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor file creation/modification events (Windows Event ID 4663) initiated by Exchange transport processes (e.g., `edgetransport.exe`). Establish a baseline of normal file write locations and file types for these processes. Flag deviations, such as writing files to unusual directories (`C:\\Temp`, `C:\\Users\\Public`, web-accessible paths) or creating files with suspicious extensions (`.ps1`, `.bat`, `.exe`, `.dll`) in unexpected locations. Use entropy measures on filenames to detect randomly generated names that may indicate malicious payloads being dropped."
          },
          {
            "description": "Anomalous outbound network connections from Exchange transport processes characterized by unusual destination, protocol, data volume, or connection timing.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For Exchange transport processes, build a statistical baseline of outbound network behavior (destination IPs/countries, ports, protocols, bytes transferred, connection duration) using historical Zeek conn.log data. Use time series analysis to detect significant deviations, such as a sudden increase in data volume to a new destination country. Use a linear regression model to predict expected data volume per connection, alerting on significant residuals. Flag connections to rare domains or IP addresses using frequency analysis (e.g., identifying destinations in the bottom 5th percentile of occurrence)."
          },
          {
            "description": "Anomalous email flow patterns that could indicate interception or exfiltration by a malicious transport agent, such as a sudden drop in inbound mail for a high-value user or a spike in outbound mail with unusual attachments.",
            "data_sources": [
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek smtp.log for high-level mail flow metadata. Establish baselines for email volume per user or group. Use time series analysis to detect sudden, unexplained drops in inbound mail for specific high-value users (suggesting interception) or spikes in outbound mail. Analyze the distribution of attachment file types (from `file_mime_type` in smtp.log) and use correlation analysis to flag sudden appearances of unusual compressed file types (e.g., `.zip`, `.rar`, `.7z`) in outbound mail that deviate from an account's normal behavior, potentially indicating data exfiltration."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]