[
  {
    "information_requirement": "Is the adversary establishing persistence using modified Pluggable Authentication Modules?",
    "tactic_id": "TA0003",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1556.003",
        "name": "Pluggable Authentication Modules",
        "evidence": [
          {
            "description": "Successful authentication (Windows Event ID 4624) to Windows systems using credentials known to be hardcoded in specific Linux PAM backdoors or commonly tested by attackers after compromising PAM.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Maintain a list of known default/hardcoded credentials (username/password pairs) associated with specific PAM backdoor tools or malware. Monitor Windows authentication logs (Event IDs 4624 for success, 4625 for failure) for login attempts using these exact credentials. Alert on any successful or multiple failed attempts, as this may indicate credential reuse from a PAM-compromised Linux system. Use frequency analysis on credential usage."
          },
          {
            "description": "A consistent pattern of direct logins to Windows systems from specific Linux source IPs (potentially compromised via PAM) that bypass MFA or normal jump box procedures, occurring at regular intervals or specific off-hours.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "MFA logs (if available for correlation)"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify Linux source IPs (via asset inventory or OS fingerprinting in Zeek logs). Monitor for successful Windows logins (Event ID 4624) originating directly from these IPs, especially if they bypass expected MFA (correlate with MFA logs) or established access pathways. Use time series analysis on Zeek conn.log and login events to detect regularly scheduled access or connections at highly consistent, unusual times, suggesting automated persistent access using credentials potentially sourced from a compromised PAM."
          },
          {
            "description": "Sustained unusual successful login activity to Windows systems (e.g., abnormal times, sources, logon types) using accounts primarily associated with Linux environments, potentially indicating persistent access through credentials compromised via modified PAM.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For user accounts with significant activity on Linux systems (where PAM is relevant), baseline their typical Windows login behavior (source IP, time, target server, logon type) using Windows Event ID 4624 and Zeek conn.log. Detect persistent deviations, such as continued logins from unexpected geolocations or at consistently odd hours. Use statistical methods (IQR, Z-scores on login attributes, time series decomposition for seasonality, percentile analysis) to flag ongoing anomalous patterns suggesting compromised credential persistence."
          },
          {
            "description": "Multiple geographically dispersed successful Windows logins for the same non-service account (especially one with Linux access) occurring persistently in an impossible travel timeframe.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "For each account, analyze successful Windows login events (Event ID 4624) and geolocated source IPs (from Zeek conn.log or enrichment). Calculate time differences and distances between consecutive logins. Flag recurring instances where the travel time required between login locations is physically impossible, particularly if the account is also used on Linux systems. Use correlation analysis and track frequency of impossible travel alerts per user. Box-plots of travel times can show outliers."
          },
          {
            "description": "Anomalous processes launched or network connections made from a Windows host immediately following authentication by an account whose credentials may have been compromised via a modified PAM on a Linux system, indicating persistent access enabling further actions.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate successful Windows logins (Event ID 4624) by accounts potentially compromised via PAM (e.g., those exhibiting other anomalous login behaviors or originating from suspect Linux IPs) with subsequent process creation events (Windows Event ID 4688) and network connections (Zeek conn.log) on the Windows host. Flag low-frequency processes, execution of known malicious tools, or connections to unusual destinations that occur consistently after such logins. Establish process execution baselines per user/host context and use descriptive statistics or regression models to identify deviations indicative of persistent follow-on activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary evading defenses by tampering with authentication modules?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense-Evasion",
    "indicators": [
      {
        "technique_id": "T1556.003",
        "name": "Pluggable Authentication Modules",
        "evidence": [
          {
            "description": "Known malicious IP addresses or domains, associated with tools that modify PAM for defense evasion (e.g., C2s that instruct PAM to log misleading information or bypass local controls), observed communicating with Linux hosts.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for network traffic between internal Linux hosts (identified by IP/asset data) and external IPs/domains present on threat intelligence feeds specifically listing indicators for PAM-related malware known to incorporate defense evasion (e.g., log tampering capabilities, local firewall bypass). Alert on matches. This is an indirect indicator that PAM might be compromised on the Linux host to evade its local defenses."
          },
          {
            "description": "Consistent successful Windows authentications (e.g., via RADIUS from a Linux VPN server with compromised PAM) that systematically lack corresponding MFA success logs or show successful MFA bypasses using known patterns.",
            "data_sources": [
              "Windows Event ID 4624",
              "MFA logs (if available for correlation)",
              "Zeek conn.log (for RADIUS traffic if visible)"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Where Linux systems (e.g., VPN servers using PAM) integrate with Windows authentication (e.g., via RADIUS to NPS), monitor Windows Event ID 4624 for successful authentications. Correlate these with MFA logs. Identify patterns of users or source systems that consistently achieve authentication without valid MFA logs or with repeated MFA bypass codes matching known PAM backdoor capabilities. Analyze Zeek conn.log for RADIUS traffic patterns from suspect Linux systems that might indicate anomalous authentication responses or replay."
          },
          {
            "description": "Successful Windows logins that bypass expected security controls (e.g., network segmentation rules, time-based access restrictions) when the access originates from or is brokered by a Linux system suspected of PAM modification allowing such bypasses.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify successful Windows logins (Event ID 4624) and associated network connections (Zeek conn.log). Compare source IPs and login times against defined security policies (e.g., allowed subnets, business hours). If access originates from a Linux system where PAM could be tampered to ignore local policies, pay close attention to logins that violate these policies without generating expected blocks or alerts, potentially indicating credentials obtained via PAM are used to bypass other controls. Use correlation analysis to link login events with policy definitions and flag violations."
          },
          {
            "description": "Anomalous sequences of Windows login attempts (e.g., specific failed attempts followed by success from an unusual source) for accounts primarily used on Linux, where the pattern suggests testing of an evasive access method established via PAM modification.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze sequences of failed (Windows Event ID 4625) and successful (Windows Event ID 4624) Windows login attempts from the same source IP or for the same user (especially Linux-primary users) within short timeframes. Use time series analysis and statistical thresholds (e.g., N failed attempts with specific error codes followed by 1 success from a new IP within M minutes) to identify patterns that might indicate testing of a compromised credential or a PAM-backdoor facilitated login designed to evade typical brute-force detection."
          },
          {
            "description": "Unexpected successful Windows authentication using atypical logon types or service contexts, especially if linked to prior suspicious activity on a related Linux system where PAM could be compromised to allow such logons.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4624 for atypical logon types (e.g., interactive on a server usually accessed via remote, Batch logon for a user account). Correlate these with any preceding anomalous activity on Linux systems associated with the user or source IP (if known via asset inventory or other alerts). Investigate subsequent process activity (Windows Event ID 4688) under this atypical logon context for unusual commands or tools. Use frequency analysis and descriptive statistics (mean, mode) to define 'atypical' logon types per user/system and detect significant deviations."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is the adversary attempting to access credentials via compromised authentication modules?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential-Access",
    "indicators": [
      {
        "technique_id": "T1556.003",
        "name": "Pluggable Authentication Modules",
        "evidence": [
          {
            "description": "Network connections from Linux hosts to external IP addresses or domains known to be command-and-control (C2) or exfiltration points for malware that harvests credentials via PAM modification.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for traffic originating from internal IP addresses associated with Linux systems (identified via asset inventory or OS fingerprinting). Correlate destination IPs/domains against a continuously updated cyber threat intelligence (CTI) feed of C2s/exfil points known to be used by PAM-targeting malware (e.g., specific stealers that patch pam_unix.so). Alert on matches. Prioritize alerts from critical Linux servers. Use descriptive statistics to baseline and identify rare external connections from these Linux hosts."
          },
          {
            "description": "Outbound network traffic from Linux hosts exhibiting data structures or protocols consistent with known PAM credential harvesting malware exfiltration techniques (e.g., encoded data in DNS TXT records, specific HTTP POST structures).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek dns.log from Linux hosts for unusually long DNS queries, high frequency of TXT record queries, or queries to non-standard DNS servers often used for data exfiltration. Inspect Zeek http.log for outbound POST requests with small, potentially encoded payloads, or unusual User-Agents associated with credential exfiltration tools. Monitor Zeek conn.log for connections using non-standard ports or protocols favored by specific credential exfiltration tools that target PAM. Maintain and apply regular expressions or signatures for such exfiltration patterns. Use entropy measures on DNS query names or HTTP POST bodies to spot encoded data."
          },
          {
            "description": "Anomalous outbound network traffic from a Linux host (e.g., to new external destinations, large data transfers) occurring shortly after multiple local user authentications on that host, potentially indicating exfiltration of credentials harvested by a modified PAM module.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Linux hosts (identified by IP/asset inventory) for significant increases in outbound network connections or data volume (Zeek conn.log) to new or unusual external destinations. Use time series analysis to establish baseline network behavior for these hosts. Flag activity that occurs after periods of expected high local login activity on multi-user Linux systems (e.g., start of business day, after patch reboots). While direct correlation with PAM-logged credentials is not possible with these logs, this temporal correlation may indicate credentials harvested by PAM being exfiltrated. Use linear regression to model expected outbound traffic based on login volume and detect significant positive residuals."
          },
          {
            "description": "A sudden increase in Windows login failures (Event ID 4625) followed by successes (Event ID 4624) across multiple Windows accounts, using credentials potentially stolen via a widespread PAM compromise on Linux systems and then tested against Windows.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4625",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Aggregate Windows login events (4624, 4625) across all users. Identify time windows with an unusually high rate of failed logins immediately followed by successful logins for multiple distinct user accounts, especially if the source IPs (from Zeek conn.log or event logs) are common or from Linux segments. This pattern could indicate broad credential testing after a PAM-based harvesting campaign. Use statistical methods like moving window event rate analysis and correlation of source IPs. Graph analysis could visualize the spread from common sources to multiple compromised Windows accounts."
          },
          {
            "description": "Execution of known credential dumping tools or suspicious processes on Windows systems using accounts that also have access to Linux environments where PAM could be compromised, especially if occurring after anomalous Windows login activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows process creation events (Event ID 4688) for the execution of known credential dumping tools (e.g., Mimikatz, ProcDump using specific command line arguments) or suspicious scripts (e.g., PowerShell invoking reflection). Prioritize alerts for processes run by accounts that have dual Windows/Linux access, especially if these processes occur after an anomalous Windows login (Event ID 4624, e.g., unusual source or time) by that account. Use frequency analysis of process names and command-line arguments per user to detect rarity. Correlate with known malicious command lines and patterns from threat intelligence."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]