[
  {
    "information_requirement": "Has the adversary accessed or stolen credentials from macOS Keychains?",
    "tactic_id": "TA0006",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1555.001",
        "name": "Keychain",
        "evidence": [
          {
            "description": "Execution of a process with a file hash or from a path known to be associated with keychain enumeration malware.",
            "data_sources": [
              "EDR process creation logs",
              "Sysmon for macOS Event ID 1"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process execution on macOS endpoints. Compare process hashes and full file paths against a threat intelligence feed of known indicators for keychain theft tools (e.g., KeySteal, Chain-Reactor). Alert on any exact match and isolate the host for immediate investigation."
          },
          {
            "description": "Execution of the built-in 'security' command-line utility with specific argument patterns used to dump keychain contents or access credentials.",
            "data_sources": [
              "EDR command-line logs",
              "Sysmon for macOS Event ID 1"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor command-line arguments for all executed processes on macOS endpoints. Use regular expression matching to detect invocations of the 'security' utility with arguments such as 'dump-keychain', 'find-generic-password', or 'find-internet-password'. Correlate command execution with parent process information and flag instances where the parent is not Terminal.app, a known administrator script, or a legitimate software installer. Use frequency analysis to identify hosts with an unusual number of these commands."
          },
          {
            "description": "An application not typically associated with keychain access (e.g., document editor, downloaded utility) spawning a prompt for the user's keychain password or making direct API calls to access keychain data.",
            "data_sources": [
              "EDR API monitoring logs",
              "macOS Unified Log (log stream)"
            ],
            "data_platforms": [
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of legitimate applications that access the keychain in the environment. Monitor for keychain access attempts (via API calls like `SecItemCopyMatching` or by analyzing the parent process of `SecurityAgent` prompts) from unusual, unsigned, or recently created processes, especially those running from temporary or user-writable directories. Use process ancestry analysis to identify the initial execution chain and investigate suspicious behavior. Use descriptive statistics to flag processes that are rare keychain accessors."
          },
          {
            "description": "Anomalous successful authentication to Windows or network services (e.g., RDP, SMB, Kerberos) using credentials associated with a macOS user, originating from an unexpected source IP or at an atypical time.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek kerberos.log"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate successful network logins on Windows assets (Windows Event ID 4624, Logon Type 3) and network authentication logs (Zeek kerberos.log) with connection logs (Zeek conn.log). Baseline normal login source IPs and times for macOS user accounts. Flag successful logins from statistically rare IP addresses or at times that deviate significantly from the user's established pattern using percentile analysis, IQR, or Z-scores. This serves as a strong indicator that credentials stolen from a macOS host are being reused elsewhere on the network."
          },
          {
            "description": "Execution of remote administration tools or lateral movement commands on Windows machines, immediately following a successful network authentication using credentials associated with a macOS user account.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a correlated alert that triggers when a successful network logon (Windows Event ID 4624, Logon Type 3) using a macOS user's credentials is immediately followed on the same target host by suspicious process creation (Windows Event ID 4688). Monitor for execution of tools like 'psexec.exe', 'wmic.exe', or the use of PowerShell for remote execution. Use correlation analysis to link the specific logon session ID with the subsequent process creation events within a short time window (e.g., 1-5 minutes) to detect credential reuse for lateral movement."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]