[
  {
    "information_requirement": "Has the adversary gained initial access to the network via spearphishing link?",
    "tactic_id": "TA0001",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1566.002",
        "name": "Spearphishing Link",
        "evidence": [
          {
            "description": "Network traffic (DNS, HTTP, SSL/TLS) directed to domains, URLs, or IP addresses present on high-confidence threat intelligence feeds for phishing or malware distribution.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join network logs (Zeek conn.log destination IPs, dns.log queries, http.log host headers, ssl.log server names) with a continuously updated CTI feed of known phishing or malicious indicators. Alert on any match. Prioritize alerts where multiple data sources (e.g., DNS and HTTP) confirm the connection to the malicious indicator."
          },
          {
            "description": "HTTP requests containing URL structures, query parameters, or POST data consistent with known phishing kits or credential harvesting pages.",
            "data_sources": [
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Use regular expression matching on Zeek http.log URIs and POST body content to detect patterns indicative of phishing kits, such as parameters designed to capture usernames/passwords (e.g., 'username=', 'password=') passed in the URL, or POSTs to non-standard login pages. Maintain a list of regex patterns based on public and internal reporting of phishing kit structures. Correlate detections with the reputation of the destination domain."
          },
          {
            "description": "File downloads of high-risk types (e.g., HTA, ISO, LNK, obfuscated HTML/JS) from low-reputation or newly registered domains initiated by a web browser.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek files.log for downloaded files with high-risk MIME types or extensions (e.g., 'application/hta', 'application/x-iso9660-image', 'application/x-ms-shortcut'). Correlate the download event (from Zeek http.log) with the domain's age and reputation using Zeek dns.log and external data sources. Calculate the frequency of downloads of these file types from specific domains; flag downloads from sources with low frequency counts across the enterprise."
          },
          {
            "description": "A browser process spawns a suspicious child process (e.g., scripting engine like wscript.exe or powershell.exe, or a living-off-the-land binary) following a user visit to a URL.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate network activity (Zeek http.log showing a URL visit) with subsequent process creation events (Windows Event ID 4688) on the same host within a short time window (e.g., 1-5 minutes). Establish a baseline of normal parent-child process relationships for browsers (e.g., chrome.exe, msedge.exe). Use frequency analysis to identify rare or never-before-seen child processes being spawned by browsers, particularly scripting engines or command shells. Alert on any such anomalous parent-child creation."
          },
          {
            "description": "A sequence of events where a user's machine makes an outbound network connection to a newly observed or low-reputation domain within minutes of that domain first appearing in an inbound email.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek smtp.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Extract all domains from URLs found in inbound email bodies and headers (Zeek smtp.log). Correlate these domains with subsequent DNS queries (Zeek dns.log) and outbound connections (Zeek conn.log) from the recipient's host. Use time series analysis to flag connections occurring within a short delta (e.g., < 5 minutes) of email delivery. Prioritize alerts for domains that are newly observed across the enterprise or have a poor reputation."
          },
          {
            "description": "Anomalous DNS queries for domains exhibiting characteristics of phishing, such as high entropy, homoglyphs, or typosquatting, especially when queried by a small number of hosts.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze all DNS queries in Zeek dns.log. Calculate the entropy for each queried domain name to identify randomly generated or complex names. Use algorithms to detect potential homoglyphs or typosquatting of corporate or popular domains. For each suspicious domain identified, count the number of distinct internal hosts that queried it. Use a box-plot or percentile analysis on the 'queried by' count to flag domains queried by an anomalously low number of hosts, indicating a targeted attack rather than widespread traffic."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]