[
  {
    "information_requirement": "Is the adversary attempting to wipe or corrupt data to impact availability?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1561",
        "name": "Disk Wipe",
        "evidence": [
          {
            "description": "Detection of file hashes or specific process names associated with known disk-wiping malware families.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688) with process hash logging enabled. Correlate the hashes of all new executables against a continuously updated cyber threat intelligence (CTI) feed of known disk-wiping malware families (e.g., WhisperGate, CaddyWiper, NotPetya, etc.). An immediate, high-severity alert should be triggered on any match."
          },
          {
            "description": "Execution of legitimate system utilities with command-line arguments and flags indicative of disk or data wiping.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for the execution of legitimate system utilities that can be used for disk wiping. Create and maintain a list of high-fidelity regular expression patterns for suspicious argument combinations, such as `vssadmin.exe delete shadows /all /quiet`, `cipher.exe /w:`, `format.exe /fs:* /p:*`, or `wbadmin.exe delete catalog`. Alert on executions of these command patterns, especially when initiated by non-administrative users or scripts."
          },
          {
            "description": "Execution of destructive commands (e.g., `erase`, `delete`, `format`) targeting persistent storage or configuration on network devices.",
            "data_sources": [
              "Zeek syslog.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor network device logs forwarded to a central syslog server (captured via Zeek syslog.log if configured). Filter for command execution events matching known destructive commands like `erase startup-config`, `write erase`, `delete flash:`, or `format flash:`. Correlate command execution with the source user and IP. Use frequency analysis to identify unauthorized or anomalous execution of such commands, and alert immediately."
          },
          {
            "description": "Anomalous process access to raw disk devices or attempts to overwrite the Master Boot Record (MBR) or partition table.",
            "data_sources": [
              "Windows Event ID 4656",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable and monitor advanced audit policy logs for object access (Windows Event IDs 4656, 4663). Create a specific audit rule for access to raw disk devices (e.g., \\\\.\\PhysicalDriveX). Baseline legitimate processes that may access raw disk (e.g., specific backup software). Alert on any access from unauthorized, unsigned, or unexpected processes. Use descriptive statistics to identify processes with an anomalously high count of raw disk access events."
          },
          {
            "description": "Anomalously high volume of file deletion, modification, or write operations on a host that deviates significantly from established baselines, indicating mass data destruction.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4660"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable file system object access auditing (for deletion: Event ID 4660; for modification/write: Event ID 4663). For each host, establish a baseline of normal file operation volume. Monitor for sudden, massive spikes in file I/O operations using time series analysis or an IQR-based outlier detection method on event counts per minute. Calculate the entropy of file extensions being modified/deleted; a sudden change in entropy (e.g., a drop indicating targeting of specific files, or a sharp rise indicating indiscriminate wiping) can be a strong indicator of malicious activity. Correlate high-volume events with the responsible process (from Event ID 4688)."
          },
          {
            "description": "A host exhibiting disk-wiping behavior begins anomalously accessing administrative shares (e.g., C$, ADMIN$) on numerous other hosts in a short period, indicating lateral spread of a wiper.",
            "data_sources": [
              "Zeek smb_mapping.log",
              "Zeek conn.log",
              "Windows Event ID 5140"
            ],
            "data_platforms": [
              "Network devices",
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate hosts that have triggered disk-wiping alerts with their subsequent network behavior. Monitor Zeek logs (conn.log for connection attempts, smb_mapping.log for successful share access) and Windows Event ID 5140 (share access) for a single source IP connecting to a high number of distinct destination IPs on port 445 (SMB). Use descriptive statistics to calculate the fan-out ratio (unique destinations per source in a time window) and alert when a host's ratio dramatically exceeds its baseline or a global threshold, indicating worm-like propagation."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]