[
  {
    "information_requirement": "Is the adversary attempting to evade defenses using safe mode boot?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1562.009",
        "name": "Safe Mode Boot",
        "evidence": [
          {
            "description": "Execution of scripts or binaries with file hashes known to be associated with malware that configures a safe mode boot for defense evasion.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor process creation events (Windows Event ID 4688) and calculate the file hash of the executed binary. Correlate these hashes against a cyber threat intelligence (CTI) feed of known malware hashes, specifically those associated with tools or scripts that modify boot configurations. Alert on any match, especially if the process is correlated with subsequent bcdedit.exe execution or direct registry modifications related to SafeBoot."
          },
          {
            "description": "Execution of boot configuration utilities (e.g., bcdedit.exe, msconfig.exe) with command-line arguments specifying safeboot options.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for process creations (Windows Event ID 4688) of 'bcdedit.exe' or 'msconfig.exe'. Scrutinize command-line arguments for strings such as '/set safeboot', '/set {current} safeboot minimal', or '/set bootmenupolicy legacy'. Use correlation analysis to link these executions with suspicious parent processes (e.g., PowerShell, a document reader) or processes spawned from unusual user contexts. Apply frequency analysis to identify rare or unauthorized execution of these utilities."
          },
          {
            "description": "Direct modification of Windows Registry keys to configure a reboot into Safe Mode or to register malicious persistence that executes in Safe Mode.",
            "data_sources": [
              "Windows Event ID 4657"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for registry modification events (Windows Event ID 4657). Specifically, look for SetValue or CreateKey operations on: 1) 'HKLM\\SYSTEM\\CurrentControlSet\\Control\\SafeBoot\\Minimal' or '...\\Network' to add new unauthorized drivers/services. 2) 'HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run' where the value name is prefixed with '*' to force execution in safe mode. Correlate the responsible process (from Event 4657) with other suspicious activity. Baseline legitimate modifications during software installation and flag all outliers."
          },
          {
            "description": "Anomalous process execution or network activity on a host immediately following a reboot, inconsistent with a standard Safe Mode environment.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "First, detect a potential safe mode boot by observing a logon event (Event ID 4624, Logon Type 2) without the preceding typical sequence of service start events seen in a normal boot. Upon detecting this, establish a short-term, high-alert monitoring window. Profile expected processes in a minimal safe boot (e.g., csrss.exe, winlogon.exe, explorer.exe). Flag any unexpected process creations (Event ID 4688), especially scripting engines (powershell.exe, cscript.exe) or any process making external network connections (via Zeek conn.log correlation). Use time series analysis to detect anomalous spikes in process counts or network connections post-reboot compared to normal boot cycles."
          },
          {
            "description": "A correlated sequence of events indicating a setup for Safe Mode boot, followed by a system reboot, and subsequent anomalous activity.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4657",
              "Windows Event ID 1074"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a high-fidelity correlation rule that triggers on a sequence of events within a defined time window (e.g., 15 minutes). The sequence is: 1) A boot configuration modification via bcdedit.exe (Event ID 4688) or a direct registry write to SafeBoot keys (Event ID 4657). 2) A system shutdown or reboot event initiated by a user process (Event ID 1074) shortly thereafter. Investigate the context of any such sequence, and correlate with post-reboot behavioral detections to confirm malicious activity."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]