[
  {
    "information_requirement": "Is the adversary attempting to hide their activity to evade detection?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564",
        "name": "Hide Artifacts",
        "evidence": [
          {
            "description": "Execution of known malicious tools used for artifact hiding, or creation of hidden artifacts with names that are specific indicators of a known threat actor or malware family.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor process creation events (Windows Event ID 4688) for process names matching a maintained list of known hacking tools used for hiding artifacts (e.g., specific rootkit installers, timestomping utilities). Additionally, monitor file creation/access events (Windows Event ID 4663) for files or directories with names that are highly specific indicators of compromise for known malware families or threat actors. This action relies on a string-matching approach against a threat intelligence-backed list of selectors."
          },
          {
            "description": "Use of built-in system utilities with specific command-line argument patterns to hide files, directories, Alternate Data Streams (ADS), or modify permissions to obscure artifacts.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze command-line arguments in Windows Event ID 4688 for known patterns used for hiding artifacts. This includes commands like 'attrib.exe +h +s', 'icacls.exe ... /deny', or the use of 'type.exe ... > file:stream', 'powershell.exe ... -stream', or 'makecab.exe' to create Alternate Data Streams or archives in unusual locations. Use regular expression matching to detect these specific command patterns, especially when executed by non-standard users or parent processes."
          },
          {
            "description": "'Timestomping' activity where file metadata timestamps are modified to match legitimate system files, evading timeline-based analysis.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for processes known to perform timestomping by analyzing process creation events and their command lines (Windows Event ID 4688), especially PowerShell using 'Set-ItemProperty'. Monitor file modification events (Windows Event ID 4663) and establish baselines for file modification patterns in critical directories (e.g., System32). Use statistical analysis to flag files whose timestamps are modified to be unusually old or to exactly match those of adjacent, legitimate system files, particularly if this occurs shortly after the file's creation. Correlate this activity with the process that performed the modification."
          },
          {
            "description": "Creation and execution of processes from non-standard, hidden, or suspicious file system locations (e.g., recycle bin, temporary directories, Alternate Data Streams) followed by suspicious downstream activity like network connections.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate process creation events (Windows Event ID 4688) where the process path is abnormal (e.g., %TEMP%, C:\\Users\\Public\\, Recycle Bin, a dot-prefixed directory, or contains ':'), with subsequent outbound network connections from the same process (via Windows Event ID 5156 or correlated with Zeek conn.log based on source IP/port and timestamp). Use frequency analysis on execution paths to identify rare or first-seen locations. A time series correlation can link the suspicious execution with the resulting network traffic to create a high-fidelity alert."
          },
          {
            "description": "Creation of user accounts or scheduled tasks with names exhibiting high entropy or masquerading as legitimate system entities to evade administrative review.",
            "data_sources": [
              "Windows Event ID 4720",
              "Windows Event ID 4698"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish a baseline of normal naming conventions for user accounts and scheduled tasks. Monitor user account creation (Windows Event ID 4720) and scheduled task creation (Windows Event ID 4698) events. Apply statistical analysis to identify names that are outliers based on length, character set, or similarity to known system names (e.g., using Levenshtein distance against a list of common system accounts). Calculate the entropy of new account/task names to detect randomly generated strings. Flag accounts or tasks with names like 'admin ' (with trailing space) or 'svch0st' (with a zero) and investigate their purpose."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]