[
  {
    "information_requirement": "Is the adversary attempting to impact system availability by wiping disk structures?",
    "tactic_id": "TA0040",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1561.002",
        "name": "Disk Structure Wipe",
        "evidence": [
          {
            "description": "Detection of known disk-wiping malware components by executable name, command-line arguments, or associated service names on endpoints or servers.",
            "data_sources": [
              "Windows Event ID 4688 (Process Creation)",
              "Windows Event ID 7045 (Service Installation)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 for execution of processes with names or command-line arguments matching known disk-wiping tools (e.g., components of Shamoon, StoneDrill, NotPetya). Monitor Windows Event ID 7045 for installation of services with names associated with such malware. Maintain and regularly update a list of these indicators (filenames, argument patterns, service names) from cyber threat intelligence (CTI) feeds. Correlate detections with subsequent suspicious disk activity or system crashes. Use descriptive statistics on process/service names to identify rare occurrences matching known wiper families."
          },
          {
            "description": "Processes performing direct raw write access to physical disk structures (e.g., Master Boot Record, Volume Boot Record, partition table) using specific system calls or `\\\\.\\PhysicalDriveX` notation.",
            "data_sources": [
              "Windows Event ID 4663 (Object Access)",
              "Windows Event ID 4656 (Handle Requested)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Enable and monitor Security Audit Control Lists (SACLs) on critical disk objects (e.g., `\\\\.\\PhysicalDrive0`, `\\\\.\\PhysicalDrive1`, etc.) to generate Windows Event ID 4663 for write attempts (specifically WriteData or AppendData access masks). Also, monitor Windows Event ID 4656 for handles requested to these objects with write permissions. Profile normal system processes that might legitimately access these objects during specific maintenance windows (e.g., disk partitioning tools, backup software). Alert on any unauthorized or unexpected processes (especially non-system, user-level processes, or newly observed processes) attempting such access. Use frequency analysis of processes accessing these objects to detect anomalies."
          },
          {
            "description": "Execution of file system format commands (e.g., 'format', 'erase filesystem') on network devices identified through device command logging.",
            "data_sources": [
              "Network Device AAA Logs"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Network Device AAA logs (or equivalent command audit logs from network infrastructure) for command execution events. Filter for commands such as 'format', 'erase filesystem', 'write erase', or vendor-specific equivalents that target storage media or boot structures. Correlate these commands with user authentication details, source IP address, and time of execution. Alert on execution by non-administrative accounts, during unexpected hours, or if commands deviate from documented change management processes. Use frequency analysis of these commands per user/device to detect unusual occurrences."
          },
          {
            "description": "Anomalous installation or loading of unsigned or suspicious kernel-mode drivers, particularly those with capabilities for low-level disk access or system modification, immediately preceding system instability or unbootable states.",
            "data_sources": [
              "Windows Event ID 7045 (New Service Created)",
              "Windows Event ID 6008 (Unexpected Shutdown)",
              "Windows Event ID 5038 (Code Integrity determined image file is not signed)",
              "Windows Event ID 7000 (Service Control Manager - Service failed to start)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 7045 for new service installations, paying close attention to kernel-mode drivers. Correlate these events with Windows Event ID 5038, which indicates if loaded image files (like drivers) are unsigned. Investigate drivers with generic names, names mimicking legitimate software but with different paths/signatures, or those from unknown vendors. Use time series analysis to establish a baseline of normal driver installation frequency and flag significant deviations. Correlate suspicious driver activity with subsequent unexpected system shutdowns (Event ID 6008) or service failures (Event ID 7000) that could indicate system corruption."
          },
          {
            "description": "Multiple critical system files related to the boot process (e.g., bootmgr, NTLDR, winload.exe, BCD store) being modified or deleted simultaneously or in rapid succession by a non-standard or unauthorized process.",
            "data_sources": [
              "Windows Event ID 4663 (Object Access - Delete/Write)",
              "Windows Event ID 4688 (Process Creation)"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Configure SACLs on critical boot files and directories (e.g., C:\\Boot\\BCD, C:\\Windows\\System32\\winload.exe, C:\\bootmgr, C:\\NTLDR for older systems) to log access attempts (Windows Event ID 4663, focusing on DELETE, WRITE_DAC, or WRITE_OWNER access masks). Monitor for a high frequency of these events originating from a single process (identified via process information in Event ID 4663 or by correlating with Event ID 4688). Establish a baseline of processes that normally interact with these files (e.g., Windows Update, system recovery tools). Alert on modifications or deletions by unexpected, non-system, or newly observed processes. Use correlation analysis to link bursts of such activity across multiple hosts, which may indicate a coordinated attack."
          },
          {
            "description": "Rapid succession of failed remote authentication attempts followed by a successful login and subsequent execution of suspicious commands or file transfers to multiple systems, indicative of wiper malware propagation activities prior to impact.",
            "data_sources": [
              "Windows Event ID 4625 (Logon Failure)",
              "Windows Event ID 4624 (Logon Success)",
              "Windows Event ID 4688 (Process Creation)",
              "Zeek conn.log",
              "Zeek smb_files.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor for patterns of lateral movement potentially associated with wiper propagation: clusters of failed logins (Windows Event ID 4625) across multiple target hosts originating from a common internal source, followed by a successful login (Windows Event ID 4624). Correlate this with subsequent process creation (Windows Event ID 4688) on target hosts involving known remote execution tools (e.g., PsExec, PowerShell Remoting, WMI commands like 'wmic process call create') or scripts. Monitor Zeek conn.log for unusual SMB/RPC connections and Zeek smb_files.log for transfer of executables or scripts to multiple hosts. Use time series analysis on the frequency of such lateral movement patterns. A sudden organization-wide spike could precede widespread impact events."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]