[
  {
    "information_requirement": "Is the adversary communicating with command and control infrastructure using fast flux DNS?",
    "tactic_id": "TA0011",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1568.001",
        "name": "Fast Flux DNS",
        "evidence": [
          {
            "description": "DNS queries for domains or connections to IPs known to be associated with fast flux C2 infrastructure.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate the 'query' field from Zeek dns.log and destination IPs ('id.resp_h') from Zeek conn.log against a high-confidence, frequently updated (e.g., hourly) cyber threat intelligence (CTI) feed of domains and IPs known to be part of fast flux networks. Generate an alert for any match and immediately investigate the querying host for signs of compromise."
          },
          {
            "description": "DNS queries for domains that exhibit characteristics of being algorithmically generated (DGA) and are also hosted on infrastructure patterns typical of fast flux (e.g., geographically disparate, residential IPs).",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze the 'query' field in Zeek dns.log to calculate metrics like character entropy, n-gram frequency, and ratio of numbers to letters to identify potential DGA domains. For domains flagged as DGA-like, enrich the resolved IPs by geolocating them and identifying their Autonomous System Numbers (ASNs). Use correlation analysis to flag domains that are both DGA-like and resolve to IPs across an unusually high number of countries or a high percentage of residential/non-business ASNs, a common pattern for botnet-based fast flux."
          },
          {
            "description": "A single domain name resolving to a high number of distinct IP addresses within a short time frame, often coupled with very low Time-To-Live (TTL) values.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek dns.log. For each unique domain ('query'), track the set and count of resolved IP addresses ('answers') and the minimum/average TTL over sliding time windows (e.g., 5-60 minutes). Use descriptive statistics to establish a network-wide baseline for IP turnover rate and TTL values. Use statistical thresholds (e.g., >10 unique IPs in 30 minutes with an average TTL < 300s) to flag domains exhibiting single fast flux behavior. A box-plot of unique IPs per domain can reveal outliers."
          },
          {
            "description": "A domain's authoritative Name Server (NS) records changing frequently, indicating double flux DNS where the authoritative servers themselves are a fluxing network.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Specifically monitor Zeek dns.log for DNS responses containing NS records. For each queried domain, track the set of its authoritative name servers over time. Identify domains where the list of associated name servers changes rapidly or contains a high number of different servers, especially if those NS records also have very low TTLs. This indicates a more resilient, multi-layered fast flux network that requires priority investigation."
          },
          {
            "description": "An internal host making an unusually high number of DNS queries for a single domain and subsequently attempting connections to the diverse set of IPs resolved from that domain.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate Zeek dns.log and Zeek conn.log. First, identify internal hosts ('id.orig_h') with abnormally high DNS query rates for a specific external domain using frequency analysis and Z-score calculations against a historical baseline for that host. For these flagged host-domain pairs, verify if the host is also attempting connections (Zeek conn.log) to the multiple, changing IPs resolved from the domain. Use a linear regression model to test the correlation between the number of unique IPs resolved and the number of unique IPs connected to by the host for that domain. A strong positive correlation provides high-confidence evidence of active C2 communication via fast flux."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]