[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by reverting cloud instances?",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1578.004",
        "name": "Revert Cloud Instance",
        "evidence": [
          {
            "description": "Detection of specific command-line parameters or process names associated with known tools or scripts used to interact with cloud provider APIs from within an instance to trigger snapshot operations or modify storage configurations, preceding a system restart.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for execution of processes (e.g., `aws.exe`, `gcloud.cmd`, `az.cmd`, `powershell.exe`) with command-line arguments indicative of snapshot creation, restoration, storage modification, or instance reset (e.g., 'Restore-AzVM', 'ec2 restore-snapshot', 'gcloud compute instances reset', 'Import-Snapshot', 'CreateSnapshot'). Maintain and regularly update a list of such sensitive commands, tools, and associated keywords. Correlate positive detections of these command executions with subsequent system shutdown/restart events (Windows Event IDs 1074, 6005, 6006) occurring within a short timeframe (e.g., 5-30 minutes) on the same host."
          },
          {
            "description": "Network connections from the instance to known cloud provider metadata services or specific instance management API endpoints (outside of normal operational patterns) immediately preceding an unexpected host shutdown or loss of network connectivity.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 1074",
              "Windows Event ID 6005",
              "Windows Event ID 6006"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify and baseline normal communications patterns (frequency, volume, destination ports/paths) between instances and cloud provider metadata services (e.g., 169.254.169.254) or known instance management API FQDNs/IPs. Monitor Zeek conn.log for unusual or high-volume connections to these services, or connections to specific API endpoints explicitly related to instance state/snapshot management, that occur shortly before unexpected system shutdown/restart events (Windows Event IDs 1074, 6005, 6006) or abrupt loss of all external network connectivity for the host. Use correlation analysis with a defined time window (e.g., 1-10 minutes before shutdown) and flag deviations using descriptive statistics on connection counts or data volume to these specific services."
          },
          {
            "description": "Discrepancy where suspicious network activity (e.g., C2, data exfiltration) is observed in network logs (Zeek) for a host, followed by an unexpected host restart, after which corresponding host-based logs (Windows Event Logs) for the period of malicious activity are missing or incomplete.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 1074",
              "Windows Event ID 6005",
              "Windows Event ID 6006",
              "Windows Event ID 4688",
              "Other relevant Windows Event IDs (e.g.",
              "Security 4624",
              "System 7045)"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate suspicious network patterns (e.g., command and control traffic signatures, large outbound data transfers to untrusted destinations, connections to known malicious IPs identified in Zeek conn.log) with specific host IP addresses. Monitor these hosts for subsequent unexpected shutdown/restart events (Windows Event IDs 1074, 6005, 6006). After the host is confirmed back online, systematically attempt to retrieve and analyze detailed Windows Event Logs (e.g., process creation Event ID 4688, login events, service creation events, security event logs, application logs) that should correspond to the timeframe of the suspicious network activity. A significant lack of detailed host logs, or clear truncation of logs, despite strong network evidence of malicious activity during that period, is a strong indicator of a revert or targeted log wiping. Utilize time series alignment of Zeek log timestamps against available host log timestamps to pinpoint gaps and calculate the percentage of missing expected logs."
          },
          {
            "description": "Significant backward system time change (Windows Event ID 4616) on a host, coinciding with or immediately followed by system restart events, strongly indicating restoration from an older snapshot.",
            "data_sources": [
              "Windows Event ID 4616",
              "Windows Event ID 1074",
              "Windows Event ID 6005",
              "Windows Event ID 6006"
            ],
            "data_platforms": [
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4616 ('System time was changed') on all critical servers. Correlate occurrences of this event, especially those indicating a backward time jump, with nearly simultaneous or immediately subsequent system restart/shutdown events (Windows Event IDs 1074, 6005, 6006). Analyze the 'PreviousTime' and 'NewTime' fields in Event ID 4616 logs. Flag instances where 'NewTime' is significantly earlier than 'PreviousTime' (e.g., backward jump > 5 minutes, configurable threshold to avoid minor NTP sync noise). Use descriptive statistics (e.g., calculating the distribution of time change deltas using box-plots) to identify outliers representing substantial backward time shifts. Such events are highly indicative of a snapshot revert."
          },
          {
            "description": "Anomalous system shutdown/restart or abrupt network disconnection of a host occurring shortly after other confirmed suspicious activities or security alerts on that host, suggesting an attempt to remove evidence via instance revert.",
            "data_sources": [
              "Windows Event ID 1074",
              "Windows Event ID 6005",
              "Windows Event ID 6006",
              "Zeek conn.log",
              "Security alert system logs (e.g.",
              "EDR",
              "IDS)"
            ],
            "data_platforms": [
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate security alerts (from EDR, IDS/IPS, AV, or other detection systems) or indicators of suspicious activity previously identified on a host (e.g., unusual process execution via Event ID 4688, confirmed malicious network connections via Zeek conn.log) with subsequent unexpected system shutdown/restart events (Windows Event IDs 1074, 6005, 6006) or abrupt termination of all network connections from that host (observed in Zeek conn.log via sudden drop in active sessions count and duration). Establish baselines for normal restart frequency and connection stability per host or host group. Use time series analysis and temporal correlation with a defined window (e.g., suspicious activity followed by restart within 1 hour) to flag these sequences. Calculate a risk score based on the severity of prior alerts and the anomaly level of the restart/disconnection using a regression model or heuristic scoring."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]