[
  {
    "information_requirement": "Is the adversary developing resources (e.g., botnets) for future attacks against our organization?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583.005",
        "name": "Botnet",
        "evidence": [
          {
            "description": "Inbound connections originating from IP addresses or outbound connections destined for IPs/domains identified on high-confidence threat intelligence feeds as known botnet members or C2 infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate source IPs of all inbound traffic (Zeek conn.log) and destination IPs/domains of all outbound traffic (Zeek conn.log, Zeek dns.log) against a CTI feed of known botnet C2 nodes, proxies, and infected clients, updated at least hourly. Alert on any matches and investigate the associated internal host for outbound connections or the targeted service for inbound connections."
          },
          {
            "description": "Network traffic containing artifacts specific to known botnet families, such as unique User-Agent strings, distinctive C2 protocol patterns, or specific SSL/TLS fingerprints (JA3/JARM hashes).",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for User-Agent strings associated with known botnet malware (e.g., Emotet, TrickBot, Qakbot). Analyze Zeek ssl.log to identify and alert on JA3, JA3S, or JARM hashes matching those used by known botnet C2 frameworks. For non-HTTP/S traffic, apply protocol-specific parsers or regular expression matching on Zeek conn.log payloads (if available and decryptable) to find known botnet command structures or heartbeat messages."
          },
          {
            "description": "An unusually high volume of distributed, low-and-slow connection attempts or scans from a large, geographically diverse set of source IPs, characteristic of a botnet performing reconnaissance or a DDoS attack.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek scan.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log and scan.log for inbound traffic patterns on internet-facing services. Use statistical analysis to detect distributed attacks by identifying a high entropy of source IPs targeting a single or few destination hosts/ports over a given time window. Use time series analysis to detect sudden surges in connection volume from a large number of disparate sources. Correlate with connection state information (e.g., high ratio of 'S0' or 'REJ' states in Zeek conn.log) to differentiate between reconnaissance scanning and denial-of-service attacks."
          },
          {
            "description": "An internal host exhibiting behavior consistent with being a bot, such as initiating connections to an abnormally high number of external hosts, sending spam, or participating in external scans.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for internal hosts exhibiting anomalous outbound connection patterns. Use descriptive statistics and outlier detection (e.g., IQR, box-plots) on the count of unique destination IPs, destination ports, or total connections per internal host over a time window (e.g., one hour). Calculate the entropy of destination IPs or ports per host to identify scanning behavior. Correlate hosts with high outlier scores to specific processes using Windows Event ID 5156 (Network Connection Permitted/Blocked) to pinpoint the responsible application."
          },
          {
            "description": "A compromised internal host communicating with a potential C2 server using heartbeat-like beaconing patterns or receiving commands on non-standard ports.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log for periodic, fixed-interval outbound connections (beaconing) from internal hosts to single external destinations. Use time series analysis on connection logs grouped by internal source and external destination to identify regularity in time deltas between connections and consistency in data packet sizes. Additionally, monitor for inbound connections to internal workstations on high or non-standard ports from external sources, which may indicate a bot receiving commands from a C2 server."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]