[
  {
    "information_requirement": "Is the adversary developing resources using compromised third-party network devices?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1584.008",
        "name": "Network Devices",
        "evidence": [
          {
            "description": "Observed network connections (inbound or outbound) with external IP addresses identified in threat intelligence as compromised network devices (e.g., SOHO routers, edge devices) currently active in malicious campaigns.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously ingest and correlate Zeek conn.log data (source IP, destination IP, port, protocol) against a high-confidence, frequently updated threat intelligence feed specifically listing IPs of compromised network devices (e.g., SOHO routers, IoT devices) known to be part of botnets, C2 infrastructure, or payload hosting. Alert immediately on any matched connection. Investigate the nature and context of the connection (e.g., duration, data volume, internal host involved)."
          },
          {
            "description": "Detection of network traffic patterns, specific C2 signatures (e.g., JA3/JA3S hashes, SNI values, User-Agents), or payload characteristics (e.g., file types, known malicious script patterns) associated with common SOHO router malware or adversary frameworks known to leverage compromised network devices.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Zeek files.log",
              "Windows Event ID 4688",
              "Windows Event ID 1116",
              "Windows Event ID 1117"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for specific User-Agents, URI patterns, or server headers associated with compromised router administration panels or known malware C2 panels. Analyze Zeek ssl.log for JA3/JA3S hashes or SNI values linked to known C2 frameworks that utilize compromised network devices. Inspect Zeek files.log for downloads of file types (e.g., .sh, .bin, .elf for routers, or executables for endpoints) or content matching signatures of malware. Correlate downloads to internal Windows endpoints with subsequent Windows Event ID 4688 (Process Creation) for suspicious processes launched from these files, and Windows Event IDs 1116/1117 (Defender/AV detections). Use regular expression matching and maintained lists of these patterns."
          },
          {
            "description": "Anomalous or sustained outbound connections from internal systems to external IP addresses geolocated to residential ISPs or dynamic IP ranges, exhibiting characteristics of C2 communication or data staging (e.g., regular small beacons, large unexpected uploads, non-standard ports for HTTP/S traffic).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish baselines for normal outbound traffic patterns from internal systems to external residential/dynamic IP ranges. Monitor Zeek conn.log for connections to these ranges showing: 1. Regular, heartbeat-like connections (fixed intervals, small data volume per connection). 2. Unusually large or frequent data uploads not aligning with known user activities. 3. Use of common service ports (e.g., 80, 443) but with non-HTTP/TLS traffic identified by Zeek, or consistent use of custom high ports. Geolocate destination IPs to confirm residential/dynamic status. Use time series analysis (e.g., ARIMA, moving averages) to detect deviations in connection frequency or volume. Calculate entropy of destination ports for internal hosts; unusually low entropy to such IPs might indicate tunneling activity."
          },
          {
            "description": "Multiple internal systems unexpectedly receiving connections or targeted scanning from a single external IP address associated with consumer-grade network devices (e.g., SOHO router IP space), especially if followed by exploit attempts or delivery of suspicious content.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek scan.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify external IP ranges commonly associated with SOHO routers or consumer ISPs using IP geolocation and ASN data. Monitor Zeek conn.log and scan.log for inbound connections or scanning activity (e.g., port scans, vulnerability probing) from these IP ranges targeting multiple internal hosts or unusual internal services. Correlate such activity with subsequent Zeek http.log entries showing delivery of suspicious files (e.g., executables, scripts) or HTTP requests matching exploit patterns from the same source IP. Use statistical analysis (e.g., calculating the number of distinct internal targets per external SOHO IP, rate of connection attempts) to flag suspicious sources. Use Inter-Quartile Range (IQR) or percentile analysis on the count of targeted internal systems per external IP to identify anomalous aggressive sources."
          },
          {
            "description": "Internal systems exhibiting traffic patterns indicative of using an external, potentially compromised network device as a proxy or relay for malicious activities, such as connecting to multiple disparate external services through a single external intermediary or unusual tunneling behavior.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor internal hosts making a high volume or diverse set of connections to a limited number of external IP addresses (potential proxies). Correlate this with Zeek dns.log lookups by the same internal host to diverse, unrelated domains just prior to or concurrent with traffic to these external IPs. Analyze Zeek conn.log for traffic characteristics such as long-lived connections with encrypted data flows, or traffic on non-standard ports that is then relayed. Use graph analysis or correlation analysis to identify internal hosts whose connections to various external services consistently route through a small set of intermediary external IPs, especially if those IPs are in residential/dynamic ranges. Calculate entropy of final destination services/IPs for sessions passing through suspected proxy IPs if further inspection is possible."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]