[
  {
    "information_requirement": "Is the adversary developing resources (acquiring infrastructure) for targeting?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1583",
        "name": "Acquire Infrastructure",
        "evidence": [
          {
            "description": "Network connections (inbound or outbound) involving IP addresses, domains, or SSL/TLS certificate hashes identified in threat intelligence feeds as newly acquired or actively used adversary infrastructure, including known C2 servers, proxy services, or bulletproof hosting.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously correlate Zeek conn.log (source/destination IPs), Zeek dns.log (queried domains), and Zeek ssl.log/x509.log (observed certificate SHA1 hashes, subject/issuer details) against high-confidence, frequently updated cyber threat intelligence (CTI) feeds. These feeds should specifically list adversary-acquired infrastructure (e.g., newly registered malicious domains, IPs of known C2 frameworks, bulletproof hosting providers, known malicious proxy services, or residential proxy IPs). Alert on any matches and investigate associated activity, prioritizing matches involving critical assets or unusual internal sources."
          },
          {
            "description": "Identification of network traffic to or from external systems exhibiting characteristics of known C2 frameworks or adversary malware, such as specific SSL/TLS negotiation fingerprints (JA3/JA3S), self-signed certificates with common adversary-tool default values, or connections to ports/services commonly used by specific malware families for C2.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek ssl.log for specific JA3 client hashes or JA3S server hashes known to be associated with adversary C2 tools or malware. Analyze Zeek x509.log for self-signed certificates or certificates where issuer/subject fields match default values of known adversary tools/frameworks, especially if the certificate's `not_valid_before` date is recent. Correlate these findings with Zeek conn.log to identify connections to non-standard ports or services known to be utilized by specific malware for C2 communications. Maintain and regularly update a library of these C2 patterns, fingerprints, and default certificate values. Use frequency analysis to spot recurring patterns from external IPs."
          },
          {
            "description": "Anomalous or high-volume internal connections to newly registered domains (NRDs) or domains hosted on recently provisioned IP addresses, especially those exhibiting unusual traffic characteristics or associated with privacy-protected registration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Integrate WHOIS lookup services or specialized NRD feeds to determine domain registration dates and IP address provisioning history. Analyze Zeek dns.log and Zeek conn.log for internal systems connecting to domains registered within a defined recent period (e.g., last 7-90 days) or IP addresses activated recently. Calculate baseline connection frequencies and data volumes for NRDs across the organization. Flag domains with a sudden surge in internal connections from multiple distinct hosts, unusually high data transfer volumes, or connections originating from sensitive internal systems. Use descriptive statistics (e.g., mean, median, standard deviation) and outlier detection methods (e.g., Inter-Quartile Range, percentile-based thresholds) on connection counts/volume to NRDs. Increase alert severity for NRDs with privacy-protected WHOIS information or hosted by registrars known for malicious registrations."
          },
          {
            "description": "Outbound network connections from internal systems to external IP addresses exhibiting a combination of suspicious characteristics such as unusual port usage, high connection entropy, non-standard SSL/TLS configurations (e.g., very new certificates not yet broadly trusted), or data transfer patterns indicative of C2 activity, especially if directed towards cloud provider IP ranges not typically used by the organization.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek x509.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for outbound connections from internal hosts to external IPs using unusual destination ports or exhibiting high destination port entropy (many different ports from one source to one destination IP). Analyze Zeek ssl.log and Zeek x509.log for outbound connections using very new certificates (e.g., `not_valid_before` within the last 1-7 days), certificates with unusually short validity periods, or certificates issued by uncommon Certificate Authorities, especially when connecting to IP addresses within cloud provider ranges not whitelisted for corporate use. Profile typical outbound data transfer sizes and session durations per user/host/service; flag significant deviations or periodic, small 'heartbeat' like transfers using time series analysis. Correlate suspicious network flows (Zeek data) with initiating processes (Windows Event ID 4688 for process creation, Windows Event ID 5156 for network connection filtering platform) on endpoints/servers to identify the source application and its command line arguments."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]