[
  {
    "information_requirement": "Is the adversary developing resources related to digital certificates?",
    "tactic_id": "TA0042",
    "tactic_name": "Resource Development",
    "indicators": [
      {
        "technique_id": "T1588.004",
        "name": "Digital Certificates",
        "evidence": [
          {
            "description": "Observed network traffic utilizing SSL/TLS certificates with known malicious indicators, such as specific thumbprints, serial numbers, or subject/issuer details matching CTI feeds for adversary-owned or compromised certificates.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Continuously monitor Zeek ssl.log for all observed SSL/TLS certificates. Extract certificate thumbprints, serial numbers, subject common names (CN), issuer distinguished names (DN), and Subject Alternative Names (SANs). Correlate these atomic indicators against a high-fidelity cyber threat intelligence (CTI) feed specifically tracking known malicious or compromised certificates (e.g., from threat actor campaigns, malware C2 infrastructure). Alert on any direct matches and investigate associated connections in Zeek conn.log for further malicious activity."
          },
          {
            "description": "Detection of SSL/TLS certificates whose subject names or Subject Alternative Names (SANs) exhibit patterns commonly associated with malicious activity, such as typosquatting, homoglyphs of legitimate domains, or use of dynamic DNS FQDNs in certificates from free Certificate Authorities.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze certificate subject CN and SAN fields from Zeek ssl.log. Implement automated checks for: 1. Typosquatting or homoglyph patterns against a list of monitored corporate or high-value domains (e.g., using Levenshtein distance calculation or visual similarity algorithms). 2. Certificates issued by free Certificate Authorities (e.g., Let's Encrypt, ZeroSSL) for domains that are also dynamic DNS FQDNs (e.g., *.ddns.net, *.no-ip.com, *.duckdns.org). 3. Certificates with subject names containing suspicious keywords frequently used in phishing or C2 infrastructure (e.g., 'login', 'admin', 'update', 'support', combined with misspellings of your organization's name). Use regular expressions and correlate findings with domain age/reputation data. Flag suspicious certificates and associated Zeek conn.log traffic for priority review."
          },
          {
            "description": "Anomalous SSL/TLS certificate characteristics observed in network traffic, such as extremely short validity periods, issuance by rarely seen or non-standard Certificate Authorities, or certificates for domains with very recent registration dates, especially if combined with low traffic volume or unusual port usage.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek ssl.log to extract certificate issuance dates, validity periods, issuer details, and subject domain names. Establish baselines for common certificate issuers, typical validity durations, and average domain age for certificates observed in your environment. Alert on certificates that exhibit: 1. Unusually short validity periods (e.g., less than 30 days, particularly from non-free CAs, which may indicate temporary use). 2. Issuance by CAs not commonly observed in legitimate traffic or not part of standard public trust stores. 3. Subject domains registered very recently (e.g., within the last 7-30 days, by correlating with WHOIS data). 4. Certificates whose subject domains have extremely low global prevalence or are primarily associated with connections to/from your network only. Use descriptive statistics (frequency counts, percentile analysis for validity periods/domain age) and inter-quartile range (IQR) to identify outliers. Investigate associated Zeek conn.log traffic, paying attention to destination ports and overall connection volume."
          },
          {
            "description": "Increased or unusual prevalence of self-signed certificates, certificates with validation errors (e.g., expired, revoked, name mismatch), or certificates issued by unexpected internal CAs for external communications or to sensitive internal systems.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Windows Event ID CAPI2 11",
              "21",
              "30",
              "41",
              "53"
            ],
            "data_platforms": [
              "Network devices",
              "Servers",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor the `validation_status` field in Zeek ssl.log. Track the frequency and context of: 1. Self-signed certificates used in external communications or for internal servers not expected to use them. 2. Certificates generating validation errors (e.g., expired, revoked, CN mismatch, untrusted root). 3. Certificates issued by internal CAs being presented by external entities or internal systems where this is not standard configuration. Use time series analysis to detect sudden increases or unusual patterns in such certificate usage. Establish baselines for expected self-signed/invalid certificate usage on specific internal services. Correlate with Zeek conn.log data. For deeper investigation on affected hosts, consider examining Windows CAPI2 operational event logs (Event IDs 11, 21, 30, 41, 53) for unusual certificate installation, trust modification, or chain validation failures that might correlate with the network observations."
          },
          {
            "description": "Clustering of multiple suspicious SSL/TLS certificates (e.g., utilizing recently registered domains, issued by free CAs, exhibiting similar subject patterns) resolving to the same IP address or a small set of related IP addresses, or the reuse of a single suspicious certificate across unrelated services or domains.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "From Zeek ssl.log and x509.log, extract certificate details (subject, issuer, thumbprint, SANs) and the associated server IP address from Zeek conn.log. Identify IP addresses that serve multiple distinct certificates, where these certificates individually possess suspicious traits (e.g., issued by free CAs, for recently registered domains, using unusual TLDs). Employ graph analysis or clustering algorithms (e.g., k-means on feature vectors derived from certificate attributes like issuer, subject keywords, and SAN count) to discover groups of interconnected suspicious certificates and their hosting infrastructure. Additionally, track individual certificate thumbprints; if a specific suspicious certificate is observed being used by multiple, seemingly unrelated external services or domains, it may indicate adversary-controlled infrastructure reusing a developed or stolen certificate. Correlate findings to build a broader picture of potentially related adversary infrastructure."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]