[
  {
    "information_requirement": "Is the adversary conducting reconnaissance against the organization?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1596.002",
        "name": "WHOIS",
        "evidence": [
          {
            "description": "Internal system connecting to WHOIS services (port 43 or known web WHOIS lookup sites) that are identified on threat intelligence feeds as malicious or commonly abused by threat actors.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for outbound connections to TCP port 43 and Zeek http.log for connections to web-based WHOIS services. Correlate destination IP addresses and domain names (resolved via Zeek dns.log if necessary for HTTP traffic, or directly from WHOIS server IPs for port 43) against a continuously updated Cyber Threat Intelligence (CTI) feed of known malicious WHOIS lookup services or infrastructure commonly abused for reconnaissance activities. Alert on any matches and investigate the source internal system."
          },
          {
            "description": "Outbound HTTP/HTTPS connections to WHOIS lookup websites exhibiting User-Agent strings associated with known reconnaissance tools or scripts, or specific query URL patterns indicative of automated WHOIS enumeration.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek http.log for connections to known WHOIS lookup websites (identified via a maintained list or DNS queries). Inspect HTTP User-Agent strings for matches against a list of those used by known reconnaissance tools (e.g., specific versions of curl, Python libraries commonly used in scripts, or commercial recon tools). For HTTPS, examine SNI in Zeek ssl.log to identify connections to such sites. Look for URL query patterns in Zeek http.log that suggest automated enumeration (e.g., rapid, sequential queries for variations of a target domain, or queries with parameters typical of scripting tools). Use regular expression matching and maintain an updated list of such patterns and User-Agents. Calculate entropy of queried domains from a single internal source over a short time window; high entropy may indicate broad, scripted lookups."
          },
          {
            "description": "An internal system exhibiting an anomalous volume or frequency of WHOIS queries (direct port 43 or via web services) compared to its own baseline or peer systems, or querying for domains unrelated to its normal function.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Establish baselines for WHOIS query activity (volume, frequency, diversity of queried domains, query times) per internal system or user group using historical Zeek conn.log (for port 43 traffic) and Zeek http.log (for web-based WHOIS sites, identified via Zeek dns.log or a curated list). Use time series analysis (e.g., ARIMA, moving averages with standard deviation bands) or descriptive statistics (e.g., mean, median, IQR, percentiles) to detect significant deviations from these baselines. Flag internal systems making unusually high numbers of queries, querying at atypical hours, or querying domains inconsistent with their established operational role (e.g., a finance department workstation querying numerous external infrastructure domains). Utilize box-plots for peer group analysis to identify outliers in query volumes or frequency."
          },
          {
            "description": "Internal systems observed making WHOIS queries (via port 43 or web) for domains or IP ranges highly specific to the organization's own infrastructure, sensitive partner infrastructure, or newly registered domains related to the organization (typosquatting detection).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor WHOIS queries (Zeek conn.log for port 43, Zeek http.log for web lookups – identifying queried domains from Referer headers, URL parameters, or HTTP POST bodies if available) for the organization's own domains, known sensitive IP ranges, domains of key business partners, or recently registered domains that are permutations/typosquats of the organization's domains. Maintain an actively updated list of these sensitive assets and potential typosquats. Use correlation analysis to flag when such queries originate from internal systems not authorized or expected to perform such lookups (e.g., non-security or non-network admin workstations). Analyze query parameters in Zeek http.log for specificity. Use frequency analysis and descriptive statistics to highlight unusual interest in these sensitive assets from internal sources."
          },
          {
            "description": "A sequence of activities where an internal system performs WHOIS lookups (direct or web-based) shortly followed by other forms of network reconnaissance (e.g., DNS enumeration of discovered nameservers, port scanning of identified IP blocks) or connection attempts against targets related to the WHOIS query results.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Identify internal systems performing WHOIS lookups (via Zeek conn.log on port 43, or Zeek http.log to WHOIS websites). Correlate these events by source IP and timestamp with subsequent activities from the same source system within a defined short window (e.g., 5 minutes to 1 hour). Specifically look for: a) Follow-on DNS queries (Zeek dns.log) for MX, NS, or A records related to domains found in WHOIS, or queries to nameservers identified via WHOIS. b) Network scanning behavior (Zeek conn.log showing connections to multiple ports on a target host or multiple hosts in a target range, or Windows Event ID 5156 on the source endpoint showing numerous outbound connection attempts). c) Actual connection attempts to services on the target IPs/domains identified or inferred from WHOIS data. Use time series analysis and linear correlation to link precursor WHOIS reconnaissance to subsequent potentially malicious actions."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]