[
  {
    "information_requirement": "Is the adversary conducting reconnaissance on our network or services by gathering IP address information?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1590.005",
        "name": "IP Addresses",
        "evidence": [
          {
            "description": "Network scanning, probing, or DNS query activity targeting organizational IP address space or hostnames, originating from IP addresses listed in high-confidence threat intelligence feeds (e.g., known scanners, C2 nodes, TOR exit nodes).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Correlate source IP addresses from Zeek conn.log (for TCP/UDP scanning) and Zeek dns.log (for DNS queries) that are targeting known organizational IP ranges or domains against continuously updated cyber threat intelligence (CTI) feeds of malicious IPs, known public scanning infrastructure, or anonymization networks (e.g., TOR exit nodes). Implement a scoring system or generate alerts on high-confidence matches, prioritizing IPs with a history of reconnaissance or exploitation. Regularly update CTI feeds (e.g., hourly or daily) and use descriptive statistics to track the volume of hits from such sources over time."
          },
          {
            "description": "Interaction with external-facing services using specific User-Agent strings, tool-specific protocol sequences, or DNS query patterns known to be associated with reconnaissance tools (e.g., Nmap, Masscan, Nuclei, DNSenum).",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek http.log for User-Agent strings commonly used by reconnaissance tools (e.g., Nmap, Masscan, ZGrab, Nuclei) when interacting with web services. Analyze Zeek conn.log for specific probe sequences or connection handshakes characteristic of tools like Nmap (e.g., distinct TCP flag combinations for OS fingerprinting probes). Monitor Zeek dns.log for query patterns (e.g., AXFR query types, sequential hostname lookups like `srv01..srvN`, or high ratio of NXDOMAIN responses for a given pattern) indicative of DNS reconnaissance tools. Maintain and update a library of these tool-specific signatures and patterns using regular expressions and sequence analysis. Correlate findings to identify coordinated tool usage."
          },
          {
            "description": "Anomalous network scanning activity from external sources characterized by a high volume of connection attempts across a wide range of organizational IP addresses or ports, or a high rate of failed connections.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log for external source IPs exhibiting scanning behavior. Define thresholds for: (1) Number of distinct destination IPs within organizational ranges contacted by a single source IP in a given timeframe (e.g., 1 hour). (2) Number of distinct destination ports contacted on one or more organizational IPs by a single source. (3) Ratio of failed (REJ, RST) to successful (SF) connections from a source. Use statistical methods like Inter-Quartile Range (IQR) or percentile analysis on these metrics across all external sources to dynamically identify outliers. Time series analysis on the overall volume of scanning events can detect sudden bursts of activity targeting the organization."
          },
          {
            "description": "Targeted network probes or unusual traffic patterns from external sources directed at specific services or ports on external-facing organizational IPs, indicative of service fingerprinting or vulnerability validation.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dpd.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for external sources connecting to specific known service ports (e.g., web, mail, VPN, RDP) followed by unusual data exchange patterns (e.g., small specific payloads, quick disconnections) or protocol anomalies. Analyze Zeek dpd.log (Dynamic Protocol Detection) for mismatches between expected and observed protocols on standard ports. Review Zeek notice.log for events like `Scan::Port_Scan`, `SSL::Invalid_Server_Cert`, or protocol violation notices that can indicate fingerprinting. Use entropy measures on destination port distribution per source IP over shorter time windows to distinguish targeted probing from broad scans. Correlate these activities with known vulnerability scanner signatures or exploit attempt patterns if possible."
          },
          {
            "description": "Unusual patterns of DNS queries from external sources targeting organizational domains, such as attempts to resolve non-public hostnames, zone transfer requests (AXFR), or high-frequency lookups indicative of subdomain enumeration.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek dns.log for DNS queries originating from external IPs and targeting organizational domains. Flag and investigate: (1) Queries for hostnames matching internal naming conventions or known non-public services (e.g., `srv.internal`, `dev-db`). (2) AXFR query types. (3) A high volume of NXDOMAIN responses from a single querying IP, suggesting brute-force enumeration. (4) Queries for a large number of unique subdomains from a single source IP over a short period. Use frequency analysis and correlation analysis to identify IPs performing extensive DNS reconnaissance. Establish baselines for normal external DNS query behavior (volume, types, error rates) and use anomaly detection techniques (e.g., deviation in query volume, sudden increase in NXDOMAIN rate from specific sources using time series analysis) to spot suspicious patterns."
          },
          {
            "description": "An internal host exhibiting anomalous outbound connection patterns to numerous external IP addresses and ports, potentially indicating a compromised system being used for external reconnaissance or target validation based on previously gathered IP intelligence.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Network devices",
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Zeek conn.log for internal source IPs generating a high volume of connection attempts to diverse external IP addresses or ports, especially to non-standard ports or IPs not typically communicated with by the organization (filter for `orig_h` being internal, `resp_h` external). Baseline normal outbound traffic patterns per host or host role. Use statistical analysis (e.g., IQR or Z-scores on the count of distinct external IPs/ports contacted per internal host over a defined time window, e.g., 15 minutes) to detect significant deviations. On suspicious endpoints, correlate network activity with Windows Event ID 5156 (Filtering Platform Connection logs from Windows Firewall) to identify the application and user context responsible for the outbound connections, and Windows Event ID 4688 (Process Creation) to investigate potentially malicious processes initiating these scans. Linear regression could be used to track trends in outbound connection diversity per host over longer periods."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]