[
  {
    "information_requirement": "Is the adversary gathering information about our host hardware during reconnaissance?",
    "tactic_id": "TA0043",
    "tactic_name": "Reconnaissance",
    "indicators": [
      {
        "technique_id": "T1592.001",
        "name": "Hardware",
        "evidence": [
          {
            "description": "Network reconnaissance activity (e.g., port scanning, banner grabbing) originating from IP addresses or autonomous systems known to be malicious or associated with scanning-as-a-service platforms.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Inner join source IP addresses from Zeek conn.log and http.log with a high-confidence threat intelligence feed of known malicious IPs, scanning services (e.g., Shodan, Censys), and TOR exit nodes. Alert on connections that appear to be probing for service banners or open ports from these sources, especially when targeting multiple hosts or ports in the network."
          },
          {
            "description": "Execution of specific commands, scripts, or binaries known to be used for gathering detailed system and hardware information.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Monitor Windows Event ID 4688 (Process Creation) for the execution of reconnaissance commands and binaries. Maintain a list of such commands including `systeminfo`, `wmic computersystem get *`, `dxdiag /t`, `msinfo32 /report`, and PowerShell cmdlets like `Get-ComputerInfo` or `Get-WmiObject -Class Win32_BaseBoard`. Create alerts for executions of these commands, especially when initiated by non-standard user accounts, web servers, or via remote sessions. Use correlation analysis to link these executions to suspicious parent processes."
          },
          {
            "description": "Widespread, low-and-slow, or high-frequency network probing from an external source across multiple hosts or ports, consistent with reconnaissance scanning behavior.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Analyze Zeek conn.log to identify external source IPs initiating connections to a large number of distinct destination IPs or ports within a given timeframe (horizontal/vertical scanning). Use statistical methods like calculating the entropy of destination ports per source IP to find scanning behavior. Employ time series analysis on connection logs to detect low-frequency, periodic probing that might evade simple threshold-based alerts. Establish a baseline of normal inbound connection attempts to identify significant deviations."
          },
          {
            "description": "Anomalous queries using information-rich protocols (e.g., SNMP, NetBIOS, SMB) from external sources or from internal hosts that do not typically perform such enumeration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek smb.log",
              "Zeek dce_rpc.log"
            ],
            "data_platforms": [
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Filter Zeek logs for traffic on ports associated with information-rich protocols like SNMP (161/UDP), SMB (445/TCP), and NetBIOS (137-139/UDP/TCP) originating from external IPs. Since external queries to these services are highly anomalous, any such attempt should be investigated. For internal traffic, baseline normal protocol usage (e.g., which hosts are authorized scanners) and alert on deviations. Use descriptive statistics on connection counts to identify internal hosts receiving an unusual number of these queries."
          },
          {
            "description": "A sequence of events where local hardware information gathering is immediately followed by an outbound network connection from the same host.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "Endpoints",
              "Servers",
              "Network devices"
            ],
            "nai": "Insert site-specific NAI here",
            "action": "Create a time-based correlation rule that triggers when a hardware reconnaissance process (identified via Event ID 4688, e.g., 'systeminfo') is executed on a host, and is followed within a short window (e.g., < 60 seconds) by an outbound network connection from that same host (identified via Event ID 5156 or Zeek conn.log). Prioritize alerts where the destination IP is external, has a low reputation, or is an unusual internal destination. Use linear regression to model and detect anomalous relationships between recon command execution and outbound data volume."
          }
        ]
      }
    ],
    "version": "2.1",
    "date_created": "2025-05-04",
    "last_updated": "2025-07-20",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]