[
  {
    "information_requirement": "Is an adversary inhibiting our response function by blocking critical reporting messages? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0804",
        "name": "Block Reporting Message",
        "evidence": [
          {
            "description": "A critical process or service responsible for receiving or processing ICS telemetry data (e.g., an OPC server, HMI client) is unexpectedly terminated on a Windows-based HMI or historian, leading to a loss of visibility into the process.",
            "data_sources": [
              "Windows Event ID 4689",
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Historian Servers, OPC Servers",
            "action": "Create and maintain a watchlist of critical ICS application process names on key Windows assets. Monitor for Windows Event ID 4689 (A process has exited) where the process name is on the watchlist. For any such termination, correlate the timestamp with Zeek conn.log to verify a subsequent and sustained drop (>90%) in expected ICS protocol traffic (e.g., Modbus, DNP3) from associated PLCs/RTUs. Investigate the parent process that caused the termination by examining Windows Event ID 4688 immediately prior to the event; termination by a non-standard administrative tool (e.g., cmd.exe, powershell.exe) outside of a maintenance window is highly suspicious."
          },
          {
            "description": "A new or modified rule is added to the Windows Defender Firewall on a critical server that explicitly blocks an ICS protocol port (e.g., TCP 502 for Modbus, TCP 20000 for DNP3), preventing reporting messages from being received.",
            "data_sources": [
              "Windows Event ID 4947",
              "Windows Event ID 4950",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMIs, Historian Servers, Application Servers in the Process Control Network (PCN)",
            "action": "Continuously monitor critical Windows-based ICS assets for Windows Event ID 4947 (A rule was added to the Windows Firewall exception list) and 4950 (A setting has changed in Windows Firewall). For each alert, parse the rule details to identify if it blocks a known ICS protocol port. Establish a baseline of normal communication volume (bytes, packets) in Zeek conn.log between the asset and its associated field devices. If a firewall rule change targeting an ICS port is detected, query Zeek conn.log to confirm a corresponding drop in traffic that deviates more than three standard deviations from the established baseline."
          },
          {
            "description": "A key reporting endpoint (e.g., HMI, historian) experiences a network denial-of-service condition, characterized by an anomalous flood of network connections that prevents legitimate reporting messages from being processed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network interfaces of HMIs, Historians, and Control Servers; network segments/VLANs dedicated to process control.",
            "action": "For critical ICS endpoints, establish a statistical baseline in Zeek conn.log for the number of concurrent connections, connection duration, and data volume per protocol, calculated for 5-minute intervals. Create an alert to trigger when the number of inbound connections to the endpoint exceeds the 99th percentile of the baseline. Enrich the alert by analyzing the 'conn_state' field for the anomalous traffic; a high percentage of 'S0' (SYN sent, no reply) or 'REJ' (connection rejected) states is indicative of a flood attack. Correlate the timing of the flood with a confirmed loss of legitimate ICS protocol traffic from expected PLCs/RTUs to verify the reporting block."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]