[
  {
    "information_requirement": "Is the adversary attempting to inhibit response functions by blocking command messages? (TA0107 - Inhibit Response Function)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0803",
        "name": "Block Command Message",
        "evidence": [
          {
            "description": "A command sent from a Human-Machine Interface (HMI) is logged by the sending application, but the target Programmable Logic Controller (PLC) never receives it, coinciding with a significant, anomalous spike in network traffic on the control network segment, suggesting a network denial-of-service attack.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 1000"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control System Network Segment (between HMI/SCADA servers and PLCs/RTUs)",
            "action": "Monitor HMI application logs (represented by generic Windows Event ID 1000 for application events) for entries indicating a control command was sent. Correlate the timestamp of this event with Zeek conn.log data for the relevant source/destination IP pair. Establish a baseline of bytes and packets transmitted per minute on this network segment. Alert if a command is logged as sent but no corresponding traffic is observed or if the command coincides with total segment traffic exceeding the 99th percentile of the historical baseline, which could indicate a flood is preventing the command's delivery."
          },
          {
            "description": "A host-based firewall rule is added to an Engineering Workstation (EWS) or HMI that explicitly blocks outbound communication to a PLC's IP address over the required ICS protocol port (e.g., TCP 502 for Modbus), preventing legitimate commands from being sent.",
            "data_sources": [
              "Windows Event ID 5157",
              "Windows Event ID 4947"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs) and Engineering Workstations (EWS)",
            "action": "Continuously monitor for Windows Event ID 4947 (Firewall exception list change) and 5157 (Windows Filtering Platform blocked a connection) on critical HMI and EWS assets. Maintain a list of approved firewall rules. Trigger a high-severity alert when a new rule is added that blocks outbound traffic to known PLC or RTU IP addresses on common ICS ports. Correlate these alerts with any subsequent process alarms from the physical system that the PLC controls."
          },
          {
            "description": "An ARP entry for a critical PLC or other field controller changes unexpectedly, indicating a potential man-in-the-middle (MITM) attack where the adversary is positioned to intercept and drop command messages.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control System Network Switches and Gateways",
            "action": "Use Zeek conn.log to create and maintain a baseline mapping of IP addresses to MAC addresses for all critical ICS devices on the network. Continuously monitor for changes to this mapping. Generate an alert if the MAC address associated with a critical device's IP address changes. The action should also check for a high frequency of ARP requests or gratuitous ARPs for the same IP, which can be an indicator of an active ARP spoofing attempt."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]