[
  {
    "information_requirement": "Has an unauthorized entity accessed or queried process state data from key ICS components? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0801",
        "name": "Monitor Process State",
        "evidence": [
          {
            "description": "Unusual or excessive read requests for process data from non-standard sources, such as an IT network host querying a Data Historian or a compromised workstation making an abnormally large number of queries.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Data Historian servers, Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), network segments connecting Level 2 and Level 3 networks.",
            "action": "Analyze Zeek conn.log for connections to Data Historian servers or PLCs on common ICS ports (e.g., 502 for Modbus, 20000 for DNP3). Establish a baseline of source IPs that normally communicate with these devices. Alert on new or infrequent source IPs initiating connections, especially from IT network segments. For each connection, calculate the duration and bytes transferred. Use statistical methods (e.g., z-score, interquartile range) to flag connections with unusually high data transfer volumes, which could indicate bulk data collection from a historian. On the historian server, monitor for a high volume of 'Object Access' events (Windows Event ID 4663) against historian database files or logs originating from an unexpected user or process."
          },
          {
            "description": "A single host begins communicating with a wide variety of ICS devices (PLCs, RTUs) it has not previously interacted with, indicative of network-level reconnaissance or widespread process variable discovery.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), network gateways between control zones, PLC and controller subnets.",
            "action": "From a single source IP, monitor the number of unique destination IPs (PLCs, servers) and destination ports contacted within a short time window (e.g., 5 minutes) using Zeek conn.log and Windows Event ID 5156 (Windows Filtering Platform permitted a connection). Establish a baseline for normal EWS or HMI communication patterns. Calculate the entropy of destination IPs for each source host over time. A sudden spike in entropy or a count of unique destinations exceeding a percentile threshold (e.g., 95th percentile) for that host class indicates potential reconnaissance or widespread process data collection."
          },
          {
            "description": "An anomalous remote login to a critical ICS host (HMI, EWS) is followed by network connections to process control devices, suggesting an adversary is using the host as a pivot to monitor the process state.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), ICS Application Servers, Domain Controllers in the ICS environment.",
            "action": "Correlate successful remote logons (Windows Event ID 4624, Logon Type 10 for RDP or 3 for network) on critical ICS hosts with subsequent outbound network connection logs (Zeek conn.log). Baseline the source IPs, user accounts, and time-of-day for remote logons to these hosts. Alert on sessions from new or geographically anomalous source IPs, or logons occurring outside of standard business hours. Scrutinize any subsequent network connections made from the target host to other ICS devices (PLCs, RTUs) on control-related ports immediately following the anomalous remote logon."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]