[
  {
    "information_requirement": "Has a critical ICS device been restarted or shut down outside of a scheduled maintenance window? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0816",
        "name": "Device Restart/Shutdown",
        "evidence": [
          {
            "description": "A shutdown or restart command is initiated by a user or process on a critical Windows-based system, such as an HMI or Engineering Workstation (EWS).",
            "data_sources": [
              "Windows System Event ID 1074",
              "Windows Security Event ID 4624",
              "Windows Security Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS), Operator Stations in the Process Control Network (PCN)",
            "action": "Monitor for Windows System Event ID 1074 (shutdown/restart event) on critical HMI and EWS assets. For each event, extract the initiating user and process name. Correlate the event timestamp with preceding process creation events (ID 4688) to trace the parent process and successful logon events (ID 4624) for that user. Use Zeek conn.log to identify the source IP of the user's session. Establish a baseline of authorized accounts and typical maintenance windows. Alert on any shutdown event initiated by an unauthorized account or occurring outside of pre-defined, scheduled maintenance periods."
          },
          {
            "description": "A network command known to cause a device restart is sent over an ICS protocol (e.g., Modbus, DNP3) to a controller like a PLC or RTU.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek dnp3.log (or other ICS protocol log)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic between Level 1 (Basic Control) and Level 2 (Supervisory Control) of the Purdue Model, specifically targeting PLCs, RTUs, and IEDs.",
            "action": "Using Zeek with ICS protocol parsers, monitor for specific restart commands within protocols like DNP3 (e.g., function code 1 for cold restart, function code 2 for warm restart) or Modbus (e.g., function code 8 diagnostics with sub-function for restart). Create a statistical baseline of all function codes observed between specific source/destination pairs. Alert when a rare or never-before-seen function code, particularly a restart command, is observed. Further scrutinize if the command originates from a source IP not on an approved list of engineering workstations."
          },
          {
            "description": "A critical controller (e.g., PLC, RTU) unexpectedly stops responding to network polling or heartbeat messages, suggesting it has been shut down or is in a reboot cycle.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network traffic flows to and from critical controllers on the Process Control Network (PCN).",
            "action": "For each critical controller IP, analyze Zeek conn.log to establish a baseline of normal communication patterns (e.g., polling interval, data volume, duration) from HMIs or data historians. Calculate the time difference between expected connections. Define a threshold for a 'missed heartbeat' (e.g., 3 standard deviations beyond the mean polling interval). Generate an alert when a device exceeds this threshold, indicating a potential loss of communication. Correlate the timestamp of the communication loss with any preceding network commands or host-based activity targeting the device's IP to differentiate a deliberate shutdown from a network failure."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]