[
  {
    "information_requirement": "Is an adversary attempting to disrupt industrial control system (ICS) device functionality via Denial of Service? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0814",
        "name": "Denial of Service",
        "evidence": [
          {
            "description": "A sudden, anomalous spike in network traffic volume (packets/bytes per second) or connection count directed at a specific ICS device, such as a PLC or HMI, from one or more sources, deviating significantly from established baselines.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments, particularly the network interfaces of critical controllers (PLCs, RTUs) and Human-Machine Interfaces (HMIs).",
            "action": "Monitor Zeek conn.log for connections to critical ICS assets. For each asset, establish a baseline of connection count, total bytes, and packet counts from unique sources over a rolling 5-minute window. Use statistical methods to detect significant deviations (e.g., traffic volume exceeding 3 standard deviations from the mean or the 99th percentile). Correlate high-volume traffic with a sudden increase in the number of concurrent connections or connection attempts from a single source IP to the target device."
          },
          {
            "description": "An abnormal rate of connection resets or errors originating from an ICS device immediately following receipt of traffic from a specific source, potentially indicating the device is rejecting malformed or malicious packets.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Control System DMZ, network interfaces of Programmable Logic Controllers (PLCs) and Remote Terminal Units (RTUs).",
            "action": "Analyze Zeek conn.log for connections to ICS devices where the conn_state is 'REJ', 'RSTO', 'RSTR', or 'RSTRH'. Establish a baseline for the rate of these connection states for each critical device. Alert when the rate of reset/rejected connections from a device to a specific source IP exceeds a statistically significant threshold (e.g., 95th percentile) over a short time frame (e.g., 1 minute). This could indicate the device is struggling to process the incoming traffic."
          },
          {
            "description": "A critical process or service on a Windows-based ICS host (e.g., HMI software, historian service) crashes or becomes unresponsive, logged as an application error or hang event, immediately following a spike in network connections or resource utilization.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 1002",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), and Historian Servers.",
            "action": "On critical Windows-based ICS hosts, monitor for Application Error (Event ID 1000) or Application Hang (Event ID 1002) events. Upon detection, perform a time-series correlation with network logs (Zeek conn.log) for the 5-minute window preceding the event to identify any anomalous network activity targeting the host. Look for a sudden increase in connection volume or connections from new/unusual internal IP addresses. A temporal correlation between a network anomaly and a critical process crash is evidence of a potential DoS attack."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]