[
  {
    "information_requirement": "Is the adversary attempting to blind operators to the state of the industrial process by causing a Loss of View? (TA0105 - Impact) (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0829",
        "name": "Loss of View",
        "evidence": [
          {
            "description": "The Human-Machine Interface (HMI) application, which provides operators with a view of the process, unexpectedly terminates or crashes on one or more operator workstations.",
            "data_sources": [
              "Windows Event ID 4689",
              "Windows Event ID 1000",
              "Windows Event ID 1002"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Operator Workstations and HMI Servers in the Process Control Network (PCN)",
            "action": "Continuously monitor for Windows Event IDs 4689 (Process Termination), 1000 (Application Error), and 1002 (Application Hang) on HMI servers and operator workstations. Correlate termination events for critical HMI process names (e.g., view.exe, iFIX.exe) across multiple hosts. Calculate the rate of these events over a rolling time window (e.g., 5 minutes). An alert should be triggered if the rate exceeds a statistically significant threshold (e.g., 3 standard deviations above the mean) or if multiple key workstations report crashes simultaneously."
          },
          {
            "description": "A sudden and sustained cessation of network traffic from key controllers (PLCs, RTUs) to the central data historian server, while other network traffic patterns remain normal.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting PLCs/RTUs to the Data Historian server",
            "action": "Using Zeek conn.log, create a baseline of expected 'heartbeat' or periodic data transmission from specific PLC/RTU source IPs to the Data Historian destination IP on expected ports (e.g., TCP/502). For each critical PLC-to-Historian pair, calculate the time difference between consecutive connections. Generate an alert if this time difference exceeds a predefined threshold (e.g., 120% of the normal polling interval). Use descriptive statistics to identify a sudden drop in the total number of connections or bytes transferred to the Historian from the control network VLAN, which would indicate a widespread communication loss."
          },
          {
            "description": "An anomalous spike in network connections or connection failures directed at an HMI server, leading to its unresponsiveness and causing a loss of view for connected operator clients.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "HMI Servers in the Process Control Network (PCN)",
            "action": "Monitor Zeek conn.log for traffic destined for HMI server IPs. Calculate the number of new connections per second and the ratio of failed connection states (e.g., S0, REJ) to successful states (e.g., SF). Trigger an alert if the connection rate exceeds the 99th percentile of the historical baseline or if the ratio of failed-to-successful connections spikes dramatically over a short time window. This indicates a potential resource exhaustion or SYN flood attack against the HMI."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]