[
  {
    "information_requirement": "Has an adversary disabled or degraded critical protective functions? (TA0105 - Impact)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0837",
        "name": "Loss of Protection",
        "evidence": [
          {
            "description": "An unauthorized command is sent to a Safety Instrumented System (SIS) controller to halt its operation or modify its logic, disabling its protective function.",
            "data_sources": [
              "Zeek industrial protocol logs (e.g., s7comm.log, modbus.log, enip.log)",
              "Windows Event ID 4624",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Safety Instrumented System (SIS) network segment, Engineering Workstations (EWS)",
            "action": "Monitor Zeek's industrial protocol logs for commands targeting SIS controllers, specifically 'Stop CPU', 'Program/Logic Download', and 'Key Switch/Mode Change' commands. Correlate the source IP of these commands with recent successful logons (Windows Event ID 4624) and engineering software execution (Windows Event ID 4688) on Engineering Workstations. Establish a baseline of normal logic download frequency and size; alert on any download occurring outside of a scheduled maintenance window or of an anomalous size."
          },
          {
            "description": "A high volume of critical alarms are inhibited or have their setpoints modified to non-protective levels from a Human-Machine Interface (HMI) or engineering station.",
            "data_sources": [
              "Zeek industrial protocol logs (e.g., opc-ua.log, modbus.log)",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interface (HMI) terminals, Process Control Network (PCN)",
            "action": "Using Zeek industrial protocol logs, identify and baseline write commands to memory registers associated with critical alarm setpoints and alarm inhibition flags. Calculate the rate of alarm inhibitions per HMI or user session (correlated with Windows Event ID 4624). Use a statistical threshold (e.g., > 95th percentile of the baseline rate) to detect an abnormal number of suppressed alarms, potentially indicating an attempt to blind operators before or during an attack."
          },
          {
            "description": "A critical protective device, such as a protective relay or safety interlock, unexpectedly ceases communication on the network, potentially indicating it has been physically disabled or placed in a bypass mode.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Substation network segments, Field device networks, Intelligent Electronic Devices (IEDs)",
            "action": "Create an asset list of critical protective devices and their IP addresses. For each device, establish a baseline of expected communication frequency (e.g., polling interval) using Zeek conn.log. Implement a 'watchdog' analysis that alerts if a device fails to communicate for a duration exceeding a defined tolerance (e.g., 3 times the normal polling interval). This time-series anomaly detection can indicate a device has been taken offline, resulting in a loss of protection."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]