[
  {
    "information_requirement": "Is an adversary manipulating physical control processes to cause an impact? (PIR)",
    "tactic_id": "TA0105",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T0831",
        "name": "Manipulation of Control",
        "evidence": [
          {
            "description": "A critical process setpoint (e.g., temperature, pressure, valve position) is modified by an unauthorized user, from an unauthorized device, or outside of scheduled maintenance windows.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek modbus.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Process Control Network (PCN) Segments",
            "action": "Correlate successful user login events on HMIs/EWS (Windows Event ID 4624) with ICS 'write' command logs (e.g., Zeek modbus.log where function is 'Write Single Coil' or 'Write Multiple Registers'). Establish a baseline of which user accounts and source workstations typically modify which setpoints. Alert on modifications that deviate from this baseline, such as a setpoint change originating from a non-EWS IP address, performed by a user account not associated with engineering staff, or occurring outside of normal operational hours. Calculate the rate of change for critical setpoints; flag any changes that exceed 3 standard deviations from the historical rate."
          },
          {
            "description": "Control system commands are observed on the network originating from a source IP or MAC address not on the authorized asset inventory list for that network segment.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) switches and routers, Demilitarized Zone (DMZ) between IT and OT networks",
            "action": "Maintain an asset inventory of authorized devices (IP addresses) for each process control network segment. Continuously monitor network traffic (Zeek conn.log) for any connections to control devices (e.g., PLCs, RTUs) originating from an IP address not on the authorized list. For any unauthorized connection, inspect the associated protocol logs (e.g., Zeek modbus.log) to determine if 'write' or 'control' function codes were used. Use descriptive statistics to track the frequency of commands from each source IP; a sudden spike in commands from a previously quiet or unknown source is a strong indicator."
          },
          {
            "description": "A new process is created on an HMI or Engineering Workstation that is responsible for sending control commands, and this process was not initiated by an authorized, interactive user logon.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS)",
            "action": "Monitor for the creation of new processes (Windows Event ID 4688) on critical HMI and EWS assets, specifically looking for processes known to interact with PLCs (e.g., control software, command-line utilities). For each such process creation, check for a preceding interactive logon event (Windows Event ID 4624, Logon Type 2) from the same user within a short time window. A control process started without a recent, corresponding interactive logon could indicate remote or automated manipulation. Establish a baseline of parent-child process relationships and alert on anomalous creations, such as control software being launched by a web browser or office application process."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]