[
  {
    "information_requirement": "Is an adversary modifying critical process control parameters to impair operations?",
    "tactic_id": "TA0106",
    "tactic_name": "Impair Process Control",
    "indicators": [
      {
        "technique_id": "T0836",
        "name": "Modify Parameter",
        "evidence": [
          {
            "description": "A parameter modification command sent over an ICS protocol contains an out-of-bounds, unsafe, or statistically anomalous value.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek dnp3.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN)",
            "action": "Using Zeek logs with ICS protocol parsers (e.g., modbus.log), parse all 'Write' function codes and their corresponding values. For each critical parameter/register, establish a baseline of normal values (min, max, mean, standard deviation) using historical data. Generate an alert for any new value that falls outside a predefined safe operating envelope or exceeds a statistical threshold (e.g., 3 standard deviations from the mean)."
          },
          {
            "description": "A parameter modification command originates from a network source not authorized to perform control actions, such as a device on the corporate IT network or an unknown IP address.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "IT/OT Network Gateway, Engineering Workstations (EWS)",
            "action": "Maintain an explicit allowlist of authorized IP addresses for Engineering Workstations and HMIs. Monitor Zeek conn.log for any connections to PLCs or RTUs on ICS-specific ports (e.g., destination port 502 for Modbus) originating from IPs not on the authorized list. Correlate these connections with ICS-specific Zeek logs (e.g., modbus.log) to confirm if a parameter 'Write' command was sent from the unauthorized source."
          },
          {
            "description": "A valid parameter modification is initiated from an authorized Engineering Workstation (EWS) or HMI, but the logon session associated with the action is anomalous.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Engineering Workstations (EWS)",
            "action": "Correlate the timestamp of a parameter modification event from Zeek ICS logs with successful Windows logon events (Event ID 4624) on the source HMI/EWS. Establish a baseline of authorized users and their typical shift hours. Generate an alert if a parameter change is initiated by a user logged in outside of their normal shift, from a rare geolocation, or from a user account not authorized for process control modifications."
          },
          {
            "description": "A specific control parameter is modified repeatedly in a short time frame, inconsistent with normal process adjustments or operator actions, potentially indicating an attempt to destabilize the system.",
            "data_sources": [
              "Zeek modbus.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Programmable Logic Controllers (PLCs), Process Control Network (PCN)",
            "action": "For each unique device and parameter combination (e.g., PLC_1, Register_40001), use Zeek ICS logs to track the frequency of 'Write' commands over time. Calculate the rate of change and establish a baseline for this rate. Alert when the frequency of modifications for a single parameter exceeds a statistical threshold (e.g., 99th percentile of modification frequency) within a short time window (e.g., 30 seconds), indicating potential parameter 'flapping'."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]