[
  {
    "information_requirement": "Is an adversary manipulating the I/O image of a PLC to inhibit its response function?",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0835",
        "name": "Manipulate I-O Image",
        "evidence": [
          {
            "description": "An explicit 'force' or 'override' command, such as Modbus Function Code 5 (Force Single Coil) or 15 (Force Multiple Coils), is sent to a PLC from an Engineering Workstation (EWS) outside of a scheduled maintenance window or by an unauthorized process.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting Engineering Workstations (EWS) to PLCs",
            "action": "Filter Zeek modbus.log for function codes 5 and 15. For each instance, correlate the source IP from conn.log with process creation logs (Windows Event ID 4688) on the originating EWS to identify the responsible user and process. Establish a baseline for the timing and frequency of these commands, which are typically linked to maintenance. Use a time-series analysis to flag any 'force' command that occurs at a time with a historically low probability (e.g., outside of 9 AM-5 PM on weekdays, excluding approved change windows) or if the daily count exceeds the 99th percentile of the historical distribution."
          },
          {
            "description": "A PLC memory write command, such as Modbus Function Code 6 (Preset Single Register) or 16 (Preset Multiple Registers), is initiated from an unauthorized source or by an unexpected process, potentially modifying the I/O image table directly.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical PLCs controlling safety and primary process functions",
            "action": "Monitor Zeek modbus.log for write function codes (e.g., 6, 16). Maintain an allowlist of authorized EWS IP addresses permitted to send these commands. For any write command from an unlisted IP, generate a high-priority alert. For writes from authorized IPs, correlate with Windows Event ID 4688 to ensure the command was initiated by approved engineering software (e.g., 'Studio5000.exe'). Calculate the entropy of source IPs sending write commands over a rolling 24-hour window; a sharp increase in entropy indicates potentially unauthorized devices attempting to modify PLC logic or memory."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]