[
  {
    "information_requirement": "Is an adversary using a rootkit to hide their presence on ICS assets? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0851",
        "name": "Rootkit",
        "evidence": [
          {
            "description": "A discrepancy exists between network traffic observed by network sensors and the processes or connections reported by the host operating system, suggesting a process is being hidden from the OS.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Historian Servers",
            "action": "Correlate network connections from a specific host's IP in Zeek conn.log with process creation events (Windows Event ID 4688) and network connection events (Windows Event ID 5156) on that same host by timestamp and destination. Identify external connections in Zeek that have no corresponding process creation or network filtering platform event on the host within a 5-second window. Calculate a baseline of this 'unattributed traffic' for each critical asset. An alert should be generated if the volume of unattributed traffic for an asset exceeds two standard deviations above its established baseline."
          },
          {
            "description": "A new service is installed on a critical system, or an existing service's configuration is modified, outside of a planned change window. This could be a rootkit establishing a persistence mechanism.",
            "data_sources": [
              "Windows Event ID 7045",
              "Windows Event ID 7040"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Domain Controllers in the OT network, Historian Servers",
            "action": "Maintain an approved list of services and their configurations for critical Windows-based ICS assets. Continuously monitor for Windows Event ID 7045 (A new service was installed). Compare the 'Service Name' and 'Service File Name' fields against the approved list. Also monitor for Event ID 7040 (The start type of a service was changed) for any deviation from the baseline. Any new or modified service not associated with a change control ticket should be immediately investigated."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary using a rootkit to inhibit the response function of an ICS device? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0851",
        "name": "Rootkit",
        "evidence": [
          {
            "description": "An abnormal increase in failed or reset network connections between a supervisory control host (e.g., HMI) and a field device (e.g., PLC), suggesting the field device is failing to process or is actively rejecting legitimate commands.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting Level 2 (Supervisory Control) and Level 1 (Basic Control) devices",
            "action": "For network traffic destined for PLCs and RTUs on known ICS protocol ports (e.g., 502/TCP, 20000/TCP, 44818/TCP), establish a baseline of the distribution of connection states ('conn_state' field in Zeek conn.log). Monitor for a statistically significant increase in the percentage of 'REJ', 'RSTO', or 'RSTR' states for a specific PLC over a rolling 1-hour window. A sustained deviation from the baseline indicates the device may be non-responsive or actively refusing connections, a potential side effect of a rootkit compromising its core functions."
          },
          {
            "description": "SCADA or HMI application software on an operator workstation repeatedly crashes, particularly after communicating with a specific field device, which may be sending malformed data due to a rootkit.",
            "data_sources": [
              "Windows Event ID 1000",
              "Windows Event ID 1001",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human-Machine Interfaces (HMIs), Operator Workstations",
            "action": "On HMI and operator workstations, monitor for Windows Event ID 1000 (Application Error) where the 'Faulting application name' corresponds to the HMI software. When an error is detected, correlate the timestamp with Zeek conn.log to identify the IP address of the field device the HMI was communicating with just prior to the crash. Track the frequency of crashes associated with each field device. A high count of crashes linked to a single device is anomalous and requires investigation of that device's integrity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]