[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to the ICS network via wireless compromise? (PIR)",
    "tactic_id": "TA0108",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T0860",
        "name": "Wireless Compromise",
        "evidence": [
          {
            "description": "An unauthorized device, identified by a MAC or IP address not on the asset inventory allowlist, is communicating on the industrial wireless network segment.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Industrial wireless network segments, network taps near wireless gateways and access points.",
            "action": "Maintain a strict asset inventory of authorized MAC and IP addresses for all wireless ICS devices. Continuously monitor Zeek conn.log data from the industrial wireless network segment. Compare the originator IP address (`id.orig_h`) against the authorized asset inventory allowlist. Generate a high-severity alert for any connection originating from an unknown IP address communicating with Level 1 or Level 2 devices."
          },
          {
            "description": "A legitimate wireless field device exhibits anomalous communication patterns, such as connecting to new internal hosts, using unusual protocols or ports, or transferring significantly more data than its established baseline.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human Machine Interfaces (HMIs), Historian Servers, ICS protocol-aware network sensors.",
            "action": "For each authorized wireless device IP address, establish a communication baseline using at least 30 days of Zeek conn.log data. The baseline should include: 1) a set of normal destination IPs, 2) a set of normal destination ports, and 3) the 95th percentile of total bytes (`orig_bytes` + `resp_bytes`). Continuously monitor for and alert on any of the following deviations: a connection to an IP not in the baseline set, use of a port not in the baseline set, or a total data transfer volume exceeding the 95th percentile baseline. If the new destination is a Windows host, correlate with Windows Event ID 4624 to check for an associated successful login."
          },
          {
            "description": "A Windows-based HMI or EWS that interacts with wireless devices executes suspicious processes or commands immediately following an anomalous network connection from one of those wireless devices.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Human Machine Interfaces (HMIs), Engineering Workstations (EWS), Control System Servers.",
            "action": "Create a detection rule that triggers when a network anomaly alert involving a wireless device (as defined in the previous action) is followed within a 2-minute window by a high-risk process creation (Windows Event ID 4688) on the destination Windows host. High-risk processes include `powershell.exe`, `cmd.exe`, `wscript.exe`, `cscript.exe`, and `certutil.exe`. Further refine by calculating the entropy of the `CommandLine` or `ParentCommandLine` fields; a high entropy score suggests obfuscation and increases the severity of the alert."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]