[
  {
    "information_requirement": "Is an adversary attempting to map our industrial control process? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0861",
        "name": "Point & Tag Identification",
        "evidence": [
          {
            "description": "A host exhibits unusual ICS protocol communication patterns, such as a high volume of read requests or communication from a non-standard source, indicative of an adversary enumerating PLC tags and points over the network.",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Control Network (PCN) segments containing PLCs, RTUs, and HMIs.",
            "action": "Establish a baseline of normal ICS communication by mapping source/destination pairs, protocols, and function codes from Zeek logs (e.g., modbus.log). Monitor for new hosts initiating ICS communications. For established hosts, calculate the 95th percentile for the volume of read requests per hour. Generate an alert when a host exceeds this statistical threshold, indicating abnormal enumeration activity."
          },
          {
            "description": "An unauthorized user or process accesses sensitive ICS project files (e.g., .ACD, .ap16) on an Engineering Workstation or file server, suggesting an attempt to steal the tag database.",
            "data_sources": [
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS) and central repositories for ICS project files.",
            "action": "Enable file system object access auditing (for Event ID 4663) on folders containing ICS project files. Create an allowlist of authorized processes (e.g., 'Studio5000.exe') and user groups ('PLC_Engineers'). Alert on any access to files with extensions like '.ACD' or '.ap16' by a process or user not on the allowlist, especially from common command-line tools like 'powershell.exe' or 'rundll32.exe'."
          },
          {
            "description": "A large or anomalous data query is made to the process historian from an unauthorized client, potentially to dump the tag list or large amounts of process data for offline analysis.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Process Data Historian server(s).",
            "action": "Using Zeek conn.log, create a baseline of IP addresses that normally connect to the historian's database port. Alert on new source IPs. For all connections, analyze the 'resp_bytes' field to establish a statistical baseline for data transfer volume. Alert when a connection's data transfer volume exceeds three standard deviations from the mean. Correlate network alerts with logon events (Windows Event ID 4624) on the historian to verify the identity and logon type of the connecting user."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]