[
  {
    "information_requirement": "Is an adversary attempting to determine the operating state of our PLCs? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0868",
        "name": "Detect Operating Mode",
        "evidence": [
          {
            "description": "A network query to determine a PLC's operating mode originates from an unauthorized host or exhibits an anomalous scanning pattern (e.g., rapid queries to multiple devices).",
            "data_sources": [
              "Zeek modbus.log",
              "Zeek s7comm.log",
              "Zeek conn.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "PLC Network Segment, Engineering Workstations (EWS), OT Network Gateway",
            "action": "Establish an asset inventory of authorized Engineering Workstations (EWS) and their typical communication patterns with PLCs. Monitor ICS protocol logs (e.g., Zeek modbus.log, s7comm.log) for status query function codes originating from IPs not in the EWS inventory. Calculate the rate of status queries per source IP per minute. A rate exceeding the 95th percentile of the historic baseline for the network segment indicates potential scanning. Correlate the source IP with host logs (Windows Event ID 4688) on the source machine to identify the process initiating the queries, looking for non-standard tools or scripts."
          },
          {
            "description": "A legitimate Engineering Workstation (EWS) is used to query PLC operating modes, but the activity is initiated following an anomalous remote logon to the EWS.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek rdp.log",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), DMZ Jump Boxes, VPN Concentrators",
            "action": "Monitor EWS for successful remote logons (Windows Event ID 4624, Logon Type 10). For each logon, enrich the source IP with geolocation and ISP data from Zeek conn.log or rdp.log. Create a baseline for each user's typical source country, ISP, and login hours. Alert on remote logons that deviate on two or more of these baseline characteristics (e.g., rare country and off-hours login). For each alerted logon, search for subsequent process creation events (Windows Event ID 4688) corresponding to known ICS engineering software, followed by network traffic to PLCs within a 15-minute window."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]