[
  {
    "information_requirement": "Is an adversary capturing wireless ICS communications for subsequent use? (PIR)",
    "tactic_id": "TA0100",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "A legitimate-appearing wireless command, captured via network monitoring at the wireless gateway, results in anomalous or unscheduled behavior on the control network. This could be indicative of a replay attack, which is preceded by wireless sniffing.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments connecting wireless gateways to the ICS network, Human-Machine Interfaces (HMIs), and Engineering Workstations (EWS).",
            "action": "Establish a baseline of normal command and control traffic originating from wireless gateways as seen in Zeek logs. Correlate traffic spikes or unusual destination ports from the gateway's IP with operator login events (Windows Event ID 4624) on HMIs. A significant burst of traffic from the gateway without a corresponding authorized operator action could indicate a replayed command sequence. Use descriptive statistics to define 'significant burst' (e.g., traffic volume greater than the 95th percentile of the baseline)."
          },
          {
            "description": "Detection of unauthorized or rogue devices communicating using known ICS wireless protocols (e.g., WirelessHART, Zigbee).",
            "data_sources": [
              "Wireless IDS Logs",
              "Spectrum Analyzer Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical airspace surrounding facilities with wireless ICS devices, such as field devices, sensors, and actuators.",
            "action": "Continuously monitor the RF spectrum for MAC addresses and device identifiers communicating on ICS wireless networks. Maintain an allow-list of known, authorized device identifiers. Generate an alert for any device that is not on the allow-list, or for any known device exhibiting anomalous signal characteristics (e.g., unusually high signal strength, suggesting it is much closer than the legitimate device). Use time-series analysis to detect sudden changes in the number of active devices."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary attempting to discover our wireless ICS protocols and frequencies? (PIR)",
    "tactic_id": "TA0102",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T0887",
        "name": "Wireless Sniffing",
        "evidence": [
          {
            "description": "Identification of unusual, broad, or persistent scanning activity across the RF spectrum, particularly targeting frequencies used by ICS protocols, without association to a known, legitimate device.",
            "data_sources": [
              "Spectrum Analyzer Logs",
              "Wireless IDS Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physical perimeter and airspace surrounding facilities with wireless ICS devices.",
            "action": "Utilize a spectrum analyzer to continuously monitor the RF spectrum in and around the facility, focusing on licensed and unlicensed bands used by operational technology (e.g., 900 MHz, 2.4 GHz). Establish a baseline of known, legitimate transmitters and their signal characteristics (strength, frequency, timing). Use statistical analysis to detect and alert on new, persistent, or unusually strong signals that do not correlate with known assets or operational schedules. Calculate the entropy of signal frequencies over time; a sudden increase may indicate broad-spectrum scanning by a discovery tool."
          },
          {
            "description": "Anomalous authentication failures or malformed packets directed at a wireless gateway, suggesting an adversary is probing the device to identify its protocol and security configuration.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Wireless gateways and access points connecting the RF environment to the wired control network.",
            "action": "On network segments containing wireless gateways, monitor for connection attempts from unknown internal or external IP addresses in Zeek conn.log. Baseline the rate of failed connections or rejected packets from legitimate devices. An alert should be triggered if the rate of failures from a single source exceeds a statistically defined threshold (e.g., 3 standard deviations above the mean). Use Zeek's notice.log to identify specific protocol violations or scanning behaviors detected by its analyzers."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]