[
  {
    "information_requirement": "Is an adversary using trusted host or application binaries to execute malicious commands or payloads on ICS systems? (PIR)",
    "tactic_id": "TA0103",
    "tactic_name": "Evasion",
    "indicators": [
      {
        "technique_id": "T0894",
        "name": "System Binary Proxy Execution",
        "evidence": [
          {
            "description": "A trusted, signed binary (e.g., a known HMI executable or a standard Windows binary) is executed with unusual or suspicious command-line arguments, such as those containing scripts, encoded commands, or network paths to untrusted locations.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), SCADA Servers, Historian Servers.",
            "action": "Establish a baseline of normal command-line arguments for critical ICS application binaries and common system utilities on key assets. Use regular expressions to search process creation logs (Windows Event ID 4688) for command lines of these trusted processes that contain suspicious patterns (e.g., 'powershell', 'http://', '\\\\unc\\path', base64 strings). Calculate the entropy of command-line arguments for these processes; a sudden spike in entropy for a specific process could indicate obfuscated or encoded commands. Alert when a command line for a baselined process deviates significantly (e.g., exceeds 95th percentile for length or entropy) from its known good patterns."
          },
          {
            "description": "A legitimate ICS application or a standard system binary, which normally communicates only with specific internal devices over OT protocols, initiates an outbound connection to an external, non-standard IP address or uses an unexpected protocol (e.g., HTTP/S, DNS).",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "ICS Network Segments (Control Network, Process Network), Demilitarized Zone (DMZ), Internet Gateway.",
            "action": "Baseline the typical network behavior (destination IPs, ports, protocols) for critical ICS applications and system processes on key assets using Zeek conn.log. Join process creation information (Windows Event ID 4688) with network connection logs (Zeek conn.log via source IP and timestamp) to attribute network activity to specific processes. Monitor for connections from these baselined processes to destinations outside the established norm, such as a connection to a non-internal IP address, a connection over port 443 from a process that never uses it, or communication with a low-reputation IP. Analyze Zeek dns.log for DNS queries originating from the ICS zone to rare or newly registered domains and correlate the source IP with host logs to identify the responsible process."
          },
          {
            "description": "A trusted ICS vendor application or a standard Windows binary (e.g., services.exe) spawns an unexpected child process, such as a command shell (cmd.exe, powershell.exe) or a script interpreter.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Domain Controllers in the OT environment.",
            "action": "Map the normal parent-child process relationships for critical systems in the ICS environment using Windows Event ID 4688. For example, an HMI application should not normally spawn powershell.exe. Generate an alert when a parent process from a 'trusted ICS application' list spawns a child process that is not on its pre-approved list, especially if the child is a command interpreter or scripting engine. Use statistical analysis (stack counting) to identify the rarest parent-child relationships across the environment, as these are the most likely to be malicious."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-25",
    "last_updated": "2025-09-25",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]