[
    {
        "information_requirement": "Has the adversary accessed or copied the NTDS database to steal credentials?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1003.003",
                "name": "NTDS",
                "evidence": [
                    {
                        "description": "An NTDS dump file copy is exfiltrated from a Domain Controller to a known malicious IP address or file-sharing service.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for any network connections from Domain Controller IPs to external IP addresses present on a high-confidence CTI blocklist. Additionally, monitor Zeek files.log for files transferred from DCs with names like 'ntds.dit', 'ntds.dit.bak', or having '.bkt', '.dmp' extensions. Inner join connection logs with CTI feeds and alert on any matches. Investigate large outbound transfers to any un-categorized or suspicious destinations."
                    },
                    {
                        "description": "Execution of command-line arguments or process names specifically associated with NTDS dumping tools or techniques on a Domain Controller.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) on all Domain Controllers for process names (e.g., 'ntdsutil.exe', 'vssadmin.exe') and command-line arguments containing patterns indicative of NTDS dumping. This includes 'ntdsutil.*ifm', 'vssadmin create shadow', 'secretsdump.py', 'Invoke-NinjaCopy', 'dcsync'. Use a regularly updated list of regular expressions to match known tool usage. Correlate these events with the parent process to identify suspicious execution chains (e.g., spawned from powershell.exe or an unusual service)."
                    },
                    {
                        "description": "Anomalous process access to the NTDS.dit database file by a non-standard process or user account on a Domain Controller.",
                        "data_sources": [
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Enable and monitor Windows Event ID 4663 on Domain Controllers for any access attempts on '%SystemRoot%\\NTDS\\Ntds.dit'. Establish a baseline of legitimate processes (e.g., lsass.exe) and accounts (e.g., SYSTEM) that access this file. Alert on any access by other processes (e.g., powershell.exe, cmd.exe, ntdsutil.exe) or any user accounts other than SYSTEM. Use frequency analysis and user account profiling to flag rare or unauthorized access events."
                    },
                    {
                        "description": "Creation of a Volume Shadow Copy on a Domain Controller outside of established backup schedules or initiated by an unauthorized process or user account.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 7036"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation (Event ID 4688) for 'vssadmin.exe create shadow' and service control events (Event ID 7036) for the Volume Shadow Copy service (VSS). Profile normal VSS activity tied to scheduled backups by establishing a baseline of execution times and initiating users/processes. Use time series analysis to detect VSS creation outside of normal backup windows (e.g., middle of the workday). Flag any VSS creation initiated by interactive user sessions, scripts (e.g., powershell.exe), or non-backup-related service accounts. Correlate VSS creation with subsequent access to the NTDS.dit file or large outbound network transfers."
                    },
                    {
                        "description": "Anomalous network traffic patterns indicative of domain replication originating from a non-Domain Controller or targeting an unusual device, suggesting a DCSync attack.",
                        "data_sources": [
                            "Zeek dce_rpc.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek dce_rpc.log for Directory Replication Service (DRS) remote procedure calls, specifically looking for the 'DRSUAPI' interface and 'DsGetNcChanges' operation. Establish a baseline of legitimate DC-to-DC replication traffic. Alert on any 'DsGetNcChanges' requests originating from an IP address that is not a known Domain Controller. Use correlation analysis to link these requests to specific user accounts and flag any such activity from non-Enterprise-Admin accounts or from standard user workstations."
                    },
                    {
                        "description": "A Domain Controller initiating anomalous outbound network connections, characterized by large data transfers, shortly after other indicators of credential dumping have been observed.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek files.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for all outbound connections originating from Domain Controller IPs. Establish a baseline for normal outbound traffic volume, destination types, and protocols using descriptive statistics (mean, median, standard deviation, percentiles) on the 'orig_bytes' field to detect unusually large transfers (e.g., >95th percentile). Correlate any anomalous outbound traffic events in time with preceding alerts on the same DC for VSS creation (via Event ID 4688), NTDS tool execution (Event ID 4688), or anomalous NTDS.dit file access (Event ID 4663). Use a linear regression model to test the correlation between suspicious host events and outbound data volume."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
