[
    {
        "information_requirement": "Is the adversary maintaining persistence using RC scripts?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1037.004",
                "name": "RC Scripts",
                "evidence": [
                    {
                        "description": "Network connections from Windows hosts to Unix-like systems on remote administration ports (e.g., SSH) involving known malicious IP addresses or payloads.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join Zeek conn.log source and destination IP addresses for connections to Unix-like systems on port 22 (SSH) or other remote administration ports with a high-confidence cyber threat intelligence feed of malicious IPs. Separately, if Zeek file extraction is enabled, scan files transferred to Unix systems for hashes of known malicious persistence scripts. Alert on any matches."
                    },
                    {
                        "description": "Execution of remote access or file transfer tools on Windows hosts with command-line arguments specifying common RC script paths on target Unix-like systems.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 command-line logging for execution of remote access or file transfer tools (e.g., `scp.exe`, `sftp.exe`, `plink.exe`, `ssh.exe`, PowerShell `Copy-Item -ToSession`). Use regular expression matching to search the command-line arguments for patterns targeting RC script file paths, such as `/etc/rc.local`, `/etc/rc.local.d/local.sh`, or `/etc/rc.common`. Flag any process creation event that matches these patterns for investigation."
                    },
                    {
                        "description": "Anomalous file upload or modification activity from a Windows host to a sensitive RC script path on a Unix-like system, deviating from established baselines.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal remote access from Windows hosts to critical Unix-like systems (e.g., ESXi servers), profiling typical source/destination pairs, protocols, user accounts, and data volumes. Monitor for deviations, such as connections from non-administrative workstations to ESXi hosts on port 22 for the first time. Correlate Windows Event ID 4688 (showing execution of `scp.exe`, etc.) with Zeek conn.log data showing a corresponding connection and data upload. Use descriptive statistics and outlier detection (e.g., IQR or Z-score on bytes transferred) to flag anomalous file uploads to sensitive systems."
                    },
                    {
                        "description": "Establishment of a new, persistent, or anomalous network connection from a Unix-like system shortly after a suspected remote file modification event, indicative of a C2 channel activated by the RC script.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a suspected RC file modification event (detected via other evidence) with the subsequent network behavior of the target Unix host. Monitor Zeek conn.log for new, unexpected outbound connections from the Unix host within minutes or hours of the suspected modification time. Use time series analysis and frequency analysis to detect beaconing (e.g., regular, low-volume connections) or other non-standard C2 patterns. Establish a baseline for normal outbound traffic from these servers and alert on significant deviations such as new destination IPs, unusual ports, non-standard protocols, or changes in connection entropy."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary elevating privileges using RC scripts?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1037.004",
                "name": "RC Scripts",
                "evidence": [
                    {
                        "description": "Transfer of known privilege escalation scripts or tools from a Windows host to a Unix-like system, intended for execution via a startup script to gain root access.",
                        "data_sources": [
                            "Zeek files.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "If Zeek file extraction is enabled, monitor file transfers (e.g., via HTTP, SMB, FTP) to staging locations on or near Unix hosts. Calculate file hashes and compare them against a maintained list of known privilege escalation scripts or exploits targeting Unix-like systems. Correlate network connections (Zeek conn.log) from known malicious IPs or unexpected internal sources to Unix hosts that coincide with these file transfers."
                    },
                    {
                        "description": "Remote command execution from a Windows host containing command syntax designed to append malicious commands to a world-writable or misconfigured RC script on a target Unix-like system.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for command-line arguments passed to remote shell tools (e.g., `ssh.exe`, `plink.exe`). Use regular expressions to search for patterns indicative of appending commands to a file, such as `echo 'payload' >> /path/to/script` or `printf 'payload' >> /path/to/script`, where the target path is a known RC script location. Alert on any such command pattern, as it is a common method for exploiting writable startup scripts for privilege escalation."
                    },
                    {
                        "description": "Anomalous modification of a system-level RC script on a Unix-like host by a non-root user account or from an unexpected source system, indicating an attempt to exploit misconfigurations for privilege escalation.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate Windows process execution logs (Event ID 4688 showing remote tool usage) with network logs (Zeek conn.log showing the SSH session). Profile which Windows users/systems normally connect to Unix hosts and with what credentials. Alert when a non-administrative user account initiates a remote session and subsequently transfers a file to, or appears to modify, a system-level RC script path. This action is most effective when correlated with file integrity monitoring or audit logs on the Unix host which can confirm a write to a root-owned file by a non-root user."
                    },
                    {
                        "description": "Unexpected network activity or privileged process execution originating from a Unix-like system immediately following a system reboot, which was preceded by anomalous file modification activity.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for system reboots on critical Unix-like hosts (may require correlation with logs from virtualization platforms or infrastructure monitoring tools). Following a reboot that was preceded by a suspected RC script modification, analyze Zeek conn.log for any new or anomalous network behaviors from that host (e.g., new C2 traffic, connections to unusual internal systems). Use time series analysis to compare post-reboot traffic to the pre-reboot baseline. A significant deviation could indicate the successful execution of a malicious, privileged payload."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
