[
    {
        "information_requirement": "Has the adversary exfiltrated sensitive data over a C2 channel?",
        "tactic_id": "TA0010",
        "tactic_name": "Exfiltration",
        "indicators": [
            {
                "technique_id": "T1041",
                "name": "Exfiltration Over C2 Channel",
                "evidence": [
                    {
                        "description": "Outbound connections to IP addresses, domains, or URLs known to be active C2 infrastructure, especially those with significant data transfer volumes.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join network connection logs (Zeek conn.log for IPs, http.log for Host headers, dns.log for queried domains) with a high-confidence, frequently updated cyber threat intelligence feed of known C2 servers. Alert on any match, prioritizing alerts where the outbound byte count (orig_bytes) is significantly greater than zero and exceeds a baseline threshold for typical keep-alive traffic."
                    },
                    {
                        "description": "Network traffic containing URI patterns, User-Agent strings, or SSL/TLS fingerprints (JA3/JA3S) that are characteristic of file exfiltration functions in known C2 frameworks.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Using regular expressions, scan Zeek http.log for URI patterns (e.g., '/download/', '/get.php') and User-Agent strings associated with the file transfer capabilities of known C2 frameworks like Cobalt Strike or Metasploit. Analyze Zeek ssl.log for JA3/JA3S hashes matching these frameworks. Maintain and regularly update the list of these C2 patterns and fingerprints and correlate matches with connections showing significant outbound data transfer."
                    },
                    {
                        "description": "Anomalously large outbound data flows over a single connection or aggregated over time, especially when masquerading as common protocols like DNS, HTTP, or HTTPS.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline for normal outbound data volume per host, service, and protocol. Use time series analysis (e.g., ARIMA, Holt-Winters) on Zeek conn.log byte counts (`orig_bytes`) to detect significant deviations from predicted volumes. For specific protocols, analyze Zeek dns.log for unusually large DNS responses (e.g., TXT/AAAA records) and Zeek http.log for HTTP POST requests with abnormally large body sizes. Use percentile analysis (e.g., flag anything above the 99th percentile of data size for that protocol) or IQR to identify statistical outliers."
                    },
                    {
                        "description": "A behavioral sequence of internal file aggregation activity followed by a sustained outbound network connection from the same host, indicating data staging and subsequent exfiltration.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events related to archiving tools (e.g., `rar.exe`, `7z.exe`, `zip.exe`, `tar.exe`) or built-in utilities used for large file manipulation. Correlate these host-based events with subsequent high-volume or long-duration outbound network connections from the same host in Zeek conn.log within a defined time window (e.g., 30 minutes). Use correlation analysis to link the host staging activity to the network exfiltration behavior."
                    },
                    {
                        "description": "Asymmetric network traffic where the outbound data volume is consistently and significantly larger than the inbound volume over an extended C2 session, especially during non-business hours.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For long-lived connections identified in Zeek conn.log, calculate the ratio of outbound bytes to inbound bytes (`orig_bytes / resp_bytes`). Establish a baseline for this ratio for different services and hosts. Use descriptive statistics and thresholds to flag connections with unusually high and sustained asymmetric ratios (e.g., ratio > 10:1 for > 5 minutes). Apply time series analysis to detect shifts in the byte ratio for a given connection over its lifetime. Correlate high-ratio events with activity outside of standard business hours for added context."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
