[
    {
        "information_requirement": "Has the adversary executed commands via the hypervisor CLI?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1059.012",
                "name": "Hypervisor CLI",
                "evidence": [
                    {
                        "description": "Execution of a hypervisor script or CLI command matching the hash or specific command-line signature of a known malicious tool or ransomware variant.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a list of known malicious script names (e.g., 'encrypt.sh'), file hashes, and full command-line strings associated with known hypervisor-targeting malware (e.g., ESXiArgs ransomware). Monitor Windows Event ID 4688 logs on hypervisor management systems (vCenter, admin workstations) for exact matches. Cross-reference the process hash (if available via Sysmon or EDR) or script name/path against a CTI feed of malware indicators. Alert immediately on any match."
                    },
                    {
                        "description": "Use of specific hypervisor CLI commands or parameters known to be frequently leveraged for destructive or malicious actions, such as deleting snapshots, killing VM processes, or disabling security features.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "From Windows Event ID 4688 logs, parse the command-line arguments for hypervisor CLIs (e.g., esxcli, vim-cmd, PowerCLI). Create detection rules for specific dangerous patterns, such as `esxcli vm process kill`, `vim-cmd vmsvc/snapshot.removeall`, `esxcli network firewall set --enabled false`, or their PowerShell equivalents. Correlate the execution of these commands with change management records; flag any unauthorized execution for immediate review."
                    },
                    {
                        "description": "A logical sequence of hypervisor CLI commands indicating a ransomware or data destruction attack pattern, such as enumerating VMs, then systematically manipulating or deleting them.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate multiple Windows Event ID 4688 events generated by the same user account or parent process on a management host within a short time window (e.g., 30 minutes). Define and search for malicious behavioral sequences, such as: 1. Enumeration (`vim-cmd vmsvc/getallvms`). 2. Followed by a loop of VM process kills (`esxcli vm process kill`). 3. Followed by file operations targeting VMDK files (`vmkfstools -E`). Use correlation analysis and stateful tracking to detect these multi-stage attack chains."
                    },
                    {
                        "description": "Execution of hypervisor CLI tools from an unauthorized user account, a non-standard host, or at an anomalous time of day, deviating from established administrative baselines.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal hypervisor CLI usage. Profile which user accounts (e.g., 'VSPHERE.LOCAL\\Administrator'), on which source workstations/servers, typically execute `esxcli.exe`, `vim-cmd`, or PowerCLI scripts. Use descriptive statistics to define normal hours of operation (e.g., business hours, scheduled maintenance windows). Monitor Windows Event ID 4688 and alert on executions that deviate from this baseline, such as execution by a non-administrator account, from a user's standard workstation instead of a designated management server, or late at night. Use time series analysis to detect spikes in CLI activity outside of normal windows."
                    },
                    {
                        "description": "Anomalous network connections originating from a hypervisor or its management interface to an external or unusual internal destination, potentially indicating C2 or exfiltration initiated via the CLI.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor Zeek conn.log for all outbound connections originating from the IP addresses of hypervisor hosts and their dedicated management servers. Establish a baseline of expected communication (e.g., to storage arrays, vCenter, specific internal subnets). Use correlation analysis to join this traffic against a CTI feed of known malicious IPs and domains. Additionally, use statistical methods like frequency analysis or entropy measures on destination ports and IPs to identify connections to rare or new destinations that deviate from the baseline, which may indicate a successful execution of a malicious command on the hypervisor."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
