[
    {
        "information_requirement": "Is the adversary communicating with external infrastructure using DNS tunneling?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1071.004",
                "name": "DNS",
                "evidence": [
                    {
                        "description": "DNS queries to domains or resolving to IP addresses known to be associated with command and control (C2) infrastructure.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously compare domains in the `query` field and IP addresses in the `answers` field of Zeek dns.log against a high-confidence, up-to-date threat intelligence feed of known C2 domains and IPs. Use an inner join for real-time matching. Alert on any matches and investigate the source host for further compromise."
                    },
                    {
                        "description": "Use of DNS record types (e.g., TXT, NULL, CNAME) or query structures in patterns characteristic of known DNS C2 tools like dnscat2, Iodine, or Cobalt Strike.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan Zeek dns.log for query patterns that match signatures of known DNS C2 tools. This includes looking for specific prefixes/suffixes in queries, use of TXT or NULL records for large data transfers, or rapid sequences of MX/CNAME queries used for tunneling. Maintain and apply a library of regular expressions and sequence rules based on public reporting of DNS C2 tool TTPs. Use frequency analysis to find rare RR types that may indicate new tool usage."
                    },
                    {
                        "description": "Anomalously high frequency of DNS queries with unusually long subdomains or high-entropy query names, indicative of data encoding within the DNS protocol.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each source IP, calculate the length and Shannon entropy of the query names (QNAMEs) in Zeek dns.log. Establish a baseline for normal query length and entropy across the network. Use statistical methods (e.g., Inter-Quartile Range (IQR), Z-score) to identify clients generating queries that are significant outliers in length (> 64 characters) or entropy. Use a time series analysis to detect sudden increases in average query length or entropy for a given client."
                    },
                    {
                        "description": "A high volume or rate of DNS queries from a single client to a single registered domain (or its subdomains), inconsistent with normal user or system activity.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate Zeek dns.log data by source IP and registered domain (e.g., `example.com` for `d1.d2.example.com`). Count the number of queries per client-domain pair over fixed time windows (e.g., 5 minutes, 1 hour). Establish a baseline for normal query counts. Use descriptive statistics and percentile analysis to flag clients with query volumes exceeding a dynamic threshold (e.g., > 99th percentile). Linear regression can be used to model expected query volume and detect anomalous spikes."
                    },
                    {
                        "description": "Significant imbalance in the ratio of DNS query size to response size for a specific client-domain pair, suggesting data upload via DNS queries.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "From Zeek dns.log, analyze the `query_length` and `answers` fields (or overall packet sizes if available). For each client-domain communication, calculate the ratio of bytes sent (queries) to bytes received (responses). Normal DNS traffic has a very low ratio (small query, larger response). Use descriptive statistics (mean, median) to find the typical ratio and flag client-domain pairs with an unusually high ratio (e.g., > 1.0) indicating more data is being sent than received. Use box-plots to visually identify these outliers."
                    },
                    {
                        "description": "DNS requests originating from unexpected processes on a host, such as office applications, command interpreters (cmd.exe, powershell.exe), or unsigned executables running from temporary directories.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network DNS query logs (Zeek dns.log) with host-level process creation logs (Windows Event ID 4688 with command-line auditing enabled). First, identify a suspicious DNS query in Zeek logs. Then, pivot to the source IP at the same timestamp to find the process (from Event ID 4688) that was active. Build a baseline of legitimate processes that make DNS queries (e.g., browsers, svchost.exe). Flag DNS activity originating from processes not on the baseline, especially from non-network-aware applications like `rundll32.exe`, scripting engines, or executables in user-writable locations (`%APPDATA%`, `%TEMP%`)."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
