[
    {
        "information_requirement": "Is the adversary collecting and staging data on local systems?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1074.001",
                "name": "Local Data Staging",
                "evidence": [
                    {
                        "description": "Execution of known malicious staging tools or creation of archive files with names matching threat actor IOCs.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) and cross-reference process image hashes against a threat intelligence feed of known malicious staging utilities. Separately, configure file creation auditing (Windows Event ID 4663) on common staging directories (e.g., C:\\Users\\Public, C:\\Windows\\Temp) and alert on the creation of files with names matching known malicious archive filenames used by threat actors (e.g., 'backup.zip', 'files.dat'). Maintain and regularly update these selector lists."
                    },
                    {
                        "description": "Execution of common command-line utilities or PowerShell scripts using syntax patterns strongly indicative of data collection and archiving.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4104"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation command lines (Windows Event ID 4688) for archiving tools (`7z.exe`, `winrar.exe`, `tar.exe`, `zip.exe`) with arguments indicating password protection and compression of sensitive user or system directories. Enable and monitor PowerShell script block logs (Windows Event ID 4104) for use of cmdlets like `Compress-Archive` targeting multiple disparate directories, especially when combined with password protection or output to non-standard locations. Use regular expression matching to detect these specific command patterns."
                    },
                    {
                        "description": "A process exhibiting anomalous file system behavior, such as reading from a high diversity of directories or causing a sudden spike in file I/O, culminating in the creation of a large archive file in a temporary or unusual location.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Enable file access auditing (Windows Event ID 4663) on sensitive directories. Correlate file read events with the parent process identified via Windows Event ID 4688. Establish a baseline of normal file access patterns for common processes. Use statistical analysis to flag any process that reads from an unusually high number of distinct directories (high source path entropy) or causes a sudden spike in file read/write operations within a short time frame. Correlate these behavioral anomalies with the subsequent creation of a large file with an archive extension (`.zip`, `.rar`, `.7z`) in a common staging location (e.g., `%TEMP%`, `%APPDATA%`, `C:\\Users\\Public`). Use time series analysis on file I/O rates per host to detect outlier activity."
                    },
                    {
                        "description": "A host making numerous read requests to internal network shares followed by writing a large archive file to a local staging directory.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Zeek smb_files.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate local file creation events (Windows Event ID 4663 for large archives) with preceding network file access activity from the same host. Monitor Zeek `smb_files.log` for a single host performing a high number of read actions (`action=SMB::FILE_READ`) from multiple different shares or directories across the network in a short period. If this network behavior is immediately followed by the creation of a large, compressed file locally on that host, flag for review. Use correlation analysis based on host IP and timestamps (within a 10-30 minute window) to link the network and local events, which indicates collection from network sources for local staging."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
