[
    {
        "information_requirement": "Is the adversary using application layer protocols for command and control?",
        "tactic_id": "TA0011",
        "tactic_name": "Command-And-Control",
        "indicators": [
            {
                "technique_id": "T1071",
                "name": "Application Layer Protocol",
                "evidence": [
                    {
                        "description": "Connections using common application layer protocols (e.g., HTTP/S, DNS) to IP addresses, domains, or server names known to be associated with command and control infrastructure.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate destination IP addresses from Zeek conn.log, requested domains from Zeek dns.log, and Server Name Indication (SNI) values from Zeek ssl.log against a high-confidence, frequently updated cyber threat intelligence (CTI) feed of known C2 servers. Generate an alert for any confirmed matches and investigate the source host for signs of compromise."
                    },
                    {
                        "description": "Application layer protocol traffic containing specific artifacts associated with known malware or C2 frameworks, such as distinctive User-Agent strings, URI patterns, or JA3/JA3S hashes.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan Zeek http.log for specific, hardcoded User-Agent strings, URI path structures, or POST request formats known to be used by C2 tools. Analyze Zeek ssl.log for TLS connections with JA3 (client) or JA3S (server) fingerprints matching those of known C2 frameworks. Maintain and apply a list of these patterns using regular expressions and direct matching. Use frequency analysis to find hosts repeatedly communicating using these suspicious patterns."
                    },
                    {
                        "description": "Repetitive, periodic network connections (beacons) from an internal host to a single external destination using an application layer protocol, characterized by regular time intervals and similar connection sizes.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each internal source IP, analyze connection logs (Zeek conn.log) to external destinations. Calculate the time delta between consecutive connections to the same destination. Use time series analysis or statistical methods (e.g., standard deviation of time deltas) to identify highly periodic 'heartbeat' traffic. Also analyze connection duration and byte counts for low variance, which is typical of beaconing. Alert on host-destination pairs exhibiting strong periodicity (low time delta variance) and consistent connection sizes."
                    },
                    {
                        "description": "Anomalous process-to-protocol behavior, such as a process not typically associated with networking initiating outbound application layer protocol connections, or traffic on a standard port that does not conform to the expected protocol.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 5156",
                            "Zeek conn.log",
                            "Zeek notice.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate network connections (Windows Event ID 5156, Zeek conn.log) with the initiating process name and path (Windows Event ID 4688). Establish a baseline of legitimate processes that make network connections on specific application layer ports. Flag connections from unexpected processes (e.g., calc.exe, unsigned binaries in temp folders) or from legitimate processes under a suspicious parent process. Monitor Zeek notice.log for alerts like `SSL_not_SSL` or other protocol violations indicating C2 tunneling over a standard port."
                    },
                    {
                        "description": "Anomalous DNS query patterns indicative of C2, such as unusually long hostnames, high query volume to a single domain, or use of non-standard query types (e.g., TXT, NULL) for data transfer.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek dns.log. Calculate the entropy of queried subdomain labels to detect high-entropy DGA-like names. Monitor the length of DNS queries, flagging those significantly longer than the established norm for the environment. Track the volume of queries per source host to a specific parent domain; a high count may indicate C2. Analyze the distribution of query types (A, AAAA, CNAME, TXT, etc.); an unusually high percentage of TXT or other non-standard record queries for data exfiltration should be investigated. Use linear regression to spot anomalous trends in query volume over time from a specific host."
                    },
                    {
                        "description": "Application layer protocol connections exhibiting highly asymmetric data flows inconsistent with normal protocol usage, such as large uploads over HTTP or DNS.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log records for established connections. For each common application protocol (e.g., HTTP, DNS), calculate the ratio of bytes sent (orig_bytes) to bytes received (resp_bytes). Establish a baseline for these ratios per protocol using historical data. Use statistical methods (e.g., Inter-Quartile Range (IQR) or Z-score) to identify significant outliers where the data flow is inverted or disproportionate (e.g., a host uploading megabytes of data in what appears to be a DNS query or a small HTTP GET request). Box-plots of byte ratios per protocol can visually identify anomalous connections."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
