[
    {
        "information_requirement": "Is the adversary communicating with command and control infrastructure using domain fronting?",
        "tactic_id": "TA0011",
        "tactic_name": "Command and Control",
        "indicators": [
            {
                "technique_id": "T1090.004",
                "name": "Domain Fronting",
                "evidence": [
                    {
                        "description": "Domain fronting traffic where the inner HTTP Host header or destination IP matches a known malicious C2 indicator.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Join Zeek ssl.log and http.log records by connection UID to identify sessions with an SNI/Host header mismatch. For these sessions, extract the inner HTTP Host header from http.log and the destination IP from conn.log. Inner join these extracted values against a high-fidelity cyber threat intelligence (CTI) feed of known malicious domains and C2 server IP addresses (updated daily). Alert on any confirmed matches."
                    },
                    {
                        "description": "Network traffic exhibiting a mismatch between the encrypted TLS Server Name Indication (SNI) and the unencrypted HTTP Host header, or a blank SNI with a present Host header.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate Zeek ssl.log and http.log records by connection UID. Identify all sessions where the 'server_name' (SNI) in ssl.log does not match the 'host' in http.log, or where 'server_name' is null/blank but 'host' is populated. Establish a baseline of legitimate mismatches (e.g., from benign CDNs). Use frequency analysis and descriptive statistics to flag new or rare SNI/Host pairings and investigate outlier connections. This pattern is a primary indicator of potential domain fronting."
                    },
                    {
                        "description": "Anomalous traffic characteristics within connections to legitimate CDN or cloud services, such as periodic beaconing, unusual data volumes, or non-standard SSL/TLS fingerprints (JA3/JA3S).",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Zeek conn.log for all connections to known CDN and cloud provider IP ranges. For these connections, analyze session metadata for behavioral anomalies. Use time series analysis to detect periodic, fixed-interval connections (beaconing) indicative of C2. Establish baselines for data transfer volumes per user/host and use IQR or Z-scores to flag outliers. Correlate with Zeek ssl.log to profile the JA3/JA3S SSL/TLS fingerprints of clients connecting to CDNs; alert on the use of rare, suspicious, or known-malicious fingerprints."
                    },
                    {
                        "description": "An internal host communicating with a large number of distinct, low-prevalence domains hidden behind a single, legitimate fronted domain (e.g., a single CDN SNI).",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each legitimate fronted domain (e.g., a common CDN SNI from ssl.log), group all associated inner HTTP Host headers (from http.log) by the internal source IP address. For each source IP, calculate the count and entropy of the unique inner domains it communicates with behind that single front. A source IP communicating with an unusually high number of different, rare, or seemingly random hostnames via one fronted domain is highly suspicious. Use percentile analysis on the count of unique inner domains to identify outlier internal hosts."
                    },
                    {
                        "description": "A host process generating network traffic with domain fronting characteristics, especially if the process is unsigned, packed, running from an unusual location, or is not a standard web browser or updater application.",
                        "data_sources": [
                            "Zeek ssl.log",
                            "Zeek http.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "First, identify potential domain fronting traffic using SNI/Host mismatch analysis on Zeek logs. For each suspicious connection, extract the source IP, source port, destination IP, and destination port. Correlate this 4-tuple with host-based network connection logs (e.g., from Sysmon Event ID 3 or Windows Filtering Platform logs) to identify the process ID that initiated the connection. Analyze this process using Windows Event ID 4688 (Process Creation) logs to determine its name, command line, parent process, and signature status. Flag domain fronting traffic originating from non-standard, unsigned, or suspiciously located processes."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
