[
    {
        "information_requirement": "Is the adversary maintaining persistence by creating cloud accounts?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1136.003",
                "name": "Cloud Account",
                "evidence": [
                    {
                        "description": "Inbound connections to on-premises systems from cloud provider IP ranges that are present on threat intelligence feeds as known malicious sources.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously filter Zeek conn.log for all inbound connections where the source IP address belongs to a known cloud provider range (e.g., AWS, Azure, GCP). Inner join these source IPs against a high-confidence, continuously updated cyber threat intelligence feed of known malicious IP addresses. Generate a high-priority alert for any successful connection from a matching IP and investigate the associated session and destination host."
                    },
                    {
                        "description": "Successful on-premises logons by accounts with Security Identifiers (SIDs) or naming conventions characteristic of cloud-native/hybrid accounts, particularly if these logons target sensitive systems or involve administrative privileges.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor successful logons (Windows Event ID 4624) on critical servers and domain controllers. Inspect the SID of the logging-on account; specifically, use regular expressions or pattern matching to look for non-standard or cloud-specific SID structures (e.g., Azure AD user SIDs beginning with 'S-1-12-1-'). Correlate the appearance of these SIDs with account names following patterns like 'AAD_*', 'svc-*', or 'temp-*'. Flag any such account performing its first administrative logon (Logon Type 3 or 10) or accessing a sensitive system."
                    },
                    {
                        "description": "An account successfully logs into on-premises systems for the first time, originating from a cloud IP space, without any corresponding preceding activity in IT or HR provisioning systems, indicating a potential 'ghost' persistence account.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a baseline of all known active user accounts and their typical login sources. Monitor successful logons (Windows Event ID 4624) for accounts not present in the baseline. For any 'new' account, correlate its first logon event with HR/IT provisioning logs. Flag accounts with zero prior history that suddenly perform a successful remote logon, especially if the source IP (from Zeek conn.log or Event ID 4624) geolocates to a cloud data center. Use linear regression to detect anomalous spikes in the rate of 'new' account creation and first-time logons."
                    },
                    {
                        "description": "A cloud-synchronized or previously dormant account performs high-privilege actions on-premises (e.g., accessing domain controllers, modifying administrative groups) inconsistent with its documented role or historical activity baseline.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4732",
                            "Windows Event ID 4728"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of privileged actions for all accounts. Correlate logon events (Windows Event ID 4624) with subsequent privileged activity logs, such as group membership changes (e.g., Event ID 4732: member added to security-enabled local group; Event ID 4728: member added to security-enabled global group). Use descriptive statistics and frequency analysis to detect when a low-privilege, dormant, or cloud-based account performs a rare or first-ever administrative action. Flag any such activity for immediate review."
                    },
                    {
                        "description": "Anomalous inbound network traffic from cloud provider IP ranges to internal systems, characterized by connections to non-standard ports, unusual protocols, or communication patterns indicative of C2 that correlate with a cloud account logon.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "In Zeek conn.log, filter for inbound traffic from known cloud provider IP ranges. Establish a dynamic baseline of normal ports, protocols, destinations, and data transfer volumes for this traffic. Use time series analysis to detect periodic connections (beaconing) or sudden spikes in data transfer volume. Use entropy measures on destination ports to detect scanning or unusual access breadth from a single cloud source. Correlate the start time of anomalous network flows with recent successful logons (Windows Event ID 4624) by known cloud-based accounts to identify the session responsible for the suspicious traffic."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
