[
    {
        "information_requirement": "Has the adversary escalated privileges using SID-History Injection?",
        "tactic_id": "TA0004",
        "tactic_name": "Privilege Escalation",
        "indicators": [
            {
                "technique_id": "T1134.005",
                "name": "SID-History Injection",
                "evidence": [
                    {
                        "description": "Execution of known privilege escalation or credential access tools with command-line arguments specific to SID-History injection on a Domain Controller.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On Domain Controllers, monitor for process creation events (Windows Event ID 4688 with command-line logging enabled). Create detection rules for specific command-line strings associated with tools like Mimikatz (e.g., 'sid::patch', 'sid::add') or other known hacking tools that manipulate SID-History. Alert on any exact matches, as these are high-fidelity indicators of compromise."
                    },
                    {
                        "description": "Modification of a user's sIDHistory attribute to include well-known, high-privilege SIDs (e.g., Domain Admins, Enterprise Admins) or SIDs from the same domain, a pattern inconsistent with legitimate cross-domain migration.",
                        "data_sources": [
                            "Windows Event ID 5136",
                            "Zeek ldap.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 5136 and Zeek ldap.log for modifications to the 'sIDHistory' attribute. Maintain a list of high-privilege SIDs (e.g., S-1-5-21-domain-512 for Domain Admins) and a pattern for detecting same-domain SIDs. Parse the 'Value' field in Event ID 5136 or the request data in ldap.log to check if any added SIDs match the list or pattern. Alert immediately on any match, as adding a same-domain SID is a strong indicator of malicious activity."
                    },
                    {
                        "description": "A non-administrative user account's sIDHistory attribute is modified, followed shortly by that account logging into a Domain Controller or other critical system for the first time.",
                        "data_sources": [
                            "Windows Event ID 5136",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate Windows Event ID 5136 (sIDHistory modification) with subsequent successful logon events (Windows Event ID 4624) within a short time window (e.g., 5-30 minutes). Establish a baseline of users who normally log onto critical systems like Domain Controllers. Flag any event where a user, especially a non-administrative one, has their SID history modified and then immediately logs onto a critical system. Use correlation analysis based on username and timestamps to detect this behavioral sequence."
                    },
                    {
                        "description": "An anomalous spike in the volume of sIDHistory modification events on Domain Controllers, suggesting automated or widespread abuse.",
                        "data_sources": [
                            "Windows Event ID 5136"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline for the frequency of Windows Event ID 5136 events that show modifications to the 'sIDHistory' attribute, which should be extremely low or zero in a stable environment. Use time series analysis or statistical process control to monitor the event volume in near-real time. Alert on any significant deviation or spike from the baseline, which could indicate an adversary attempting to inject SIDs into multiple accounts for privilege escalation."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary evading defenses using SID-History Injection?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1134.005",
                "name": "SID-History Injection",
                "evidence": [
                    {
                        "description": "The sIDHistory attribute of an account is modified by a process or from a source IP address not associated with legitimate administrative tools or domain migration activities.",
                        "data_sources": [
                            "Windows Event ID 5136",
                            "Zeek ldap.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "From Windows Event ID 5136, identify the 'Subject/Security ID' and process name that performed the modification. From Zeek ldap.log, identify the source IP of the LDAP modify request. Maintain allow-lists of approved processes (e.g., lsass.exe), authorized source IPs (e.g., specific migration servers), and administrator accounts authorized for such changes. Alert on any 'sIDHistory' modification originating from a source not on these lists."
                    },
                    {
                        "description": "An existing, dormant, or service account is modified to include a privileged SID in its sIDHistory, creating a 'sleeper' account to evade detection focused on new or active user accounts.",
                        "data_sources": [
                            "Windows Event ID 5136",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate Windows Event ID 5136 (sIDHistory modification) with account activity baselines derived from logon events (Event ID 4624). Flag modifications made to accounts that have been dormant for an extended period (e.g., >90 days) or are designated as service accounts not typically involved in migrations. This pattern suggests an adversary is repurposing an existing account to create a stealthy backdoor, evading detection that focuses on new or recently active account anomalies."
                    },
                    {
                        "description": "An account with injected SIDs performs privileged actions that are inconsistent with its documented role or explicit group memberships, thereby bypassing group-based monitoring controls.",
                        "data_sources": [
                            "Windows Event ID 5136",
                            "Windows Event ID 4624",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "First, identify accounts with a populated 'sIDHistory' attribute via real-time monitoring of Event ID 5136. For these accounts, track subsequent activity after logon (Event ID 4624). Compare their actions (e.g., process creation on critical systems per Event ID 4688, access to sensitive file shares) against the permissions granted by their explicit group memberships. Use a correlation engine to flag when an account performs an action that should be denied but is allowed due to injected SIDs, which detects the successful evasion of group-based access controls."
                    },
                    {
                        "description": "Periodic auditing reveals accounts with populated sIDHistory attributes that cannot be justified by any documented, ongoing, or historical domain migration project.",
                        "data_sources": [
                            "Windows Event ID 5136"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On a recurring basis (e.g., weekly), perform a historical query of Windows Event ID 5136 logs on all Domain Controllers to build a comprehensive list of all accounts with modified 'sIDHistory'. Compare this generated list against official IT records of domain migration projects. Any account whose modification is not part of a documented migration is a high-fidelity indicator of a potential defense evasion backdoor and must be investigated immediately. Use descriptive statistics to track the count of such accounts over time to spot trends."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
