[
    {
        "information_requirement": "Has the adversary gained initial access to the network via drive-by compromise?",
        "tactic_id": "TA0001",
        "tactic_name": "Initial Access",
        "indicators": [
            {
                "technique_id": "T1189",
                "name": "Drive-by Compromise",
                "evidence": [
                    {
                        "description": "Network connections from endpoints to domains, URLs, or IP addresses known to be associated with malvertising, exploit kits, or active watering hole attacks.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Integrate network logs (Zeek http.log for host/URI, Zeek conn.log for IP addresses) with high-confidence cyber threat intelligence (CTI) feeds for malicious domains, URLs, and IPs. Continuously correlate all outbound web traffic against these feeds in near real-time. Generate a high-priority alert for any match, indicating a user has browsed to a known-bad location, and investigate the associated endpoint for signs of compromise."
                    },
                    {
                        "description": "Web traffic containing specific code patterns, iframe structures, or request sequences characteristic of known exploit kits or exploits for specific browser vulnerabilities.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan HTTP bodies (from Zeek http.log or extracted files from Zeek files.log) using regular expressions that match known exploit kit landing page structures, specific obfuscation function names, or code snippets that target known browser vulnerabilities (e.g., specific CVEs). Maintain and update a library of these signatures. Alert on any matches."
                    },
                    {
                        "description": "A web browser process spawning a command-line interpreter or scripting engine with known malicious command-line arguments used for payload execution.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) where the parent process is a web browser (e.g., chrome.exe, msedge.exe, firefox.exe). Alert on the creation of child processes such as cmd.exe, powershell.exe, wscript.exe, or cscript.exe when their associated command line contains specific, high-fidelity patterns associated with post-exploitation payload download/execution (e.g., '-enc', 'IEX (New-Object Net.WebClient)', 'mshta.exe javascript:')."
                    },
                    {
                        "description": "A web browser process spawns an unusual child process (not a typical helper process) or writes an executable file to a common user directory.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal child processes for web browsers in the environment. Monitor Windows Event ID 4688 for deviations, such as a browser spawning a process that is not on the established allowlist (e.g., svchost.exe, rundll32.exe). Concurrently, monitor file creation events (Windows Event ID 4663) where a browser process writes a file with an executable extension (.exe, .dll, .ps1, .vbs) to disk, particularly in temporary or user-writable locations (%APPDATA%, %TEMP%). Use frequency analysis to identify rare parent-child process relationships."
                    },
                    {
                        "description": "An endpoint establishes a new, anomalous outbound network connection (e.g., to a rare IP, using an unusual port or protocol) immediately following a web browsing session to a low-reputation site.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate web browsing activity (Zeek http.log) with subsequent network connections (Zeek conn.log) from the same source IP within a short time window (e.g., 1-5 minutes). Establish a baseline of typical outbound connection destinations and ports for endpoints. Use statistical analysis (e.g., identifying low-frequency occurrences using percentiles or an inter-quartile range test) to flag connections to new or rare destination IPs/countries, or over non-standard ports, that occur directly after a web browsing event, especially if the site visited has a low reputation or is newly registered."
                    },
                    {
                        "description": "A cluster of endpoints within the same department or physical location simultaneously visit a previously unseen or low-reputation domain.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate web browsing logs (Zeek http.log) and DNS query logs (Zeek dns.log) across the enterprise. Identify domains that are newly observed in the environment or have a low reputation score. Perform correlation analysis to detect if multiple, logically-grouped endpoints (e.g., by subnet, department) access the same suspicious domain within a narrow timeframe (e.g., 1 hour). A sudden spike in requests to a single new domain from a specific user group, visualized with a box-plot or time series analysis, is a strong indicator of a targeted watering hole attack."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
