[
    {
        "information_requirement": "Is the adversary attempting to evade defenses using signed binaries like Odbcconf?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1218.008",
                "name": "Odbcconf",
                "evidence": [
                    {
                        "description": "Execution of odbcconf.exe to load a DLL whose hash is on a threat intelligence blacklist.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for 'odbcconf.exe' executions. Extract the DLL path from the command line arguments. Via an EDR or script, retrieve the file hash (e.g., SHA256) of the specified DLL. Inner join the collected file hashes with a high-confidence cyber threat intelligence (CTI) feed of known malicious file hashes. Alert on any match and isolate the host for forensic analysis."
                    },
                    {
                        "description": "Execution of odbcconf.exe with specific command-line argument patterns known to be leveraged for malicious code execution, such as '/S /A {REGSVR ...}'.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a high-fidelity detection rule to monitor Windows Event ID 4688 for process creations of 'odbcconf.exe'. Filter for command lines containing the argument pattern '/S /A {REGSVR' or other known malicious argument combinations. Since this pattern is strongly correlated with malicious use and exceptionally rare in benign activity, any match should be treated as a high-confidence alert for immediate investigation."
                    },
                    {
                        "description": "Execution of odbcconf.exe from an anomalous parent process (e.g., Office application, browser, script interpreter) or from a non-standard file path (e.g., user profile directory, temp folder).",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for 'odbcconf.exe' process creation. Establish a baseline of normal parent processes (e.g., 'msiexec.exe', 'svchost.exe') and execution locations (e.g., '%SystemRoot%\\System32'). Use frequency analysis and statistical models to flag executions where the parent process is anomalous (e.g., 'winword.exe', 'powershell.exe', 'wscript.exe') or the execution path is outside the established baseline. A box-plot of parent process frequencies can help identify rare and suspicious parent-child relationships."
                    },
                    {
                        "description": "A DLL is written to a temporary or user-writable directory and is immediately executed via odbcconf.exe, indicating a 'write-then-execute' behavior.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate file creation events for DLLs (from Windows Event ID 4663 with object access auditing enabled) with subsequent 'odbcconf.exe' process creation events (Windows Event ID 4688) that reference the newly created DLL in the command line. Use correlation analysis based on hostname and a tight time window (e.g., DLL creation occurs within 60 seconds of 'odbcconf.exe' execution) to detect this behavior. Prioritize alerts where the DLL is written to a non-standard location like 'C:\\ProgramData', '%APPDATA%', or 'C:\\Users\\Public\\'."
                    },
                    {
                        "description": "Anomalous child process creation (e.g., cmd.exe, powershell.exe) or outbound network connections are observed immediately following an odbcconf.exe execution.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate 'odbcconf.exe' executions (Windows Event ID 4688) with subsequent events on the same host. Look for the creation of suspicious child processes by 'odbcconf.exe'. Simultaneously, monitor for any new outbound network connections (Zeek conn.log) from the host within a short time window (e.g., 1-5 minutes) of the execution. Use time series analysis to detect network traffic spikes post-execution and cross-reference destination IPs with threat intelligence to identify potential C2 communication."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
