[
    {
        "information_requirement": "Is the adversary maintaining persistence using bootkit techniques?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1542.003",
                "name": "Bootkit",
                "evidence": [
                    {
                        "description": "Known bootkit installer files or components observed on the system or in network traffic.",
                        "data_sources": [
                            "Zeek files.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan transferred files identified in Zeek files.log against a database of known bootkit component hashes (e.g., malicious drivers, installers, MBR images). Monitor Windows Event ID 4688 for the execution of processes with file hashes matching known bootkit installers. Maintain and regularly update this hash list from cyber threat intelligence sources."
                    },
                    {
                        "description": "Execution of commands or tools in patterns known to be used for writing to boot sectors or modifying UEFI boot configurations.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create and monitor for a list of high-fidelity command-line patterns associated with boot sector modification (e.g., `bootsect.exe /nt60 SYS /mbr`, `bcdedit.exe /set {bootmgr} path \\path\\to\\malicious.efi`, use of `dd` or `debug.exe` with disk targets). Use descriptive statistics to find rare or first-seen command-line invocations of tools like `bcdedit.exe` or `bootsect.exe` that are not part of standard software deployment or system repair."
                    },
                    {
                        "description": "A process obtaining raw write access to a physical disk, followed by system shutdown or restart commands, indicating MBR/VBR modification.",
                        "data_sources": [
                            "Windows Event ID 4656",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate events to detect a sequence where a process requests raw handle access with write permissions to a physical drive (e.g., `\\\\.\\PhysicalDrive0`) (Windows Event ID 4656, ObjectType: File, Accesses contains WRITE_DATA), followed shortly by the same process executing a shutdown/restart command (e.g., `shutdown.exe /r /t 0`) (Windows Event ID 4688). Use correlation analysis with a short time delta (e.g., under 1 minute) between these events to flag a highly probable bootkit installation attempt."
                    },
                    {
                        "description": "Anomalous modifications to the EFI System Partition (ESP) by unauthorized or non-standard processes.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of legitimate processes that modify the ESP (e.g., `Bcdboot.exe`, official OS updaters). Monitor for any file creation or modification events (Windows Event ID 4663) in the ESP initiated by processes not on this baseline (e.g., `powershell.exe`, `rundll32.exe`, or other unsigned executables). Use correlation analysis to link the process execution (Event ID 4688) with the file modification event (Event ID 4663) to identify the source of the unauthorized change. Use frequency analysis to detect rare processes writing to the ESP."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary evading defenses using bootkit techniques?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense-Evasion",
        "indicators": [
            {
                "technique_id": "T1542.003",
                "name": "Bootkit",
                "evidence": [
                    {
                        "description": "Network traffic matching signatures of known bootkit command and control (C2) protocols or destinations.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inner join connection logs (Zeek conn.log) and DNS query logs (Zeek dns.log) against CTI feeds of known bootkit C2 IPs, domains, and protocol signatures (e.g., unusual ports, JA3/JA3S hashes). Pay special attention to connections occurring very early in the boot sequence and alert on any matches."
                    },
                    {
                        "description": "System security features, such as Secure Boot or driver signature enforcement, being disabled via command line.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4673"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor for specific command-line execution (Windows Event ID 4688) of `bcdedit.exe /set {current} nointegritychecks Yes` or `bcdedit /set testsigning on`, which disables critical OS security features. Correlate this with a privileged service being used (Windows Event ID 4673) by an unusual process. Flagging these specific command patterns provides a high-confidence indicator of attempts to weaken system security to load unsigned malicious code."
                    },
                    {
                        "description": "Unusual network connections originating from a host immediately after boot, before a user logs on, and bypassing typical network security controls.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 1 (System log)"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate system boot events (e.g., Windows System log Event ID 1) with network connection logs (Zeek conn.log). Identify network traffic from a host that starts within seconds or a few minutes of boot time but does not correspond to legitimate boot services (e.g., DHCP, NTP, AD discovery, SCCM). Use time series analysis to identify hosts with recurring, anomalous early-boot connections. These may indicate a bootkit's C2 communication occurring before user-level security tools are fully active."
                    },
                    {
                        "description": "Discrepancies between OS-reported activity and network-observed activity, indicating a bootkit is hiding processes or network connections.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "This is a hunting action. Formulate a hypothesis that a bootkit is hiding activity. From a suspect host, generate a list of running processes and listening network ports (via live response or by analyzing recent Windows Event ID 4688). Simultaneously, from the network perspective (Zeek conn.log), identify all active outbound connections from that host's IP address. Correlate the two datasets. Investigate any network connections observed in Zeek that cannot be attributed to a process on the host-generated list. Such a discrepancy is a strong behavioral indicator of a hidden process, a hallmark of a successful bootkit."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
