[
    {
        "information_requirement": "Has the adversary obtained credentials via credential caching?",
        "tactic_id": "TA0006",
        "tactic_name": "Credential Access",
        "indicators": [
            {
                "technique_id": "T1558.005",
                "name": "Ccache Files",
                "evidence": [
                    {
                        "description": "Execution of processes with file hashes matching known malicious tools used to steal or manipulate Kerberos tickets and ccache files.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 process creation events. Retrieve or compute the file hash (e.g., SHA256) of the new process image file. Compare this hash against a cyber threat intelligence (CTI) feed or a curated list of known malicious file hashes for tools like kekeo, Rubeus, and Mimikatz that are known to interact with Kerberos tickets. Generate a high-priority alert on any match."
                    },
                    {
                        "description": "Execution of Kerberos-related tools with specific command-line arguments or patterns indicative of ticket theft, manipulation, or use.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events and their full command lines. Use regular expressions to search for patterns associated with credential theft tools (e.g., `Rubeus.exe ptt /ticket:...`, `kekeo.exe ptt /ticket:...`) or the misuse of legitimate tools for reconnaissance (e.g., `klist -c <path_to_cache_file>`). Maintain and update a list of known malicious command-line patterns for these tools and alert on matches."
                    },
                    {
                        "description": "Access to files matching common Kerberos credential cache naming conventions (*krb5cc_*, *.krb5.ccache) by unusual processes or over network file transfers.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Zeek files.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Enable object access auditing on systems where ccache files might be stored or accessed (e.g., file servers holding Linux home directories, developer workstations). Monitor Windows Event ID 4663 for access to files with patterns `*krb5cc_*` or `*.krb5.ccache`. Filter for access by non-standard processes (e.g., not sshd, cron, or known applications). Separately, monitor Zeek files.log for transfers of files with these names over protocols like SMB or FTP. Correlate file access events with subsequent network connections from the source host using Zeek conn.log to identify potential exfiltration."
                    },
                    {
                        "description": "Anomalous execution behavior of Kerberos utilities or access to ccache files, deviating from established user or host baselines.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal Kerberos utility usage (`klist`, `kinit`, etc.) and ccache file access (from Event ID 4663) for each user and host. Profile typical parent processes, frequency, and time of day for these activities. Use descriptive statistics and time series analysis to detect significant deviations, such as a user who never uses these tools suddenly executing them, execution from an unusual parent process (e.g., `powershell.exe`), or a sudden burst of file access attempts to locate ccache files. Use entropy measures on the UID part of `krb5cc_UID` file names being accessed by a single process to detect scanning behavior."
                    },
                    {
                        "description": "Anomalous Kerberos authentication patterns on the network, such as a user authenticating from an unusual source host or a ticket being used for a service inconsistent with the user's role, indicating Pass-the-Ticket attacks leveraging stolen ccache files.",
                        "data_sources": [
                            "Zeek kerberos.log",
                            "Zeek conn.log",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek kerberos.log and Windows authentication logs (Event ID 4624, Logon Type 9 for new credentials) to build a statistical model or graph of normal authentication relationships, such as (user, source_host, destination_service). Use this baseline to detect anomalies, for instance a user's ticket being used from a host they have never logged into, a ticket for a low-privilege user being used to access a high-privilege service (e.g., krbtgt, host/), or tickets with unusual encryption types or flags. Use correlation analysis to link a suspicious Kerberos authentication event with a preceding ccache file access event (Windows Event ID 4663) on the source host."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
