[
    {
        "information_requirement": "Is the adversary maintaining persistence by modifying host software binaries?",
        "tactic_id": "TA0003",
        "tactic_name": "Persistence",
        "indicators": [
            {
                "technique_id": "T1554",
                "name": "Compromise Host Software Binary",
                "evidence": [
                    {
                        "description": "Discrepancies in file hashes or digital signatures of critical system or application binaries when compared to a known-good baseline, not attributable to legitimate patching.",
                        "data_sources": [
                            "Windows Event ID 1 (Sysmon)",
                            "Windows Event ID 4688",
                            "Windows Event ID 3002",
                            "Windows Event ID 3034"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a baseline 'golden image' of file hashes (e.g., SHA256) for critical OS and application binaries in a known-good state. Upon process execution (Sysmon Event ID 1 or Windows Event ID 4688), compare the executing binary's hash against the baseline. Additionally, monitor Code Integrity events (Windows Event ID 3002, 3034) for binaries failing signature validation. Alert on any hash mismatch or signature validation failure that does not correlate with authorized change management or patching activity records. Use a simple inner join or lookup against the baseline hash list for detection."
                    },
                    {
                        "description": "Modification of a trusted software binary by a process known to be a malicious dropper/packer, or by a process not associated with standard software installation/updating.",
                        "data_sources": [
                            "Windows Event ID 11 (Sysmon)",
                            "Windows Event ID 26 (Sysmon)",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Sysmon FileCreate (Event ID 11) and FileChange (Event ID 26) events where the TargetFilename is a known critical binary (e.g., in System32, Program Files). Analyze the ProcessId and Image of the process performing the modification. Create a pattern-based rule to alert when the modifying process is not a known trusted installer (e.g., `TrustedInstaller.exe`, `msiexec.exe`, `setup.exe` from a trusted publisher) or if its name or hash matches known malicious tools. Correlate with process creation events (Event ID 4688) to analyze the parentage of the modifying process for further context."
                    },
                    {
                        "description": "A normally non-network-facing binary (e.g., notepad.exe) or a server-side binary initiating unexpected outbound network connections after potential compromise.",
                        "data_sources": [
                            "Windows Event ID 3 (Sysmon)",
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate process execution data (Windows Event ID 4688) with network connection logs (Sysmon Event ID 3, Zeek conn.log). Establish a baseline of normal network behavior for critical system and application binaries. Use descriptive statistics to model typical destination IPs, ports, and data volumes for each binary. Alert on significant deviations, such as a binary that normally has no network activity making any connection, or a binary connecting to a rare destination IP/port. Use entropy measures on destination ports/IPs per process over time to detect anomalous connection patterns."
                    },
                    {
                        "description": "A legitimate system or application binary spawning unexpected child processes, loading unusual modules, or accessing sensitive files inconsistent with its normal function.",
                        "data_sources": [
                            "Windows Event ID 1 (Sysmon)",
                            "Windows Event ID 7 (Sysmon)",
                            "Windows Event ID 11 (Sysmon)",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For critical system processes (identified via Sysmon Event ID 1 or Windows Event ID 4688), establish a behavioral baseline. 1) Child Processes: Profile typical child processes and alert on anomalies (e.g., WINWORD.EXE spawning powershell.exe). 2) Module Loads (Sysmon Event ID 7): Baseline common DLLs and their paths; alert on modules loaded from unusual locations (e.g., %TEMP%) or that are unsigned. 3) File Access (Sysmon Event ID 11): Baseline typical file read/write patterns; alert on access to sensitive files outside its normal scope (e.g., ssh.exe writing to browser credential stores). Use frequency analysis and correlation to build baselines and detect deviations with percentile or standard deviation thresholds."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
