[
    {
        "information_requirement": "Is the adversary executing code using inter-process communication mechanisms?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1559",
                "name": "Inter-Process Communication",
                "evidence": [
                    {
                        "description": "Creation or use of named pipes or COM objects with names or identifiers (CLSIDs) known to be associated with specific malware or malicious tools.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain and regularly update a list of known malicious named pipe names (e.g., from Cobalt Strike, Metasploit) and COM object CLSIDs used by malware for IPC or execution. Scan Windows Event ID 4688 command-line arguments for attempts to create or connect to these named pipes (e.g., via `rundll32.exe` or other utilities) or instantiate these COM objects. Alert on any exact matches found in command-line logs."
                    },
                    {
                        "description": "Execution of a command interpreter (cmd.exe, powershell.exe) as a child process of a non-standard parent, such as a Microsoft Office application, indicative of DDE or COM abuse patterns.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 4688 logs to track parent-child process relationships. Establish a baseline of normal parent processes for `cmd.exe` and `powershell.exe` (e.g., `explorer.exe`, other shells). Generate alerts for any instance where a Microsoft Office application (`WINWORD.EXE`, `EXCEL.EXE`, `POWERPNT.EXE`), PDF reader (`AcroRd32.exe`), or browser spawns a command shell directly, as this is a common and high-fidelity pattern for execution via IPC."
                    },
                    {
                        "description": "Anomalous local IPC activity, such as the creation of named pipes with high-entropy names or DCOM/RPC calls originating from unusual client processes like Microsoft Office applications.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek dce_rpc.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Windows Event ID 4688 command-line arguments for named pipe creation patterns (`\\\\.\\pipe\\...`). Calculate the Shannon entropy of the pipe names being created; alert on names with high entropy that do not match a known-good allowlist, as this may indicate an attempt to evade signature-based detection. Separately, monitor Zeek dce_rpc.log for DCOM/RPC calls and baseline which internal applications normally initiate them. Flag DCOM calls originating from unusual client processes, especially those like `WINWORD.EXE` or `EXCEL.EXE`."
                    },
                    {
                        "description": "Anomalous DCOM/RPC network traffic patterns, such as a single host scanning multiple systems via RPC or traffic between workstations that do not typically communicate.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dce_rpc.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek dce_rpc.log and associated Zeek conn.log events for DCOM/RPC traffic (typically involving TCP port 135 and subsequent dynamic high ports). Build a statistical baseline or graph of normal RPC communication paths and volumes. Identify and alert on a single source IP making RPC calls to an unusually high number of distinct destination hosts within a short time frame (potential lateral movement scanning). Use correlation analysis to flag rare source-destination RPC communication pairs (e.g., client-to-client traffic) by identifying connections in the 99th percentile of rarity."
                    },
                    {
                        "description": "Sustained, low-volume network connections between internal hosts on non-standard or ephemeral ports, potentially indicating a custom socket-based IPC channel for command and control or lateral movement.",
                        "data_sources": [
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek conn.log for connections between internal hosts, filtering out traffic on well-known and authorized application ports. For the remaining traffic, profile connections based on duration, total bytes transferred, and packet count. Use statistical methods (e.g., calculating the ratio of connection duration to bytes transferred, using Inter-Quartile Range (IQR) on session data volume) to identify long-lived, 'low-and-slow' connections that are statistical outliers. Use time series analysis to detect connections that persist across days or weeks, which is highly indicative of a custom IPC or C2 channel."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
