[
    {
        "information_requirement": "Is the adversary using 'Pass the Ticket' for defense evasion?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1550.003",
                "name": "Pass the Ticket",
                "evidence": [
                    {
                        "description": "Kerberos ticket requests or grants specifying weak or deprecated encryption types (e.g., RC4_HMAC_MD5), especially for high-privilege accounts.",
                        "data_sources": [
                            "Windows Event ID 4768",
                            "Windows Event ID 4769"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Domain Controller logs for Windows Event ID 4768 (TGT request) and 4769 (Service Ticket request). Filter for events where the 'Ticket Encryption Type' is '0x17' (RC4-HMAC). Correlate these events with the 'Account Name' to identify when privileged accounts (e.g., Domain Admins, service accounts) request or use tickets with weak encryption, as adversary tools often default to RC4 for compatibility. Alert on such combinations."
                    },
                    {
                        "description": "Kerberos tickets observed in network traffic with characteristics matching known forgery tool defaults, such as abnormally long lifetimes.",
                        "data_sources": [
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze Zeek kerberos.log data. Establish a baseline for normal ticket 'endtime' or 'renew_until' values based on the domain's Kerberos policy (e.g., 10 hours). Alert on any tickets with lifetimes exceeding this policy by a significant margin (e.g., >24 hours, or years in the future), a common artifact of Golden Tickets created with tools like Mimikatz. Use descriptive statistics to identify extreme outliers in ticket lifetime durations across all observed tickets."
                    },
                    {
                        "description": "A user account requesting a Kerberos ticket from a source host or IP address it has never used before, especially if the account is privileged.",
                        "data_sources": [
                            "Windows Event ID 4768",
                            "Windows Event ID 4769",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a historical baseline mapping user accounts to the source hostnames/IPs from which they normally request Kerberos tickets using Windows Event IDs 4768/4769 and Zeek kerberos.log. Use frequency analysis and correlation to generate an alert when an account requests a ticket from a new, unseen host. Increase severity if the account is privileged (e.g., a member of Domain Admins) or if the source host is unusual for that user's role (e.g., a web server authenticating as a finance user)."
                    },
                    {
                        "description": "A rapid sequence of a TGT request followed by multiple Service Ticket requests for distinct services, indicating reconnaissance activity with a stolen or forged ticket.",
                        "data_sources": [
                            "Windows Event ID 4768",
                            "Windows Event ID 4769",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event IDs 4768 (TGT request) and 4769 (Service Ticket request) or Zeek kerberos.log. Correlate events by source IP and user account. Identify sequences where a TGT request is followed by a rapid succession (e.g., within 5 minutes) of Service Ticket requests for multiple distinct services/systems from the same source. Use time series analysis and thresholding to flag sequences exceeding expected limits (e.g., >10 unique service tickets requested within 5 minutes), which suggests network service scanning."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    },
    {
        "information_requirement": "Is the adversary using 'Pass the Ticket' for lateral movement?",
        "tactic_id": "TA0008",
        "tactic_name": "Lateral Movement",
        "indicators": [
            {
                "technique_id": "T1550.003",
                "name": "Pass the Ticket",
                "evidence": [
                    {
                        "description": "A service ticket request for a Service Principal Name (SPN) known to be associated with malicious tools or one that is not legitimately registered in Active Directory.",
                        "data_sources": [
                            "Windows Event ID 4769"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Periodically query Active Directory to generate a baseline list of all valid, registered SPNs. Monitor Windows Event ID 4769 (Service Ticket Request) on Domain Controllers. Compare the 'Service Name' field in each event against the known-good baseline of SPNs and a threat intelligence list of known-malicious SPNs. Alert on any request for an unregistered or known-malicious SPN."
                    },
                    {
                        "description": "A successful network logon using a Kerberos ticket that has unusual properties, such as weak encryption, an abnormally long lifetime, or flags inconsistent with the user or service context.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Zeek kerberos.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate successful network logons (Windows Event ID 4624, Logon Type 3, Authentication Package 'Kerberos') with network-level Kerberos data (Zeek kerberos.log). For a given successful logon, inspect the corresponding ticket in Zeek data for suspicious properties: 'encryption_type' using RC4, ticket lifetime far exceeding domain policy, or unusual 'ticket_flags' (e.g., 'forwardable' flag used for a service where it is not expected). Use descriptive statistics to baseline normal ticket properties per service and flag outliers using IQR or percentile analysis."
                    },
                    {
                        "description": "A successful Kerberos network logon to a host that the user has never accessed before, or that is inconsistent with their role, particularly if moving between peer workstations.",
                        "data_sources": [
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a graph or baseline of user-to-host access patterns using Windows Event ID 4624 (Logon Type 3 with Authentication Package 'Kerberos'). Alert when a user successfully authenticates to a new host for the first time, or to a host type inconsistent with their role (e.g., HR user logging into an IT server). Use correlation analysis to link user-role profiles with typical host access patterns and flag statistically significant deviations. Increase alert severity for workstation-to-workstation lateral movement."
                    },
                    {
                        "description": "An authenticated Kerberos session immediately followed by suspicious post-access activity, such as execution of reconnaissance commands, remote administration tools, or staging of malicious files.",
                        "data_sources": [
                            "Windows Event ID 4624",
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Endpoints"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate a successful Kerberos logon (Windows Event ID 4624, Logon Type 3) with subsequent process creation (Windows Event ID 4688) on the target host within a short time window (e.g., < 2 minutes). Hunt for command line execution of reconnaissance tools (`whoami`, `net user`, `nltest`, `ipconfig`), remote access tools (`psexec.exe`), or script interpreters (`powershell.exe`, `cscript.exe`) with obfuscated or suspicious arguments. Correlate with Zeek conn.log to detect if the new session initiates further unusual network connections, indicating staging or C2 activity."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
