[
    {
        "information_requirement": "Has the adversary attempted to evade defenses by modifying cloud firewalls?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense Evasion",
        "indicators": [
            {
                "technique_id": "T1562.007",
                "name": "Disable or Modify Cloud Firewall",
                "evidence": [
                    {
                        "description": "A cloud firewall rule is created or modified to explicitly allow ingress traffic from an IP address or CIDR range present on a high-confidence threat intelligence feed.",
                        "data_sources": [
                            "AWS CloudTrail Logs",
                            "Azure Activity Logs",
                            "GCP Audit Logs",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously parse cloud audit logs (e.g., AWS CloudTrail 'AuthorizeSecurityGroupIngress', Azure Activity Logs for Network Security Group changes) to extract source IP/CIDR ranges from all firewall rule modifications. Inner join these IP/CIDR values with a high-confidence CTI feed of known malicious IPs (updated within 24 hours). Alert on any match. Correlate alerts with Zeek conn.log to confirm if traffic from the malicious source was observed after the rule change."
                    },
                    {
                        "description": "A cloud firewall rule is created or modified using a specific naming convention, description, or API call pattern associated with known offensive security tools or malware.",
                        "data_sources": [
                            "AWS CloudTrail Logs",
                            "Azure Activity Logs",
                            "GCP Audit Logs"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Scan the 'name' and 'description' fields within cloud audit log events for firewall rule creation/modification. Use regular expression matching to search for keywords associated with malicious activity (e.g., 'backdoor', 'temp_allow', 'pwned') or specific naming conventions used by known offensive tools. Analyze the User Agent string in the audit log event for matches to tools such as 'pacu', 'Prowler', or other known cloud exploitation frameworks. Maintain and regularly update the keyword and User-Agent lists."
                    },
                    {
                        "description": "A cloud firewall rule is created or modified to be overly permissive, such as allowing ingress from all IPs ('0.0.0.0/0' or '::/0'), or opening high-risk management ports (e.g., RDP 3389, SSH 22, WinRM 5985) to the internet.",
                        "data_sources": [
                            "AWS CloudTrail Logs",
                            "Azure Activity Logs",
                            "GCP Audit Logs"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor cloud audit logs for firewall creation or modification events. Immediately flag any rule that sets the source CIDR to '0.0.0.0/0' or '::/0'. Additionally, flag any rule that opens high-risk ports (e.g., 22, 3389, 5985, 5986, 1433, 3306) to any non-approved external source. Establish a baseline of approved open ports and alert on any deviation. Use frequency analysis to identify ports that are rarely opened to the internet to spot unusual changes."
                    },
                    {
                        "description": "Cloud firewall modifications are performed by a user or role that typically does not manage network security, are executed outside of normal business hours, or originate from an anomalous source IP.",
                        "data_sources": [
                            "AWS CloudTrail Logs",
                            "Azure Activity Logs",
                            "GCP Audit Logs"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of which users, roles, and source IP addresses normally perform firewall modifications and during what time windows. Monitor cloud audit logs for any firewall modification events. Use descriptive statistics and frequency analysis to flag modifications made by a user or role that has rarely or never performed this action before. Use time series analysis or percentile analysis on timestamps to detect modifications occurring at highly unusual times (e.g., 3 AM on a Sunday). Geolocate the source IP of the API call and flag if it originates from an unexpected country or is inconsistent with the user's typical locations."
                    },
                    {
                        "description": "A cloud firewall modification is immediately followed by anomalous network activity that aligns with the new rule, such as successful connections from a previously unseen external IP or a sudden spike in traffic on the newly opened port.",
                        "data_sources": [
                            "AWS CloudTrail Logs",
                            "Azure Activity Logs",
                            "GCP Audit Logs",
                            "Zeek conn.log",
                            "Windows Event ID 4624",
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate the timestamp of a cloud firewall modification event with subsequent network and log data. Within a short time window (e.g., 1-15 minutes) after a rule change, monitor Zeek conn.log for new connections matching the allowed port/protocol from external IPs. Analyze Windows Event IDs 4624 (successful logon) and 4625 (failed logon) on the destination host. Use correlation analysis to link the firewall change event with a subsequent burst of login attempts or a successful login from a low-reputation or previously unseen source IP. Use linear regression to test if the rule change predicts a significant increase in connections or login events."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
