[
    {
        "information_requirement": "Is the adversary executing commands via system services?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1569",
                "name": "System Services",
                "evidence": [
                    {
                        "description": "Creation or modification of a system service using a known malicious service name, executable file hash, or one that establishes network connections to a known malicious C2 IP address or domain.",
                        "data_sources": [
                            "Windows Event ID 7045",
                            "Windows Event ID 4697",
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously monitor service creation events (Windows Event ID 7045, 4697) and process creation events (Windows Event ID 4688). Compare the created service name and its executable file hash against a CTI feed of known malicious service indicators. Separately, monitor network logs (Zeek conn.log, Zeek dns.log) for connections originating from service host processes (e.g., svchost.exe, or the executable of a newly created service) to IPs/domains on a high-confidence CTI feed. An inner join between network logs and the CTI list should be performed regularly, and any matches should be alerted on."
                    },
                    {
                        "description": "Use of common administrative tools (e.g., sc.exe, PowerShell) or direct registry modification to configure a service with suspicious parameters, such as an executable path pointing to a temporary or user-writable directory.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4657"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for `sc.exe` or PowerShell processes with command-line arguments containing `create`, `config`, `New-Service`, or `Set-Service`. Separately, monitor registry modifications (Windows Event ID 4657) to `HKLM\\System\\CurrentControlSet\\Services\\*\\ImagePath`. Use regular expressions to flag any instance where the specified service executable path is in a non-standard location such as `C:\\Users\\`, `C:\\Windows\\Temp\\`, `C:\\ProgramData\\`, or other world-writable directories. Correlate these events with user accounts to identify unauthorized changes."
                    },
                    {
                        "description": "A new service is created with a name or description that mimics a legitimate Windows service (e.g., 'WgaLogon' vs. 'Winlogon'), but points to a different or misspelled executable path.",
                        "data_sources": [
                            "Windows Event ID 7045",
                            "Windows Event ID 4697"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Maintain a baseline list of legitimate service names, display names, and their corresponding executable paths for the standard operating system build. Monitor service creation events (Event ID 7045, 4697) and compare the properties of new services against this baseline. Use string similarity algorithms (e.g., Levenshtein distance) to detect service names that are slight misspellings of legitimate ones. Flag any service where the name is legitimate or highly similar to a legitimate name, but the associated `ImagePath` is incorrect or unusual."
                    },
                    {
                        "description": "A newly created service exhibits an anomalous lifecycle, such as an extremely short execution time ('flash in the pan' execution), frequent restarts, or being created and deleted within a short time frame inconsistent with legitimate software installation.",
                        "data_sources": [
                            "Windows Event ID 7045",
                            "Windows Event ID 7036",
                            "Windows Event ID 7034",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate service creation (Event ID 7045) with service start (7036), stop/crash (7034), and deletion (often via `sc.exe delete` captured in Event ID 4688) events for the same service name. Establish a baseline for normal service installation and lifecycle patterns. Use time series analysis to flag services that are created and deleted within a suspicious window (e.g., less than one hour). Use descriptive statistics (mean, median, standard deviation) on service run times to identify services with unusually short or erratic lifespans via outlier detection methods like IQR or Z-scores."
                    },
                    {
                        "description": "A legitimate service host process (e.g., svchost.exe, dllhost.exe) spawns an unexpected child process or initiates network connections to rare external destinations, deviating from its established baseline activity.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log",
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of normal child processes (e.g., conhost.exe, WerFault.exe) and typical network destinations for common service host processes on servers and endpoints. Monitor process creation events (Windows Event ID 4688) where the parent process is a known service host. Flag the creation of unexpected child processes, especially command shells (cmd.exe, powershell.exe) or binaries in temporary locations. For network activity, analyze Zeek conn.log for connections from these service hosts and use frequency analysis (e.g., identifying destination IPs or domains seen by less than 1% of hosts) or entropy measures on destination ports/IPs to detect anomalous outbound traffic. Correlate anomalous process or network activity with recent service modification events."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
