[
    {
        "information_requirement": "Has the adversary collected and prepared data for exfiltration using archiving utilities?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1560.001",
                "name": "Archive via Utility",
                "evidence": [
                    {
                        "description": "Execution of archiving utilities matching known malicious file hashes or command-line invocations identical to those used by specific threat actor tools for collection and archiving.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for process creation events. Compare the file hash of the executed utility (e.g., 7z.exe, rar.exe, tar.exe) against a curated list of known malicious archiving tools or legitimate tools known to be bundled with malware. Additionally, compare the full command line against a list of exact command-line strings known to be used by specific malware families or APT tools for data archiving (e.g., specific password usage, targeting of sensitive default paths). Alert on any exact matches. Maintain and regularly update these selector lists from Cyber Threat Intelligence (CTI) feeds."
                    },
                    {
                        "description": "Execution of common archiving utilities (e.g., 7z.exe, WinRAR.exe, tar, zip, makecab.exe, certutil.exe) with command-line arguments or operational patterns strongly indicative of data staging and collection, especially when initiated by unusual parent processes.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for executions of legitimate archiving utilities (e.g., 7z.exe, WinRAR.exe, tar.exe, zip.exe, makecab.exe, diantz.exe, xcopy.exe with /S /E flags, certutil.exe with -encode argument). Focus on patterns such as: archiving entire user profiles (e.g., C:\\Users\\), document folders, or specific sensitive directories (e.g., directories containing financial data, PII); use of password protection arguments (e.g., -p, -hp); output of archives to unusual locations like temporary folders (%TEMP%, %APPDATA%, C:\\Windows\\Temp) or the recycle bin; use of non-standard file extensions for created archives. Correlate these executions with their parent processes; flag if spawned by anomalous processes (e.g., web server processes, Office applications post-macro execution, unidentified remote access tools). Use descriptive statistics to baseline typical command-line arguments, output locations, and parent processes for these utilities within the environment to identify significant deviations."
                    },
                    {
                        "description": "Anomalous creation of large or numerous archive files (e.g., .zip, .rar, .7z, .tar.gz, .cab) in unusual locations, by unexpected processes, or with high-entropy content, potentially preceded by broad file/directory access.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688",
                            "Windows Event ID 4656"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4663 (An attempt was made to access an object - typically for file write/create) for creation of files with common archive extensions. Profile typical locations, creating processes (from associated Windows Event ID 4688), file sizes, and counts of such files per host/user. Flag creations in atypical directories (e.g., system directories, user's startup folder), or by non-interactive processes or processes not typically associated with user-driven archiving (e.g., svchost.exe, powershell.exe executing obscure scripts). Use time-series analysis to detect unusual spikes in archive creation volume or aggregate size per host. Calculate file entropy for newly created archives; flag those with unusually high entropy (>7.0 for example, tunable) if encryption is suspected. Correlate archive creation (Event ID 4663, 4688) with preceding file/directory access events (Windows Event ID 4656, if enabled and targeted to sensitive data repositories) by the same process or user session to understand context."
                    },
                    {
                        "description": "Transfer of files identified as archives (by extension, MIME type, or file header/magic number) to external or unusual internal network destinations, especially if the transfer volume or frequency is anomalous.",
                        "data_sources": [
                            "Zeek files.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Inspect Zeek files.log for entries where `mime_type` indicates common archive formats (e.g., `application/zip`, `application/x-rar-compressed`, `application/x-7z-compressed`, `application/gzip`, `application/x-tar`) or where analysis of file headers (magic numbers like PK for ZIP) confirms an archive type. Correlate these file transfer events (using `fuid` from files.log) with Zeek conn.log connection details (source IP, destination IP, port, duration, total bytes) to identify sessions transferring these archives to external IP addresses or unusual internal destinations (e.g., non-file servers, user workstations). Establish baselines for archive transfer volume (bytes), frequency (count), and destination prevalence. Use anomaly detection techniques such as Inter-Quartile Range (IQR) or Z-score for transfer sizes, time series analysis for overall volume of archived data exfiltration, and low-frequency analysis for identifying rare or new destinations. Alert on significant deviations from baseline."
                    },
                    {
                        "description": "A sequence of activities on a host involving discovery of sensitive files/directories, followed by execution of an archiving utility targeting these findings, and culminating in the creation of a large or uniquely named archive file.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Windows Event ID 4663",
                            "Windows Event ID 4656"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Define and monitor for a sequence of events within a short time window (e.g., 5-60 minutes) on a single host: 1. Execution of discovery commands (e.g., `dir /s *.docx`, `findstr /S /M \"confidential\" *.*`, `Get-ChildItem -Recurse -Include *.pst`) via Windows Event ID 4688, or numerous sensitive file access events (Windows Event ID 4656 from critical data locations). 2. Subsequent execution of an archiving utility (Windows Event ID 4688) with command line arguments referencing enumerated directories, broad wildcards (e.g., `*.*`), or specific file types discovered. 3. Creation of one or more archive files (Windows Event ID 4663) with a significant total size (e.g., >100MB, percentile-based threshold) or a naming convention suggestive of staged data (e.g., `backup.zip`, `all_docs.rar`, GUID-like names in temp folders). Use correlation analysis based on ProcessID, ParentProcessID, User, and timestamps to link these events into a behavioral pattern. Employ descriptive statistics on resulting archive sizes and counts to flag outliers."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
