[
    {
        "information_requirement": "Is the adversary communicating with C2 infrastructure using DNS calculation?",
        "tactic_id": "TA0011",
        "tactic_name": "Command-And-Control",
        "indicators": [
            {
                "technique_id": "T1568.003",
                "name": "DNS Calculation",
                "evidence": [
                    {
                        "description": "DNS queries for domains or resolutions to IP addresses matching high-confidence threat intelligence feeds for known Domain Generation Algorithm (DGA) C2 infrastructure.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously inner join the query field (qname) and resolved IP addresses from Zeek dns.log against a CTI feed specializing in DGA-based malware and C2 infrastructure (updated daily). Generate a high-priority alert for any match and investigate the source host for compromise."
                    },
                    {
                        "description": "DNS queries for domains exhibiting statistical properties of algorithmic generation, such as high character entropy, unusual n-gram distribution, or a lack of linguistic structure.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Analyze all queried domains from Zeek dns.log that are not on an enterprise allowlist. For each domain, calculate its Shannon entropy and n-gram (bigram, trigram) frequency distribution. Establish a baseline from known legitimate domains. Flag domains with entropy scores or n-gram distributions that are statistical outliers (e.g., > 3 standard deviations from the mean of the legitimate set). A box-plot of entropy scores can visually identify DGA candidates."
                    },
                    {
                        "description": "A high volume or rate of DNS queries from a single internal host resulting in NXDOMAIN (Non-Existent Domain) responses, indicating a DGA actively searching for a registered C2 domain.",
                        "data_sources": [
                            "Zeek dns.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For each internal host, calculate the ratio of NXDOMAIN responses to total DNS queries within a rolling time window (e.g., 5-10 minutes). Establish a network-wide baseline for this ratio. Use time series analysis to detect sudden spikes in the NXDOMAIN ratio for any given host. Flag hosts with a persistently high ratio (e.g., >50% NXDOMAIN responses over a 10-minute window) for investigation."
                    },
                    {
                        "description": "An internal host making a network connection to a resolved IP address on a non-standard port shortly after a DNS query, particularly for a domain flagged as suspicious or algorithmically generated.",
                        "data_sources": [
                            "Zeek dns.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate successful DNS queries (Zeek dns.log) with subsequent network connections (Zeek conn.log) from the same source host to the resolved IP within a short timeframe (e.g., < 60 seconds). Prioritize and alert on events where the connection's destination port is outside a list of standard service ports (e.g., 80, 443, 22, 53) AND the queried domain was previously flagged as suspicious (e.g., by DGA entropy measures or CTI match). Use correlation analysis to measure the strength of the relationship between DGA-like queries and non-standard port communication."
                    },
                    {
                        "description": "Identification of periodic, low-volume, and potentially encrypted network traffic (beaconing) to an IP address that was recently resolved via a suspicious DNS query, characteristic of a C2 channel.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek dns.log",
                            "Zeek ssl.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "For connections identified in the previous step (suspicious DNS query followed by connection), analyze the properties of the connection itself. Use time series analysis on Zeek conn.log data grouped by source/destination pair to identify traffic with regular, periodic intervals (beaconing). Analyze connection duration and data volume (orig_bytes, resp_bytes); use descriptive statistics or box-plots to flag connections that are consistently low-volume and long-lived compared to typical traffic. If traffic is over TLS/SSL, inspect Zeek ssl.log for self-signed certificates or unusual JA3/JA3S hashes associated with the session."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
