[
    {
        "information_requirement": "Has the adversary collected data by archiving it?",
        "tactic_id": "TA0009",
        "tactic_name": "Collection",
        "indicators": [
            {
                "technique_id": "T1560.002",
                "name": "Archive via Library",
                "evidence": [
                    {
                        "description": "Execution of processes whose file hash matches known malicious or dual-use archiving tools or scripts used by threat actors.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Collect the SHA256 or MD5 hash for all processes at execution time from Windows Event ID 4688 process creation events (or associated EDR data). Compare these hashes against a continuously updated threat intelligence feed of file hashes corresponding to known malicious archivers, suspicious variants of legitimate tools (e.g., 7-Zip), or specific archiving scripts used by adversary groups. Alert on any confirmed match and initiate incident response."
                    },
                    {
                        "description": "Execution of scripting interpreters (e.g., Python, PowerShell) or living-off-the-land binaries with command-line arguments and module loads indicative of library-based archiving.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) for scripting interpreters (`python.exe`, `pwsh.exe`, `perl.exe`) or built-in utilities. Use regular expressions to scan command-line arguments for keywords referencing archiving libraries or functions (e.g., 'zipfile', 'tarfile', 'System.IO.Compression.ZipFile', 'Compress-Archive'), especially when targeting sensitive user or system directories. Use frequency analysis on command-line patterns to identify rare or first-seen uses of these archiving functionalities on a host or in the environment."
                    },
                    {
                        "description": "An unusual process (e.g., a web server process, a non-interactive service) creates one or more archive files in a suspicious location like a temporary directory or public web folder.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Correlate file creation/modification events (Windows Event ID 4663 for extensions like .zip, .rar, .7z) with the creating process name and path from the event details or by joining with Windows Event ID 4688 on the Process ID. Establish a baseline of normal archiving behavior for common processes. Flag archive creation by anomalous parent processes (e.g., `w3wp.exe`, `svchost.exe`, `sqlserver.exe`) that do not typically perform archiving. Use descriptive statistics and box-plots to identify outliers in the number or total size of archives created per process."
                    },
                    {
                        "description": "A single process accessing an unusually large number of distinct files or directories in a short time, immediately followed by the creation of a single archive file.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor file access events (Windows Event ID 4663, filtering for 'ReadData' or 'ListDirectory' access types). For each process ID, calculate the entropy or unique count of directories and files accessed within a short time window (e.g., 1-5 minutes). Correlate high-entropy or high-volume file access behavior with a subsequent file creation event (Windows Event ID 4663 'WriteData') by the same process for a file with an archive extension (.zip, .rar, .7z). This behavioral pattern helps identify a process staging data for collection prior to compression."
                    },
                    {
                        "description": "A sequence of events where a process creates an archive file, followed immediately by an outbound network connection from the same host, indicating potential exfiltration.",
                        "data_sources": [
                            "Windows Event ID 4663",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a correlated alert that triggers on a sequence of events within a short time window (e.g., 60 seconds) on a single host: 1) A file creation event (Windows Event ID 4663) for a suspicious archive file (e.g., by extension .zip, .rar, .7z). 2) A subsequent outbound network connection (Zeek conn.log) originating from that host's IP address. Investigate network connections to external destinations or unusual internal destinations that occur immediately after suspected archiving activity. Use time series correlation to statistically link file system events to network events based on timestamp and host IP."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
