[
    {
        "information_requirement": "Is the adversary gathering victim identity information during reconnaissance?",
        "tactic_id": "TA0043",
        "tactic_name": "Reconnaissance",
        "indicators": [
            {
                "technique_id": "T1589",
                "name": "Gather Victim Identity Information",
                "evidence": [
                    {
                        "description": "Authentication attempts or web scraping activity originating from IP addresses or networks known to be associated with reconnaissance, scanning, or malicious activity.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Zeek http.log",
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Continuously correlate source IP addresses from logs of failed authentications (Windows Event ID 4625) and web traffic to public-facing applications (Zeek conn.log, Zeek http.log) against high-confidence threat intelligence feeds of known malicious scanners, open proxies, TOR exit nodes, or IPs associated with credential abuse. Alert on any matches and investigate for further reconnaissance activity."
                    },
                    {
                        "description": "Requests to authentication endpoints or public-facing applications using User-Agent strings, HTTP headers, or request sequences characteristic of known reconnaissance or scraping tools.",
                        "data_sources": [
                            "Zeek http.log"
                        ],
                        "data_platforms": [
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Filter Zeek http.log for requests to sensitive paths (e.g., /login, /api/users, password reset pages). Maintain and apply a library of regular expressions to match User-Agent strings of known reconnaissance tools (e.g., sqlmap, nmap, feroxbuster, Gobuster). Analyze the sequence and timing of requests from a single source IP; automated tools often exhibit unnaturally fast and methodical patterns. Flag sources matching these tool-specific patterns. Use correlation analysis to link these patterns to specific IPs."
                    },
                    {
                        "description": "A high ratio of invalid to valid usernames in authentication attempts from a single source, or a high count of unique usernames attempted, indicating username enumeration or guessing.",
                        "data_sources": [
                            "Windows Event ID 4625"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "On authentication servers, parse Windows Event ID 4625 logs to extract source IP and target username. For each source IP over a defined time window (e.g., 10 minutes), calculate the number of unique usernames attempted. Establish a baseline for normal activity and alert on outliers identified via Inter-Quartile Range (IQR) or percentile analysis. Additionally, calculate the entropy of usernames attempted from a single IP; a high entropy may suggest random guessing, while a low entropy with many attempts could indicate a targeted list."
                    },
                    {
                        "description": "Anomalous and sustained request volume from a single external source targeting public-facing web pages or APIs that contain employee information, indicative of systematic web scraping.",
                        "data_sources": [
                            "Zeek http.log",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor request rates to public web applications using Zeek http.log. For each external source IP, profile the request rate, total data transferred, and diversity of pages visited. Use time series analysis on request volume to detect sustained, high-frequency activity that deviates from normal user browsing patterns. Flag IPs that traverse a directory structure methodically or request an abnormally high number of pages per minute without loading associated resources (e.g., images, CSS), a common artifact of scraping tools. Create a box-plot of requests per IP to identify outliers."
                    },
                    {
                        "description": "A high volume of failed login attempts across many different user accounts originating from one or a few source IPs (password spraying) or against a single user account from many source IPs (credential stuffing).",
                        "data_sources": [
                            "Windows Event ID 4625",
                            "Windows Event ID 4624"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate Windows Event ID 4625 (failure) and 4624 (success) by source IP and target account. To detect password spraying, identify source IPs with a low number of failed attempts per user but a high number of users targeted (e.g., >20 users attempted in 1 hour). To detect credential stuffing, identify user accounts targeted by a high number of failed login attempts from a distributed set of source IPs. Use descriptive statistics and set thresholds to identify these patterns as outliers from baseline."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
