[
    {
        "information_requirement": "Is the adversary attempting to evade defenses by modifying cloud resource hierarchy?",
        "tactic_id": "TA0005",
        "tactic_name": "Defense-Evasion",
        "indicators": [
            {
                "technique_id": "T1666",
                "name": "Modify Cloud Resource Hierarchy",
                "evidence": [
                    {
                        "description": "Execution of scripts or tools on internal systems known to be associated with malicious cloud resource modification, or cloud administrative activity co-occurring with confirmed C2 communication from the same host.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for execution of processes where command lines match known malicious scripts or tools used for cloud attacks (maintain a list of such signatures, or use hashes if process hashing is available). Correlate cloud CLI/API activity (identified via Win EID 4688 command lines like `aws`, `az`, `gcloud` or Zeek conn.log to cloud management API endpoints) with prior or concurrent Zeek conn.log alerts indicating connections from the same internal host IP to known malicious C2 IP addresses or domains (from a CTI feed). Alert on such co-occurrences, treating them as high-confidence indicators of compromised host orchestrating cloud attacks."
                    },
                    {
                        "description": "Execution of specific, highly sensitive cloud provider CLI commands or identifiable API call patterns directly associated with altering cloud resource hierarchy from internal systems.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Strictly monitor Windows Event ID 4688 (Process Creation) for exact command-line arguments corresponding to high-risk hierarchy modification operations. Examples include: `aws organizations leave-organization`, `aws organizations create-account --email <new_account_email>`, `az account subscription transfer --subscription-id <victim_sub_id> --destination-tenant <attacker_tenant_id>`, `az account create --name <new_sub_name>`, `az management-group create --name <new_mg_name>`. For Zeek conn.log, if API calls are over HTTP/S and patterns are discernible (e.g., specific URI paths for these actions in `management.azure.com` or `organizations.amazonaws.com` traffic), monitor for such network patterns. Establish extremely tight baselines for any authorized users/systems performing these actions and alert on any execution outside of approved change windows or by unauthorized entities. These patterns should trigger high-severity alerts."
                    },
                    {
                        "description": "Anomalous invocation of cloud administrative CLI tools or direct API interactions related to resource hierarchy management from unexpected internal sources, at unusual times, or with atypical frequency compared to established baselines.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Profile baseline usage of cloud CLI tools (`aws`, `az`, `gcloud`) and direct connections to cloud management API endpoints (e.g., `organizations.amazonaws.com`, `management.azure.com`, `cloudresourcemanager.googleapis.com`) originating from internal systems using Windows Event ID 4688 (command line analysis) and Zeek conn.log (network traffic analysis). Identify authorized users, source systems/IPs, typical command sets/API paths, and normal hours/frequency of operation. Use statistical methods (e.g., Inter-Quartile Range (IQR) for outlier detection in frequency/timing, Z-scores for command counts per user/host, percentile analysis) to detect significant deviations. Examples include: hierarchy management commands executed from non-administrative workstations, by non-privileged user accounts, outside standard business hours, or at a significantly increased rate. Use time series analysis on Zeek conn.log volumes to these endpoints to detect unusual spikes in such activity."
                    },
                    {
                        "description": "A sequence of internal host activities involving reconnaissance of cloud credentials or configurations, followed by execution of unusual scripts or direct network calls to cloud management APIs, potentially bypassing standard CLI tools.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for suspicious sequences of process execution. For example: 1. Processes accessing local cloud credential stores (e.g., `type %USERPROFILE%\\.aws\\credentials`, `cat ~/.azure/azureProfile.json`). 2. Followed by execution of scripting engines (e.g., `powershell.exe -enc`, `python.exe`) that subsequently make network connections to cloud management API endpoints (identified via Zeek conn.log). Analyze script content if available, or look for command-line patterns suggesting direct SDK usage or raw HTTP requests (e.g. using `Invoke-RestMethod` or `curl` to cloud APIs), rather than standard CLI tools like `aws` or `az`. Use correlation analysis (based on host, user, and time window) to link credential access attempts with subsequent unusual network connections. Calculate entropy of command line arguments for scripting engines making cloud connections; high entropy might suggest obfuscated or encoded commands."
                    },
                    {
                        "description": "Initiation of cloud account detachment from an organization or subscription transfer commands from an internal host, potentially correlated with local attempts to disable security tools or logging.",
                        "data_sources": [
                            "Windows Event ID 4688",
                            "Zeek conn.log"
                        ],
                        "data_platforms": [
                            "Endpoints",
                            "Servers",
                            "Network devices"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Windows Event ID 4688 for commands initiating AWS `LeaveOrganization` or Azure subscription transfers (as detailed in pattern-based detection). Correlate the execution of these high-risk commands from an internal host with other suspicious local activities on the same host around the same time. Such activities could include: 1. Execution of commands to stop or tamper with local security software (e.g., `net stop WinDefend`, `sc config <service> start=disabled` via Event ID 4688). 2. Clearing or modifying local event logs (requires monitoring specific event log tampering event IDs if available, or process execution of `wevtutil.exe cl`). While direct confirmation of cloud-side impact requires cloud audit logs, these correlations on the endpoint side can indicate malicious intent and attempts to cover tracks when initiating hierarchy modifications. Use sequence analysis to establish these correlations."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
