[
    {
        "information_requirement": "Has the adversary executed commands on guest VMs using ESXi administration services?",
        "tactic_id": "TA0002",
        "tactic_name": "Execution",
        "indicators": [
            {
                "technique_id": "T1675",
                "name": "ESXi Administration Command",
                "evidence": [
                    {
                        "description": "Execution of commands on guest VMs containing specific atomic indicators, such as known malicious file hashes, IP addresses, domains, or command-line strings associated with ESXi-targeting threat actors.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor process creation events (Windows Event ID 4688) on guest VMs where the parent process is 'vmtoolsd.exe'. Scan the 'CommandLine' field of the child process for known malicious IP addresses, domain names, or specific hardcoded strings and commands (e.g., 'esxcli vm process kill', specific ransomware commands) obtained from a cyber threat intelligence (CTI) feed. Check the hash of any created files against a list of known malware hashes. Alert on any matches."
                    },
                    {
                        "description": "Observation of vmtoolsd.exe on a guest VM spawning a common shell or scripting interpreter (e.g., cmd.exe, powershell.exe, sh, bash), which is a known pattern for arbitrary command execution via ESXi.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Create a high-fidelity alert rule to trigger on any process creation event (Windows Event ID 4688) where the 'ParentProcessName' is 'vmtoolsd.exe' and the 'ProcessName' (or Image path) corresponds to a common command interpreter, such as 'cmd.exe', 'powershell.exe', 'pwsh.exe', 'wscript.exe', 'cscript.exe', 'sh.exe', or 'bash.exe'. This is a highly suspicious pattern and should be investigated immediately as it directly indicates malicious use of the Guest Operations API."
                    },
                    {
                        "description": "vmtoolsd.exe on a guest VM spawning any child process that is not on a pre-defined allowlist of expected VMware Tools operations, indicating anomalous execution behavior.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Establish a baseline of all normal child processes spawned by 'vmtoolsd.exe' across the environment; this list should be very small or empty. Use frequency analysis to identify all unique child processes over a baseline period. Create an alert to trigger on any new or rare child process spawned by 'vmtoolsd.exe' that is not on the established baseline allowlist. Use descriptive statistics (e.g., low frequency of occurrence, percentile analysis) on the prevalence of child processes to identify outliers."
                    },
                    {
                        "description": "Anomalous network activity from an ESXi management interface to a guest VM, correlated with subsequent suspicious process execution or outbound network connections from that same guest.",
                        "data_sources": [
                            "Zeek conn.log",
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Network devices",
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Monitor Zeek conn.log for connections from ESXi management IPs to guest VMs over the vSphere API ports (e.g., TCP/902, TCP/443). Correlate these connections with subsequent process creation events (Windows Event ID 4688) on the destination guest VM within a short time window (e.g., 1-5 minutes). Use correlation analysis to flag instances where an ESXi-to-guest connection is immediately followed by suspicious process activity (e.g., enumeration commands like 'whoami', 'net user'; credential dumping tools) or new outbound connections from the guest to unusual external destinations. Apply time series analysis to ESXi-to-guest communication volumes to detect anomalous spikes in activity."
                    },
                    {
                        "description": "A single ESXi host initiating administrative commands across multiple, disparate guest VMs in a short period, indicative of automated or scripted malicious activity like ransomware deployment.",
                        "data_sources": [
                            "Windows Event ID 4688"
                        ],
                        "data_platforms": [
                            "Servers"
                        ],
                        "nai": "Insert site-specific NAI here",
                        "action": "Aggregate process creation events (Windows Event ID 4688) where the parent process is 'vmtoolsd.exe' across all guest VMs. Group these events by the source ESXi host (requires guest-to-host mapping). Use time series and correlation analysis to identify a single ESXi host initiating commands on an unusually high number of distinct guest VMs within a short timeframe (e.g., >N VMs in M minutes). Calculate the entropy of guest VMs targeted by a single host; a sudden spike in entropy indicates broad, potentially malicious activity and should be flagged for urgent investigation."
                    }
                ]
            }
        ],
        "version": "2.1",
        "date_created": "2025-05-04",
        "last_updated": "2025-07-20",
        "contributors": [
            "Zachary Szewczyk"
        ]
    }
]
