[
  {
    "information_requirement": "Is the adversary attempting to evade defenses by hiding files or directories? (PIR)",
    "tactic_id": "TA0005",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1564.001",
        "name": "Hidden Files and Directories",
        "evidence": [
          {
            "description": "A process creation event is recorded where 'attrib.exe' is executed with command-line arguments containing '+h' to set the hidden file attribute.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Application Servers, Domain Controllers",
            "action": [
              "Construct a SIEM query to detect process creation events (Windows Event ID 4688) where the process name is 'attrib.exe' and the command line includes '+h'. To reduce false positives, create an exclusion list for known software deployment tools or administrative scripts by whitelisting specific parent processes (e.g., 'ccmexec.exe') or full, legitimate command lines.",
              "For each host, aggregate the count of 'attrib.exe +h' executions over a 24-hour period. Calculate the 99th percentile for this count across a 30-day rolling window for all hosts. Generate an alert when any host's daily count exceeds this established threshold, indicating an abnormal level of file hiding activity.",
              "Train a supervised classification model (e.g., Random Forest) to predict if an 'attrib.exe +h' execution is malicious. Extract features from Windows Event ID 4688, including: parent process name, user account name, time of day (categorical: e.g., 'business-hours', 'after-hours'), and the target file's directory depth and parent folder name (e.g., 'Temp', 'ProgramData'). Label data based on incident response findings to train the model."
            ]
          },
          {
            "description": "A PowerShell script block log is generated containing commands that modify an item's 'IsHidden' attribute to true or directly manipulate the 'Hidden' file attribute.",
            "data_sources": [
              "Windows Event ID 4104"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User workstations, Exchange Servers, Web Servers",
            "action": [
              "Deploy a SIEM detection rule that scans PowerShell script block logs (Windows Event ID 4104) for the regex pattern '(?i)(\\.Attributes.*\\+|Set-ItemProperty.*-Name\\s+IsHidden\\s+-Value\\s+\\$true)'. Alert on any matches, and build a suppression list for script hashes known to be part of legitimate system administration.",
              "For each PowerShell script block that sets a file to hidden, calculate its Shannon entropy score. Group these events by the executing user and compute the average entropy score per user over a 7-day period. Flag any user whose average entropy score deviates by more than 3 standard deviations from the mean of all users, as this suggests the use of highly obfuscated scripts.",
              "Implement a clustering algorithm (e.g., K-Means or DBSCAN) to group PowerShell scripts that hide files. Vectorize scripts using TF-IDF on the command content, and include metadata features like script length and the presence of encoding functions (e.g., 'FromBase64String'). Analyze clusters for outliers or small, distinct clusters that do not correspond to known administrative toolsets."
            ]
          },
          {
            "description": "A file or directory is created or renamed with a name beginning with a period ('.') on a Windows file system, captured by process or file access auditing.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User profile directories (e.g., 'C:\\Users\\<username>\\'), temporary directories ('%TEMP%'), web server root directories",
            "action": [
              "Create a query to search file creation events (Windows Event ID 4663 Object Name field) and process command lines (Windows Event ID 4688) for file paths containing a segment matching the regex '\\\\\\\\.[^\\\\\\\\\\s]+'. Since this is rare on Windows, alert on any match where the parent process is not a known developer tool (e.g., 'git.exe', 'ssh.exe').",
              "Generate a frequency table (stack count) of parent process names that create dot-files. Maintain a baseline of common, legitimate processes (e.g., 'git.exe', 'code.exe'). Any process creating dot-files that is not in the top 95% of the baseline frequency distribution should be considered anomalous and trigger an investigation.",
              "Apply a time-series anomaly detection algorithm (e.g., Seasonal Hybrid ESD) to the aggregated count of dot-file creation events per hour across the enterprise. The model should account for weekly seasonality (e.g., lower activity on weekends). Flag any time interval where the count is identified as an anomaly, suggesting a potential widespread campaign."
            ]
          },
          {
            "description": "A process, executing from a file path known to have the hidden attribute, initiates an outbound network connection to an external IP address.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (Firewall, Proxy), DNS servers, endpoint devices",
            "action": [
              "Correlate process creation events (Windows Event ID 4688) with network connection events (Zeek conn.log) using hostname and timestamp. Separately, maintain a state table of files marked as hidden from 'attrib.exe' or PowerShell events. Alert when a process from the correlated set has an image path that exists in the hidden files state table and connects to a non-RFC1918 address in Zeek conn.log.",
              "From the set of processes running from hidden locations and making network connections, analyze the requested domains in Zeek dns.log. Calculate the public suffix + 1 level domain (e.g., 'example.com') and compute the least-frequently seen domains across the enterprise over the last 30 days. Connections to domains in the bottom 5th percentile of frequency are highly suspicious and warrant an alert.",
              "Construct a heterogeneous graph with nodes for processes, files, remote IPs, and domains. Create edges for 'executed from', 'connected to', and 'resolved'. Enrich file nodes with a 'isHidden' boolean feature, and enrich IP/domain nodes with threat intelligence scores. Train a Graph Neural Network (GNN) to classify subgraphs (e.g., a process and its outbound connection) as malicious or benign, identifying complex patterns that simple rules would miss."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "2.3",
    "date_created": "2025-05-04",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]