[
  {
    "information_requirement": "Are unauthorized tools or files being transferred to critical ICS assets like HMIs, Engineering Workstations, or Historians? (PIR)",
    "tactic_id": "TA0109",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T0867",
        "name": "Lateral Tool Transfer",
        "evidence": [
          {
            "description": "A successful network file transfer event over SMB, FTP, or SFTP is observed where a file with an executable, script, or archive extension (e.g., .exe, .dll, .ps1, .bat, .zip, .rar) is transferred to a critical ICS asset from a source IP not on an approved whitelist for such transfers.",
            "data_sources": [
              "Zeek smb_files.log",
              "Zeek ftp.log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments at IT/OT zone boundaries, within the industrial control network (e.g., Level 2/3), and in DMZs where critical ICS assets (e.g., HMIs, Engineering Workstations, Historians) communicate.",
            "action": [
              "Create a SIEM rule to query Zeek logs (smb_files.log, ftp.log, files.log) for file transfers to IP addresses of critical ICS assets. Alert if the filename ends in a high-risk extension (.exe, .dll, .bin, .ps1, .bat, .sh, .zip, .rar) or the SMB path includes an administrative share (C$, ADMIN$) and the source IP (id.orig_h) is not on a pre-defined whitelist of authorized administrative or engineering systems.",
              "For all file transfers to critical ICS assets, establish a 30-day rolling baseline of file sizes and filename Shannon entropy. Generate an alert if a new transfer's file size or filename entropy exceeds the 98th percentile of the established baseline for that asset, indicating an unusually large/small file or a potentially obfuscated filename.",
              "Train a time-series anomaly detection model (e.g., Isolation Forest) on historical Zeek log data (volume, frequency, file types, source/destination pairs) for file transfers within the OT network. The model should learn normal operational patterns. Deploy the model to alert in real-time on significant deviations, such as a sudden spike in .exe transfers to HMIs or transfers from a source IP never before seen communicating with an Engineering Workstation."
            ]
          },
          {
            "description": "A Windows Event ID 5145 is generated on a critical ICS host, indicating a 'WriteData' or 'AppendData' access request to an administrative share (e.g., C$, ADMIN$) or sensitive system directory, where the source account or IP address is not on an approved whitelist for that specific host and share.",
            "data_sources": [
              "Windows Event ID 5145"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical ICS hosts (e.g., HMIs, Engineering Workstations, Historians, SCADA servers) where Windows security auditing for detailed file share access is enabled.",
            "action": [
              "Create a SIEM rule to filter for Windows Event ID 5145 on critical ICS hosts. Alert if the 'Accesses' field contains 'WriteData' or 'AppendData', the 'ShareName' is an administrative share (e.g., '\\\\*\\C$'), and the 'SourceAddress' or 'AccountName' is not on a pre-defined whitelist of authorized entities for that host.",
              "For each critical ICS host, establish a baseline of normal write activity (Event ID 5145) by unique 'SourceAddress'-'AccountName'-'ShareName' combinations. Alert when the hourly count of write events for a specific combination exceeds three standard deviations from its historical mean, or when a write event occurs from a 'SourceAddress' or 'AccountName' that has never previously written to that share on that host.",
              "Implement a User Behavior Analytics (UBA) model (e.g., One-Class SVM) trained on historical Windows Event ID 5145 data. The model should profile normal write access patterns based on attributes like source IP, account, share name, target path, and time of day. Alert when the model flags a write event with a high anomaly score, indicating a significant deviation from learned normal behavior."
            ]
          },
          {
            "description": "A Windows Event ID 5145 indicating a successful file write is followed within 300 seconds by a Windows Event ID 4688 for process creation on the same ICS host, where the file path from the write event exactly matches the new process name from the process creation event. This sequence is not associated with a whitelisted software deployment or maintenance activity.",
            "data_sources": [
              "Windows Event ID 5145",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Critical ICS hosts (e.g., HMIs, Engineering Workstations, Historians) with security event logging enabled for both detailed file share auditing and process creation.",
            "action": [
              "Create a high-priority SIEM correlation rule that triggers when a Windows Event ID 5145 (with 'WriteData' access) is observed on a host, and is followed within 300 seconds by a Windows Event ID 4688 on the same host, where EventID_5145.RelativeTargetName matches EventID_4688.NewProcessName. Exclude process names and source accounts associated with known, legitimate software update mechanisms.",
              "Analyze historical correlations of Event ID 5145 and 4688 to baseline legitimate file-write-then-execute behavior. Calculate the frequency of each unique process name executed from a network share. Generate an alert if a process is created from a share that has occurred fewer than 5 times in the past 90 days, or if the time delta between write and execution is below the 5th percentile of the baseline for known legitimate processes.",
              "Develop a sequence-based anomaly detection model (e.g., a Hidden Markov Model) to learn normal sequences of file writes (Event ID 5145) followed by process creation (Event ID 4688). The model should consider the source user, source host, target host, and process name. Alert when an observed sequence has a low probability score according to the model, indicating a rare or malicious sequence of lateral tool transfer and execution."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]