[
  {
    "information_requirement": "Is an adversary attempting to inhibit response functions by changing credentials on critical ICS devices? (PIR)",
    "tactic_id": "TA0107",
    "tactic_name": "Inhibit Response Function",
    "indicators": [
      {
        "technique_id": "T0892",
        "name": "Change Credential",
        "evidence": [
          {
            "description": "Execution of whitelisted ICS engineering software (e.g., TIA Portal.exe) on an Engineering Workstation (EWS) by a user account not on the authorized user list for that host; or a logon to the EWS (Windows Event ID 4624) from an IP address outside of established geofenced locations; or process execution (Windows Event ID 4688) occurring outside of baselined operational hours.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 4624"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Human-Machine Interfaces (HMIs), Active Directory Servers, and network gateways within the Process Control Network (PCN) and DMZ.",
            "action": [
              "Create and maintain a watchlist of critical ICS engineering executables (e.g., 'TIA Portal.exe', 'Studio5000.exe') and a corresponding allowlist of authorized user accounts per Engineering Workstation (EWS). Configure a SIEM rule to trigger an alert upon detection of a Windows Event ID 4688 (Process Creation) where the 'NewProcessName' is on the watchlist and the 'SubjectUserName' is not on the allowlist for that specific host.",
              "For each authorized user/EWS pair, baseline the hour-of-day for ICS software execution (from Windows Event ID 4688 'CreationTime') and source IP subnets for remote logons (from Windows Event ID 4624 'Source Network Address') over a 90-day period. Alert when a new execution's timestamp falls outside 2 standard deviations of the user's mean execution time, or when a remote logon originates from an IP address that does not fall within the user's established subnet baseline.",
              "Train a one-class SVM (Support Vector Machine) or Isolation Forest model on features from Windows Event IDs 4688 and 4624 for normal EWS activity. Features should include user, process name, hour of day, day of week, and for remote logons, source IP geolocation data (country, ISP). The model will learn a boundary of normal behavior. Classify new events in real-time and alert on any activity classified as an anomaly, indicating a deviation from established operational patterns."
            ]
          },
          {
            "description": "Observation of specific ICS protocol commands known to modify credentials directed at a PLC, RTU, or IED. This includes S7COMM 'Setup Communication' with password parameters, Modbus Function Code 'Write Multiple Registers' targeting known credential memory addresses, or EtherNet/IP 'Set Attribute Single' on security objects, originating from an unauthorized source or outside a scheduled maintenance window.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network segments within the Process Control Network (PCN) where Engineering Workstations (EWS) communicate with Programmable Logic Controllers (PLCs), Remote Terminal Units (RTUs), or Intelligent Electronic Devices (IEDs), including network taps at aggregation switches and firewalls separating these zones.",
            "action": [
              "Deploy a SIEM rule that alerts when Zeek logs (s7comm.log, modbus.log, enip.log) show a known credential modification command. For S7COMM, detect 'Setup Communication' (function 0xf0) with a PDU setup type for password protection. For Modbus, detect function code '16' (Write Multiple Registers) to specific register addresses documented by the vendor for credentials. For EtherNet/IP, detect 'Set_Attribute_Single' for security-related class IDs. Correlate with a maintenance schedule database; suppress alerts during authorized windows.",
              "For each EWS-to-controller communication pair, baseline the frequency distribution of all observed ICS protocol function codes over a 30-day period using Zeek logs. Calculate the relative frequency of each function code in a 1-hour rolling window. Alert when a credential-modifying function code, which normally has a frequency near zero (e.g., below the 1st percentile), is detected, indicating a rare and suspicious command.",
              "For each EWS-to-controller pair, model the sequence of ICS protocol function codes as a categorical time series. Calculate the Shannon entropy of the function code distribution within a 5-minute sliding window. Train a time-series anomaly detection model (e.g., LSTM autoencoder) on the entropy values. Alert when the model flags a significant drop in entropy (e.g., a reconstruction error above the 98th percentile), which indicates a low-complexity, repetitive, and potentially malicious command sequence."
            ]
          },
          {
            "description": "A correlated sequence of events within a 15-minute window consisting of: 1) A successful remote logon (Windows Event ID 4624, Logon Type 10) to an EWS from an anomalous source IP. 2) The execution of ICS engineering software (Windows Event ID 4688) on that EWS by the logged-on user. 3) Network traffic from the EWS to a critical controller containing ICS protocol commands for credential modification, as observed in Zeek logs.",
            "data_sources": [
              "Windows Event ID 4624",
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek s7comm.log",
              "Zeek modbus.log",
              "Zeek enip.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Engineering Workstations (EWS), Active Directory/Authentication Servers, VPN concentrators, and network perimeter devices between the IT and OT networks.",
            "action": [
              "Build a multi-stage correlation rule in a SIEM. Stage 1: Trigger on Windows Event ID 4624 (LogonType 10) on an EWS from an IP not on an approved remote access list. Stage 2: If Stage 1 triggers, look for a Windows Event ID 4688 on the same EWS by the same user for a known engineering application within 5 minutes. Stage 3: If Stage 2 triggers, look for Zeek logs showing traffic from the EWS to a controller with a credential-change function code within 10 minutes. A high-priority alert is generated if all three stages are met.",
              "For each EWS user, create a multi-feature profile using historical data (Windows events 4624, 4688; Zeek logs). The profile includes: source IP reputation/rarity, login time-of-day Z-score, process execution frequency, and ICS command rarity score. For each new chain of events (logon -> process -> command), calculate a composite risk score by summing the individual feature scores. Alert when the composite score for a sequence exceeds the 99th percentile of all scores observed in the last 30 days.",
              "Implement a graph-based anomaly detection model where nodes represent users, EWS hosts, and controllers, and edges represent interactions (logon, process execution, network connection). Enrich edges with features like time, protocol commands, and source IP geolocation. Train the model on historical graph data to learn normal interaction patterns and subgraphs. Alert on the emergence of anomalous subgraphs, such as a user from a rare location logging into an EWS and immediately sending rare commands to a controller."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]