[
  {
    "information_requirement": "Is an adversary attempting to discover running processes on our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1424",
        "name": "Process Discovery",
        "evidence": [
          {
            "description": "A mobile device exfiltrates a process list over the network. This is observed as an outbound HTTP/S POST request with an anomalous Content-Type (e.g., 'application/octet-stream' instead of 'application/json') and a high-entropy body (e.g., > 4.5 Shannon entropy), or as a DNS query where a subdomain label length exceeds the 99th percentile of observed lengths for the environment, suggesting encoded data.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, network egress points, DNS servers, VPN concentrators, web proxies, Cloud Access Security Broker (CASB) logs.",
            "action": [
              "Deploy a SIEM rule that triggers when Zeek conn.log shows a connection from a mobile device IP range to a destination IP or domain on a C2 threat intelligence list AND Zeek http.log shows a corresponding HTTP POST request to that destination.",
              "Implement a scheduled query that, for all outbound HTTP POST requests from the mobile VLAN, calculates the Shannon entropy of the POST body (from Zeek files.log or full packet capture) and the URI length. For all DNS queries (Zeek dns.log), calculate the length and character set entropy of the query name. Establish 30-day rolling baselines for these metrics per user and per device. Generate an alert when a value exceeds the 99.5th percentile of its respective baseline, especially if the destination is a newly observed domain (NOD).",
              "Develop and deploy a Random Forest classifier to identify C2 exfiltration. Use features from Zeek logs including: request body entropy, URI length, query name length, query name entropy, connection duration, bytes sent, destination port, domain age, destination ASN rarity, and TLS cipher suite popularity. Augment this with a separate LSTM autoencoder trained on a time-series of bytes sent per device per hour to detect anomalous spikes in outbound traffic volume that may represent the exfiltration event."
            ]
          },
          {
            "description": "On a host computer connected to a mobile device via USB, the Android Debug Bridge process (adb.exe) spawns a child process associated with process enumeration (e.g., 'tasklist.exe', 'ps.exe', or 'powershell.exe' with 'Get-Process'). This is identified by a Windows Event ID 4688 where ParentProcessName is 'adb.exe', NewProcessName is a known enumeration utility, and the CommandLine field contains relevant arguments.",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows PowerShell Logging (Event ID 4104)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Employee workstations, developer machines, privileged user workstations, Jump servers, Virtual Desktop Infrastructure (VDI) instances.",
            "action": [
              "Configure a real-time SIEM alert for any Windows Event ID 4688 where ParentProcessName ends with 'adb.exe' and NewProcessName is one of 'tasklist.exe', 'ps.exe', 'wmic.exe', or 'powershell.exe'. For PowerShell, the rule must inspect the command line arguments from the event or associated PowerShell logs (Event ID 4104) for 'Get-Process', 'gps', or 'ps'.",
              "Create a baseline of parent-child process relationships for all hosts where 'adb.exe' is present. Calculate an environmental prevalence score for each parent-child pair (e.g., the percentage of hosts with adb.exe that have observed the ('adb.exe', 'tasklist.exe') relationship). Trigger an alert when a pair with a prevalence score below a defined threshold (e.g., <1%) is observed, or if any such pair is observed on a host not belonging to a pre-defined 'Developer Workstations' security group.",
              "Apply an Isolation Forest model to Windows Event ID 4688 data to identify anomalous process lineage. Features for the model should include ParentProcessName, NewProcessName, user context, host security group (e.g., developer vs. non-developer), and command line argument length and entropy. The model will flag events such as 'adb.exe' spawning 'tasklist.exe' on a finance team member's machine as a high-scoring outlier."
            ]
          },
          {
            "description": "A mobile device establishes network connections to domains, IPs, or URLs associated with mobile device rooting (Android) or jailbreaking (iOS) toolkits. This is observed in network logs as DNS queries for known malicious domains, direct-to-IP connections to non-standard ports, or specific URI patterns in HTTP requests, which are often precursors to enabling process discovery on modern OS versions.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log",
              "Mobile Device Management (MDM) logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, guest Wi-Fi networks, Mobile Device Management (MDM) platforms, DNS resolvers, Cloud Access Security Broker (CASB) logs.",
            "action": [
              "Integrate a threat intelligence feed of domains, IPs, and JA3/JA3S hashes associated with mobile rooting/jailbreaking tools. Create a real-time SIEM rule to match DNS queries (dns.log), HTTP host headers (http.log), TLS SNI fields (ssl.log), and destination IPs (conn.log) from the mobile device IP range against this feed. Any match triggers an immediate, high-severity alert.",
              "Monitor for high-frequency DNS queries to Newly Observed Domains (NODs). Generate an alert if a device queries >10 NODs (where domain age < 30 days) within a 5-minute window, especially if the domains use uncommon TLDs (e.g., .xyz, .biz, .club). Correlate this with a high count (>95th percentile) of non-standard port connections (Zeek conn.log) or connections using self-signed TLS certificates (Zeek ssl.log) from the same device in the same time window.",
              "Build a domain reputation model using a gradient boosting classifier (e.g., XGBoost) to score domains in real time. Features should include domain age, DNS query-to-answer ratio, TTL value, presence on threat feeds, TLS certificate issuer, and lexical features of the domain name (e.g., length, entropy). Use a time-series anomaly detection model (e.g., SARIMA) to flag any device whose average destination reputation score drops significantly over a rolling time window. Correlate these network-based flags with 'rooted' or 'jailbroken' status alerts from an integrated Mobile Device Management (MDM) platform to confirm the device state."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]