[
  {
    "information_requirement": "Has a corporate mobile application been compromised through its supply chain? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1474",
        "name": "Supply Chain Compromise",
        "evidence": [
          {
            "description": "A managed mobile application, within 24 hours of an MDM-pushed update, initiates network connections exhibiting one or more of the following anomalous characteristics: (1) DNS queries (Zeek dns.log) for domains not present in the application's 90-day baseline; (2) TLS connections (Zeek ssl.log) with a self-signed certificate, an issuer not on an approved list, or a JA3/JA3S hash with an organizational rarity below 1%; (3) Direct-to-IP connections (Zeek conn.log) where the destination is not part of the established application infrastructure.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, corporate Wi-Fi segments for mobile devices, VPN concentrators, and forward/recursive DNS resolvers.",
            "action": [
              "Correlate MDM logs identifying an application update with network logs from the affected devices for the subsequent 24-hour period. Compare destination domains (from Zeek dns.log) and destination IPs (from Zeek conn.log) against a threat intelligence feed of known mobile malware command and control (C2) servers. Generate a high-severity alert on any match.",
              "For each managed application, maintain a 90-day rolling baseline of known-good destination domains, TLS certificate issuers, and JA3/JA3S hashes. After an update, alert if the application contacts a new domain, uses a self-signed certificate, uses a certificate from an untrusted issuer, or if the connection's JA3/JA3S hash is present on less than 1% of monitored devices.",
              "Train an autoencoder neural network on feature vectors representing normal network connections for each application (features: destination port, protocol, JA3S hash, connection duration, bytes_in, bytes_out). After an update, process new connection data through the model. A high reconstruction error, which indicates a deviation from the learned normal behavior, flags a potential C2 channel and should generate a medium-severity alert for investigation."
            ]
          },
          {
            "description": "During a mobile app build cycle, a process on a developer workstation or CI/CD server, such as a compiler or build script, spawns a child process (Windows Event ID 4688) that initiates a network connection (Windows Event ID 5156 and Zeek conn.log) to an external IP address not on a pre-approved allowlist of code repositories, package managers, or update services. The child process may exhibit high-entropy command-line arguments or represent an unusual child for its parent process (e.g., MSBuild.exe spawning bitsadmin.exe).",
            "data_sources": [
              "Windows Event ID 4688",
              "Windows Event ID 5156",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint logging on developer workstations, virtual desktop infrastructure (VDI) used for development, and continuous integration/continuous delivery (CI/CD) pipeline servers. Network traffic from the development subnet.",
            "action": [
              "On build systems, monitor for process creation events (Windows Event ID 4688) where a build tool (e.g., xcodebuild, gradle, MSBuild.exe) spawns a networking utility (e.g., curl.exe, powershell.exe, wget.exe). Correlate the Process ID with network connection events (Windows Event ID 5156 or Zeek conn.log). If the destination IP is on a known C2 threat intelligence list or is not on the corporate allowlist for development tools, generate a critical alert.",
              "Establish a 30-day baseline of all parent-child process relationships on build servers and calculate the frequency of each pair; alert on any new or statistically rare pair (e.g., bottom 0.5% frequency). For processes such as powershell.exe or cmd.exe, calculate the Shannon entropy of the command line arguments; flag any instance with an entropy score greater than 4.5 as potentially obfuscated and requiring review.",
              "Train a gradient boosting classifier (e.g., XGBoost) to predict if a process chain is malicious. Use features including parent process name, child process name, command-line argument length, command-line entropy, presence of IP addresses in arguments, and correlated network connection data (destination port, bytes out, protocol). A classification of 'malicious' with high confidence should trigger an automated host quarantine for immediate investigation."
            ]
          },
          {
            "description": "In the 24 hours following an MDM-pushed update, the aggregate network traffic profile for the updated application version deviates significantly from its historical baseline. Specific deviations include: (1) a sustained increase in data egress (total orig_bytes in Zeek conn.log) that exceeds the 99th percentile of the pre-update 30-day baseline; (2) a sharp increase in the rate of new, unique destination IP addresses contacted per hour; or (3) a statistically significant change in the distribution of connection protocols or destination ports.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM platform logs, network flow data from internet gateways, traffic mirrored from corporate Wi-Fi controllers, and logs from cloud access security brokers (CASBs) or secure web gateways (SWGs) that proxy mobile traffic.",
            "action": [
              "Define a device watchlist using MDM logs for a specific application update. Query Zeek logs for all connections from this watchlist post-update. Compare all destination domains and IPs against a threat intelligence feed of known malicious mobile infrastructure and generate a high-priority alert on any match.",
              "For each application, maintain a 30-day rolling baseline of hourly network metrics, including the 99th percentile for total orig_bytes and the count of unique destination IPs. Alert if the post-update application traffic exceeds these percentile thresholds for more than two consecutive hours. Use a two-sample Kolmogorov-Smirnov (K-S) test to compare the distribution of connection durations from the 24 hours pre-update with the 24 hours post-update; a p-value below 0.01 indicates a significant change warranting investigation.",
              "For each application, train a time-series forecasting model (e.g., Prophet, LSTM) on key aggregate metrics like total data volume, DNS query rate, and unique IP count. After an update, feed the actual observed metrics into the model. If observed values consistently fall outside the model's 99% confidence interval, this signals an anomaly and should trigger an alert for potential low-and-slow data exfiltration or periodic C2 beaconing."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]