[
  {
    "information_requirement": "Is an adversary using non-standard or suspicious asymmetric cryptography for command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1521.002",
        "name": "Asymmetric Cryptography",
        "evidence": [
          {
            "description": "A TLS session from a mobile device IP address has a certificate that is self-signed, has an unusually short validity period, or is issued by a known-malicious certificate authority. Specifically, evidence includes a TLS connection where: 1) the 'validation_status' field in Zeek ssl.log is 'self-signed'; 2) the certificate's validity duration is in the bottom 5th percentile of all observed mobile device TLS sessions over a 30-day baseline; or 3) the certificate's 'issuer' or 'subject' field matches a known malicious indicator.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek conn.log",
              "Zeek ja3.log",
              "Zeek ja3s.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, VPN concentrators, MDM (Mobile Device Management) proxy servers, Cloud Access Security Brokers (CASB), Cellular network gateways (for corporate-liable devices backhauling traffic)",
            "action": [
              "Create a detection rule to query Zeek ssl.log records where the 'issuer' or 'subject' field exactly matches an entry in a threat intelligence feed of malicious certificate CAs and subjects. Correlate with Zeek conn.log using the 'uid' field to confirm the source IP ('id.orig_h') is from a designated mobile device IP range.",
              "For all TLS sessions originating from mobile IP ranges, calculate the certificate validity duration in days by subtracting 'not_valid_before' from 'not_valid_after'. Maintain a 30-day rolling baseline distribution of these durations. Create an alert for any new session where the 'validation_status' is 'self-signed' OR the certificate duration falls below the 5th percentile of the baseline. Enrich alerts with connection data (total bytes, duration) from Zeek conn.log to prioritize investigation.",
              "Develop and deploy a Random Forest classification model to produce a risk score for each TLS session. Engineer features from Zeek logs, including: certificate validity duration, public key length, TLS version ('version' from ssl.log), selected cipher suite, JA3 hash ('ja3' from ja3.log), JA3S hash ('ja3s' from ja3s.log), and connection properties ('duration', 'orig_bytes', 'resp_bytes' from conn.log). Train the model on a labeled dataset of benign and malicious TLS sessions. In production, use the model's probability score to rank suspicious sessions for analyst review."
            ]
          },
          {
            "description": "A series of encrypted network connections from a single mobile device to a single external destination IP and port exhibits highly regular, periodic 'heartbeat' behavior. This is evidenced by a low statistical variance in the time between connections and the amount of data transferred in each connection, or the destination IP is a known C2 server.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, MDM (Mobile Device Management) proxy servers, Corporate Wi-Fi gateways, Cellular network gateways (for corporate-liable devices backhauling traffic)",
            "action": [
              "Implement a continuous query against Zeek conn.log data where the destination IP ('id.resp_h') matches a threat intelligence feed of known C2 servers and the source IP ('id.orig_h') originates from a corporate mobile device IP range. Trigger a high-priority alert for any match.",
              "In 1-hour intervals, group Zeek conn.log records by the 4-tuple (source IP, destination IP, destination port, protocol). For each group with more than 10 connections, calculate the coefficient of variation (Standard Deviation / Mean) for two data series: 1) the inter-arrival time between connections and 2) the total bytes ('orig_bytes' + 'resp_bytes') per connection. Generate an alert for groups where both coefficients are below the 1st percentile of their respective historical distributions, indicating abnormally regular, machine-generated traffic.",
              "For each unique source-destination-port flow, implement a time-series anomaly detection model using an LSTM (Long Short-Term Memory) autoencoder. Create a multivariate time series from Zeek conn.log features including inter-arrival time, connection duration, and total bytes. Train the model on a baseline of known benign traffic patterns. A high reconstruction error score on live traffic indicates a significant deviation from normalcy, flagging a potential C2 beacon for investigation."
            ]
          },
          {
            "description": "High-entropy data is observed within DNS query names or HTTP User-Agent strings originating from mobile devices. This suggests data is being encoded within these fields for C2, as evidenced by a Shannon entropy value that is a statistical outlier compared to a historical baseline of legitimate traffic.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Forward web proxies, Reverse proxies, Cloud Access Security Brokers (CASB)",
            "action": [
              "Scan Zeek dns.log records for queries matching regular expressions for known DGA patterns or domains on a threat intelligence list. Concurrently, scan Zeek http.log records for User-Agent strings matching a blocklist of known malicious or non-standard agents. Generate an alert on any match.",
              "For each DNS query in Zeek dns.log, calculate the Shannon entropy of the query name. For each request in Zeek http.log, calculate the Shannon entropy of the User-Agent string. Compare each calculated value against a 30-day rolling baseline for its respective field. Flag any value exceeding the 99th percentile for further analysis. Validate findings by performing a Chi-squared goodness-of-fit test on the character frequency distribution of the flagged string against a baseline of benign strings; a p-value less than 0.01 confirms abnormality.",
              "Employ a density-based clustering algorithm like DBSCAN to identify anomalous DNS and HTTP requests. From Zeek dns.log, engineer features such as query length, subdomain count, query entropy, and the ratio of numeric to alphabetic characters. From Zeek http.log, engineer features like User-Agent length and entropy. Apply DBSCAN to this combined feature space; points classified as noise are outliers and should be investigated as potential C2 activity."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]