[
  {
    "information_requirement": "Is an adversary abusing elevation control mechanisms to escalate privileges on managed mobile devices? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1626",
        "name": "Abuse Elevation Control Mechanism",
        "evidence": [
          {
            "description": "A device administrator privilege grant event is observed for a mobile application whose package ID is either not present on a pre-approved allowlist or whose installation count across all managed devices falls below a statistical rarity threshold (e.g., 5th percentile).",
            "data_sources": [
              "MDM Device Administrator Event Log",
              "MDM Application Inventory Report",
              "Corporate App Store Metadata"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized MDM/EMM log platform, Corporate Application Store database, and the population of managed mobile devices.",
            "action": [
              "Using a SIEM query, search MDM logs for all device administrator grant events. For each event, perform a lookup to compare the application's package ID against a curated allowlist of approved administrative applications. Generate a high-severity alert for any application package ID not found on the allowlist.",
              "From MDM application inventory reports, periodically calculate the prevalence of every application package ID (defined as count of installs / total devices). For each new device administrator grant event, look up the application's prevalence score. Generate a medium-severity alert if the prevalence score falls within the bottom 5th percentile.",
              "Train and deploy a logistic regression classifier on historical administrator grant events using features such as: application category, developer signature reputation, number of requested permissions, application prevalence score, and application age. Score all new grant events in real-time and automatically escalate events with a predicted malicious probability score greater than 0.85 for immediate analyst review."
            ]
          },
          {
            "description": "Within 5 minutes following a device administrator privilege grant event on a mobile device, the same device is observed initiating network connections to IP addresses or domains on a threat intelligence blocklist, or the device's network traffic exhibits anomalous characteristics such as high-entropy DNS queries or unusually large data transfers.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM Device Administrator Event Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network TAPs or switch SPAN ports feeding Zeek sensors at the network egress, centralized DNS server logs, and the centralized MDM/EMM log platform.",
            "action": [
              "Correlate MDM device administrator grant events with network logs (Zeek conn.log, Zeek dns.log) by joining on the device's source IP within a 5-minute time window. Scan all `query` fields in dns.log and `id.resp_h` fields in conn.log against a threat intelligence feed of known malicious domains and IPs. Generate a high-severity alert that includes both the privilege grant event and the matching threat intelligence indicator.",
              "For the 5-minute window following a grant event, calculate the Shannon entropy of all FQDNs requested by the device in Zeek dns.log; an entropy score above 4.5 suggests DGA activity and should trigger an alert. Concurrently, calculate the sum of outbound bytes (`resp_bytes` in Zeek conn.log) and alert if the total volume exceeds the 99th percentile of the device's 30-day historical baseline for a 5-minute window.",
              "Deploy a time-series anomaly detection model, such as an LSTM autoencoder, trained on each device's historical network telemetry (e.g., bytes out, connection count, protocol mix per minute). Following a privilege grant event, analyze the device's network data for the subsequent 5-minute window using the model. A high reconstruction error, indicating a significant deviation from the learned normal behavior, should be flagged as an anomaly and escalated for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]