[
  {
    "information_requirement": "Is an adversary collecting protected user data from corporate mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1636",
        "name": "Protected User Data",
        "evidence": [
          {
            "description": "An installed mobile application's manifest or declared entitlements requests a combination of permissions defined as 'dangerous' by the OS vendor (e.g., READ_CONTACTS, READ_SMS, ACCESS_FINE_LOCATION) that either matches a signature of known malware or is statistically rare (e.g., present in <1% of applications) for its declared application category.",
            "data_sources": [
              "MDM Application Inventory Export (CSV/JSON)",
              "Application Vetting Service Report (JSON)",
              "Mobile Threat Intelligence Feed (STIX/TAXII)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform, Corporate App Store, Application Vetting System, Corporate-managed mobile endpoints",
            "action": [
              "For each application in the MDM inventory, compare its package name, file hash, and signing certificate against a mobile threat intelligence feed. Generate a critical alert upon any match to a known malicious indicator.",
              "For each application category (e.g., 'Productivity', 'Games'), calculate the prevalence of every requested permission across all enterprise-managed apps in that category. For a given app, calculate a risk score by summing the inverse prevalence of its requested permissions (rarer permissions yield higher scores). Flag applications with a total risk score in the 95th percentile or higher for their category for manual review.",
              "Train a classification model (e.g., Random Forest, Gradient Boosting) on a labeled dataset of benign and malicious application manifests. Engineer features including a one-hot encoded vector of permissions, a count of 'dangerous' permissions, and the application's declared category. Deploy the model to score all new and updated applications; investigate any app classified as 'malicious' with a model confidence score greater than $$ 0.90 $$."
            ]
          },
          {
            "description": "A mobile device's network traffic shows a data upload, measured by originated bytes, that is anomalously large compared to its own historical baseline, and the destination is suspicious. Destination suspiciousness is defined by one or more of the following: the destination IP/domain is on a threat intelligence blocklist, the domain was registered within the last 30 days, or the domain name has a high Shannon entropy score ($$ > 3.5 $$).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Feed (STIX/TAXII)",
              "WHOIS Lookup Service/API"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, VPN concentrators, DNS resolvers",
            "action": [
              "From Zeek logs, filter for connections originating from the mobile device IP address range. Join `conn.log` with `dns.log` on the UID. Alert immediately if the destination IP (`id.resp_h`) or resolved domain name (`query`) matches a known C2 or data exfiltration endpoint from a threat intelligence feed.",
              "For each mobile device, establish a 30-day rolling baseline of hourly outbound data volume (`orig_bytes`) using mean and standard deviation. Alert when a single connection's `orig_bytes` exceeds 3 standard deviations from the mean for that hour of the day. For the associated domain from `dns.log`, calculate its Shannon entropy and use a WHOIS lookup to find the domain registration date. Prioritize alerts where a high-volume anomaly co-occurs with a domain entropy score $$ > 3.5 $$ and a domain age $$ < 30 $$ days.",
              "Implement a time-series anomaly detection model (e.g., LSTM Autoencoder) on per-device, per-hour aggregated `orig_bytes` from `Zeek conn.log`. Include features such as day-of-week and hour-of-day. Flag time intervals where the model's reconstruction error exceeds a dynamic threshold (e.g., the 99th percentile of historical errors). Correlate these network anomalies with suspicious DNS query features (e.g., high entropy, DGA prediction score) to increase alert fidelity."
            ]
          },
          {
            "description": "An application process on a managed mobile endpoint accesses a protected data store (e.g., contacts, calendar) and, within a 10-second window, initiates an outbound network connection to a destination IP or domain that is not on a pre-established allowlist for that specific application or application category.",
            "data_sources": [
              "Mobile EDR API Monitoring Log",
              "Mobile EDR Network Flow Log",
              "Zeek conn.log",
              "Application Network Behavior Allowlist"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile endpoints, Network egress points",
            "action": [
              "Using Mobile EDR logs, create a correlation rule that triggers when a process makes an API call to a protected data source (e.g., Android ContentProvider for `ContactsContract`) and subsequently creates a network socket connection within a 10-second window. Correlate the destination IP with threat intelligence feeds and an application-specific network allowlist. Alert on a match to the threat feed or if the destination is not on the allowlist.",
              "For each application, build a baseline of 'normal' network destinations seen over a 30-day period from EDR or Zeek logs. Create a 'first-seen' rule that flags any sequence where a protected data access event is followed by a network connection to a destination IP/domain not present in that application's historical baseline. Escalate for review if the new destination is also newly registered or has high domain entropy.",
              "Model application behavior as a graph where nodes represent entities (e.g., app process, API call, destination IP) and edges represent the sequence of actions. Use a graph-based anomaly detection algorithm (e.g., GraphSAGE) to learn a model of 'normal' activity subgraphs. Score new activity based on its deviation from learned normal structures. A subgraph representing the flow `Process -> Contacts API -> Rare External IP` would receive a high anomaly score, triggering an alert."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]