[
  {
    "information_requirement": "Is an adversary attempting to remove their tools from a compromised mobile device to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.001",
        "name": "Uninstall Malicious Application",
        "evidence": [
          {
            "description": "A series of network connections from a single mobile device IP address to a consistent external destination, characterized by a highly regular inter-arrival time (e.g., coefficient of variation < 0.2) and consistent data volume (e.g., standard deviation of bytes transferred < 10% of mean), unexpectedly stops for a period exceeding 3 standard deviations of its established inter-arrival time. This cessation occurs without a corresponding device shutdown or network disconnection event logged in the Mobile Device Management (MDM) platform.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Mobile Device Management (MDM) Device Status Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN concentrators, and DNS resolvers servicing mobile devices.",
            "action": [
              "Ingest a threat intelligence feed of known C2 servers. Configure a SIEM rule to alert when a `id.orig_h` identified as a corporate mobile device in Zeek conn.log communicates with a destination IP (`id.resp_h`) from the C2 feed, or when a `query` in Zeek dns.log matches a C2 domain from the feed.",
              "For each unique source-destination IP pair in Zeek conn.log, calculate the rolling 24-hour coefficient of variation for connection `duration` and `orig_bytes` to identify potential beacons (e.g., coefficient < 0.2). For identified beacons, calculate the mean and standard deviation of inter-arrival time. Generate a high-priority alert if a beaconing series stops for a period exceeding its mean inter-arrival time plus 3 standard deviations, and no corresponding MDM device shutdown event is observed.",
              "Utilize a time series anomaly detection model (e.g., Isolation Forest or Prophet) on the `duration` and `orig_bytes` of statistically identified beaconing connections from Zeek conn.log for each mobile device. Train the model to establish a baseline for normal beaconing patterns. If the model detects a cessation of expected activity that falls outside the 99% prediction interval, classify this as a 'Beacon Cessation Anomaly' and trigger an alert."
            ]
          },
          {
            "description": "A `MobileApplicationUninstall` event is recorded in the Mobile Device Management (MDM) platform audit logs for a corporate-managed mobile device, but no corresponding `ApprovedChangeRequest` or `ServiceTicket` for that specific application and device exists in the IT Service Management (ITSM) system logs within a 24-hour lookback window.",
            "data_sources": [
              "MDM Platform Audit Logs",
              "IT Service Management (ITSM) System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Centralized SIEM/log aggregators, servers hosting the Mobile Device Management (MDM) platform, and servers hosting the IT Service Management (ITSM) platform.",
            "action": [
              "Configure a SIEM rule to parse MDM Platform Audit Logs for events with `event_type='MobileApplicationUninstall'`. For each detected uninstall, automatically query the ITSM system's API or database to verify an authorized change request for the given application and device ID within the last 24 hours. Generate a high-priority alert if no matching approved request is found.",
              "For all unauthorized uninstalls identified via the symbolic method, calculate the daily count of unique unauthorized uninstall events per device. Establish a 30-day moving average and standard deviation for this metric for each device. Flag any device whose daily count of unauthorized uninstalls exceeds the moving average by more than 3 standard deviations as a 'Suspicious Uninstall Spike'.",
              "Train a supervised classification model (e.g., Gradient Boosting or Random Forest) using historical MDM uninstall events, labeled as 'authorized' or 'unauthorized' based on ITSM correlation. Use features for the model including application name, time of day, day of week, device model, and time since installation. Apply the trained model to new unauthorized uninstall events and flag events with a model confidence score above the 95th percentile for 'unauthorized' as 'High-Confidence Malicious Uninstall'."
            ]
          },
          {
            "description": "A mobile device's network traffic, observed in Zeek logs, matches a known Indicator of Compromise (IOC) for a mobile rooting toolkit (e.g., specific domains, IP addresses). This event is observed within a 60-minute window prior to the unexpected cessation of a previously established beaconing communication from the same mobile device, as identified by the absence of expected traffic patterns.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Platform Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, network gateways (e.g., firewalls, proxies), and VPN concentrators servicing the mobile device fleet.",
            "action": [
              "Configure a SIEM rule to ingest Threat Intelligence Platform Feeds containing IOCs for mobile rooting toolkits. Create an alert whenever a mobile device's traffic in Zeek conn.log or Zeek dns.log matches a known rooting toolkit IOC. Tag these events as `RootingToolkit_Communication`.",
              "Upon a `RootingToolkit_Communication` alert for a specific device, initiate a statistical analysis of subsequent alert timings. Calculate the time difference between the rooting IOC alert and any 'Beacon Cessation Anomaly' alert for that same device. If this time difference falls within the 1st percentile of all inter-alert timings for the device (or a fixed window like 60 minutes), escalate the alert priority to 'Critical', indicating a statistically rare and rapid sequence of events.",
              "Develop a sequence anomaly detection model (e.g., using a Hidden Markov Model or Recurrent Neural Network) to analyze event streams for each mobile device. Define a high-risk sequence as a `RootingToolkit_Communication` event followed by a `BeaconCessationAnomaly` within a 60-minute window. Train the model on historical event sequences and trigger a 'High-Confidence Malicious Uninstall Chain' alert when this specific sequence is observed with high probability."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]