[
  {
    "information_requirement": "Is an adversary performing an Adversary-in-the-Middle (AitM) attack to intercept or manipulate traffic from corporate mobile devices?",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1638",
        "name": "Adversary-in-the-Middle",
        "evidence": [
          {
            "description": "A TLS connection from a managed mobile device presents a certificate with a validation status other than 'ok' in Zeek's ssl.log. This is evidence of potential TLS interception, where an adversary presents a fraudulent certificate. High-risk statuses include 'self signed certificate in certificate chain', 'unable to get local issuer certificate', 'certificate has expired', and 'SSL_WRONG_VERSION_NUMBER'.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, network egress points, DNS resolvers, network sensor collectors (e.g., Zeek cluster), and Certificate Authority infrastructure.",
            "action": [
              "Create a SIEM rule to join Zeek ssl.log and x509.log on the 'uid' field. Trigger a high-priority alert when a connection from a mobile device IP range has a 'validation_status' not equal to 'ok'. Enrich the alert with the certificate issuer (x509.log:certificate.issuer) and subject (x509.log:certificate.subject). Check the issuer against an internal list of trusted CAs and a threat intelligence feed of malicious issuers.",
              "For each mobile device IP, establish a 30-day rolling baseline of the ratio of error-status TLS connections to total TLS connections. Alert if this ratio for any single device exceeds the 99th percentile of its own history. Separately, monitor the hourly count of non-'ok' statuses for the entire mobile subnet and alert if the count exceeds 3 standard deviations from the established seasonal baseline.",
              "Train a time-series anomaly detection model (e.g., Prophet or an LSTM-based autoencoder) on the volume and type of certificate validation errors per network segment. Features should include server_name (SNI), validation_status, issuer, and source/destination geo-data. An unexplained spike in the error count that deviates significantly from the forecasted model's confidence interval should trigger an alert for potential widespread AiTM activity."
            ]
          },
          {
            "description": "A managed mobile device establishes a network connection consistent with a VPN tunnel (e.g., using ports UDP 500/4500 for IPsec, TCP 1194 for OpenVPN, UDP 51820 for WireGuard) to a destination IP or ASN not on the allow-list of corporate VPN gateways. This may be accompanied by an MDM/UEM log indicating a non-standard application has registered VPN permissions.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/UEM logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, corporate firewalls, and MDM/UEM servers.",
            "action": [
              "Maintain an allow-list of sanctioned corporate VPN gateway IP addresses and Autonomous System Numbers (ASNs). Create a SIEM rule to alert on any connection from a mobile device IP range to a destination IP not on this list, using common VPN ports (UDP/500, UDP/4500, TCP/1194, UDP/51820). Enrich alerts with WHOIS and GeoIP data for the destination and cross-reference MDM/UEM logs for any recent VPN profile installations on the source device.",
              "From Zeek conn.log, group connections by source mobile IP. For each device, calculate the 95th percentile for connection duration and total bytes sent/received over a 30-day baseline. Alert if a new connection to a non-sanctioned destination on a VPN-like port exceeds both of these historical thresholds. Additionally, calculate the rarity of the destination IP/ASN pair across all mobile devices; a connection to a destination seen by only a single device is highly suspicious.",
              "Use an unsupervised learning model, such as an Isolation Forest, to identify outlier network sessions from mobile devices. Features for the model should include destination port, protocol, connection duration, total_bytes, destination_ASN_rarity, and a boolean flag for 'is_sanctioned_vpn_ip'. Sessions identified as anomalies, especially those with long durations and high data volumes to rare destinations, should be flagged for analyst review as potential rogue VPN tunnels."
            ]
          },
          {
            "description": "A temporal sequence of events from a single mobile device IP shows: 1) a DNS query for a high-entropy or newly registered domain, followed within 60 seconds by 2) an HTTP/S connection to the resolved IP, and 3) a data upload (orig_bytes in conn.log) that is statistically anomalous for the device's history.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, web proxies/egress points, network traffic sensors (e.g., Zeek cluster), and threat intelligence platform feeds.",
            "action": [
              "Correlate Zeek dns.log queries against threat intelligence feeds for malicious, newly registered (NRD), or DGA-flagged domains. If a match occurs from a mobile device IP, create a high-priority alert if it is followed by an HTTP POST request or a connection where 'conn.log:orig_bytes' exceeds the 95th percentile of historical uploads for that device within a 60-second window.",
              "For domains in Zeek dns.log queried by mobile devices, calculate the Shannon entropy of the query name. Alert on any domain whose entropy score exceeds the 98th percentile of the baseline. Also, calculate a 'least-seen' score by stack counting the public suffix + 1 domain (e.g., 'example.co.uk' becomes 'example.co.uk', 'sub.example.com' becomes 'example.com') and alert on domains requested by fewer than 3 devices in the organization within the last 30 days.",
              "Develop a sequence classification model (e.g., LSTM or GRU) trained on legitimate user session event sequences. The model should be fed sequences of features including dns_query_entropy, domain_age, domain_request_rarity, http_method, user_agent, conn_duration, and orig_bytes. An event sequence classified as anomalous, especially one matching a 'rare DNS -> HTTP -> large upload' pattern, should be flagged as a potential AiTM-facilitated C2 channel."
            ]
          },
          {
            "description": "An Android device downloads an application package (APK) from a source not on the corporate allow-list, as seen in Zeek files.log. Within 24 hours, the same device initiates one or more network connections with large data uploads (orig_bytes) to a destination IP not previously associated with the device's normal traffic profile.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log",
              "MDM/UEM logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices, MDM/UEM servers, network egress points, corporate application store, and network file analysis systems.",
            "action": [
              "Monitor Zeek files.log for transfers with mime-type 'application/vnd.android.package-archive' (APK). If the download source (http.log:host) is not on an approved list (e.g., Google Play, corporate store), check the file hash (files.log:sha1) against threat intelligence. If the source is suspicious or the app is unmanaged (per MDM logs), create an alert if the device subsequently initiates a connection where 'orig_bytes' exceeds its typical upload baseline to an un-categorized or suspicious destination.",
              "For each mobile device, baseline the daily volume of data uploaded to various service categories (e.g., cloud storage, social media). Alert if a device's daily upload volume to a non-corporate or un-categorized service exceeds 3 standard deviations from its 30-day average, especially if this occurs within 24 hours of a non-sanctioned APK installation event. Also, track the rate of new destination IPs contacted by a device post-install and alert on a sudden spike.",
              "Train a classifier (e.g., Random Forest) to produce a risk score for connections following a sideloaded app installation. Features should include apk_source_domain_reputation, apk_hash_malicious_ratio, time_since_install, destination_ip_rarity, destination_port, total_bytes, connection_duration, and destination_ASN_rarity. A high cumulative risk score for a device post-installation would trigger a comprehensive device review."
            ]
          },
          {
            "description": "A managed mobile device, via its MDM/UEM agent or a NAC client, reports a connection to a Wi-Fi network (BSSID) that is not on the list of known corporate or trusted access points, or it reports a change in the default gateway MAC address for a known corporate SSID, suggesting an ARP spoofing or evil twin attack.",
            "data_sources": [
              "MDM/UEM logs",
              "Network Access Control (NAC) logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices, MDM/UEM servers, and corporate wireless LAN controllers and NAC systems.",
            "action": [
              "Maintain an allow-list of approved BSSIDs for all corporate office SSIDs. Create a rule that alerts when an MDM/UEM or NAC log shows a device connected to an unapproved BSSID while using a corporate SSID name. Additionally, alert if the reported default gateway MAC address for a corporate network changes for a specific device, which could indicate ARP poisoning.",
              "For each corporate SSID, build a historical distribution of all BSSIDs seen over the last 90 days. Alert on any new BSSID that appears and is associated with a corporate SSID, as this could be a new but unauthorized access point or an evil twin. Calculate the rarity of a given BSSID/gateway MAC address pairing; a very rare or previously unseen pairing is highly suspicious.",
              "Train a clustering model (e.g., DBSCAN) on Wi-Fi connection properties reported by MDM/NAC agents (e.g., BSSID, signal strength, channel, security type, gateway MAC). Legitimate connections should form dense clusters for each physical location. New connections that are identified as noise points (outliers) by the model may represent connections to rogue APs and should be flagged for investigation."
            ]
          }
        ]
      }
    ],
    "last_updated": "2025-09-30",
    "version": "1.4",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]