[
  {
    "information_requirement": "Is an adversary leveraging legitimate remote access software for Command and Control on corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1663",
        "name": "Remote Access Software",
        "evidence": [
          {
            "description": "A network connection from a corporate mobile device matches a known remote access software domain, IP, or SSL certificate from a threat intelligence feed, and the device's MDM profile does not list an approved application that would generate this traffic.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "MDM application inventory logs",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Corporate DNS servers, Windows-based web proxies, VPN concentrators, Mobile Device Management (MDM) platform",
            "action": [
              "Create and maintain a watchlist of domains, IP addresses, and SSL certificate subjects associated with unapproved remote access software. Query Zeek logs (dns.log for 'query', conn.log for 'id.resp_h', ssl.log for 'server_name') for traffic from the mobile device IP range that matches this watchlist. On a match, query the MDM platform via API to check the source device's installed applications. Trigger a high-severity alert if no approved remote access software is present.",
              "For each connection matching the remote access watchlist, analyze its metadata in Zeek conn.log. Establish a 30-day rolling baseline for connection duration and total bytes ('orig_bytes' + 'resp_bytes') for all mobile device traffic. Generate a medium-severity alert if a watchlist-matched connection exceeds the 95th percentile for either duration or total bytes, and a high-severity alert if it exceeds the 99th percentile.",
              "Train a supervised classification model (e.g., Random Forest) using labeled historical Zeek conn.log data, enriched with MDM and threat intelligence context. Features should include protocol, duration, orig_bytes, resp_bytes, conn_state, destination port, a binary feature for a watchlist match, and a binary feature for the presence of approved MDM software. Deploy the model to classify new mobile device connections in near-real-time as 'benign' or 'suspicious-remote-access', triggering an alert on the latter."
            ]
          },
          {
            "description": "A long-lived TCP connection from a mobile device exhibits signs of interactive remote access, including a duration and packet-to-byte ratio in the top 5th percentile of all mobile device traffic, while using a non-standard port for a dynamically identified remote access protocol (e.g., VNC, RDP).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Network segments hosting corporate mobile devices, Core network switches, Wi-Fi access points",
            "action": [
              "Create a SIEM rule that searches Zeek conn.log for entries where the 'service' field contains a remote access protocol (e.g., 'vnc', 'rdp', 'teamviewer') and the 'id.resp_p' is not the standard IANA-assigned port for that service. Escalate the alert priority if Zeek also generates a 'Long_Connection' or 'Protocol_Mismatch' notice in notice.log for the same session UID.",
              "For all successful TCP connections ('conn_state' = 'SF') from the mobile device IP range, calculate an interactivity score as (orig_pkts + resp_pkts) / (orig_bytes + resp_bytes). Establish a 30-day baseline for this score and for connection duration. Flag connections where both the duration and interactivity score exceed their respective 95th percentiles. Additionally, calculate the Shannon entropy of destination ports used by each mobile device over a 24-hour window; alert on sharp increases in entropy which may indicate precursor activity.",
              "Deploy a time-series anomaly detection model, such as an LSTM-based autoencoder, trained on per-minute vectors of network telemetry for each mobile device (e.g., total outgoing bytes, number of new connections, average duration). Generate an alert when the model's reconstruction error for a device's activity exceeds a dynamic threshold, indicating a significant deviation from its established baseline behavior. Correlate this anomaly in time with a long-duration connection on a non-standard port to increase alert fidelity."
            ]
          },
          {
            "description": "A successful, unsolicited inbound TCP connection is made from an external, non-RFC1918 IP address to a corporate mobile device, violating firewall policy. The connection targets a port commonly associated with remote access software or any port that is not explicitly allowed.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek known_services.log",
              "Firewall logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Demilitarized Zone (DMZ), Wi-Fi network segments, Firewall appliances, Mobile VPN termination points",
            "action": [
              "Implement a critical-priority SIEM alert that triggers on any successful connection ('conn_state' of 'SF' or 'RSTO') in Zeek conn.log or firewall logs where the source IP ('id.orig_h') is external/non-RFC1918 and the destination IP ('id.resp_h') is within the designated mobile device IP range. Since policy should block all unsolicited inbound traffic, any such event is a critical incident.",
              "On a daily basis, query Zeek known_services.log to inventory all listening services observed on mobile devices. For each listening port, calculate its prevalence as a percentage of the total mobile device fleet. Generate an alert for any device found listening on a port that is statistically rare (e.g., present on less than 1% of the fleet) or is on a watchlist of ports associated with remote access tools.",
              "Apply a density-based clustering algorithm like DBSCAN to mobile devices using features derived from their inbound network profile over a 24-hour period. Features should include the set of listening ports, the ratio of inbound to outbound connections, and the number of distinct external source IPs. Automatically flag devices identified as outliers (noise points) for analyst review, as they represent significant deviations from their peer group."
            ]
          }
        ]
      }
    ],
    "version": "1.4",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-30",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]