[
  {
    "information_requirement": "Has an adversary successfully elevated privileges on a mobile device? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1404",
        "name": "Exploitation for Privilege Escalation",
        "evidence": [
          {
            "description": "A managed device's integrity check fails, generating a log from the Mobile Device Management (MDM) or Unified Endpoint Management (UEM) platform where the 'isJailbroken' or 'isRooted' attribute transitions from 'false' to 'true' [1].",
            "data_sources": [
              "MDM/UEM Integrity Log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet (corporate and BYOD), MDM/UEM management console, Enterprise DNS resolvers, Network gateways",
            "action": "1. (Symbolic Logic) Create a rule in the SIEM to trigger a high-priority alert immediately when a log from the MDM/UEM platform shows a device's 'isJailbroken' or 'isRooted' status changes to 'true'. 2. (Statistical Analysis) Upon alert, automatically query the device's network history from Zeek conn.log for the preceding 24 hours. Establish a baseline of typical destination ports, ASNs, and countries for that user/device. Flag any connections where the destination port, ASN, or country is statistically rare (e.g., outside the 99th percentile of historical activity or a first-seen occurrence for that device). 3. (Machine Learning) Train a one-class SVM or isolation forest model on historical Zeek conn.log features (e.g., connection duration, bytes sent/received, protocol) for each device. In near real-time, score new connections against this model. A connection flagged as a significant anomaly, especially when temporally correlated within 30 minutes of the jailbreak/root event, indicates a potential command-and-control (C2) or exploit delivery channel."
          },
          {
            "description": "An application is installed or executed on a mobile device whose package name, signing certificate, or file hash matches a known mobile exploitation tool or malware family capable of privilege escalation.",
            "data_sources": [
              "MDM/UEM Application Inventory Log",
              "Mobile Threat Protection (MTP) Agent Logs",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, Mobile devices with MTP agents, Threat intelligence platforms",
            "action": "1. (Symbolic Logic) Continuously scan MDM application inventory logs and MTP agent alerts against a threat intelligence-derived watchlist of malicious application package names, hashes, and signing certificates. Generate an alert upon any match. 2. (Statistical Analysis) Monitor Zeek dns.log for DNS queries originating from the mobile device subnet. Calculate the Shannon entropy of the query name (qname). A query with an entropy score significantly higher than the 95th percentile of the network's baseline entropy distribution may indicate Domain Generation Algorithm (DGA) activity. Additionally, track the ratio of NXDOMAIN to successful responses per client IP; a sudden spike in this ratio can indicate C2 beaconing attempts. 3. (Machine Learning) Use a pre-trained gradient boosting classifier to analyze features from Zeek http.log and ssl.log for suspicious application downloads. Features should include JA3/JA3S hashes, file MIME types, user agents, certificate issuer/subject, and destination IP reputation. Classify each download session as benign or suspicious. A 'suspicious' classification for a download to a mobile device, especially for an APK/IPA or unknown binary type, warrants investigation as a potential exploit delivery vector."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]