[
  {
    "information_requirement": "Is an adversary accessing and exfiltrating sensitive application data from our managed mobile devices? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1409",
        "name": "Stored Application Data",
        "evidence": [
          {
            "description": "A process on a managed mobile device performs unauthorized or anomalous read/write access to another application's sandboxed storage directory, specifically targeting locations known to contain sensitive data like authentication token stores, contact databases, or message caches.",
            "data_sources": [
              "Mobile OS audit logs (e.g., Android logcat, iOS sysdiagnose)",
              "Mobile Device Management (MDM) security event logs",
              "Endpoint Detection and Response (EDR) for Mobile agent logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet; Application sandboxes on endpoints",
            "action": "1. (Symbolic) Query MDM/EDR logs for alerts where a process with a known malicious hash or package name from a threat intelligence feed attempts to access file paths outside its own sandbox (e.g., /data/data/*). 2. (Statistical) For each managed application, establish a baseline of normal file access patterns using MDM/OS logs. Calculate the entropy of file paths accessed by a given process; a high entropy score may indicate directory scanning. Trigger an alert if a process accesses files in another application's directory at a rate exceeding 3 standard deviations from the established baseline for that user or device group. 3. (Machine Learning) Develop a classification model (e.g., Random Forest) trained on features from OS audit logs (process name, parent process, target file path, access permissions requested, time of day). The model will classify file access events as 'benign inter-app communication' or 'suspicious cross-sandbox access'. Flag events classified as suspicious with high confidence for analyst review."
          },
          {
            "description": "A mobile device exhibits an outbound network connection with characteristics indicative of data exfiltration, such as an unusually large data volume sent to a non-standard port or a low-reputation domain, especially following activity in a sensitive corporate application.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways; VPN concentrators; Cloud Access Security Broker (CASB) egress points",
            "action": "1. (Symbolic) Continuously screen destination IPs and domains from Zeek conn.log and dns.log against a blocklist of known C2 servers and malicious exfiltration endpoints. Generate a high-severity alert upon any match originating from the mobile device IP space. 2. (Statistical) For each device, model typical outbound data volume (orig_bytes in conn.log). Alert when orig_bytes for a single connection exceeds the 99th percentile of the device's 30-day historical data, especially if the destination port is non-standard. Correlate with DNS lookups (dns.log) and calculate the Jaro-Winkler distance between the queried domain and known-good corporate domains to flag potential typosquatting. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., ARIMA) on aggregated outbound data volume per device over 5-minute intervals. An alert is generated when the observed data volume significantly deviates from the model's forecast, indicating a potential bulk data transfer event consistent with exfiltration."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]