[
  {
    "information_requirement": "Is an adversary using steganography to exfiltrate data from or introduce malicious tools to managed mobile devices? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1406.001",
        "name": "Steganography",
        "evidence": [
          {
            "description": "Anomalously large media files are transferred to or from a mobile device over the network, potentially containing hidden data.",
            "data_sources": [
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network egress points",
            "action": "Monitor Zeek `files.log` for media file transfers (e.g., `mime_type` of `image/png`, `image/jpeg`, `video/mp4`). For each file, calculate the ratio of bytes transferred (`seen_bytes`) to a typical size for its type and, if available, dimensions. Use statistical methods like the interquartile range (IQR) or z-scores to flag files with anomalously large sizes. Correlate the `uid` from `files.log` with `conn.log` to identify the source/destination IPs and user agent strings. High-risk indicators include large media files from non-standard domains or transfers to known malicious infrastructure."
          },
          {
            "description": "A mobile application contains known steganographic libraries, or an installed media file on a device has an unusually high entropy score, suggesting embedded data.",
            "data_sources": [
              "Mobile Device Management (MDM) Application Inventory",
              "Mobile Endpoint File System Scan Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet",
            "action": "From MDM application inventories, create a list of installed packages. Scan application binaries (`.apk`/`.ipa`) for strings or imported libraries associated with known steganography tools. For on-device media files, periodically run file entropy calculations. Establish a baseline entropy score for various benign media file types (e.g., photos from the device camera). An entropy score significantly deviating from the mean (e.g., >3 standard deviations or approaching the theoretical maximum of 8 for random data) for a given file type is a strong indicator of embedded, likely encrypted, data."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]