[
  {
    "information_requirement": "Is an adversary collecting sensitive information from mobile device clipboards?",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1414",
        "name": "Clipboard Data",
        "evidence": [
          {
            "description": "An installed Android application, which is not the default input method editor (IME), registers a ClipboardManager.OnPrimaryClipChangedListener to monitor clipboard activity in the background (Android 9 and earlier) or when it is not the app in focus (Android 10+).",
            "data_sources": [
              "Mobile Application Static Analysis Report",
              "Mobile Threat Defense (MTD) Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (Android), Corporate application store / Vetting pipeline",
            "action": "During the application vetting process, statically analyze the APK for the presence of the 'addPrimaryClipChangedListener' method call. Correlate this finding with the application's manifest file (AndroidManifest.xml) to determine if it is registered as an IME. Flag any non-IME application that registers a clipboard listener. In parallel, configure MTD policies to generate alerts for applications that exhibit clipboard monitoring behavior, and use descriptive statistics to identify outlier applications that access the clipboard more frequently than their peers."
          },
          {
            "description": "An installed iOS application makes frequent or programmatic calls to UIPasteboard.general to access clipboard contents, particularly when the app is not in the foreground or immediately after the user switches to the app.",
            "data_sources": [
              "Mobile Application Dynamic Analysis Report (Sandboxing)",
              "Mobile Device Management (MDM) Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS), Corporate application store / Vetting pipeline",
            "action": "During dynamic analysis of iOS applications in a sandboxed environment, monitor and log all calls to the UIPasteboard class. Establish a baseline for normal app behavior. Use statistical analysis to identify applications that access the clipboard with an unusually high frequency or with a consistently low time delta after the app is brought to the foreground, which may indicate programmatic, non-user-driven access. For managed devices running iOS 14+, analyze MDM logs for user-reported 'pasted from' notifications to identify offending applications."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary capturing credentials copied from password managers or other sensitive applications on mobile devices?",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1414",
        "name": "Clipboard Data",
        "evidence": [
          {
            "description": "A non-browser, non-password manager application accesses the clipboard immediately after a user interacts with a known password manager application, suggesting automated scraping of copied credentials.",
            "data_sources": [
              "Mobile Threat Defense (MTD) Behavioral Logs",
              "Mobile Application Usage Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Endpoint mobile devices with corporate password managers installed",
            "action": "From MTD or MDM logs, create an allow-list of approved password manager application process names. Monitor for a sequence of events where: 1) a password manager process is active, followed by 2) a clipboard access event, and then 3) another, unrelated application process becomes active and immediately accesses the clipboard. Calculate the time delta between the password manager being backgrounded and the suspicious app accessing the clipboard. A consistently low time delta (e.g., below the 5th percentile of normal app-switching behavior) for a specific app across multiple devices is a strong indicator of automated clipboard scraping."
          },
          {
            "description": "Following a clipboard access event by a suspicious application, the same application initiates a network connection to an unknown or high-entropy external domain, potentially for exfiltration.",
            "data_sources": [
              "Mobile Threat Defense (MTD) Logs",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile device endpoints, Corporate VPN concentrators, Network egress points",
            "action": "Correlate MTD alerts for suspicious clipboard access with network logs (from a VPN or proxy) using device ID and timestamp. For each clipboard access alert, query network logs (e.g., Zeek dns.log) for connections originating from the device's IP within a 2-minute window. Calculate the entropy score for all requested domain names. An event where a high-entropy domain or a domain from a threat intelligence feed is contacted by the same process that just accessed the clipboard should be escalated as a high-confidence credential theft event."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]