[
  {
    "information_requirement": "Is an adversary attempting to discover sensitive information on our corporate mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1420",
        "name": "File and Directory Discovery",
        "evidence": [
          {
            "description": "An application on a managed Android device exhibits anomalous file system scanning behavior, such as rapidly accessing a large number of unique files or directories in external storage, which is inconsistent with its documented function or baseline behavior.",
            "data_sources": [
              "Mobile Threat Defense (MTD) file access logs",
              "Mobile Endpoint Detection and Response (EDR) telemetry",
              "Android OS logs (logcat)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android mobile devices",
            "action": "Using MTD/EDR logs, establish a baseline for each managed application's typical file and directory access patterns (e.g., number of files accessed per hour, common directory paths). Create a rule to alert when an application's file access count exceeds a statistical threshold (e.g., 3 standard deviations above its hourly mean) or when it accesses directories unrelated to its function. Calculate the entropy of directory paths accessed by an app over a short time window; a high entropy score may indicate broad, non-specific scanning activity characteristic of discovery."
          },
          {
            "description": "A user grants 'Storage' or 'Files and Media' access permissions to a newly installed or non-standard application that has no clear business or functional requirement for such access.",
            "data_sources": [
              "Mobile Device Management (MDM) application permission logs",
              "Mobile Threat Defense (MTD) security event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android and iOS mobile devices",
            "action": "Maintain a curated list of approved corporate applications and their standard, required permissions. Generate a high-priority alert for any event where a user grants storage-related permissions to an application not on the approved list, or to an application whose category (e.g., 'Calculator', 'Flashlight') does not justify storage access. Analyze the frequency of these events across the enterprise; a sudden spike in permission grants for a specific new application could indicate a coordinated campaign."
          },
          {
            "description": "A significant volume of outbound network traffic originates from a mobile device shortly after an application is observed performing broad file system scanning or is granted storage permissions for the first time.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "MTD/EDR for Mobile network flow logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network egress points and VPN gateways",
            "action": "Correlate on-device alerts for unusual file access or permission changes with network logs. For a device triggering such an alert, analyze its network activity in the subsequent 1-60 minutes using Zeek conn.log. Sum the total bytes sent (`orig_bytes`) from the device to external destinations. Compare this sum to a historical baseline for that device/user. An outbound data transfer in the 95th percentile or higher, especially to a new or low-reputation IP address, is a strong indicator of exfiltration following discovery. Check Zeek files.log for any file transfers that correspond with the timing of the anomalous network activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]