[
  {
    "information_requirement": "Is an adversary attempting to discover running processes on our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1424",
        "name": "Process Discovery",
        "evidence": [
          {
            "description": "A mobile device sends network traffic consistent with process list exfiltration, characterized by an HTTP POST request with a high-entropy body or a DNS query with an unusually long subdomain label and high character variance.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, network egress points, DNS servers, VPN concentrators.",
            "action": "1. (Symbolic) Query Zeek http.log and dns.log for connections originating from the mobile device VLAN to known malicious C2 domains or IPs from a threat intelligence feed. 2. (Statistical) For HTTP, calculate the Shannon entropy of the POST request body in Zeek http.log; flag requests where entropy exceeds a dynamically calculated baseline (e.g., > 4.5 for ASCII text) and the destination is uncategorized or has a low reputation. For DNS, calculate the length of the queried subdomain in Zeek dns.log; alert on queries exceeding the 99th percentile of length for the environment. Also, calculate the character frequency distribution of the subdomain; a flat distribution suggests encoded data. 3. (Machine Learning) Train a time-series model (e.g., ARIMA) on the volume of outbound data per device. An anomalous spike in traffic to an unusual destination, correlated with a high entropy score from the statistical analysis, indicates likely exfiltration. A classification model (e.g., Random Forest) can also be used, trained on features like URL length, domain age, entropy, and request size to classify HTTP/DNS requests as benign or suspicious exfiltration."
          },
          {
            "description": "A process associated with a USB-connected mobile device (e.g., adb.exe) spawns a child process on a Windows host that is used for process enumeration, such as 'tasklist.exe', 'ps.exe', or PowerShell 'Get-Process'.",
            "data_sources": [
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Employee workstations, developer machines where mobile devices are frequently connected, privileged user workstations.",
            "action": "1. (Symbolic) Create a SIEM rule to alert on any process creation event (Windows Event ID 4688) where the ParentProcessName is 'adb.exe' or another mobile device bridge process and the NewProcessName is 'tasklist.exe', 'ps.exe', 'powershell.exe', or 'cmd.exe'. For PowerShell, inspect the command line arguments for 'Get-Process' or 'ps'. 2. (Statistical) Establish a baseline of normal child processes for 'adb.exe' and similar parent processes on developer workstations. Calculate the rarity of each child process across the environment. Alert when a statistically rare child process (e.g., seen on < 1% of hosts where adb.exe is present) is spawned, especially process enumeration tools on non-developer machines. 3. (Machine Learning) Use a clustering algorithm (e.g., DBSCAN) on host process creation events, using features like parent process name, child process name, user context, and command-line arguments. An 'adb.exe -> tasklist.exe' event on a non-developer machine will likely be flagged as an outlier or part of a very small, anomalous cluster."
          },
          {
            "description": "A mobile device initiates network connections to domains, IPs, or URLs known to host mobile device rooting (Android) or jailbreaking (iOS) toolkits, a prerequisite for this technique on modern, non-vulnerable operating systems.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, guest Wi-Fi networks, Mobile Device Management (MDM) platforms, DNS resolvers.",
            "action": "1. (Symbolic) Continuously match all DNS queries (Zeek dns.log) and destination IPs (Zeek conn.log) from the mobile device IP space against a threat intelligence feed of known rooting/jailbreaking domains and C2 servers. Generate a high-severity alert upon any match. 2. (Statistical) Profile DNS queries per device. Calculate the frequency of queries to newly observed domains (NODs). A device that suddenly queries multiple NODs that are also present on rooting/jailbreaking watchlists is a strong indicator. Monitor connection logs (Zeek conn.log) for connections to a high number of distinct, non-categorized IP addresses over a short period (e.g., > 10 new IPs in 5 minutes). 3. (Machine Learning) Use a reputation scoring model for domains and IPs visited by mobile devices. Features can include domain age, IP block owner, TLS certificate details, and threat intelligence hits. A device whose average destination reputation score drops significantly over a short time window should be flagged. Correlate these network-based flags with non-compliant/rooted status alerts from an MDM/UEM platform to increase confidence."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]