[
  {
    "information_requirement": "Is an adversary performing discovery on compromised mobile devices to identify network connectivity? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1422.001",
        "name": "Internet Connection Discovery",
        "evidence": [
          {
            "description": "An anomalous shell command, such as 'netstat' or 'ping', is executed on a mobile device, particularly via a remote administration tool like Android Debug Bridge (ADB), which is not typical for standard user or application behavior.",
            "data_sources": [
              "Mobile EDR process execution logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (Android, iOS)",
            "action": "Monitor Mobile EDR logs for process creation events. Create a specific rule to alert on the execution of network discovery commands ('netstat', 'ping', 'ifconfig') and their variants. Establish a baseline of commands executed by legitimate applications and users. Use a statistical model to flag deviations; for example, alert if the frequency of such commands from a single device exceeds the 95th percentile of the fleet-wide daily average. Correlate command execution with the parent process to identify suspicious origins (e.g., a non-system app spawning a shell)."
          },
          {
            "description": "A mobile device initiates a burst of short-lived connections or DNS lookups to multiple, common high-availability domains (e.g., google.com, cloudflare.com, apple.com) in a pattern inconsistent with normal user browsing or application background activity.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, corporate Wi-Fi controllers, VPN concentrators",
            "action": "Ingest Zeek conn.log and dns.log. For each device IP, profile the rate of new outbound connections and DNS queries over a 1-minute rolling window. Establish a baseline for each device's typical activity. Trigger an alert if the rate of new connections or DNS queries spikes more than 3 standard deviations above the device's historical average. Further score the activity by calculating the ratio of DNS queries to subsequent connections; a high ratio may indicate a discovery sweep. Enrich destination IPs against threat intelligence feeds to identify connections to known adversary infrastructure."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]