[
  {
    "information_requirement": "Is a compromised mobile device being used to perform network service discovery on the internal network? (TA0032 - Discovery)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1423",
        "name": "Network Service Scanning",
        "evidence": [
          {
            "description": "A single mobile device IP initiates connections to a statistically significant number of unique internal IP addresses (horizontal scan) or unique ports (vertical scan) in a short time frame, far exceeding typical device behavior.",
            "data_sources": [
              "Zeek conn.log",
              "DHCP Server Logs",
              "VPN Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments accessible by mobile devices (e.g., corporate Wi-Fi, VPN address pools), Core network switches, VPN concentrators, DHCP servers",
            "action": "First, implement symbolic logic by monitoring for any connection attempts from mobile device IP ranges to predefined 'canary' ports on critical servers where no legitimate traffic is expected; any single attempt should trigger an immediate alert. Second, apply a statistical method: for each source IP from a mobile NAI, aggregate connection data over 5-minute windows and calculate the count of unique destination IPs and unique destination ports. An alert is triggered if a device's count for either metric exceeds 3 standard deviations above its own 7-day rolling average AND also surpasses the 99th percentile for all mobile devices, indicating a deviation from both personal and population norms. Third, use a machine learning approach: featurize device activity with metrics like unique destination IP count, unique port count, and entropy of destination ports. Employ an unsupervised clustering model like DBSCAN to identify outliers that represent scanning behavior, which may not cross simple statistical thresholds but exhibit multi-dimensional anomalous patterns."
          },
          {
            "description": "A mobile device IP generates a high ratio of failed or rejected connection attempts compared to successful connections, indicating probing of closed ports or non-existent hosts.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments accessible by mobile devices (e.g., corporate Wi-Fi, VPN address pools), Core network switches, Network firewalls",
            "action": "Begin with a symbolic rule: trigger an alert if a single mobile source IP generates more than 10 connections with a 'REJ' state in Zeek conn.log to any single destination within a 1-minute window, indicating a likely scan against a firewalled host. Next, use a statistical approach: for each mobile device, calculate the ratio of failed connection states ('S0', 'REJ') to successful states ('SF') over a 10-minute window. Generate an alert if this ratio exceeds the 95th percentile observed across all mobile devices, flagging an abnormal rate of connection failures. Finally, apply a machine learning model: use a time series anomaly detection algorithm (e.g., Seasonal-Hybrid ESD) on the per-minute count of failed connections ('S0', 'REJ') for each device. This model learns the normal background 'noise' of connection failures for each user and alerts on sudden, statistically significant spikes that deviate from this learned pattern."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]