[
  {
    "information_requirement": "Is an adversary attempting to discover the location of our subscribers by impersonating SS7 nodes? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "One or more SS7 Mobile Application Part (MAP) location-related query messages (e.g., Send Routing Information for SM, Provide Subscriber Information) are received by the HLR from an external Global Title (GT) not on the established partner whitelist.",
            "data_sources": [
              "SS7 Signaling Gateway (SGW) transaction records",
              "Home Location Register (HLR) event logs",
              "Partner Global Title (GT) whitelist database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network infrastructure, specifically the SS7 signaling plane interfaces (SGWs) and subscriber databases (HLR/HSS).",
            "action": "Symbolic: For every inbound SS7 MAP query for subscriber location (e.g., SRI-SM, PSI), check if the source Global Title (GT) exists in the approved partner GT whitelist. If the source GT is not on the whitelist, generate a high-severity alert. Statistical: For all non-whitelisted source GTs, calculate the ratio of location queries to other message types. Flag any non-whitelisted GT whose location query ratio exceeds the 99th percentile of the baseline established from legitimate roaming partners. Machine Learning: Develop and deploy a supervised machine learning classifier (e.g., Random Forest) trained on historical SS7 transaction data with features like message type, source GT, source country, and time of day. The model should classify each incoming location query as 'benign' or 'suspicious', triggering an investigation for 'suspicious' classifications from non-whitelisted GTs."
          },
          {
            "description": "A single external source Global Title (GT) issues a statistically anomalous volume of location queries against a high number of unique subscriber identifiers (MSISDNs) within a defined time window (e.g., one hour), indicating a scanning or enumeration attempt.",
            "data_sources": [
              "SS7 Signaling Gateway (SGW) transaction records",
              "Home Location Register (HLR) event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network infrastructure, specifically the SS7 signaling plane interfaces (SGWs) and subscriber databases (HLR/HSS).",
            "action": "Symbolic: Define a hard threshold for abuse. Create an alert if any single source GT queries more than 1,000 unique MSISDNs within a 1-hour window. Statistical: For each source GT, calculate the count of unique MSISDNs queried per hour. Use a statistical measure like a Z-score $$ Z = (x - \\mu) / \\sigma > 3 $$ to detect anomalous scanning behavior against a rolling 30-day baseline. Machine Learning: Use a time-series anomaly detection model (e.g., ARIMA) on the stream of location queries per source GT to flag significant, unexpected spikes in volume. Additionally, use a clustering algorithm (e.g., DBSCAN) on features like query volume and number of unique targets to automatically group and identify outlier GTs exhibiting scanning behavior."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary successfully collecting subscriber location data via SS7 network exploitation? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.002",
        "name": "Impersonate SS7 Nodes",
        "evidence": [
          {
            "description": "Multiple sequential SS7 MAP location queries for a single subscriber identifier (MSISDN) are received from the same external, potentially non-whitelisted, Global Title (GT) within a short time frame (e.g., less than 15 minutes), indicating active tracking.",
            "data_sources": [
              "Home Location Register (HLR) event logs",
              "SS7 Signaling Gateway (SGW) transaction records",
              "Visitor Location Register (VLR) event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Subscriber location databases (HLR/HSS, VLR) and the signaling gateways (SGW) that route queries to them.",
            "action": "Symbolic: For each MSISDN, if the count of location queries from a single, non-whitelisted source GT exceeds a fixed threshold (e.g., > 3 queries in 1 hour), generate a 'Potential Subscriber Tracking' alert. Statistical: For each MSISDN, calculate the entropy of the source GTs querying its location over 24 hours. A very low entropy score, $$ H(X) = -\\sum p(x_i) \\log_2 p(x_i) $$, indicates queries are from a single source and warrants investigation if the score is in the bottom 5th percentile of the user population. Machine Learning: Implement a sequence analysis model (e.g., LSTM) to analyze SS7 message sequences for each subscriber. Train the model to distinguish legitimate sequences (e.g., call setup) from anomalous tracking sequences (e.g., repeated location queries with no follow-on communication), triggering an alert on anomalous detections."
          },
          {
            "description": "A successful SS7 MAP response message (e.g., SRI-SM ACK) containing sensitive subscriber location information (e.g., serving MSC/VLR address) is transmitted to an external Global Title (GT) that is not on the partner whitelist or has been flagged as suspicious.",
            "data_sources": [
              "Home Location Register (HLR) event logs",
              "SS7 Signaling Gateway (SGW) transaction records",
              "Partner Global Title (GT) whitelist database"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Egress points of the core network's signaling plane, specifically the Signaling Gateways (SGWs) responsible for forwarding responses to external networks.",
            "action": "Symbolic: Correlate every outbound successful location query response with its initiating inbound query. If the destination GT of the response is not on the partner GT whitelist, immediately generate a 'Confirmed Location Leak' critical alert and, if possible, block the response via a signaling firewall. Statistical: For each external GT, calculate the success rate of its location queries. A sudden spike in the success rate for an unknown GT, especially if it exceeds the 95th percentile of all partner success rates, indicates a potential exploited misconfiguration. Machine Learning: Use a graph analysis model where SS7 entities (GTs, MSISDNs) are nodes and messages are edges. Apply an anomaly detection algorithm (e.g., Local Outlier Factor) to the graph to identify non-whitelisted GT nodes that have a high number of successful 'collection' edges from many MSISDNs, flagging them as suspicious collectors."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]