[
  {
    "information_requirement": "Is an adversary attempting to discover the physical location of our managed mobile devices? (PIR)",
    "tactic_id": "TA0032",
    "tactic_name": "Discovery",
    "indicators": [
      {
        "technique_id": "T1430.001",
        "name": "Remote Device Management Services",
        "evidence": [
          {
            "description": "A successful authentication to an EMM/MDM console (e.g., Windows Event ID 4624) where the authentication event exhibits one or more high-risk anomalies, such as originating from an IP on a threat intelligence feed, a geolocation with no prior history for that user, or occurring at a time that deviates by more than 3 standard deviations from the user's established baseline.",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "EMM/MDM web application servers, Authentication servers (e.g., Domain Controllers, RADIUS), Network egress points and web proxies, Administrative workstations and VDI environments",
            "action": "1. Symbolic Logic: Continuously monitor Zeek conn.log for connections to EMM/MDM console IP addresses where the source IP is present in an active threat intelligence feed. Generate a high-priority alert if a source IP from this feed is associated with a successful login event (Windows Event ID 4624) on the authentication server within a 5-minute window. 2. Statistical Analysis: For each EMM/MDM administrator, establish a 90-day baseline of login behavior including (a) a set of historically observed source countries and ASNs from Zeek conn.log, and (b) a distribution of login times. Flag any successful login (Windows Event ID 4624) that originates from a country not in the user's historical set or occurs at an hour that falls outside the 5th-95th percentile of their typical login times. 3. Machine Learning: Train an isolation forest model on historical successful EMM/MDM admin logins, using features such as source ASN, country, time of day (as a cyclical feature), and day of the week. Run new successful logins through the model in real-time to classify them as anomalous, indicating a potential account compromise being used for unauthorized discovery."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary collecting location data from our managed mobile devices via remote management services? (PIR)",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1430.001",
        "name": "Remote Device Management Services",
        "evidence": [
          {
            "description": "A pattern of repeated device location lookups originating from a single source IP or user account that is anomalous in frequency or volume, measured by the rate of API calls to location-finding endpoints exceeding a statistically-derived threshold (e.g., 99th percentile) over a rolling 1-hour time window. [1]",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "EMM/MDM web application servers, Authentication servers, Network egress points and web proxies, Cloud service access points (for iCloud/Google Find My)",
            "action": "1. Symbolic Logic: Create a detection rule to monitor Zeek http.log for HTTP requests to known device location API endpoints (e.g., '/api/v1/devices/locate'). Alert if a single user account or source IP makes more than a predefined number (e.g., 50) of these requests within a 1-hour window, which may indicate a 'smash and grab' collection attempt. 2. Statistical Analysis: For each user, calculate the entropy of the time delta between consecutive location lookup requests over a 24-hour period. A very low entropy score suggests highly regular, machine-like timing indicative of a script. Also, alert if the number of unique devices a user queries per hour exceeds the 98th percentile for all administrative users. 3. Machine Learning: Apply a time-series anomaly detection model (e.g., ARIMA) to the aggregate count of location API calls per minute across the EMM/MDM platform. The model will learn the normal daily and weekly cyclical patterns of activity. Generate an alert when the observed lookup volume significantly deviates from the model's prediction, indicating a potential platform-wide collection event."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]