[
  {
    "information_requirement": "Is an adversary using standard application protocols for command and control on our mobile devices?",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1437",
        "name": "Application Layer Protocol",
        "evidence": [
          {
            "description": "A mobile device establishes connections to a single destination IP/domain at highly regular intervals (e.g., jitter less than 5%) with consistently small, uniform payload sizes (e.g., less than 1KB), indicative of C2 beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi infrastructure, VPN concentrators",
            "action": "1. (Symbolic) Ingest a threat intelligence feed of known C2 domains/IPs. Scan Zeek conn.log and http.log for any connections from mobile device IP ranges to these malicious destinations. 2. (Statistical) For each source-destination pair, calculate the standard deviation of the time delta between connections over a 24-hour window. Flag pairs in the bottom 5th percentile (lowest jitter). Simultaneously, calculate the standard deviation of the 'orig_bytes' and 'resp_bytes' fields; flag pairs in the bottom 5th percentile (most uniform size). Alert on pairs flagged by both metrics. 3. (ML) Apply a clustering algorithm (e.g., DBSCAN) to mobile device network traffic, using features such as connection frequency, payload size variance, and inter-arrival time standard deviation. Analyze the resulting clusters to identify small, dense clusters that represent anomalous, machine-like beaconing behavior distinct from large, diffuse clusters of normal user activity."
          },
          {
            "description": "DNS requests from a mobile device show signs of tunneling, characterized by an abnormally high query rate to a specific domain, unusually long FQDNs indicative of data encoding, or large TXT/AAAA record responses used for data exfiltration.",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, DNS forwarders, Network egress points",
            "action": "1. (Symbolic) Match all domains in Zeek dns.log 'query' field against a threat intelligence feed of known DGA and DNS tunneling C2 domains. 2. (Statistical) For each source IP, calculate the character entropy of the queried subdomain; flag queries with entropy > 4.0. Separately, calculate the 99th percentile for DNS query length and TXT record response size across a 30-day baseline; alert on any DNS transaction exceeding these thresholds. 3. (ML) Train a Random Forest classifier on labeled DNS data with features like query length, subdomain entropy, ratio of numeric to alphabetic characters, and query type (A, AAAA, TXT, CNAME). Deploy the model to classify live DNS queries from mobile devices as benign, DGA, or tunneling."
          },
          {
            "description": "An HTTP/S request from a mobile device presents a client signature, such as a User-Agent string or JA3 TLS fingerprint, that is either known to be malicious or has an extremely low prevalence within the organizational baseline.",
            "data_sources": [
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web Application Firewalls (WAFs), Reverse proxies, Internet gateways",
            "action": "1. (Symbolic) Ingest and maintain a list of User-Agent strings and JA3/JA3S hashes associated with known mobile malware. Scan Zeek http.log and ssl.log to alert on any exact matches. 2. (Statistical) Create a frequency table of all User-Agent strings and JA3 hashes observed from mobile devices over the last 30 days. Alert on any User-Agent or JA3 hash that has a prevalence of less than 0.1% or is seen on fewer than 3 unique devices, indicating a rare client. 3. (ML) Use an Isolation Forest anomaly detection model trained on features from benign mobile client traffic, including User-Agent string length, token count, and the categorical JA3 hash. The model will create a profile of normal clients and score new connections, flagging those with high anomaly scores that deviate from the established norm."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]