[
  {
    "information_requirement": "Has an adversary gained initial access to a mobile device via a physical USB connection? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1458",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "A mobile device management process (e.g., adb.exe, ideviceinstaller.exe) on a host executes with high-entropy command-line arguments or initiates network connections to domains with low reputation scores, within minutes of a new USB device connection event.",
            "data_sources": [
              "Windows Event ID 4688",
              "Zeek conn.log",
              "Zeek dns.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, employee laptops, public charging kiosks within corporate facilities, VPN concentrators, DNS servers.",
            "action": "Join host-based process creation logs (Windows Event ID 4688) with network connection logs (Zeek conn.log) on the host and timestamp. First, create a watchlist of mobile device management tools (e.g., 'adb.exe', 'ideviceinstaller.exe', 'iFunBox.exe') and trigger an alert if a process from this watchlist initiates a network connection to an IP address or domain on a threat intelligence feed (symbolic logic). Second, for any process on the watchlist, calculate the Shannon entropy of its command-line arguments and alert if the entropy exceeds the 95th percentile for that specific command across the enterprise, suggesting obfuscation (statistical method). Third, develop a time-series anomaly detection model (e.g., ARIMA or LSTM) for the volume of network connections originating from these tools per host. An alert is generated when the model detects a statistically significant anomaly in connection volume shortly after a USB connection event (Windows Event ID 4663), indicating a potential data exfiltration attempt (machine learning method)."
          },
          {
            "description": "A host PC initiates network connections to a statistically unusual number of new or rare domains within 5 minutes of a mobile device being connected via USB. The domains are not on an established allowlist of known update/management servers (e.g., *.apple.com, *.google.com).",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Windows Event ID 4663"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, internet gateway, DNS servers, Endpoint Detection and Response (EDR) logs.",
            "action": "Correlate USB device connection events (Windows Event ID 4663) with subsequent DNS queries (Zeek dns.log). First, maintain an allowlist of domains for legitimate mobile device vendors (Apple, Google, Samsung) and alert if a host queries a domain not on this list within 5 minutes of a connection (symbolic logic). Second, for each host, baseline DNS query patterns, including the frequency of top-level domains (TLDs). Alert if the ratio of rare TLDs (e.g., .xyz, .top) to common TLDs exceeds 3 standard deviations from the host's historical baseline post-connection (statistical method). Third, use an unsupervised learning model (e.g., Isolation Forest) to cluster hosts based on post-USB-connection network behavior (features: destination port distribution, protocol mix, data volume). Hosts classified as outliers are flagged for investigation (machine learning method)."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary using compromised mobile devices to laterally move to corporate workstations? (PIR)",
    "tactic_id": "TA0033",
    "tactic_name": "Lateral Movement",
    "indicators": [
      {
        "technique_id": "T1458",
        "name": "Replication Through Removable Media",
        "evidence": [
          {
            "description": "An executable file is written to a non-standard or temporary location on a workstation from a device connected via MTP/PTP, and this file is subsequently executed, spawning unexpected child processes such as PowerShell or cmd.exe.",
            "data_sources": [
              "Windows Event ID 4663",
              "Windows Event ID 4688"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, IT administrator workstations, file servers, user profile directories (Downloads, Temp, AppData).",
            "action": "Monitor file write events (Windows Event ID 4663) to user directories (e.g., %TEMP%, Downloads) from mobile devices. First, if a written file has an executable extension (.exe, .ps1, .bat) and its hash matches a known malicious signature, correlate with its execution (Windows Event ID 4688) and alert (symbolic logic). Second, analyze parent-child process relationships for files executed from a mobile source. Alert if a process chain is observed that falls in the bottom 5th percentile of frequency across the enterprise, such as a copied executable spawning powershell.exe (statistical method). Third, train a classification model (e.g., Random Forest) to predict file maliciousness based on features like file path, extension, source (mobile device), and parent process. Flag files with a high malicious probability score for review (machine learning method)."
          },
          {
            "description": "A host PC, within minutes of a mobile device USB connection, initiates connections to an anomalously high number of unique internal IP addresses or ports, consistent with network reconnaissance.",
            "data_sources": [
              "Zeek conn.log",
              "Windows Event ID 4688",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate workstations, network segments containing high-value assets, internal network traffic choke points, VLANs with sensitive servers.",
            "action": "Upon detecting a mobile device USB connection, monitor the host's network activity. First, check Zeek notice.log for `Scan::Address_Scan` or `Scan::Port_Scan` events. If a scan notice's timestamp correlates with a recent USB connection for that host, generate a high-priority alert (symbolic logic). Second, in Zeek conn.log, count unique internal destination IPs and ports per source host in 1-minute windows. Alert if either count exceeds 3 standard deviations above the host's historical baseline, indicating a network scan (statistical method). Third, use a K-Means clustering algorithm on network flow features (e.g., connection success/failure ratio, port diversity). If a host's behavior shifts it into a cluster associated with scanning activity post-connection, flag it for investigation (machine learning method)."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]