[
  {
    "information_requirement": "Has an adversary compromised a user's corporate account access by performing a SIM swap? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1078",
        "name": "Valid Accounts",
        "evidence": [
          {
            "description": "A successful user authentication to a corporate service (e.g., VPN, SSO, O365) occurs with anomalous characteristics immediately following a loss of connectivity from the user's registered mobile device. The anomalous characteristics include, but are not limited to, a new geographic location, a new device type, or a new Internet Service Provider (ISP).",
            "data_sources": [
              "Windows Event ID 4624",
              "Zeek conn.log",
              "Mobile Device Management (MDM) logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication servers (Domain Controllers, ADFS), VPN Concentrators, MDM Servers, Internet Gateways",
            "action": "Continuously monitor MDM logs for devices that fail to check in or are reported as offline. For the owner of any such device, create a time-based alert. If a successful authentication (Windows Event ID 4624 or equivalent SSO log) for that user occurs after the device went offline, trigger an enrichment and analysis workflow. In this workflow, extract the source IP address from the authentication log and correlate it with Zeek conn.log to gather session details. Compare the login's geolocation, ASN, and user-agent against a 30-day rolling baseline for that specific user. Use statistical methods to flag significant deviations (e.g., a login from a country with a 0% historical frequency for that user). A combination of a device-offline event and a statistically anomalous login should be considered a high-confidence indicator of a compromised account via SIM swap and escalated for immediate response."
          }
        ]
      },
      {
        "technique_id": "T1566",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A user receives and interacts with a phishing email designed to harvest Personal Identifiable Information (PII) that could be used to socially engineer a mobile carrier. Interaction is defined as clicking a link within the email and/or submitting data to a web form.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Email gateway logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate email gateway, Enterprise DNS resolvers, Web proxies/Internet gateways",
            "action": "Analyze email gateway logs for messages targeting users with subjects related to mobile account security, carrier notifications, or password resets. Scan URLs in these emails against threat intelligence feeds. For any links that are clicked, correlate the user with DNS requests for the domain found in Zeek dns.log. Further correlate with Zeek http.log to confirm the user visited the site. Analyze the URI and POST requests in the http.log for evidence of submitted credentials or PII. Calculate the Shannon entropy of the domain names in dns.log to identify potential Domain Generation Algorithms (DGA) used for phishing. Users who visit a suspected PII-harvesting site should be flagged as being at high risk for a follow-on SIM swap attack, and their accounts should be placed on a watchlist for heightened monitoring of authentication activity."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]