[
  {
    "information_requirement": "Has an adversary gained initial access to the corporate network via a compromised mobile device?",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1461",
        "name": "Lockscreen Bypass",
        "evidence": [
          {
            "description": "A high-velocity series of failed corporate authentication events (Windows Event ID 4625) originating from a single source IP address associated with a mobile device, immediately followed by a successful authentication (Windows Event ID 4624) from the same IP, where the successful login's attributes (time, geolocation) deviate from the user's established baseline. This pattern suggests a brute-force attack against the user's corporate credentials, potentially enabled by a compromised device.",
            "data_sources": [
              "Windows Event ID 4625",
              "Windows Event ID 4624",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Authentication Servers (e.g., Active Directory Domain Controllers), VPN Concentrators, Cloud Identity Providers (e.g., Azure AD, Okta), Internet Gateway, MDM/UEM solution logs.",
            "action": "1. (Symbolic Logic) Create a rule to detect a specific event sequence: search for at least 5 failed logins (Windows Event ID 4625, Failure Reason: '%%2313') for a single user from a single source IP within a 10-minute window, followed by a successful login (Windows Event ID 4624) for the same user from the same IP within the subsequent 5 minutes. 2. (Statistical) For every successful login flagged by the symbolic rule, enrich the source IP with geolocation data using the Zeek conn.log. Calculate if the login time deviates more than 3 standard deviations from the user's mean login hour. Also, determine if the source country is historically rare for the user (e.g., present in <1% of their previous 90 days of logins). Generate a high-severity alert if the event sequence is met and either the time or location is statistically anomalous. 3. (Machine Learning) Train and apply a user-specific Isolation Forest model on historical login features (e.g., hour of day, day of week, source ASN, country). When the symbolic rule triggers, feed the features of the successful login into the model. If the model classifies the login with a high anomaly score (e.g., in the top 1% of scores), escalate the alert for immediate investigation."
          },
          {
            "description": "A mobile device, identified by its IP address on the corporate network (VPN or Wi-Fi), initiates network connections that are anomalous when compared to its own historical baseline or the baseline of its peer group. Specific anomalies include connections to high-value internal hosts not previously accessed, unusual DNS query patterns indicative of command and control, or traffic flows matching data exfiltration signatures.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal network segments (especially those housing sensitive data like developer environments or financial systems), Corporate Wi-Fi access points, VPN termination points, DNS resolvers, Egress points to the internet.",
            "action": "1. (Symbolic Logic) Maintain and monitor a watchlist of sensitive internal hostnames and IP addresses (e.g., 'payroll-db.internal', 'source-code.git.internal'). Generate an alert if a connection is observed in Zeek conn.log from a mobile device's IP to any asset on this watchlist, and the user associated with that device is not in a pre-approved access group. 2. (Statistical) For each mobile device IP, establish a baseline for its 99th percentile of outbound data transfer size ('orig_bytes' in Zeek conn.log) over a 30-day period. Also, calculate the baseline entropy of its DNS queries (from Zeek dns.log) in a 5-minute window. Trigger an alert if an outbound connection's data size exceeds 5x its established 99th percentile, or if the DNS query entropy significantly deviates (e.g., +/- 3 standard deviations) from its baseline. 3. (Machine Learning) Employ a graph-based anomaly detection model where nodes represent devices and internal servers. The model learns normal traffic patterns and community structures. Generate an alert when a mobile device establishes a connection that is highly improbable under the learned model (e.g., a device from the 'Sales' peer group connecting to a 'R&D' server). Concurrently, use a time series forecasting model (e.g., Prophet) on the volume of data uploaded from the device; an alert is raised if the actual volume significantly exceeds the forecasted upper confidence bound."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]