[
  {
    "information_requirement": "Is an adversary attempting to disrupt mobile device communications through a Network Denial of Service attack? (TA0034 - Impact)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1464",
        "name": "Network Denial of Service",
        "evidence": [
          {
            "description": "Multiple (>3) MDM-enrolled mobile devices within a 50-meter radius simultaneously report a loss of Wi-Fi connectivity and an inability to detect any available SSIDs for more than 60 seconds, while network-side monitoring (Zeek) shows an abrupt cessation of traffic from their last known IP addresses without a corresponding TCP FIN or RST packet.",
            "data_sources": [
              "Zeek conn.log",
              "Mobile OS/MDM Wi-Fi Logs",
              "Zeek weird.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points in sensitive areas (e.g., executive suites, R&D labs, data centers), mobile devices of key personnel, and geofenced event spaces (e.g., boardrooms, all-hands meeting areas).",
            "action": "Symbolic: Create a rule that triggers when an MDM-enrolled device reports a Wi-Fi state change to 'disconnected' and concurrently reports the count of visible SSIDs as zero. Escalate to an alert if more than three devices in the same NAI report this state within a 5-minute window. Statistical: For each NAI, establish a baseline of the mean and standard deviation of device Received Signal Strength Indicator (RSSI) values reported via MDM. Trigger an alert if a device's RSSI drops more than 3 standard deviations below its personal 30-day baseline for that NAI, or if the average RSSI for a group of 5+ devices in an NAI drops 2 standard deviations below the NAI's collective baseline. Machine Learning: Implement a time series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the count of Wi-Fi disconnect events per NAI. An alert is generated when the model flags a statistically significant spike in disconnects. Further qualify this by using an unsupervised clustering algorithm (e.g., DBSCAN) on the physical coordinates of the disconnecting devices to confirm they form a dense, localized group, indicative of a targeted jammer."
          },
          {
            "description": "A statistically significant percentage (>20%) of MDM-enrolled devices within a defined NAI simultaneously report 'No Service' or a cellular signal strength (RSRP) drop below -120 dBm for a sustained period (>2 minutes) in an area with a historically strong coverage baseline (e.g., average RSRP > -95 dBm).",
            "data_sources": [
              "Mobile OS/MDM Telephony Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Geofenced perimeters of critical infrastructure (corporate headquarters, data centers), off-site meeting venues for executive events, and the real-time travel corridors of high-value personnel.",
            "action": "Symbolic: Deploy a rule that alerts when the number of devices reporting a 'No Service' status within a single NAI exceeds a hard threshold (e.g., 5 devices) within a 1-minute sliding window. Statistical: For each NAI, calculate the hourly rate of 'No Service' events. Establish a baseline and alert if the current rate exceeds the 99th percentile of the historical distribution. Additionally, track the median cellular signal strength (e.g., RSRP) for all devices in the NAI and alert if it drops by more than 20 dBm in under 5 minutes. Machine Learning: Train a multivariate classification model (e.g., Random Forest) using features like time of day, day of week, device count in NAI, and historical signal strength to predict the likelihood of a 'mass outage' event being benign (e.g., carrier issue) vs. malicious. A high probability score for 'malicious', combined with a sudden onset, triggers a high-priority alert."
          },
          {
            "description": "An MDM-enrolled device reports a GPS horizontal accuracy of worse than 100 meters or a satellite count of less than 3 for a duration exceeding 60 seconds, while simultaneously reporting a loss of cellular or Wi-Fi connectivity. This behavior is observed in a location where historical data shows typical GPS accuracy is better than 15 meters.",
            "data_sources": [
              "Mobile OS/MDM Location Logs",
              "Mobile OS/MDM Telephony Logs",
              "Mobile OS/MDM Wi-Fi Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices used for asset tracking, fleet management, and by personnel operating in high-risk or sensitive environments where location integrity is critical.",
            "action": "Symbolic: Create a correlation rule that triggers if a single device reports a GPS status event with a satellite count less than 3 within 60 seconds of also reporting a cellular status of 'No Service' or a Wi-Fi status of 'disconnected' with a visible SSID count of 0. Statistical: For each device, establish a baseline of its median GPS horizontal accuracy. Generate an alert if the accuracy degrades by more than 5 standard deviations from its baseline for more than 2 minutes. Calculate the entropy of a device's reported location coordinates over a 10-minute window; a sudden, sharp increase in entropy indicating erratic location jumps should trigger an investigation. Machine Learning: Use an isolation forest algorithm to detect anomalies across multiple GPS-related features simultaneously (e.g., horizontal accuracy, vertical accuracy, satellite count, time-to-first-fix). Anomaly scores that are highly correlated in time with anomalies detected in cellular or Wi-Fi signal strength data (using a separate model) should be flagged as a potential multi-signal jamming event."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]