[
  {
    "information_requirement": "Is an adversary leveraging legitimate external web services for one-way command and control against corporate mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1481.003",
        "name": "One-Way Communication",
        "evidence": [
          {
            "description": "A corporate mobile device application makes repeated, small, outbound connections to a known file-sharing, social media, or paste site (e.g., Pastebin, GitHub Gist, Twitter) in a beacon-like pattern, inconsistent with typical user browsing. The data transfer size is consistently small, and the timing is periodic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The organization's network perimeter, specifically the internet gateway and Wi-Fi access points used by mobile devices.",
            "action": "Filter Zeek conn.log for traffic originating from the corporate mobile device IP range. For each source IP, group connections by destination server name (from ssl.log `server_name` or http.log `host`). Analyze the time delta between consecutive connections to the same host. Calculate the standard deviation of these time deltas; a very low standard deviation indicates periodic beaconing. Also, calculate the 95th percentile of the `orig_bytes` for these connection groups. A low byte count (e.g., under 1KB) combined with periodic timing is a strong indicator. Correlate with http.log to check if the `user_agent` is unusual or non-standard for a mobile browser. Score devices based on the number of suspicious beaconing behaviors detected."
          },
          {
            "description": "A mobile application connects to a legitimate web service, but the destination URI points to a raw content endpoint or a specific, non-human-readable resource, rather than a typical user-facing webpage. The Content-Type of the response may also be plain text.",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The organization's network egress points, focusing on traffic from managed mobile devices.",
            "action": "Analyze Zeek http.log for requests originating from the mobile device IP space. Search for URI patterns that indicate raw content retrieval (e.g., `*.pastebin.com/raw/*`, `gist.githubusercontent.com/*`, `api.twitter.com/*`). Calculate the entropy of the URI path; C2 URIs may have higher entropy or be pseudo-random. For identified connections, inspect the corresponding `Content-Type` in the http.log reply headers; `text/plain` for a site that normally serves `text/html` is suspicious. Use Zeek files.log to analyze the MIME type and content of any downloaded files. A high frequency of small, plain-text file downloads from these services by a single device is a key indicator of potential one-way C2."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]