[
  {
    "information_requirement": "Is an adversary using custom symmetric encryption for command and control on our managed mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1521.001",
        "name": "Symmetric Cryptography",
        "evidence": [
          {
            "description": "A mobile application on a managed device is observed making highly regular, periodic network connections (beaconing) to a single destination. The data payload of these connections exhibits high entropy, suggesting it is encrypted, and does not conform to known protocols for the port in use.",
            "data_sources": [
              "Zeek conn.log",
              "Mobile EDR/MDM network flow logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN gateways, Managed mobile devices",
            "action": "From network flow data (Zeek conn.log or mobile EDR), group connections by source mobile device and destination. For each group, calculate the time difference between consecutive connections to the same destination. Identify groups with a low standard deviation in these time differences, which indicates a consistent beaconing interval. For these identified beaconing flows, analyze the payload sizes. If payload capture is available, calculate the Shannon entropy of the data; a score greater than 7.5 (for 8-bit bytes) indicates likely encryption. Score and alert on connections that exhibit a combination of high-frequency beaconing, high payload entropy, and connections to low-reputation or newly-observed domains."
          },
          {
            "description": "Network traffic from a mobile device is observed over a standard, well-known port (e.g., 53, 443) but does not conform to the expected protocol (DNS, TLS). This suggests an adversary may be tunneling encrypted C2 traffic over a commonly allowed port to bypass firewall rules.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek ssl.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, DNS resolvers, Corporate Wi-Fi access points",
            "action": "Analyze Zeek logs for protocol anomalies. For connections on port 443, identify source IPs from mobile device network ranges that appear in conn.log but do not have a corresponding entry in ssl.log, indicating the session is not valid TLS. For connections on port 53, identify source IPs that appear in conn.log but have no corresponding valid query/response in dns.log. Create a risk score for mobile devices that generate such traffic. Increase the score if the destination is a direct-to-IP connection rather than a hostname, or if the destination IP has a poor reputation. Statistically profile the volume of such mismatched traffic per device and alert on significant deviations from the established baseline."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]