[
  {
    "information_requirement": "Is an adversary transferring malicious tools or files onto our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1544",
        "name": "Ingress Tool Transfer",
        "evidence": [
          {
            "description": "A mobile device downloads a file with a high-risk MIME type (e.g., application/octet-stream, application/x-executable, application/vnd.android.package-archive) from a URL whose domain is not on an established allow-list of legitimate software sources, CDNs, or corporate services. Further suspicion is warranted if the domain has a low reputation score, was registered within the last 90 days, or is flagged by threat intelligence feeds.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek files.log",
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points capturing traffic from corporate-managed mobile devices, including VPN concentrators, corporate Wi-Fi access point controllers, and Mobile Threat Defense (MTD) platform traffic logs.",
            "action": "1. Symbolic (IOC Matching): Correlate Zeek `http.log` `host` and `conn.log` `id.resp_h` fields against a threat intelligence feed of known malicious C2 domains and IPs. Generate a high-severity alert for any match associated with traffic from the mobile device VLAN/IP space. 2. Statistical (Heuristic Analysis): From Zeek `files.log`, filter for files transferred to mobile devices. For each file, calculate the Shannon entropy of the filename; flag filenames with entropy greater than the 95th percentile of all observed filenames in the last 30 days. Simultaneously, check if the `mime_type` is in a high-risk list (`'application/octet-stream'`, `'application/x-executable'`, `'application/vnd.android.package-archive'`). If both conditions are met and the source domain from `http.log` is younger than 90 days (from WHOIS data), escalate for investigation. 3. Machine Learning (Behavioral Anomaly): Use JA3/JA3S hashes from `ssl.log` to build a device-specific profile of legitimate client-server handshakes. A new, never-before-seen JA3/JA3S hash associated with a file download is a strong feature for an anomaly detection classifier (e.g., Isolation Forest) to flag suspicious C2 connections."
          },
          {
            "description": "A single connection from a mobile device downloads a payload where the total bytes (`resp_bytes`) exceeds the 99th percentile of all connection sizes for that specific device or user over the past 30 days. This anomaly is not associated with a known software update domain or a scheduled backup process.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points capturing traffic from corporate-managed mobile devices, including VPN concentrators, corporate Wi-Fi access point controllers, and Mobile Threat Defense (MTD) platform traffic logs.",
            "action": "1. Symbolic (Rule-Based Threshold): Create a rule that triggers an alert if a single session in Zeek `conn.log` from a mobile device IP has `resp_bytes` > 50MB and the destination (`id.resp_h`) is not on an allow-list of approved file sharing, software update, or cloud storage domains. This serves as a simple high-water-mark detector for unusually large transfers. 2. Statistical (Peer Group Analysis): For each mobile device, calculate the total daily download volume (`sum(resp_bytes)` from `conn.log`). Group devices by their role or department. Use a Z-score calculation to identify if a device's daily download volume is an outlier within its peer group (e.g., Z-score > 3). This helps normalize for roles that legitimately transfer more data and highlights individual anomalies. 3. Machine Learning (Time Series Forecasting): For each mobile device, create a time series of total hourly download volume. Apply a forecasting model like Prophet or LSTM to predict the expected volume for the next hour. If the actual observed volume exceeds the model's prediction confidence interval (e.g., the `yhat_upper` value in Prophet), flag the hour for anomalous ingress. Correlate this flag with DNS requests (`dns.log`) in the same window; if the requests are to low-reputation or newly seen domains, increase the alert severity."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]