[
  {
    "information_requirement": "Is an adversary using foreground services to establish persistence on a corporate mobile device? (TA0028 - Persistence)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1541",
        "name": "Foreground Persistence",
        "evidence": [
          {
            "description": "An Android application manifest explicitly requests the 'android.permission.FOREGROUND_SERVICE' permission, and runtime logs from the device show the application is actively invoking the startForeground() service method, particularly in applications not typically associated with persistent user notifications (e.g., calculators, simple games).",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Android Logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (Android); Corporate App Store/Vetting Environment",
            "action": "1. (Symbolic) Using MDM data, create a watchlist of applications with the 'FOREGROUND_SERVICE' permission that are not from the official Google Play Store or are not part of an approved corporate application catalog. Generate an alert for any new installation of these apps. 2. (Statistical) For all apps with the 'FOREGROUND_SERVICE' permission, establish a baseline of foreground service duration using Android Logcat data. Calculate the 95th and 99th percentiles for service runtime duration per application category (e.g., navigation, music). An application exceeding the 99th percentile for its category triggers an alert. 3. (Machine Learning) Develop a logistic regression classifier trained on application metadata (permissions, app store of origin, user ratings, category) and network behavior to predict the likelihood that an application's use of a foreground service is malicious. A high probability score (>0.9) flags the application and device for investigation."
          },
          {
            "description": "A corporate mobile device, identified by its IP address on the Wi-Fi network, maintains one or more TCP connections with a single external endpoint for a duration exceeding a statistically defined threshold (e.g., > 8 hours), especially during non-business hours (e.g., 10 PM to 6 AM local time).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM device inventory"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments for mobile devices; DNS resolvers; Network egress points",
            "action": "1. (Symbolic) Query Zeek conn.log for connections originating from the mobile device IP range where the connection duration is > 28800 seconds (8 hours) and the destination IP is on a threat intelligence blocklist. Correlate with Zeek dns.log to check if the destination domain is known malicious. 2. (Statistical) For each mobile device, calculate the 95th percentile of all outbound connection durations over a 30-day rolling window. Generate a risk score by adding points if a new connection's duration exceeds this percentile and if the total data transferred ('orig_bytes' + 'resp_bytes') is in the top 5% for that device. A high cumulative score triggers an alert. 3. (Machine Learning) Use a time-series anomaly detection model (e.g., Seasonal-Hybrid ESD) on the volume of long-duration connections per device. A sudden spike in the number of persistent connections that the model flags as an anomaly indicates a potential compromise."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  },
  {
    "information_requirement": "Is an adversary evading background process restrictions on mobile devices to access sensors? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1541",
        "name": "Foreground Persistence",
        "evidence": [
          {
            "description": "Network traffic from a mobile device shows connections to a single external destination IP with a standard deviation in the inter-packet arrival time approaching zero, indicating automated, non-human-generated communication. The entropy of the time delta between sequential connections is measured to be unusually low.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points; Corporate Wi-Fi network segments for mobile devices",
            "action": "1. (Symbolic) Scan Zeek http.log for traffic from the mobile IP range where the 'user_agent' string is missing, generic (e.g., 'Dalvik/2.1.0'), or matches a known malicious signature, and where the destination is a non-categorized or newly registered domain identified from Zeek dns.log. 2. (Statistical) For each source-destination IP pair in Zeek conn.log, collect connection timestamps over a 1-hour window. Calculate the Shannon entropy of the time differences between consecutive connections. A very low entropy score (e.g., < 1.0) indicates highly periodic beaconing and should be flagged. 3. (Machine Learning) Implement an unsupervised clustering algorithm (e.g., DBSCAN) on connection features: (duration, bytes sent, destination port, inter-arrival time standard deviation). Identify outlier clusters representing C2 beaconing, which would exhibit low duration, low data volume, and high regularity."
          },
          {
            "description": "An application, identified via MDM as using a foreground service, generates network flows with a ratio of bytes sent to connection count that is multiple standard deviations above the established baseline for that specific application or its category, suggesting bulk data transfer.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (Android); Corporate Wi-Fi network segments for mobile devices",
            "action": "1. (Symbolic) Join MDM application inventory data with Zeek conn.log data. Create a rule to alert if an application with the 'FOREGROUND_SERVICE' permission communicates with an IP address on a threat intelligence feed categorized as a 'drop zone' or 'exfiltration point'. 2. (Statistical) For each application using a foreground service, establish a 30-day rolling baseline of the average bytes sent per connection ('orig_bytes' / connection count). Alert if the daily average for an application on any device exceeds 3 standard deviations from this baseline. 3. (Machine Learning) Train a regression model to predict the expected daily data upload volume for a device based on historical usage. A large, sustained residual (the difference between predicted and actual data volume) flagged by the model suggests an anomalous data exfiltration event not explained by normal user behavior."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]