[
  {
    "information_requirement": "Is an adversary using scheduled tasks for persistence on mobile devices? (PIR)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1603",
        "name": "Scheduled Task/Job",
        "evidence": [
          {
            "description": "A mobile device generates network connections to a specific destination at regular, predictable intervals with low temporal jitter, which is characteristic of an automated, scheduled task used for command and control (C2) beaconing.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN gateways, Network egress points, Mobile Device Management (MDM) / Unified Endpoint Management (UEM) platforms.",
            "action": "1. (IOC Match) For all outbound connections from mobile device IP ranges in `Zeek conn.log`, extract destination IPs and associated domains from `Zeek dns.log`. Compare these destinations against a threat intelligence feed of known C2 servers. Alert on any match. 2. (Statistical Analysis) For each source-destination pair, calculate the time deltas (jitter) between consecutive connections. Identify pairs with a standard deviation of time deltas below a low threshold (e.g., < 5 seconds), indicating automated, periodic communication. Also, calculate the entropy of destination ports used by each device; an unusually low entropy score suggests communication with a single C2 channel. Flag devices where jitter is in the lowest 5th percentile and port entropy is in the lowest 5th percentile compared to their peers. 3. (Time-Series Analysis) For connections identified as periodic via statistical analysis, apply a time-series forecasting model (e.g., Seasonal-ARIMA) to the connection timestamps. If the model predicts future connection times with high accuracy and low error, it strongly confirms the presence of a scheduled, automated task. A successful prediction for a connection to a low-reputation domain is a high-fidelity alert."
          },
          {
            "description": "Network traffic from a mobile device utilizes uncommon destination ports or tunnels application data over a common protocol (e.g., DNS), which deviates from the established baseline of legitimate application behavior for the device or its peer group.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, VPN gateways, Network egress points, Internal DNS resolvers.",
            "action": "1. (IOC/Rule Match) In `Zeek conn.log`, scan for traffic from mobile devices to destination ports known to be associated with malware (e.g., from threat intelligence). Also, use Zeek's protocol analysis to identify mismatches, such as non-HTTP traffic over ports 80/443, and alert. 2. (Statistical Analysis) For each mobile device, create a profile of destination ports used and bytes transferred per port. Identify statistical outliers by flagging devices with a high percentage (e.g., >95th percentile) of traffic to ports outside the top 100 most common ports across the mobile fleet. For DNS tunneling detection in `Zeek dns.log`, calculate the average query length and the ratio of TXT/CNAME queries to A/AAAA queries per device. Flag devices with anomalously high values compared to the fleet baseline (e.g., >3 standard deviations above the mean). 3. (Clustering Analysis) Create feature vectors for each device based on its network traffic profile (e.g., distribution of protocols, port usage, average connection duration, data volume). Apply a density-based clustering algorithm like DBSCAN to group devices with similar behavior. Devices that are classified as noise or belong to very small clusters are anomalous and warrant investigation for covert C2 channels."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  },
  {
    "information_requirement": "Is an adversary using a scheduled task to execute malicious code on mobile devices? (PIR)",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1603",
        "name": "Scheduled Task/Job",
        "evidence": [
          {
            "description": "A mobile device initiates a download of a file with a potentially executable MIME type (e.g., 'application/vnd.android.package-archive') from a low-reputation source, with the download event's timestamp correlating to a recurring, predictable schedule (e.g., within 60 seconds of the top of the hour).",
            "data_sources": [
              "Zeek http.log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, Corporate Wi-Fi access points, Web Proxies.",
            "action": "1. (IOC Match) In `Zeek files.log`, extract file hashes (MD5, SHA1) for all downloads to mobile devices and compare them against malware hash databases. In `Zeek http.log`, check the `host` and `uri` fields against threat intelligence feeds for malicious domains and payload paths. Alert on any match. 2. (Statistical Analysis) Monitor `Zeek files.log` for mobile-related executable MIME types (e.g., 'application/vnd.android.package-archive', 'application/x-mach-o'). For these files, calculate the Shannon entropy of the filename. Flag downloads where the filename entropy is in the top 5th percentile, suggesting randomization. Also, analyze the timestamp of the download; flag any that occur with high regularity at specific intervals (e.g., every hour at H+01:00). 3. (Classification Model) Train a supervised classification model (e.g., Logistic Regression) to score the likelihood of a download being malicious. Use features from Zeek logs such as: source IP reputation, domain age, filename entropy, User-Agent string rarity, file MIME type, and whether the download occurs off-hours. Downloads with a high malicious probability score should trigger an alert for analyst review."
          },
          {
            "description": "A mobile device, following a period of inactivity or at a predictable time, issues a DNS query for a domain that is either on a threat intelligence list, newly registered, or exhibits characteristics of domain generation algorithms (DGA).",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internal DNS resolvers, Network egress points.",
            "action": "1. (IOC Match) In `Zeek dns.log`, continuously compare all domains queried by mobile devices against threat intelligence feeds of known malicious, DGA, and C2 domains. Also, check against a list of newly registered domains (NRDs) and flag any queries to domains registered within the last 72 hours. 2. (Statistical Analysis) For each queried domain not on an allowlist, calculate its character entropy and n-gram frequency score (e.g., by comparing its 2-gram and 3-gram frequencies to those from a large list of legitimate domains). Flag domains that have high entropy and low n-gram scores (e.g., in the 98th percentile for entropy and bottom 2nd percentile for n-gram score), as these are characteristic of DGAs. 3. (DGA Classification) Implement a machine learning model (e.g., a pre-trained LSTM or Random Forest classifier) that takes a domain name as input and outputs a probability score of it being generated by a DGA. Feed all non-allowlisted domains queried by mobile devices into the model. Alert on domains that receive a high DGA probability score, especially if the query occurs shortly after a suspicious file download or at a suspicious time."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]