[
  {
    "information_requirement": "Is an adversary executing unauthorized commands or scripts on mobile devices via a Unix shell?",
    "tactic_id": "TA0041",
    "tactic_name": "Execution",
    "indicators": [
      {
        "technique_id": "T1623.001",
        "name": "Unix Shell",
        "evidence": [
          {
            "description": "A parent process, not included in an established baseline of legitimate shell-spawning applications, executes a shell process (e.g., 'sh', 'bash'). The baseline is defined by applications present in the corporate MDM-approved application catalog and known administrative tools.",
            "data_sources": [
              "Mobile EDR/MTD Process Creation Events",
              "MDM Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM servers hosting application inventories, Cloud-hosted Mobile Threat Defense (MTD) platform, Individual corporate-managed mobile endpoints (iOS/Android)",
            "action": "1. (Symbolic) Create and maintain an allowlist of legitimate parent process names and their hashes known to spawn shells (e.g., 'sshd', MDM agent binaries). In your SIEM, trigger a high-severity alert if a process creation event shows a shell process (e.g., 'sh', 'bash') spawned by a parent process not on this allowlist. 2. (Statistical) For each mobile application across the fleet, calculate the frequency of shell process creation over a 30-day rolling window. Flag any application that suddenly begins spawning shells or whose shell-spawning frequency increases by more than three standard deviations above its historical mean. 3. (Machine Learning) Train a classification model (e.g., Random Forest) using features from the process creation event, such as parent process name, parent process path, user context, and application signature. The model should be trained on labeled data to classify shell-spawning events as either 'benign' or 'malicious'. Deploy this model to score new events in real-time."
          },
          {
            "description": "A Unix shell process is executed with command-line arguments matching known malicious patterns (e.g., inline downloaders), exhibiting high character entropy indicative of obfuscation, or involving network connections to non-categorized or newly observed domains.",
            "data_sources": [
              "Mobile EDR/MTD Process Creation Events with Command-Line Logging",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress gateways (Firewalls, VPN Concentrators, Proxies), DNS resolvers serving mobile device clients, Cloud-hosted Mobile Threat Defense (MTD) platform",
            "action": "1. (Symbolic) In your SIEM, deploy a ruleset to scan command-line arguments of shell processes for high-risk regular expressions, such as 'curl ... | sh', 'wget', 'base64 -d', and IP addresses in place of hostnames. Correlate any matches with Zeek dns.log to check if the destination is a known C2 domain from a threat intelligence feed. 2. (Statistical) For every shell command line executed, calculate its Shannon entropy score. Establish a baseline entropy distribution for legitimate shell commands observed in your environment. Alert on any command whose entropy score exceeds the 99th percentile of this baseline. 3. (Machine Learning) Utilize a time-series forecasting model (e.g., ARIMA) on network traffic volume (bytes_in/bytes_out from Zeek conn.log) associated with shell processes. An alert should be generated if the observed traffic significantly deviates from the forecasted volume, which could indicate unexpected data exfiltration or payload download following command execution."
          },
          {
            "description": "A process creation event is observed for a superuser binary (e.g., 'su', 'sudo') on a mobile device. This is a critical indicator of privilege escalation, often on a device that has been rooted or jailbroken.",
            "data_sources": [
              "Mobile EDR/MTD Process Creation Events",
              "MDM/UEM Device Compliance and Attestation Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/UEM servers hosting device compliance state, Individual corporate-managed mobile endpoints, Identity and Access Management (IAM) platform for user context",
            "action": "1. (Symbolic) Create a zero-tolerance, critical-severity alert in the SIEM for any process creation event where the process name is 'su' and the parent process is not a known administrative tool or the MDM agent itself. This alert should trigger an automated response via SOAR to quarantine the device using the MDM API. 2. (Statistical) Monitor the fleet-wide count of unique devices executing 'su' per hour. A sudden spike in this count, exceeding three standard deviations above the rolling 7-day average, indicates a potential widespread campaign and should be escalated for immediate investigation. 3. (Machine Learning) Use an unsupervised clustering algorithm (e.g., DBSCAN) on device telemetry following a 'su' execution. Features could include subsequent network connections (e.g., destination ASN, port), processes spawned, and files accessed. This can help group compromised devices that are part of the same campaign or controlled by the same threat actor."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]