[
  {
    "information_requirement": "Is an adversary maintaining persistence on our mobile devices through event-triggered execution? (PIR)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1624",
        "name": "Event Triggered Execution",
        "evidence": [
          {
            "description": "An installed application has registered to receive system event broadcasts that are unusual for its category or are paired with other high-risk permissions. For example, a calculator app that registers a receiver for the 'android.intent.action.BOOT_COMPLETED' or 'android.provider.Telephony.SMS_RECEIVED' events.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Android Application Manifests (AndroidManifest.xml)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet",
            "action": "Periodically collect the list of installed applications and their manifest files from all managed mobile devices. For each application, parse the manifest to extract all registered broadcast receivers ('<receiver>') and their associated intent filters. Establish a baseline of legitimate receivers for approved applications. Create a risk score for each application based on the receivers it registers. For example, receivers for 'BOOT_COMPLETED', 'SMS_RECEIVED', or 'NEW_OUTGOING_CALL' should have a high weight. Correlate these with requested permissions (e.g., 'READ_SMS', 'SEND_SMS', 'INTERNET'). Applications exceeding a risk threshold, especially those whose registered events do not align with their stated function, should be flagged for manual review."
          },
          {
            "description": "A burst of anomalous network activity from a mobile device occurs immediately following a common system event, such as device boot-up, connecting to a Wi-Fi network, or device unlock.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM Event Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways and VPN concentrators",
            "action": "Ingest MDM event logs to identify timestamps for system events like 'device boot' or 'connected to network' on a per-device basis. Correlate these timestamps with network logs (Zeek conn.log) from the infrastructure through which the device's traffic is routed. For each device, analyze the network connections made within a short window (e.g., 30-60 seconds) following a system event. Calculate the entropy of requested domain names in dns.log within this window to detect potential DGA activity. Compare the destination IPs/domains against threat intelligence feeds. Establish a baseline of normal post-event network behavior for each device/user and use statistical methods (e.g., 3-sigma deviation from the mean number of connections or data volume) to detect significant anomalies indicative of malicious code execution."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]