[
  {
    "information_requirement": "Is an adversary hiding artifacts on managed mobile devices to evade detection?",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628",
        "name": "Hide Artifacts",
        "evidence": [
          {
            "description": "A discrepancy exists where an application package name from a device's full inventory list does not appear in the corresponding list of applications with a registered launcher icon, and the package name is not present on an established whitelist of legitimate iconless applications (e.g., system services, plugins).",
            "data_sources": [
              "MDM Application Inventory Log",
              "Mobile Endpoint Security Agent Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) platform servers, Unified Endpoint Management (UEM) consoles, Corporate-owned mobile devices (iOS, Android), Employee-owned devices enrolled in BYOD program",
            "action": "1. (Symbolic Logic) On a scheduled basis, query MDM/UEM logs to generate a list of all installed application package names per device. Concurrently, generate a list of applications with registered launcher icons from the same logs. Identify the set difference to find all iconless applications. Compare the package names of these iconless applications against a threat intelligence feed of known malicious mobile application package names. An exact match generates a high-severity alert. Maintain and apply a whitelist of known-good iconless applications (e.g., system services, keyboard extensions) to suppress false positives.\n2. (Statistical Analysis) For all non-whitelisted, iconless applications identified in step 1, calculate their prevalence across the entire mobile device fleet (e.g., 'app_X appears on 3 of 5,000 devices'). Flag applications with a prevalence below a set threshold (e.g., <0.5%) for investigation. Additionally, establish a baseline for the count of non-whitelisted iconless apps per device model and OS version. Use a percentile-based threshold (e.g., alert if the count for a device is in the 98th percentile) to detect devices with an anomalously high number of hidden applications.\n3. (Machine Learning) Develop a classification model (e.g., a Random Forest or Gradient Boosting Classifier) to predict the maliciousness of newly discovered, non-whitelisted iconless applications. Collect features for each application such as requested permissions (e.g., access contacts, SMS, location), signing certificate details, installation source, and statistical prevalence from step 2. Train the model using labeled data from historical analysis, malware sandboxes, and threat intelligence. Deploy the trained model to score new iconless applications in near-real-time; a score exceeding a predefined confidence threshold (e.g., >0.85) triggers an alert for analyst review."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]