[
  {
    "information_requirement": "Is an adversary abusing elevation control mechanisms to escalate privileges on mobile devices? (PIR)",
    "tactic_id": "TA0029",
    "tactic_name": "Privilege Escalation",
    "indicators": [
      {
        "technique_id": "T1626",
        "name": "Abuse Elevation Control Mechanism",
        "evidence": [
          {
            "description": "A mobile application is granted administrative privileges, and the application's package ID is either absent from a pre-approved administrative application allowlist or its installation prevalence across the mobile device fleet falls below a statistically significant threshold (e.g., bottom 5th percentile).",
            "data_sources": [
              "MDM/EMM Audit Logs",
              "Mobile OS System Logs",
              "Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM log aggregation platform, Corporate Application Store inventory database, Managed mobile device fleet",
            "action": "1. [Symbolic] Create and maintain an allowlist of application package IDs authorized for administrative privileges (e.g., MDM client, security agents). For each privilege grant event recorded in MDM/EMM logs, compare the application's package ID against the allowlist. Generate a high-severity alert for any grant to an unlisted application. 2. [Statistical] Continuously ingest application inventory logs from all managed mobile devices to maintain a fleet-wide application prevalence baseline. For each administrative privilege grant event, query the prevalence score (count of devices with app / total devices) for the associated application. Generate a medium-severity alert if an application with a prevalence score in the bottom 5th percentile is granted administrative rights. 3. [Machine Learning] Develop and deploy a logistic regression classifier trained on historical privilege grant events. Feature engineering should include: application category, developer signature reputation, count of other permissions requested, application prevalence score, and time since the application was first observed in the environment. Score each new privilege grant event in real-time. Events with a malicious probability score exceeding 0.85 should be automatically escalated for immediate analyst review."
          },
          {
            "description": "A mobile device's network traffic exhibits anomalous patterns, such as connections to known malicious destinations or statistically unusual data flows, within a 5-minute window immediately following an administrative privilege grant event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "MDM/EMM Audit Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Core network switches and routers with traffic mirroring to Zeek sensors, DNS resolvers forwarding logs to SIEM, MDM/EMM log aggregation platform",
            "action": "1. [Symbolic] Correlate MDM privilege grant events with network logs (Zeek conn.log, dns.log) from the device's source IP address by timestamp. Within a 5-minute window following the grant, scan for DNS queries or TCP/UDP connections to domains/IPs present on threat intelligence feeds or to domains registered within the last 30 days (Newly Registered Domains). A positive match generates a high-severity alert correlating the privilege grant and the suspicious network activity. 2. [Statistical] For the same 5-minute post-grant window, calculate the Shannon entropy of all requested domain names in the device's Zeek dns.log data. An entropy score greater than 4.0 indicates potential DGA activity and should trigger a medium-severity alert. Concurrently, monitor the total volume of outbound data ('resp_bytes' in Zeek conn.log) and alert if the volume exceeds the 99th percentile of the device's historical 5-minute baseline, calculated over the last 30 days. 3. [Machine Learning] Deploy a time-series anomaly detection model, such as an LSTM autoencoder, trained on each device's historical network telemetry (e.g., connection count, data volume, protocol distribution per minute). Feed the network data from the 5-minute window following a privilege grant into the model. An event flagged by the model as a significant anomaly (high reconstruction error) should be escalated for analyst investigation, providing the context of the preceding privilege grant."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]