[
  {
    "information_requirement": "Is the adversary concealing captured multimedia files on mobile devices?",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628.003",
        "name": "Conceal Multimedia Files",
        "evidence": [
          {
            "description": "A '.nomedia' file is created in a directory on an Android device, making multimedia files within that directory invisible to standard media scanning applications like the Gallery.",
            "data_sources": [
              "Mobile EDR File System Auditing",
              "Mobile MDM Application Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "File systems of corporate-managed Android devices, specifically directories like /DCIM/, /Pictures/, or app-specific data folders.",
            "action": "Continuously monitor file system creation events on managed Android endpoints for any file named '.nomedia'. Correlate the creation event with the process that created it. Flag any non-user, non-OS process creating this file. Calculate the entropy of the parent directory's name; a high entropy score suggests a randomly generated name, which is common for malware. Alert when a '.nomedia' file is created by a recently installed application or in a high-entropy directory."
          },
          {
            "description": "Multimedia files (e.g., JPG, PNG, MP4) are exfiltrated from a mobile device over the network, especially if the destination is a new or low-reputation domain.",
            "data_sources": [
              "Zeek files.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring traffic from mobile device subnets (e.g., corporate or guest Wi-Fi).",
            "action": "Analyze Zeek logs for traffic originating from the mobile device network segment. In 'files.log', filter for transmissions with multimedia MIME types (e.g., image/jpeg, image/png, video/mp4). For each session in 'conn.log' associated with these file transfers, analyze the destination IP and domain. Establish a baseline for typical upload destinations and data volumes per device. Use statistical analysis to flag transfers to destinations not seen in the last 30 days or where the total data uploaded exceeds three standard deviations from the device's daily average."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]