[
  {
    "information_requirement": "Is an adversary preventing the removal of malicious applications on our managed mobile devices? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629.001",
        "name": "Prevent Application Removal",
        "evidence": [
          {
            "description": "A non-standard or suspicious application is granted 'Device Administrator' or 'Accessibility Service' permissions on a managed mobile device, which could be used to prevent uninstallation.",
            "data_sources": [
              "Windows Event Log (from MDM Server)",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/EMM Management Server",
            "action": "Query Mobile Device Management (MDM) logs, assumed to be forwarded to a central Windows Event Log, for events indicating an application has been granted 'Device Administrator' or 'Accessibility Service' permissions. Maintain and reference an allow-list of legitimate, expected applications that require these permissions. Generate an alert for any application not on this list that receives these permissions. As an enrichment step, calculate the character entropy of the application package name; package names with high entropy scores (indicating randomness) should have their risk score elevated. Correlate the permission grant event time with network activity from the same device (from Zeek conn.log) within a 5-minute window to identify potential C2 registration activity immediately following the permission escalation."
          },
          {
            "description": "A mobile device, where an application has recently gained high-risk permissions, exhibits anomalous network behavior indicative of Command and Control (C2) communication or UI interference callbacks.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Network Gateway",
            "action": "For devices flagged by the previous action (non-whitelisted app with high-risk permissions), conduct a focused analysis of their network traffic in Zeek logs. For each flagged device, establish a baseline of normal network activity, including metrics such as destination ports, data volume per connection, and connection frequency using a 30-day lookback. Hunt for anomalous connections that deviate from this baseline, such as connections to domains with a low Alexa rank or those first seen within the last 7 days (from Zeek dns.log), connections over non-standard ports, or TLS connections using JA3/JA3S hashes (from Zeek ssl.log) that are rare across the enterprise. Use statistical methods, such as flagging connections where key metrics exceed the 95th percentile of the device's baseline, to identify likely C2 traffic associated with the malicious application."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]