[
  {
    "information_requirement": "Is an adversary hiding malicious applications on our mobile devices by suppressing their icons? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1628.001",
        "name": "Suppress Application Icon",
        "evidence": [
          {
            "description": "An application is found in the device's complete installation inventory but does not have a corresponding icon in the main application launcher. This suggests the app's launcher activity has been programmatically disabled to hide its presence from the user.",
            "data_sources": [
              "MDM/EDR Application Inventory Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-owned and BYOD mobile endpoints",
            "action": "On a recurring basis (e.g., daily), use the MDM/EDR platform to pull two lists from all managed devices: 1) a complete list of all installed application packages (e.g., from PackageManager). 2) a list of all applications with a registered launcher activity. Use a script to perform a differential analysis between the two lists. Any application present in the first list but absent from the second is a high-confidence indicator of a hidden app. Prioritize alerts for non-system applications that also possess high-risk permissions."
          },
          {
            "description": "On a device running Android 10 or newer, a user taps an application icon and is redirected to the app's detail page in the system settings instead of the application opening. This is evidence of a 'synthesized activity', a placeholder icon created by the OS for an app that has attempted to hide its primary icon.",
            "data_sources": [
              "MDM/EDR Endpoint Activity Logs",
              "User-Reported Incidents"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile endpoints (Android 10+)",
            "action": "Configure MDM/EDR solutions to monitor for a sequence of process events: a user tap within the launcher application followed immediately by the launch of the system settings activity (`com.android.settings`). Correlate this event sequence with the application that was the target of the tap. Establish a baseline for legitimate apps that might exhibit this behavior (if any). Use a statistical approach to flag applications that cause this redirection event across multiple devices at a rate that is a significant deviation from the norm. Supplement this automated detection with a user awareness campaign instructing users on how to identify and report this specific behavior."
          },
          {
            "description": "Static analysis of an application package (APK) reveals programmatic calls to disable its own main launcher activity component, a method used to hide the application icon post-installation.",
            "data_sources": [
              "Application Vetting Platform Reports",
              "Mobile App Reputation Service (MARS) Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organizational application stores and application vetting sandboxes",
            "action": "Integrate an application vetting sandbox into the mobile application deployment lifecycle. For any new or updated application, automatically scan its `AndroidManifest.xml` to ensure it has a `LAUNCHER` intent. Furthermore, perform static code analysis to search for the use of the `PackageManager.setComponentEnabledSetting()` function paired with the `COMPONENT_ENABLED_STATE_DISABLED` flag targeting its own launcher activity. An application using this combination without a clear and legitimate purpose (e.g., a setup wizard that disables itself after first run) should be flagged for manual review before being approved for deployment."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]