[
  {
    "information_requirement": "Is the adversary using geofencing to evade detection or analysis on our mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1627.001",
        "name": "Geofencing",
        "evidence": [
          {
            "description": "A mobile application's manifest file lists location permissions (e.g., ACCESS_FINE_LOCATION, ACCESS_BACKGROUND_LOCATION, requestAlwaysAuthorization) that are not present in a pre-approved baseline for its application category and stated function (e.g., a 'calculator' app requesting background location).",
            "data_sources": [
              "MDM Application Manifest Scan Results",
              "Application Store Metadata",
              "Internal Application Whitelist/Category Definitions"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile Device Management (MDM) Platform, Application Vetting Sandbox, Corporate App Store/Repository, Managed Mobile Endpoints",
            "action": "1. (Symbolic) Ingest application inventory and manifest data from the MDM platform. Maintain a whitelist of applications and categories where location access is justified (e.g., Maps, Logistics). Create a SIEM rule to alert on any application that requests `ACCESS_BACKGROUND_LOCATION` or `requestAlwaysAuthorization` and is not on the explicit whitelist. 2. (Statistical) For each app category (e.g., 'Productivity', 'Finance'), establish a baseline for the number and type of permissions requested. Calculate the 95th percentile for permission count within each category. Flag any application that both exceeds its category's permission count threshold and requests any form of location access. 3. (Machine Learning) Train a classification model (e.g., Random Forest) using application store metadata (description, category) and its requested permissions as features to predict if a location permission request is 'justified' or 'suspicious'. Score all new and updated applications with the model to generate a risk rating, prioritizing apps with a 'suspicious' classification for manual review."
          },
          {
            "description": "Dynamic analysis of a mobile application reveals calls to geofencing-related APIs (e.g., Android GeofencingClient, iOS CLLocationManager region monitoring) that are not correlated with user interactions and which immediately precede a measurable change in network behavior, such as the cessation of connections to known C2 domains or a significant change in data exfiltration patterns.",
            "data_sources": [
              "Mobile Application Vetting Sandbox Logs",
              "Static Analysis Report (APK/IPA)",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Application Vetting Sandbox, Network Egress Points (VPN, Corporate Wi-Fi), DNS Resolvers, Web Proxy Servers",
            "action": "1. (Symbolic) During dynamic analysis, create a rule that alerts if an application calls a geofencing API (e.g., `addGeofences`) and, after a simulated location change, network traffic to a domain on a threat intelligence feed ceases for more than 10 minutes. 2. (Statistical) In a sandbox, establish a baseline of network behavior, including beaconing interval and DNS request entropy. Simulate a location change into a suspected 'denied' zone. Alert if the beaconing interval to a specific endpoint deviates by more than 3 standard deviations from the mean or if the Shannon entropy of requested subdomains drops below a statistically-derived threshold, indicating a switch from randomized to static C2 lookups or a halt in activity. 3. (Machine Learning) Deploy a time-series anomaly detection model (e.g., LSTM) on egress network traffic volume (bytes_out from Zeek conn.log) for sandboxed applications. Feed simulated location changes into the model as an external variable. An anomaly score that spikes immediately following a location change, especially when correlated with a sharp and sustained drop in traffic, indicates a high probability of evasive geofencing."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]