[
  {
    "information_requirement": "Is the adversary attempting to impair or disable security defenses on our mobile devices? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1629",
        "name": "Impair Defenses",
        "evidence": [
          {
            "description": "A managed mobile device fails to send its periodic heartbeat signal to the MDM/MTD management server for a duration that exceeds a dynamically calculated baseline, and this cessation of communication does not correlate with a legitimate 'unenrolled' or 'powered-off' event in the management console.",
            "data_sources": [
              "Zeek conn.log",
              "MDM/MTD Server Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway, Wi-Fi network infrastructure, and MDM/MTD Management Servers",
            "action": "1. (Symbolic) Cross-reference the list of devices that have missed a check-in against the MDM server's logs for any explicit 'unenroll' or 'decommission' events for those device IDs. A device that stops communicating without a corresponding legitimate event is a positive match. 2. (Statistical) For each device, calculate the mean and standard deviation of its check-in interval over the last 30 days using Zeek conn.log or MDM logs. Flag any device whose time since last check-in exceeds the 99th percentile (or mean + 3 standard deviations) of its historical intervals. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., ARIMA) on the check-in event stream for each device. A forecast that predicts a check-in, followed by a sustained period of no actual check-in events, should be flagged as an anomaly indicative of a potential communication impairment."
          },
          {
            "description": "A mobile device initiates a network connection to a known malicious domain/IP address associated with unauthorized app stores or malware C2, or downloads an application package (.apk, .ipa) whose file hash is present in threat intelligence feeds. [1]",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek files.log",
              "Threat Intelligence Platform (TIP) Feeds"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Organization's internet gateway and Wi-Fi network infrastructure",
            "action": "1. (Symbolic) Continuously match DNS queries (Zeek dns.log), HTTP host headers (Zeek http.log), and destination IPs (Zeek conn.log) against a threat intelligence feed of known malicious domains/IPs. Also, match file hashes from Zeek files.log against a malware hash database. A direct match generates a high-severity alert. 2. (Statistical) For DNS queries not on an allowlist, calculate the Shannon entropy $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$ of the query name. Flag queries with an entropy score greater than 3.5 as potential DGA. Additionally, track the rarity of requested domains across the organization; a device connecting to a domain seen by less than 1% of other mobile devices is suspicious. 3. (Machine Learning) Use a supervised classification model (e.g., Random Forest) trained on features from Zeek logs (DNS query length, entropy, TLD, HTTP user-agent, JA3 hash) to predict the probability of a connection being malicious. A prediction score exceeding a predefined threshold (e.g., > 0.85) indicates a high-likelihood malicious connection."
          },
          {
            "description": "An MTD agent on a mobile device reports the termination of a critical security process, modification of a security configuration profile, or the granting of excessive permissions (e.g., 'Device Administrator' on Android) to an unauthorized application.",
            "data_sources": [
              "Mobile Threat Defense (MTD) Agent Logs",
              "Mobile Device Management (MDM) Compliance Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device endpoints and MDM/MTD Management Servers",
            "action": "1. (Symbolic) Create a SIEM rule to alert whenever an event from the MTD/MDM log source contains a specific 'Process Terminated' event name where the process name matches a list of known security agents (e.g., 'mtd_agent', 'mdm_client') or a 'Profile Modified' event for a non-administrative user. 2. (Statistical) Establish a baseline of normal permission grants and profile modifications for device groups. Calculate the frequency of 'Device Administrator' or equivalent high-privilege grants. Alert when the rate of these events for a single device or user exceeds the 95th percentile for their peer group over a rolling 24-hour window. 3. (Machine Learning) Deploy a User and Entity Behavior Analytics (UEBA) model that profiles user and device activities. An anomaly score should be generated based on a sequence of events, such as a user downloading an app from a rare domain, followed by the app being granted high privileges, and then the MTD agent process terminating. A high cumulative anomaly score indicates a likely compromise."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]