[
  {
    "information_requirement": "Has an adversary established persistence on a mobile device by hijacking its execution flow? (TA0028 - Persistence)",
    "tactic_id": "TA0028",
    "tactic_name": "Persistence",
    "indicators": [
      {
        "technique_id": "T1625",
        "name": "Hijack Execution Flow",
        "evidence": [
          {
            "description": "A mobile device fails a remote attestation check, resulting in a log entry where the attestation status is 'failed' or an integrity hash mismatches the expected value. This indicates a potential compromise of the bootloader, OS kernel, or system applications to hijack execution flow.",
            "data_sources": [
              "Mobile Device Management (MDM) attestation logs",
              "Mobile Threat Defense (MTD) integrity scan logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "MDM/MTD management console, managed mobile endpoints (iOS, Android), and cloud infrastructure hosting the MDM/MTD services.",
            "action": "First, implement a symbolic rule in the SIEM to generate a high-severity alert for any log from the MDM/MTD platform where the device attestation status is 'failed' or the measured integrity hash does not match the known-good baseline hash. Second, apply a statistical method by tracking the rate of attestation failures per device model and OS version over a 24-hour rolling window; alert if the failure count for any cohort exceeds the 99th percentile of its historical 30-day distribution. Third, for a machine learning approach, implement a time series anomaly detection model (e.g., ARIMA) on the overall fleet-wide attestation failure rate. An alert is triggered if the observed failure rate significantly deviates from the forecasted rate, suggesting a coordinated or widespread attack."
          },
          {
            "description": "A core system process on a mobile device (e.g., trustd on iOS, netd on Android) initiates a network connection to a destination IP or domain flagged by threat intelligence, or exhibits network behavior such as high-entropy DNS queries or unusual data upload volumes statistically uncharacteristic for that process.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateway, VPN concentrators for mobile devices, and DNS resolvers serving mobile clients.",
            "action": "First, for symbolic detection, continuously correlate the destination IP (`id.resp_h` in conn.log) and server name (`server_name` in ssl.log or `query` in dns.log) from mobile device traffic against a threat intelligence feed of known C2 servers; generate an alert on any match. Second, for statistical analysis, baseline normal network activity for core system processes by profiling destination ports, data volume sent (`orig_bytes`), and DNS query string entropy. Alert if a connection uses a port outside the baseline, the data volume exceeds the 95th percentile of the process's historical distribution, or the DNS query entropy score is anomalously high, suggesting DGA activity. Third, apply a machine learning classification model (e.g., Random Forest) trained on labeled network data to assign a 'maliciousness score' to each connection from a system process, using features like port, protocol, duration, byte counts, and threat intel matches; connections with a score above a tuned threshold trigger an investigation."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]