[
  {
    "information_requirement": "Is an adversary removing indicators of compromise from mobile devices to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630",
        "name": "Indicator Removal on Host",
        "evidence": [
          {
            "description": "An application executes a data or cache clearing API call (e.g., Android's clearApplicationUserData, iOS's FileManager.removeItem) that is not flagged as user-initiated by the EDR agent and deviates from established behavioral baselines for the application or its category.",
            "data_sources": [
              "MDM Application Activity Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); Corporate Wi-Fi access points; VPN concentrators; Cloud-based MDM/UEM management consoles",
            "action": "1. (Symbolic) Create a SIEM correlation rule that triggers when a Mobile EDR log shows a data-clearing API call (e.g., `api_name` is 'clearApplicationUserData' or 'FileManager.removeItem') and the application's hash or package name is present on a threat intelligence list of known malware. 2. (Statistical) For each application package name, execute a scheduled query to calculate the hourly frequency of non-user-initiated data-clearing events per device. Establish a 30-day baseline for each application. Generate an alert if the current frequency for an application exceeds the 99th percentile of its historical baseline. 3. (Machine Learning) Train a Random Forest classifier to predict if a data-clearing event is malicious. Use features from MDM/EDR and Zeek logs such as: `app_category`, `is_user_initiated` (boolean), `time_of_day`, `day_of_week`, and `preceding_network_bytes_out` from Zeek conn.log in the 5-minute window before the event. A high probability score (> 0.9) should trigger an automated workflow to isolate the device."
          },
          {
            "description": "An application generates a high volume of file deletion events or deletes files outside its sandboxed directory, targeting sensitive locations such as user data folders (e.g., DCIM, Documents) or system log directories.",
            "data_sources": [
              "MDM File Integrity Monitoring Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek files.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); MDM/UEM servers; Network egress points with file transfer monitoring",
            "action": "1. (Symbolic) Deploy an EDR/FIM policy to generate a critical alert if a process not on an enterprise allowlist (e.g., non-system, non-security-agent processes) performs a delete operation within protected directories such as `/var/logs`, `DCIM`, or `Downloads`. 2. (Statistical) Run an hourly SIEM query to compute two metrics per application: the total count of deleted files and the Shannon entropy of the file extensions of deleted files using the formula $$ H(X) = -\\sum_{i=1}^{n} P(x_i) \\log_2 P(x_i) $$. Alert if the deletion count exceeds 3 standard deviations of the application's 30-day hourly baseline OR if the entropy score increases by more than 50% from its baseline, indicating indiscriminate deletion. 3. (Machine Learning) Ingest EDR file events into a data science environment. Use a DBSCAN clustering model on features like `deletion_count_per_minute`, `total_bytes_deleted`, and `directory_path_depth`. Isolate and investigate outlier event clusters. Correlate these outlier events with Zeek `files.log` and `conn.log` data for the same device and timeframe to check for preceding data exfiltration activity."
          },
          {
            "description": "An application is uninstalled from a device in a time period that is anomalously short (e.g., under one hour) following its installation, particularly when the uninstall is not explicitly user-initiated or is preceded by suspicious network activity.",
            "data_sources": [
              "MDM Application Inventory Log",
              "Mobile EDR/MTP Agent Log",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile devices (iOS, Android); MDM/UEM servers; Enterprise DNS resolvers",
            "action": "1. (Symbolic) Create a SIEM rule to alert when an MDM log shows an `app_uninstall` event and the `app_package_name` or `app_hash` is present on a threat intelligence feed categorized as 'short-lived malware' or 'dropper'. 2. (Statistical) Join MDM application install and uninstall logs on `device_id` and `app_name` to calculate `app_lifetime_seconds`. Alert if `app_lifetime_seconds` is below the 5th percentile of all app lifetimes calculated across the enterprise over the last 90 days. Enhance this by querying Zeek `dns.log` for the `device_id` during the app's lifetime; a ratio of NXDOMAIN responses to total queries greater than 0.5 is a strong corroborating indicator. 3. (Machine Learning) Train a logistic regression model to produce a risk score for each uninstallation event. Use features such as: `app_lifetime_seconds`, `install_source` (e.g., 'AppStore', 'Sideloaded'), `unique_dns_domains_contacted` (from Zeek `dns.log`), `total_bytes_transferred` (from Zeek `conn.log`), and `is_user_initiated` (boolean from EDR). A risk score > 0.85 should automatically create an incident ticket for Tier 2 analysis."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.2",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]