[
  {
    "information_requirement": "Is an adversary deleting files or wiping data on corporate mobile devices to evade detection or cause impact? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.002",
        "name": "File Deletion",
        "evidence": [
          {
            "description": "A mobile application not on the approved list, or a recently updated approved application, is granted device administrator privileges, which are required for a full device wipe.",
            "data_sources": [
              "Mobile Device Management (MDM) Logs",
              "Mobile Endpoint Detection and Response (EDR) Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed mobile devices (iOS, Android), Mobile Device Management (MDM) Platform",
            "action": "Maintain a baseline of applications approved for device administrator access within the MDM platform. Generate an alert for any deviation from this baseline, including new applications gaining these rights or existing applications gaining them post-update without formal approval. Correlate these alerts with app installation logs to identify the source and timing of the change."
          },
          {
            "description": "An anomalous, high-volume deletion of files is observed on a mobile device, occurring outside of a normal application uninstallation or cache-clearing process.",
            "data_sources": [
              "Mobile EDR Logs",
              "OS-level file system logs (e.g., Android Logcat)"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "User data partitions on corporate mobile devices, Application sandboxes on mobile devices",
            "action": "Using Mobile EDR data, establish a baseline for the rate of file deletions per user and device. Use statistical methods, such as calculating the 99th percentile of file deletions within a 5-minute window, to define a threshold for anomalous activity. Trigger an alert when the observed deletion rate exceeds this threshold. Enrich the alert with the process name responsible for the deletions and cross-reference with MDM logs to determine if the process is a managed, approved application."
          },
          {
            "description": "Deletion of specific, high-value file types (e.g., *.docx, *.pdf, *.sqlite) or files located in sensitive directories (e.g., /sdcard/Download, /sdcard/Documents) is initiated by an unusual or non-standard process.",
            "data_sources": [
              "Mobile EDR Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Sensitive data storage locations on mobile devices, Endpoint devices of high-value targets",
            "action": "Define a set of 'critical file extensions' and 'sensitive directories' for monitoring via Mobile EDR. Create a rule that alerts on any file deletion event matching these criteria that is initiated by a process not on a pre-defined allow list of approved file managers or system utilities. Analyze the entropy score of the initiating process name; a high-entropy or randomized name could indicate malware and should increase the event's risk score."
          },
          {
            "description": "A large volume of data is transferred from a mobile device to a rare or non-standard external network destination, immediately followed by widespread file deletion activity on the same device.",
            "data_sources": [
              "Zeek conn.log",
              "Mobile EDR Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Our organization's internet gateway, Corporate-managed mobile devices",
            "action": "Correlate network flow data (Zeek conn.log) with endpoint file system logs (Mobile EDR). For each mobile device IP, identify significant outbound data transfers, defined as total bytes sent exceeding 3 standard deviations above the user's daily average. If this network activity is followed within a 15-minute window by a high-volume file deletion alert (as defined in a previous action), escalate the event for immediate investigation as probable post-exfiltration data destruction."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]