[
  {
    "information_requirement": "Are adversaries accessing credentials stored on corporate mobile devices? (PIR)",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1634",
        "name": "Credentials from Password Store",
        "evidence": [
          {
            "description": "A device's integrity is compromised via jailbreaking or rooting, which is a common prerequisite for accessing protected credential stores.",
            "data_sources": [
              "MDM/UEM device compliance logs",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "The fleet of corporate-managed mobile devices",
            "action": "Continuously monitor the Mobile Device Management (MDM) or Unified Endpoint Management (UEM) platform for devices that change their compliance status to 'non-compliant' due to jailbreak or root detection. For each device flagged, initiate an automated query to correlate its IP address with network connection logs (Zeek conn.log) from the time of the status change forward. Establish a baseline of normal outbound data volume for mobile devices; alert if a compromised device's data sent exceeds the 95th percentile of this baseline, suggesting potential exfiltration of stolen credential data."
          },
          {
            "description": "A malicious or unauthorized application installed on a mobile device is observed making network connections to suspicious domains, potentially to exfiltrate stolen credentials.",
            "data_sources": [
              "MDM/UEM application inventory logs",
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate application repository and managed mobile devices",
            "action": "Use the MDM/UEM platform to maintain an inventory of all applications on managed devices. Cross-reference this inventory against an approved application list and a threat intelligence feed of known malicious package names. For any device with an unauthorized or known-malicious app, analyze its corresponding DNS requests (Zeek dns.log). Calculate the Shannon entropy of the queried domain names; a high entropy score can indicate the use of Domain Generation Algorithms (DGAs) for command-and-control (C2) or data exfiltration. Additionally, analyze connection logs (Zeek conn.log) for traffic to low-reputation IP addresses or countries from which the organization does not typically see traffic."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]