[
  {
    "information_requirement": "Is the adversary using Domain Generation Algorithms (DGAs) to establish command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637.001",
        "name": "Domain Generation Algorithms",
        "evidence": [
          {
            "description": "A single mobile device's source IP is observed making more than 50 DNS requests for unique, non-existent domains (NXDOMAIN) within a 5-minute interval. The requested domains have a Shannon entropy score greater than 3.5 and a character set that deviates from typical domain names (e.g., high numeric character ratio, low vowel ratio). [1]",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Enterprise Wi-Fi access point logs, VPN concentrator logs, internal and external DNS server logs, Cloud Access Security Broker (CASB) traffic logs.",
            "action": "1. (Symbolic) Ingest threat intelligence feeds of known DGA patterns or domains. Create a rule to match queried domains in Zeek dns.log against this list for immediate, high-fidelity alerts. 2. (Statistical) From Zeek dns.log, group by source IP (id.orig_h) and calculate the count of unique queries where the DNS response code is 'NXDOMAIN' within a 5-minute tumbling window. Establish a baseline for this metric across all mobile devices and alert when any single device exceeds the 99th percentile of the distribution. 3. (Machine Learning) For all queried domains not on an allowlist, calculate linguistic features (Shannon entropy, n-gram frequency, length, vowel-to-consonant ratio). Feed these features into a pre-trained classification model (e.g., Logistic Regression, Random Forest) to produce a DGA probability score. Domains with a score > 0.90, especially those associated with a high NXDOMAIN rate from a single client, should be escalated for investigation."
          },
          {
            "description": "A mobile device establishes a successful network connection (e.g., TCP, UDP) to an IP address that resolved from a domain registered within the last 72 hours. The domain is not categorized by web filtering services and has a low prevalence (<5 devices) across the organization.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "WHOIS data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, internet gateway proxy logs, firewall logs, DNS resolver caches, Mobile Device Management (MDM) solution logs.",
            "action": "1. (Symbolic) Correlate the destination IP addresses from Zeek conn.log against threat intelligence feeds of known malicious C2 infrastructure. A match from a mobile device endpoint is a critical alert. 2. (Statistical) For each successfully resolved domain in Zeek dns.log, enrich it with its WHOIS creation date. Flag domains created in the last 72 hours. Cross-reference these domains with Zeek conn.log to identify connections from mobile device IPs. Calculate the internal prevalence (number of unique clients connecting) for each newly registered domain. A connection to a domain with prevalence < 5 is a high-confidence indicator. 3. (Machine Learning) Develop a time series model (e.g., Seasonal-ARIMA) for each mobile device that tracks the daily count of connections to newly registered domains. An anomaly detection algorithm identifies spikes that deviate more than 3 standard deviations from the device's established baseline, flagging potential 'beaconing' behavior to a new C2 server."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]