[
  {
    "information_requirement": "Is an adversary attempting to remove their tools from a compromised mobile device to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1630.001",
        "name": "Uninstall Malicious Application",
        "evidence": [
          {
            "description": "A previously established, periodic network connection (C2 beacon) from a mobile device to a single destination IP, characterized by a low standard deviation in time between connections and consistent data volume, abruptly and permanently terminates. The termination does not coincide with a known device power-off or network change event.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points monitoring corporate mobile device traffic (e.g., Wi-Fi access points, VPN concentrators).",
            "action": "1. (Symbolic) Continuously monitor Zeek dns.log and conn.log for connections from mobile device IP ranges to destinations on a threat intelligence list of known C2 servers. Alert on any match. 2. (Statistical) For all outgoing connections from mobile devices, calculate the inter-arrival time and data volume for each unique source-destination pair over a rolling 24-hour window. Identify potential C2 channels where the coefficient of variation for inter-arrival time is below 0.2. If such a connection series abruptly stops and does not resume within a period exceeding 5 standard deviations of its historical average inter-arrival time, flag it for review. 3. (Machine Learning) For connections identified as potential C2 channels via the statistical method, apply a time series forecasting model (e.g., Holt-Winters) to predict the next expected connection timestamp. If the actual connection does not occur within the 99% prediction interval, classify this event as a 'C2 Cessation' anomaly and correlate it with other device alerts."
          },
          {
            "description": "A Windows Event Log, forwarded from an MDM logging server, contains an event ID corresponding to an application uninstall on a mobile device, where the timestamp and device/application name do not match any entry in the authorized change management database or help desk ticketing system for the preceding 72 hours.",
            "data_sources": [
              "Windows Event Log (Application, Source: MDMPlatform)",
              "Change Management Database/Ticketing System Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Windows Servers hosting the Mobile Device Management (MDM) platform and Change Management systems.",
            "action": "1. (Symbolic) Ingest MDM logs from the Windows Application Event Log (e.g., by filtering for the MDM source name). For each event indicating an application uninstall, query the change management/ticketing system API or database to find a corresponding authorized action for that device/user within the last 24 hours. An event with no matching authorization record is an immediate high-fidelity alert. 2. (Statistical) For all unauthorized uninstalls, calculate the rate per device over a 30-day window. Use a Z-score to identify devices with a statistically significant higher rate of unauthorized uninstalls (e.g., Z-score > 3) compared to their peers (e.g., same department or device type). 3. (Machine Learning) Use an anomaly detection model (e.g., Isolation Forest) on the features of the uninstall event. Features should include: application name prevalence across the organization, time of day (e.g., outside business hours), and the time delta between application installation and uninstallation. Events flagged as anomalous are prioritized for analyst review."
          },
          {
            "description": "Network traffic from a mobile device indicates communication with a known mobile rooting toolkit C2 server, which is then followed by the cessation of a separate, previously established suspicious beacon.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "DNS resolvers and network gateways used by the mobile device fleet.",
            "action": "1. (Symbolic) In a SIEM, create a rule that alerts when a DNS query (from Zeek dns.log) or a connection (from Zeek conn.log) from a mobile device's IP matches a threat intelligence list of indicators associated with mobile rooting toolkits. 2. (Statistical) Upon a 'Rooting Toolkit' alert for a device, automatically query the device's network history for the past 48 hours to identify any persistent, periodic C2-like beacons (low coefficient of variation for inter-arrival time). If a beacon's termination timestamp occurs within 1 hour after the rooting toolkit communication, escalate the alert priority. 3. (Machine Learning) Implement a sequence analysis model that tracks device states. An alert for 'Rooting Toolkit Communication' transitions the device to a 'Potentially Rooted' state for 60 minutes. If, during this state, a 'C2 Cessation' alert (from the first evidence action) is observed for the same device, the model classifies this sequence as a high-confidence 'T1630.001 - Uninstall Malicious Application' event and triggers a critical incident response workflow."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]