[
  {
    "information_requirement": "Is an adversary exfiltrating data from our mobile devices over unencrypted, non-C2 protocols? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1639.001",
        "name": "Exfiltration Over Unencrypted Non-C2 Protocol",
        "evidence": [
          {
            "description": "DNS queries from a mobile device exhibiting characteristics of data tunneling, such as query lengths exceeding 100 characters, a Shannon entropy score above 4.5 in the subdomain, or a query rate over 50 requests per minute to a single parent domain.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, corporate Wi-Fi access point logs, Mobile Device Management (MDM) platforms, Cloud Access Security Broker (CASB) logs.",
            "action": "1. (Symbolic) Continuously match the 'query' field in Zeek dns.log against a threat intelligence feed of known DNS tunneling C2 domains and generate a high-severity alert on any match. 2. (Statistical) For all A, AAAA, and TXT requests, calculate the length and Shannon entropy of the query's subdomain. Establish a baseline for these metrics across all mobile devices. Alert on queries where length or entropy exceeds the 99th percentile. Additionally, profile the query frequency per source IP to a given parent domain over a 5-minute window; alert if this frequency is more than 3 standard deviations above the user's historical baseline. 3. (Machine Learning) Utilize a pre-trained classification model (e.g., Random Forest) to score each DNS query for likelihood of being malicious tunneling. Features should include query length, subdomain entropy, number of distinct characters, and ratio of numeric to alphabetic characters. Queries with a prediction score above 0.85 should be flagged. Additionally, apply time-series anomaly detection to the volume of DNS data per device to identify uncharacteristic spikes in traffic."
          },
          {
            "description": "Outbound HTTP POST or PUT requests from a mobile device where the request body size exceeds the 99th percentile of the user's baseline, the destination is a low-reputation or newly seen domain, and the request body has a Shannon entropy score above 4.0, indicating non-textual or encoded data.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, web proxy logs, MDM/UEM logs with network activity, and Cloud Access Security Broker (CASB) logs.",
            "action": "1. (Symbolic) Extract the destination 'host' and IP address from Zeek http.log. Correlate these against threat intelligence feeds for known malicious infrastructure and domain reputation services. Generate a high-severity alert for any POST/PUT request to a destination with a 'malicious' or 'suspicious' category. 2. (Statistical) For each mobile device, create a baseline of outbound HTTP POST/PUT request body sizes ('post_body_len' in Zeek http.log). Alert when a request's size exceeds the 99th percentile for that device's baseline. For any such alert, calculate the Shannon entropy of the request body; an entropy value > 4.0 strongly suggests encoded data and should escalate the alert's priority. 3. (Machine Learning) Implement an Isolation Forest model to detect anomalous HTTP requests based on a feature set including 'post_body_len', 'method', destination IP, and request body entropy. Requests flagged as anomalies by the model require analyst review. Further, apply a time-series forecasting model to the aggregate daily outbound data volume via POST/PUT for each device; an observed volume that significantly exceeds the forecasted upper confidence interval indicates potential bulk data exfiltration."
          },
          {
            "description": "Any use of the unencrypted FTP protocol (port 21/TCP) for outbound connections from a mobile device, with a high-priority focus on file upload commands ('STOR').",
            "data_sources": [
              "Zeek ftp.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, network firewalls, VPN concentrators, and corporate Wi-Fi access points.",
            "action": "1. (Symbolic) Create a high-severity, zero-tolerance rule to alert on any connection from the mobile device IP range to any external IP on destination port 21/TCP, as identified in Zeek conn.log. If Zeek ftp.log is available, create a critical alert for any event where the 'command' field is 'STOR'. 2. (Statistical) Upon alert, enrich it by querying the last 90 days of activity to determine if this is the first instance of FTP usage for this specific device and for its peer group (e.g., other devices in the same department). A first-time occurrence significantly increases the alert's severity. 3. (Machine Learning) Employ a peer group analysis model to learn the normal set of protocols used by each user group (e.g., department). Generate an alert when a device uses a protocol, like FTP, that is anomalous for its group, providing context-aware 'protocol outlier' detection."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]