[
  {
    "information_requirement": "Is an adversary performing an Adversary-in-the-Middle (AitM) attack to intercept or manipulate traffic from corporate mobile devices?",
    "tactic_id": "TA0035",
    "tactic_name": "Collection",
    "indicators": [
      {
        "technique_id": "T1638",
        "name": "Adversary-in-the-Middle",
        "evidence": [
          {
            "description": "A mobile device's network connection, observed at the network layer, presents an invalid SSL/TLS certificate, such as one that is self-signed, expired, or issued by an untrusted Certificate Authority (CA), which is a primary indicator of a potential TLS interception proxy.",
            "data_sources": [
              "Zeek ssl.log",
              "Zeek x509.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network segments, network egress points, DNS resolvers, and the mobile devices themselves.",
            "action": "1. (Symbolic) Continuously scan Zeek ssl.log and x509.log for connections from the mobile device IP space where `validation_status` is not 'ok'. Create a specific rule to trigger alerts for high-risk validation statuses like 'self signed certificate in certificate chain' or for certificates issued by CAs known to be used in malicious toolkits. 2. (Statistical) For each mobile device subnet, calculate a baseline of normal certificate validation errors over a 30-day rolling window. Use a statistical threshold, such as alerting if the hourly count of unique validation errors exceeds the 95th percentile of the baseline, to detect sudden increases indicative of a widespread AitM attack. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., Seasonal-ARIMA) on the volume of certificate validation errors per network segment. An unexplained spike in the error count that deviates significantly from the forecasted model would trigger an alert for further investigation into a coordinated interception event."
          },
          {
            "description": "A managed mobile device establishes a long-lived, high-volume network tunnel using protocols like IKE/IPsec or OpenVPN to a destination IP address not on the sanctioned list of corporate VPN gateways. The data volume is inconsistent with typical background traffic.",
            "data_sources": [
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, VPN concentrators, and corporate firewalls.",
            "action": "1. (Symbolic) Maintain an explicit allow-list of sanctioned corporate VPN gateway IP addresses and ports. Ingest this list into the SIEM and create a rule to alert on any long-lived connection from a mobile device IP address using common VPN ports (e.g., UDP/500, UDP/4500, TCP/443 for SSL VPNs) to a destination IP not on the allow-list. 2. (Statistical) For each mobile device, calculate the total bytes sent (`orig_bytes`) and connection duration (`duration`) from Zeek conn.log. Use frequency analysis (stack counting) to identify destination IPs that receive traffic from only a small number of devices. A destination IP that is rare (e.g., < 5 devices connect to it) and receives a high volume of data (e.g., total bytes in the 90th percentile) is highly suspicious. 3. (Machine Learning) Use a clustering algorithm like DBSCAN on connection metadata (destination IP, destination port, protocol, total bytes, duration) from Zeek conn.log. Outlier connections that do not fit into any established cluster, particularly those with long durations and high data volumes, represent potential unauthorized VPN tunnels and should be flagged for analyst review."
          },
          {
            "description": "A temporal sequence of network events from a single mobile device shows a connection to a legitimate service, immediately followed by a DNS query to a high-entropy or newly registered domain, and then an HTTP/S connection to that suspicious domain, suggesting data exfiltration after legitimate file access.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, web proxies/egress points, and file servers accessed by mobile devices.",
            "action": "1. (Symbolic) Correlate Zeek dns.log queries against a threat intelligence feed of known malicious, newly registered, or DGA-related domains. Trigger an alert if a mobile device queries for a domain on this list, especially if it is followed by an HTTP POST or a large data transfer in conn.log within a 5-minute window. 2. (Statistical) For all DNS queries in Zeek dns.log, calculate the Shannon entropy of the queried domain name. Establish a baseline entropy score for legitimate domains. Flag any query from a mobile device where the domain entropy exceeds a high percentile threshold (e.g., 98th percentile), as this is characteristic of algorithmically generated domains. 3. (Machine Learning) Develop a sequence analysis model (e.g., using a Hidden Markov Model) trained on legitimate user session behavior. Feed real-time event sequences from mobile devices into the model. An event sequence that has a low probability of being generated by the trained model indicates anomalous behavior, such as the pattern of 'access legitimate service -> query suspicious domain -> exfiltrate data', and should be alerted on."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]