[
  {
    "information_requirement": "Is an adversary maintaining command and control over a compromised mobile device via dynamic resolution? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1637",
        "name": "Dynamic Resolution",
        "evidence": [
          {
            "description": "A DNS query from a mobile device resolves to a domain name that has a character distribution, length, and n-gram frequency statistically improbable for legitimate domains and consistent with known Domain Generation Algorithms (DGAs) [1].",
            "data_sources": [
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and Mobile Device Management (MDM) platform logs.",
            "action": "Symbolic: Continuously match the 'query' field in Zeek dns.log against a threat intelligence feed of known DGA domains. A direct match should trigger a high-priority alert. Statistical: For each unique domain in 'query', calculate the Shannon entropy, the ratio of numerical characters to total characters, and the 2-gram frequency distribution. Establish a 30-day rolling baseline for these metrics. Flag any domain where the entropy and numerical ratio exceed the 98th percentile and whose 2-gram frequencies deviate significantly (e.g., >3 standard deviations) from the norm. Machine Learning: Train a random forest classifier using a labeled dataset (e.g., public DGA domain lists versus a domain prevalence list [2]) with features including domain length, entropy, and numerical ratio. Apply this model to classify new DNS queries originating from mobile device IP ranges. Queries classified as 'DGA' with a confidence score above 0.90 should be escalated for analysis."
          },
          {
            "description": "A mobile device establishes a network connection to a domain that was registered within the last 30 days, is not present on a domain prevalence list (e.g., Tranco Top 1M) [2], and exhibits periodic, low-volume communication patterns characteristic of C2 beaconing.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and external WHOIS services.",
            "action": "Symbolic: For each domain resolved in dns.log, query a threat intelligence platform to check if the domain or its resolved IP is on a blocklist of known C2 infrastructure. An exact match generates a critical alert. Statistical: For each unique domain, enrich it with WHOIS registration date and its rank from a domain prevalence list [2]. Calculate a risk score where $$ risk = (10 * is\\_new) + (5 * is\\_unpopular) $$, where $$ is\\_new $$ is 1 if registered < 30 days ago, and $$ is\\_unpopular $$ is 1 if not in the top 1 million. For connections in conn.log to domains with a risk score > 10, flag source IPs that exhibit connections with low data volume (less than the 20th percentile of total bytes) and a low standard deviation in the time interval between connections. Machine Learning: For traffic to high-risk domains, perform a time-series analysis on the connection timestamps for each source IP. Use a Fast Fourier Transform (FFT) or autocorrelation to detect periodicity, which indicates automated beaconing. A strong periodic signal should be classified as a likely C2 channel."
          },
          {
            "description": "A mobile device communicates with multiple, seemingly unrelated IP addresses over a short period, where these IPs are associated with a single domain exhibiting fast-flux characteristics (high rate of IP address change) or a known dynamic DNS provider.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi gateways, VPN concentrators, guest network segments, and DNS resolution infrastructure.",
            "action": "Symbolic: Maintain and apply a watchlist of known dynamic DNS providers (e.g., *.ddns.net, *.no-ip.com, *.duckdns.org). Any DNS query from a mobile device for a hostname matching this list should be flagged for review. Statistical: For each domain in dns.log, count the number of unique IP addresses it resolves to over a rolling 1-hour window. Calculate the 99th percentile for the number of unique IPs per domain across the environment. Domains exceeding this threshold, especially those with low DNS TTL values, are potential fast-flux C2 domains. Identify all devices in conn.log communicating with the resolved IPs of these domains. Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on connection metadata from conn.log, with features including destination IP, destination port, and protocol for all traffic from a single mobile device IP. A distinct cluster of connections to a large number of disparate IPs on non-standard ports within a short time frame indicates potential use of an algorithmically determined C2 infrastructure."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]