[
  {
    "information_requirement": "Is an adversary stealing application access tokens from our mobile devices to gain unauthorized credential access?",
    "tactic_id": "TA0031",
    "tactic_name": "Credential Access",
    "indicators": [
      {
        "technique_id": "T1635",
        "name": "Steal Application Access Token",
        "evidence": [
          {
            "description": "An OAuth flow initiated from a mobile device IP address results in an authorization code or access token being sent to a callback URI that is not on the organization's approved list, as observed in network traffic.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, including firewalls, VPN concentrators, and Cloud Access Security Brokers (CASBs) inspecting traffic from corporate Wi-Fi and VPN-connected mobile devices.",
            "action": "For traffic from mobile device IP ranges, parse Zeek http.log to identify requests to known OAuth providers (e.g., login.microsoftonline.com, accounts.google.com). First, perform a symbolic match by extracting the 'redirect_uri' parameter and comparing it against a curated allowlist of known-good callback URIs; any URI not on the list generates a medium-severity alert. Second, apply a statistical method by calculating the Shannon entropy of the domain name for any unlisted 'redirect_uri'. An entropy score in the top 5th percentile compared to a baseline of legitimate URIs indicates a likely DGA and escalates the alert. Third, use a machine learning classifier (e.g., a pre-trained logistic regression model) that inputs features like URI length, domain age from passive DNS, TLD, and query parameter count to score the URI's maliciousness. A score exceeding a 0.85 confidence threshold escalates the alert to high severity for immediate investigation."
          },
          {
            "description": "A sequence of network events from a single mobile device IP shows a connection to a known phishing or low-reputation URL, immediately followed by an HTTP redirect or new connection that initiates an OAuth flow to a rare or previously unseen domain.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Web proxy logs and network sensor data (e.g., Zeek) at the internet gateway, capturing the full browsing session of mobile devices.",
            "action": "For a single source IP, create a rule that triggers on a specific event sequence. First, use symbolic logic to identify an initial connection to a URL categorized as 'phishing' or 'untrusted' by threat intelligence feeds. If, within 60 seconds, a subsequent HTTP request from the same IP is observed in Zeek http.log containing OAuth parameters ('response_type=code', 'client_id', 'scope'), trigger an alert. Second, apply a statistical method by baselining destination domain frequency per user. If the domain in the subsequent OAuth request falls in the bottom 1st percentile of access frequency for that user (or organization-wide), elevate the alert's priority. Third, employ a machine learning sequence model (e.g., Hidden Markov Model) trained on normal browsing sessions. An alert is escalated to critical if the observed sequence of '(initial untrusted domain) -> (subsequent rare OAuth domain)' has a very low probability score under the model, indicating a strong deviation from normal behavior."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]