[
  {
    "information_requirement": "Is an adversary exfiltrating data from mobile devices over an established command and control channel? (PIR)",
    "tactic_id": "TA0036",
    "tactic_name": "Exfiltration",
    "indicators": [
      {
        "technique_id": "T1646",
        "name": "Exfiltration Over C2 Channel",
        "evidence": [
          {
            "description": "Outbound data volume from a mobile device to a single destination IP address exceeds a statistically-derived threshold (e.g., 99th percentile) compared to its historical baseline, or the connection duration is anomalously long for beacon-like traffic.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network gateways for corporate Wi-Fi, VPN concentrators, Cloud Access Security Broker (CASB) egress points, Unified Endpoint Management (UEM) platforms",
            "action": "Symbolic: Query for connections in Zeek conn.log where the destination IP (id.resp_h) matches a threat intelligence feed of known C2 servers and the outbound byte count (orig_bytes) is greater than 1MB. Statistical: For each source mobile device IP, establish a 30-day rolling baseline of orig_bytes and duration per destination IP. Calculate the 99th percentile for both metrics. Generate an alert when a new connection's orig_bytes or duration exceeds its respective percentile for that specific source-destination pair. Machine Learning: Implement a time series forecasting model (e.g., ARIMA) on the aggregate daily outbound data volume per mobile device. An alert is triggered if the observed volume significantly exceeds the model's predicted confidence interval, indicating a potential exfiltration event."
          },
          {
            "description": "The ratio of outbound POST/PUT requests to inbound GET requests for a given mobile device-to-server communication stream inverts or increases significantly, and the average size of POST request bodies exceeds its historical baseline by more than three standard deviations.",
            "data_sources": [
              "Zeek http.log",
              "Zeek dns.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet-facing web proxies, DNS resolvers used by mobile devices, Network Security Group (NSG) flow logs for cloud-hosted mobile infrastructure",
            "action": "Symbolic: From Zeek dns.log, identify mobile devices querying for domains matching known C2 patterns (e.g., DGA characteristics, newly registered domains). Correlate the source IP with Zeek http.log and flag any subsequent HTTP POST activity to those domains. Statistical: For each source mobile IP and destination host pair in Zeek http.log, calculate a baseline ratio of 'method=GET' to 'method=POST' events over a 30-day window and baseline the average request_body_len. Alert when the POST count surpasses the GET count for a 24-hour period or when the average request_body_len exceeds the baseline by more than 3 standard deviations. Machine Learning: Use a clustering algorithm (e.g., DBSCAN) on features from Zeek http.log sessions (e.g., request/response size ratio, request method distribution, user-agent string entropy, periodicity). Identify clusters of anomalous C2-like behavior that deviate from the main cluster of normal browsing activity."
          },
          {
            "description": "The Shannon entropy of captured network traffic payloads from a mobile device to a specific destination consistently exceeds a baseline established for normal application traffic (e.g., > 7.5 for encrypted/compressed data), suggesting obfuscated data exfiltration.",
            "data_sources": [
              "Zeek files.log",
              "MDM/UEM application logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Mobile devices enrolled in Mobile Device Management (MDM), Network TAPs capturing traffic to/from mobile subnets, Virtual Private Cloud (VPC) traffic mirroring",
            "action": "Symbolic: Scan captured file contents from Zeek files.log associated with mobile device traffic for file headers corresponding to common archive formats (e.g., ZIP, RAR, 7z) being sent to destinations not on an approved list of file-sharing services. Statistical: For traffic flows from mobile devices over non-standard ports or to low-reputation IPs, sample the initial data packets of the payload. Calculate the Shannon entropy for these samples. Establish a baseline entropy score for known-good application traffic. Alert when the calculated entropy for a flow exceeds a high-water mark (e.g., entropy > 7.5), indicating likely encrypted or compressed data. Machine Learning: Train a classification model (e.g., logistic regression) to distinguish between 'benign' and 'exfiltration' traffic using features such as payload entropy, packet size distribution, and inter-arrival time of packets. The model, once trained, can classify live traffic flows in near-real time."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]