[
  {
    "information_requirement": "Is an adversary using our managed mobile devices to generate fraudulent or malicious outbound traffic? (PIR)",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1643",
        "name": "Generate Traffic from Victim",
        "evidence": [
          {
            "description": "A non-messaging mobile application is observed sending SMS messages where the volume exceeds a statistically significant threshold (e.g., >3 standard deviations above the user's or peer group's baseline) over a 24-hour period, or any SMS are sent to numbers on a known premium-rate blocklist.",
            "data_sources": [
              "Carrier billing records",
              "Mobile Device Management (MDM) application inventory logs",
              "MDM application permission logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet, MDM servers, and Telecommunications provider billing systems",
            "action": "1. (Symbolic) Query billing and messaging logs for any SMS sent to destination numbers matching a curated threat intelligence list of known premium-rate or international fraud number blocks. 2. (Statistical) For each device, calculate a 30-day rolling baseline of daily SMS volume. Generate an alert when a device's daily SMS count exceeds 3 standard deviations above its own baseline or the 99th percentile of all managed mobile devices. Correlate alerts with MDM data to check if the app sending messages is a non-standard messaging app and possesses the `SEND_SMS` permission. 3. (Machine Learning) Develop a classification model (e.g., Random Forest) using features such as app category, app age on device, `SEND_SMS` permission status, daily SMS volume, and number of unique recipients. Train the model on historical data to classify daily device activity as 'fraudulent' or 'benign', flagging devices with a high probability score for fraudulent activity."
          },
          {
            "description": "A mobile device's network traffic exhibits a sustained, high volume of HTTP/S requests (>3 standard deviations above baseline) with low Shannon entropy in requested domain names (<2.0), indicating repetitive, automated connections to a small set of domains, often with minimal data transfer per connection (<1KB).",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek http.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi network gateways, DNS resolvers, and Internet web proxies",
            "action": "1. (Symbolic) Scan Zeek dns.log and http.log for requests to domains and URLs matching threat intelligence feeds for known ad fraud, click fraud, or app-ranking manipulation services and alert on any match. 2. (Statistical) For each device IP, calculate the Shannon entropy of requested FQDNs in `dns.log` and User-Agent strings in `http.log` over a 1-hour window. Alert if entropy for either falls below a threshold (e.g., 2.0) while the connection count from `conn.log` exceeds the 95th percentile of the device's hourly baseline. Also, flag sessions with a high connection-to-byte ratio (e.g., >10 connections per kilobyte transferred). 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., Seasonal-ARIMA) on the per-minute connection count for each mobile device. The model, trained on historical data, will flag periods where the observed connection volume significantly deviates from the forecasted pattern, indicating uncharacteristic, automated traffic generation."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]