[
  {
    "information_requirement": "Is an adversary manipulating data on mobile devices to cause an impact?",
    "tactic_id": "TA0034",
    "tactic_name": "Impact",
    "indicators": [
      {
        "technique_id": "T1641.001",
        "name": "Transmitted Data Manipulation",
        "evidence": [
          {
            "description": "A POST request originating from a mobile device contains a data pattern consistent with a sensitive identifier, such as a cryptocurrency wallet address or IBAN, being sent to a destination domain that is newly registered, has a low reputation score, or is not on an established allowlist for such transactions.",
            "data_sources": [
              "Zeek http.log",
              "Zeek conn.log",
              "Zeek dns.log",
              "Threat Intelligence Platform Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate and guest Wi-Fi network access points, VPN concentrators, Perimeter firewalls and web proxies",
            "action": "1. (Symbolic) Identify mobile device IP ranges from DHCP or VPN logs. Monitor Zeek http.log for HTTP POST requests from these ranges. Use regular expressions to scan the POST body content for sensitive patterns like cryptocurrency addresses (BTC, ETH) or financial identifiers (IBANs). For each match, extract the destination 'Host' header and correlate with Zeek dns.log. Check the resolved domain against a threat intelligence feed for known malicious indicators, domain age, and reputation score. Alert if a sensitive pattern is sent to a domain that is malicious, has a reputation score below a set threshold, or was registered within the last 30 days and is not on a pre-approved allowlist. 2. (Statistical) For each user or device, establish a historical baseline of destination domains to which they POST sensitive data patterns. Monitor for outliers where sensitive data is sent to a statistically rare domain for that user (e.g., a domain not in the top 95% of their destinations for this data type). Additionally, calculate the Shannon entropy of the data within the specific form field containing the sensitive pattern. Alert if the entropy for a new submission deviates more than 2 standard deviations from that user's established baseline for that specific field, which could indicate replacement with a value of a different structure. 3. (Machine Learning) Develop a feature set for each sensitive data transaction, including source IP, User-Agent, destination domain reputation, domain age, data entropy, request size, and time of day. Train a classification model, such as a Random Forest, on labeled historical data to generate a risk score for each transaction. Deploy the model to score new transactions in real-time and generate a high-priority alert for any transaction exceeding a predetermined risk threshold (e.g., a score > 0.9)."
          },
          {
            "description": "A mobile device initiates a network connection to a domain that is not associated with any known foreground application, has a low reputation, or is statistically anomalous for the device. This connection may be used to exfiltrate copied data or receive a replacement value for clipboard injection.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Threat Intelligence Platform Data"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate DNS resolvers, Internet gateway, Wi-Fi network sensors",
            "action": "1. (Symbolic) Monitor Zeek dns.log for all queries originating from mobile device IP ranges. Enrich every queried domain with threat intelligence data, including threat categories (e.g., C2, malware, phishing) and reputation scores. Alert on any DNS query and subsequent connection (verified in Zeek conn.log) to a domain explicitly categorized as malicious. 2. (Statistical) For each mobile device, create a baseline of normally contacted domains and their query frequency over a 30-day rolling window. Calculate the rate of 'first-time seen' domains contacted by each device per hour. Alert when this rate exceeds a dynamic threshold, such as the 98th percentile of the device's historical 'new domain' rate, indicating an unusual burst of new network communications. 3. (Machine Learning) Train a one-class SVM or an isolation forest model on 'normal' network activity features for each device. Features should include domain TLD, query type, connection duration, and data volume transferred (from Zeek conn.log). Use the trained model to identify anomalous connections that deviate significantly from the established pattern-of-life for that device. Score each new connection and alert on those identified as outliers by the model, as they represent a departure from normal behavior that could indicate malicious background activity."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]