[
  {
    "information_requirement": "Is an adversary using out-of-band channels for command and control on mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command and Control",
    "indicators": [
      {
        "technique_id": "T1644",
        "name": "Out of Band Data",
        "evidence": [
          {
            "description": "An application on an Android device has been granted 'Notification Access' and is observed making suspicious network connections, suggesting it is intercepting out-of-band data (e.g., from SMS) to receive commands or exfiltrate data.",
            "data_sources": [
              "MDM application inventory logs",
              "Zeek conn.log",
              "Android system logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate-managed and BYOD Android devices",
            "action": "Periodically query the MDM for a list of all Android applications with 'Notification Access' permission granted. Cross-reference this application list against internal whitelists and threat intelligence feeds to identify unauthorized or malicious apps. For devices with suspicious apps that have this permission, prioritize analysis of their network traffic. In Zeek conn.log, filter for traffic originating from these devices and look for connections to low-reputation IPs/domains, unusual ports, or periodic 'heartbeat' connections characteristic of C2. Use a statistical model to score the risk of each connection based on features like destination prevalence, data volume, and connection duration, flagging connections that exceed a predefined risk threshold."
          },
          {
            "description": "A corporate mobile device receives SMS/MMS messages containing non-standard content, such as encoded strings or URLs pointing to unknown domains, which may be commands for a malicious application.",
            "data_sources": [
              "Carrier SMS/MMS detail records",
              "MDM security event logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Telecommunication provider gateways for corporate mobile accounts",
            "action": "Ingest SMS/MMS metadata logs from the cellular carrier. For each message, calculate the entropy of the message body; a high entropy score (e.g., > 4.5) suggests encrypted or encoded data and should be flagged. Analyze for messages containing only a URL, especially from unknown senders. Establish a baseline of normal sender patterns for each user and use outlier detection to identify messages from anomalous sources (e.g., new international numbers). Correlate the timestamp of a high-risk SMS with any subsequent anomalous network or process activity on the device via MDM or network logs."
          },
          {
            "description": "A device exhibits unusual Bluetooth or NFC pairing events or data transfers, particularly in proximity to unknown devices or in physically secure locations, suggesting a close-access C2 or data exfiltration channel.",
            "data_sources": [
              "MDM security logs",
              "Mobile OS-level Bluetooth/NFC logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Physically controlled spaces (e.g., executive suites, R&D labs), corporate-managed mobile devices",
            "action": "Use MDM policies to log all Bluetooth and NFC pairing events and file transfers. Analyze these logs to establish a baseline of normal activity for each user or device group. Develop a rule to alert on a high frequency of pairing events with new, unknown devices over a short period (e.g., more than 3 new pairings in an hour). Use descriptive statistics to identify devices whose daily or weekly Bluetooth/NFC activity is more than two standard deviations above the mean for their peer group. Geofence sensitive locations and create higher-severity alerts for any unauthorized pairing activity within those zones."
          }
        ]
      }
    ],
    "version": "1.0",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]