[
  {
    "information_requirement": "Is an adversary using masquerading techniques on corporate mobile devices to evade detection? (PIR)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1655.001",
        "name": "Match Legitimate Name or Location",
        "evidence": [
          {
            "description": "An application on a managed mobile device has a display name or package name that closely resembles a legitimate application, but its signer certificate details (Subject, Issuer, Thumbprint) do not match the authentic application's known signature, or the package name is found on a threat intelligence list of known malicious application identifiers.",
            "data_sources": [
              "Mobile Device Management (MDM) Application Inventory Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed mobile device fleet (iPhones, Androids)",
            "action": "First, perform an IOC match by querying MDM application inventory logs for any installed package names that exist on a threat intelligence feed of known-malicious or typosquatted application identifiers. Second, apply a statistical method by creating and maintaining an allowlist of known-good (package_name, signer_certificate_thumbprint) tuples for system and corporate applications. Group all installed applications by display name (e.g., 'Settings'); alert on any display name associated with more than one unique tuple. Additionally, use a Levenshtein distance algorithm to compare all installed package names against the allowlist; flag any name with a distance score greater than 0 but less than 3 as potential typosquatting. Third, implement a machine learning classifier (e.g., Random Forest) trained on features from application manifests (e.g., permissions requested, exported activities) and package name string characteristics (length, character distribution) to classify newly installed applications as 'benign' or 'potential masquerade' for further investigation."
          },
          {
            "description": "A mobile application, previously flagged as a potential masquerade, generates network traffic (DNS queries, TCP/UDP connections) inconsistent with the behavior of the legitimate application it impersonates. This includes connections to known malicious domains, domains with high character entropy, or connections to non-standard ports.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Mobile Device Management (MDM) Application Inventory Log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points (Firewalls, Proxies), Corporate WiFi network segments, and VPN concentrators",
            "action": "First, conduct an IOC match by correlating network logs with MDM data to identify traffic from suspected masqueraded apps. Join the DNS queries (Zeek dns.log) from these sources against a threat intelligence feed of known command-and-control (C2) domains and alert on any match. Second, apply statistical analysis by calculating the Shannon entropy of all queried domain names in Zeek dns.log; flag any query from a suspected app where the entropy score is in the 98th percentile or higher compared to the 30-day organizational baseline. Also, establish a baseline profile (destination ports, connection duration, bytes sent) for the legitimate version of the app and alert if the suspected app's connection metrics (from Zeek conn.log) deviate by more than 3 standard deviations. Third, use a time-series anomaly detection model (e.g., LSTM) on the volume of data sent (orig_bytes) by the suspected application on a per-device basis to detect significant, unexplained spikes in traffic volume that deviate from established patterns."
          }
        ]
      }
    ],
    "last_updated": "2025-09-29",
    "version": "1.1",
    "date_created": "2025-09-26",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]