[
  {
    "information_requirement": "Is an adversary attempting to gain initial access to mobile devices via phishing? (PIR)",
    "tactic_id": "TA0027",
    "tactic_name": "Initial Access",
    "indicators": [
      {
        "technique_id": "T1660",
        "name": "Phishing",
        "evidence": [
          {
            "description": "A user's mobile device initiates a network connection to a domain with multiple high-risk characteristics, such as being newly registered (<30 days), having high character entropy (>3.5), or being a typosquatted version of a known brand, following a suspected smishing attempt.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek conn.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate VPN concentrators, network egress points, corporate Wi-Fi access points, and Mobile Device Management (MDM) platform logs.",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Continuously match requested domains in Zeek dns.log against a threat intelligence feed of known phishing domains and generate a high-priority alert on any match. 2. (Statistical) For each new DNS query, calculate the domain's character entropy and registration age. Flag any query where the domain entropy exceeds the 95th percentile of the established baseline and the domain age is less than 30 days. Correlate with Zeek http.log to confirm the User-Agent string indicates a mobile browser. 3. (Machine Learning) Deploy a pre-trained classification model (e.g., Logistic Regression) that uses features like domain entropy, length, TLD, and keyword presence to score the malicious probability of each requested domain. A score exceeding a probability threshold (e.g., >0.85) triggers an alert for analyst review."
          },
          {
            "description": "A mobile device's network traffic shows a DNS request and subsequent connection to a domain that is a statistical outlier in terms of rarity and character composition, lacks a history of being visited by other corporate mobile devices, and is not associated with an installed mobile application, suggesting a QR code-initiated (quishing) connection.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi access points, public-facing guest Wi-Fi networks, and VPN concentrators handling mobile traffic.",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Scan Zeek ssl.log for connections where the server certificate's subject or issuer contains keywords associated with phishing kits or matches a known-bad certificate fingerprint from threat intelligence. 2. (Statistical) Profile the set of domains each mobile device typically visits. Use a Jaccard similarity index to compare domains visited in a 5-minute window against the user's historical profile. A low similarity score, combined with the destination domain being visited by only one user organization-wide, indicates a potential quishing-led deviation. 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., ARIMA) on the volume of DNS requests per mobile device to domains not on an enterprise allowlist. A sudden spike in requests to rare or new domains, inconsistent with the user's past behavior, signals an anomaly for investigation."
          },
          {
            "description": "A mobile device, identified by its User-Agent string in HTTP traffic, connects to a domain featuring a suspicious TLS certificate (e.g., short validity period, free CA provider for a sensitive domain) or a domain known for URL shortening that resolves to a known malicious IP address after a user clicks an email link.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Network egress points, email security gateways, corporate VPN concentrators, and Cloud Access Security Brokers (CASB).",
            "action": "For network traffic from mobile device IP ranges: 1. (Symbolic) Filter Zeek http.log for mobile User-Agents, join with Zeek dns.log to get resolved IP addresses, and compare these IPs against a real-time threat intelligence feed of known malicious infrastructure. Generate an immediate alert on a match. 2. (Statistical) From Zeek ssl.log, extract TLS certificate validity duration and issuer. Alert on connections where the validity is anomalously short (e.g., < 30 days, in the bottom 5th percentile of observed durations) and the issuer is a free CA, especially if the domain's common name impersonates a known brand. 3. (Machine Learning) Train a Random Forest classifier to identify malicious TLS connections using features from Zeek ssl.log (e.g., validation_status, issuer, validity_length) and Zeek dns.log (e.g., domain entropy, TLD). The model's probability output for a connection being malicious will trigger a scored alert."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]