[
  {
    "information_requirement": "Is an adversary using legitimate remote access software for Command and Control on our mobile devices? (PIR)",
    "tactic_id": "TA0037",
    "tactic_name": "Command And Control",
    "indicators": [
      {
        "technique_id": "T1663",
        "name": "Remote Access Software",
        "evidence": [
          {
            "description": "A successful network connection is established from a corporate mobile device to a domain or IP address on a threat intelligence watchlist for remote access software, where the connection is not associated with a whitelisted business application.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek conn.log",
              "Zeek ssl.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Corporate DNS servers, Windows-based web proxies, VPN concentrators, Mobile Device Management (MDM) platform",
            "action": "1. (Symbolic Logic) Continuously ingest and update a watchlist of domains, IPs, and SSL/TLS certificate subjects associated with unapproved remote access software. Create a SIEM rule that queries Zeek dns.log (for 'query'), conn.log (for 'id.resp_h'), and ssl.log (for 'server_name') every 5 minutes for matches originating from the corporate mobile device IP range. Exclude traffic from devices with approved remote access tools via an MDM-sourced whitelist. 2. (Statistical Method) For any connection matching the watchlist, analyze the connection's metadata from Zeek conn.log. Profile the baseline data transfer volume ('orig_bytes' + 'resp_bytes') and duration for all connections from mobile devices. Flag any watchlist-matched connection where the data volume or duration exceeds the 98th percentile of the general mobile device population's traffic. 3. (Machine Learning) Develop a supervised classification model (e.g., Random Forest) trained on labeled historical network data (Zeek conn.log). Use features such as 'proto', 'duration', 'orig_bytes', 'resp_bytes', 'conn_state', 'history', destination port, and a binary feature for 'is_on_watchlist'. The model will classify each new connection from a mobile device as 'benign' or 'suspicious-remote-access'. A 'suspicious-remote-access' classification triggers an alert."
          },
          {
            "description": "A long-lived TCP connection from a corporate mobile device uses a dynamically detected protocol associated with remote access (e.g., VNC, RDP via Zeek's protocol analyzers) on a destination port not registered for that protocol, and exhibits a traffic pattern consistent with an interactive session.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek notice.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Network segments hosting corporate mobile devices, Core network switches",
            "action": "1. (Symbolic Logic) Create a SIEM rule to query Zeek conn.log and notice.log. The rule should trigger when Zeek's dynamic protocol analysis ('service' field in conn.log) identifies a remote access protocol (e.g., 'vnc', 'rdp') but the destination port ('id.resp_p') is not the IANA standard port for that service. Correlate with Zeek notice.log for 'Protocol_Mismatch' notices involving mobile device IP ranges. 2. (Statistical Method) For each mobile device, calculate the Shannon entropy of the destination ports used over a 24-hour rolling window. A sudden spike in port entropy is anomalous. Additionally, profile session 'interactivity' by calculating the ratio of packet count to total bytes transferred for long-lived connections; high ratios may indicate keepalives or interactive keystroke sessions. Flag sessions with high interactivity ratios on non-standard ports. 3. (Machine Learning) Use a time series anomaly detection algorithm (e.g., SARIMA or an LSTM-based autoencoder) to model the byte count of outgoing connections for each mobile device. Generate an alert when the model detects a significant anomaly (e.g., a sudden, sustained increase in traffic volume) that coincides with a long-duration connection on a non-standard port."
          },
          {
            "description": "A successful, unsolicited inbound TCP or UDP connection is established from an external IP address to a corporate mobile device on a port commonly associated with remote access software hosting (e.g., 5900/TCP, 5938/TCP), and this connection was not initiated by an internal service or user action.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek known_services.log",
              "Windows Event ID 5156"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Internet gateway, Demilitarized Zone (DMZ), Wi-Fi network segments, Firewall appliances",
            "action": "1. (Symbolic Logic) Configure a SIEM rule to query firewall logs and Zeek conn.log for any connection where 'id.orig_h' is an external, non-RFC1918 address, 'id.resp_h' is within the corporate mobile device IP range, and the connection state ('conn_state') is 'SF' (Session Established and Finished). Focus on destination ports ('id.resp_p') listed in a watchlist for remote access services. Since policy should block all unsolicited inbound connections to mobile devices, any such successful connection is a high-fidelity alert. 2. (Statistical Method) Periodically scan Zeek's known_services.log and conn.log to build a profile of all listening services and successful inbound connections across the mobile device fleet. Calculate the prevalence of each listening port/service combination. An alert is triggered if a mobile device is observed listening on or accepting a connection to a port/service that is statistically rare (e.g., present on <1% of the mobile fleet). 3. (Machine Learning) Use a clustering algorithm (e.g., DBSCAN) to group mobile devices based on their network behavior profiles (listening ports, inbound/outbound traffic ratios, source countries of inbound traffic). A device that is identified as an outlier or part of a micro-cluster, especially due to accepting inbound connections from geographically diverse or low-reputation IPs, should be flagged for investigation to identify peer group deviations."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk"
    ]
  }
]