[
  {
    "information_requirement": "Is an adversary leveraging virtualization solutions on corporate mobile devices to conduct malicious activities? (TA0030 - Defense Evasion)",
    "tactic_id": "TA0030",
    "tactic_name": "Defense Evasion",
    "indicators": [
      {
        "technique_id": "T1670",
        "name": "Virtualization Solution",
        "evidence": [
          {
            "description": "A non-allowlisted application whose package name matches a known virtualization or containerization tool is present in the MDM application inventory for a managed mobile device.",
            "data_sources": [
              "MDM Application Inventory Logs",
              "Android Logcat"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Managed Android mobile device fleet, Mobile Device Management (MDM) servers",
            "action": "1. (Symbolic) Maintain a curated list of package names for known Android virtualization and container applications (e.g., io.va.exposed, com.lbe.parallel.intl, com.dual.space.pro). Periodically query Mobile Device Management (MDM) application inventory logs to compare the list of installed applications against this curated list and the organization's official application allowlist. Generate a high-severity alert for any device containing a non-allowlisted virtualization application. 2. (Statistical) For all applications not on the corporate allowlist, calculate the fleet-wide installation prevalence. Flag any device that installs an application falling below a rarity threshold (e.g., installed on less than 0.5% of devices), as this could indicate targeted, non-standard tool deployment. 3. (Machine Learning) Develop a supervised machine learning classifier (e.g., Random Forest) trained on application metadata (permissions requested, package name structure, developer signature) to predict the likelihood that a new, unclassified application is a virtualization tool or otherwise suspicious. An app with a high-risk score from the model triggers an alert for manual review."
          },
          {
            "description": "Network traffic telemetry (e.g., destination domains, data volume) from a mobile device is statistically anomalous and does not correlate with the network profile of the application reported to be in the foreground by MDM.",
            "data_sources": [
              "Zeek conn.log",
              "Zeek dns.log",
              "Zeek ssl.log",
              "MDM Application Usage Logs"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate Wi-Fi and VPN gateways, Enterprise DNS resolvers, MDM servers",
            "action": "1. (Symbolic) Continuously monitor Zeek dns.log for requests to domains on a C2 or malware threat intelligence feed. Correlate any hits with the device IP address. If the MDM reports a trusted foreground application at the time of the connection, it strongly suggests a background or virtualized process is responsible; generate a high-severity alert. 2. (Statistical) For each device, establish a baseline of network behavior by correlating MDM foreground app data with Zeek logs. Calculate a multi-metric anomaly score where metrics include: (a) Shannon entropy of DNS requests per 15-minute window using the formula $$ H(X) = -\\sum_{i=1}^{n} p(x_i) \\log_2 p(x_i) $$, (b) ratio of outgoing to incoming bytes, and (c) number of distinct destination IPs. An alert is triggered if the composite score exceeds a dynamic threshold (e.g., 95th percentile of the device's own historical scores). 3. (Machine Learning) Implement a time-series anomaly detection model (e.g., LSTM autoencoder) on network traffic features (bytes out, connection count, protocol mix) for each device. A high reconstruction error from the model signifies a deviation from normal patterns that, when correlated with MDM data showing a benign foreground app, indicates potential hidden or virtualized process activity."
          },
          {
            "description": "A mobile device initiates a network connection to an external destination (domain, IP, URL) included on a threat intelligence watchlist for indicators associated with virtualization-based malware.",
            "data_sources": [
              "Zeek dns.log",
              "Zeek http.log",
              "Zeek ssl.log"
            ],
            "data_platforms": [
              "TBD"
            ],
            "nai": "Corporate network egress points, Web proxies, DNS resolvers",
            "action": "1. (Symbolic) Maintain and ingest a high-fidelity threat intelligence feed of domains, IPs, URLs, and JA3/JA3S hashes associated with the distribution and operation of virtualization-based malware. Create a detection rule to generate a high-severity alert upon any match in Zeek dns.log, conn.log, or ssl.log from a mobile device IP. 2. (Statistical) Analyze Zeek dns.log to identify domains that are newly observed across the entire mobile fleet ('First Seen' domains). For each newly seen domain accessed by a mobile device, calculate its reputation and prevalence using external services and internal historical data. A mobile device connecting to a domain that is both newly observed and has a low reputation or prevalence score (e.g., in the bottom 5th percentile) should be flagged for investigation. 3. (Machine Learning) Use a pre-trained machine learning model to score the maliciousness of every requested domain based on features like name length, entropy, TLD, and n-gram analysis. A high maliciousness score for a domain requested by a mobile device, especially if the domain is also statistically rare, should trigger a medium-severity alert for analyst review."
          }
        ]
      }
    ],
    "version": "1.1",
    "date_created": "2025-09-26",
    "last_updated": "2025-09-29",
    "contributors": [
      "Zachary Szewczyk",
      "Ask Sage"
    ]
  }
]